{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"msgInstallPkgProgress": "L'installation des dépendances de notebook est en cours",
	"msgPythonDownloadComplete": "Le téléchargement de Python est terminé",
	"msgPythonDownloadError": "Erreur de téléchargement du programme d'installation de Python",
	"msgPythonDownloadPending": "Téléchargement du package Python",
	"msgPythonUnpackPending": "Décompression du package Python",
	"msgPythonDirectoryError": "Erreur de création du répertoire d'installation de Python",
	"msgPythonUnpackError": "Erreur de décompression du bundle Python",
	"msgTaskName": "Installation des dépendances de notebook",
	"msgInstallPkgStart": "Installation des dépendances de notebook, consultez la vue Tâches pour plus d'informations",
	"msgInstallPkgFinish": "L'installation des dépendances de notebook est terminée",
	"msgPythonRunningError": "Impossible de remplacer une installation Python existante quand Python est en cours d'exécution. Fermez tous les notebooks actifs avant de continuer.",
	"msgSkipPythonInstall": "Python existe déjà à l'emplacement spécifique. Installation ignorée.",
	"msgWaitingForInstall": "Une autre installation de Python est actuellement en cours. En attente de la fin de l'installation.",
	"msgDependenciesInstallationFailed": "L'installation des dépendances de notebook a échoué avec l'erreur : {0}",
	"msgDownloadPython": "Téléchargement de la version locale de Python pour la plateforme : {0} dans {1}",
	"confirmPackageUpgrade": "Des packages Python installés ont besoin d'être mis à niveau. Voulez-vous les mettre à niveau maintenant ?",
	"upgradePackages.pipInstall": "Installation de {0}",
	"msgInstallStart": "Installation des packages obligatoires pour l'exécution de Notebooks...",
	"msgJupyterInstallDone": "...Installation de Jupyter effectuée."
}