Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

# connectionGroupName
source: Server group name
fr: Nom de groupe serveur
pt_br: Nome do grupo de servidores
ru: Имя группы серверов
zh_hans: 服务器组名称
zh_hant: 伺服器群組名稱

# MissingGroupNameError
source: Group name is required.
fr: Le nom du groupe est nécessaire.
pt_br: Nome do grupo é necessário.
ru: Необходимо указать имя группы.
zh_hans: 组名称是必需的。
zh_hant: 需要群組名稱。

source: Group description
fr: Description du groupe
pt_br: Descrição do grupo
ru: Описание группы
zh_hans: 组描述
zh_hant: 群組描述

source: Group color
fr: Couleur de groupe
pt_br: Grupo cor
ru: Цвет группы
zh_hans: 组颜色
zh_hant: 群組顏色

# serverGroup.addServerGroup
source: Add server group
fr: Ajouter le groupe de serveurs
pt_br: Adicionar grupo de servidores
ru: Добавить группу серверов
zh_hans: 添加服务器组
zh_hant: 新增伺服器群組

# serverGroup.editServerGroup
source: Edit server group
fr: Modifier le groupe de serveurs
pt_br: Editar grupo de servidores
ru: Редактировать группу серверов
zh_hans: 编辑服务器组
zh_hant: 編輯伺服器群組

# errorMessageDialog.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# errorMessageDialog.close
source: Close
fr: Fermer
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

source: Copy details
fr: Copier les détails
pt_br: Copiar detalhes
ru: Скопировать сведения
zh_hans: 复制详细信息
zh_hant: 複製詳細資訊

# schema.providerId
source: Common id for the provider
fr: ID courant du fournisseur
pt_br: Id comum para o provider
ru: Общий идентификатор поставщика
zh_hans: 提供程序的公共 id
zh_hant: 提供者的通用識別碼。

# schema.displayName
source: Display Name for the provider
fr: Nom complet du fournisseur
pt_br: Nome de exibição do provedor
ru: Отображаемое имя поставщика
zh_hans: 提供程序的显示名称
zh_hant: 提供者的顯示名稱

# schema.connectionOptions
source: Options for connection
pt_br: Opções de conexão
ru: Параметры подключения
zh_hans: 连接选项
zh_hant: 連線的選項

# query.ExecutionFailedError
source: Execution failed due to an unexpected error: {0} {1}
fr: L’exécution a échoué en raison d’une erreur inattendue : {0} {1}
pt_br: Execução falhou devido a um erro inesperado: {0} {1}
ru: Сбой выполнения из-за непредвиденной ошибки: {0} {1}
zh_hans: 由于意外错误, 执行失败: {0} {1}
zh_hant: 由於意外錯誤導致執行失敗: {0} {1}

# query.message.executionTime
source: Total execution time: {0}
ru: Суммарное время выполнения: {0}
zh_hant: 總執行時間: {0}

# query.message.startQuery
source: Started executing query at Line {0}
ru: Начато выполнение запроса в строке {0}
zh_hant: 已於第 {0} 行開始執行查詢

# query.initEditExecutionFailed
source: Init Edit Execution failed:
fr: Echec à l'initialisation de l'exécution de la modification
pt_br: Falha na execução de editar init:
ru: Ошибка изменения инициализации:
zh_hans: 初始化编辑失败：
zh_hant: 初始化編輯執行失敗:

# elapsedBatchTime
source: Batch execution time: {0}
fr: Temps d’exécution par lots : {0}
pt_br: Tempo de execução em lote: {0}
ru: Время выполнения пакета: {0}
zh_hans: 批处理执行时间: {0}
zh_hant: 批次執行時間: {0}

# runQueryBatchStartMessage
source: Started executing query at
fr: Démarrage de l’exécution de la requête à
pt_br: Iniciada a execução de consulta em
ru: Начало выполнения запроса
zh_hans: 开始执行查询于
zh_hant: 已開始執行查詢在

# runQueryBatchStartLine
source: Line {0}
fr: Ligne {0}
pt_br: Linha {0}
ru: Строка {0}
zh_hans: 第 {0} 行
zh_hant: 第 {0} 行

# msgCancelQueryFailed
source: Canceling the query failed: {0}
fr: Échec de l’annulation de la requête : {0}
pt_br: Cancelamento da consulta falhou: {0}
ru: Ошибка при отмене запроса: {0}
zh_hans: 取消查询失败: {0}
zh_hant: 取消查詢失敗︰ {0}

# msgSaveStarted
source: Started saving results to
fr: Démarrage de l’enregistrement des résultats pour
pt_br: Iniciado o salvamento de resultados em
ru: Начало сохранения результатов в
zh_hans: 已开始将结果保存到
zh_hant: 開始儲存結果

# msgSaveFailed
source: Failed to save results.
fr: Impossible d’enregistrer les résultats.
pt_br: Falha ao salvar os resultados.
ru: Не удалось сохранить результаты.
zh_hans: 保存结果失败。
zh_hant: 無法儲存結果。

# msgSaveSucceeded
source: Successfully saved results to
fr: Résultats enregistrés avec succès sur
pt_br: Os resultados foram salvos com sucesso em
ru: Результаты успешно сохранены в
zh_hans: 成功将结果保存到
zh_hant: 成功儲存結果至

# msgStatusRunQueryInProgress
source: Executing query...
fr: Exécution de la requête en cours...
pt_br: Executando consulta ...
ru: Выполнение запроса...
zh_hans: 正在执行查询...
zh_hant: 執行查詢中...

# maximizeLabel
source: Maximize
fr: Maximiser
pt_br: Maximizar
ru: Увеличить
zh_hans: 最大化
zh_hant: 最大化

# resultsPane.restoreLabel
source: Restore
fr: Restaurer
pt_br: Restaurar
ru: Восстановить
zh_hans: 还原
zh_hant: 還原

# saveCSVLabel
source: Save as CSV
fr: Enregistrer au format CSV
pt_br: Salve como CSV
ru: Сохранить в формате CSV
zh_hans: 另存为 CSV
zh_hant: 另存為 CSV

# saveJSONLabel
source: Save as JSON
fr: Enregistrer au format JSON
pt_br: Salvar como JSON
ru: Сохранить в формате JSON
zh_hans: 另存为 JSON
zh_hant: 另存為 JSON

# saveExcelLabel
source: Save as Excel
fr: Enregistrer au format Excel
pt_br: Salvar como Excel
ru: Сохранить в файле Excel
zh_hans: 另存为 Excel
zh_hant: 另存為 Excel

# saveXMLLabel
source: Save as XML
ru: Сохранить как XML
zh_hant: 另存為 xml

# viewChartLabel
source: View as Chart
fr: Vue sous forme de graphique
pt_br: Ver como gráfico
ru: Посмотреть в виде диаграммы
zh_hans: 图表视图
zh_hant: 以圖表查看

# resultPaneLabel
source: Results
fr: Résultats
pt_br: Resultados
ru: Результаты
zh_hans: 结果集
zh_hant: 結果

# executeQueryLabel
source: Executing query
fr: Requête en cours d'exécution
pt_br: Executando consulta
ru: Выполнение запроса
zh_hans: 执行查询
zh_hant: 執行查詢

# messagePaneLabel
source: Messages
pt_br: Mensagens
ru: Сообщения
zh_hans: 消息
zh_hant: 訊息

# elapsedTimeLabel
source: Total execution time: {0}
fr: Temps d’exécution total : {0}
pt_br: Tempo total de execução: {0}
ru: Суммарное время выполнения: {0}
zh_hans: 执行时间总计: {0}
zh_hant: 總執行時間: {0}

# msgCannotSaveMultipleSelections
source: Save results command cannot be used with multiple selections.
fr: La commande d'enregistrement des résultats ne peut pas être utilisée avec des sélections multiples.
pt_br: O comando de salvar resultados não pode ser utilizado com múltiplas seleções
ru: Команда сохранения результатов не может быть использована при множественном выборе.
zh_hans: 多选时不能使用保存结果命令。
zh_hant: 儲存結果指令無法使用於多重選擇中

# chooseSqlLang
source: Choose SQL Language
fr: Choisir le langage SQL
pt_br: Escolha a linguagem SQL
ru: Выберите язык SQL
zh_hans: 选择 SQL 语言
zh_hant: 選擇 SQL 語言

# changeProvider
source: Change SQL language provider
fr: Changer de fournisseur de langage SQL
pt_br: Alterar provedor de idiomas SQL
ru: Изменить поставщика языка SQL
zh_hans: 更改 SQL 语言提供程序
zh_hant: 變更 SQL 語言提供者

# changeSqlProvider
source: Change SQL Engine Provider
pt_br: Alterar o provedor de mecanismo SQL
ru: Изменить поставщика SQL
zh_hans: 更改 SQL 引擎提供程序
zh_hant: 變更 SQL 引擎提供者

# alreadyConnected
source: A connection using engine {0} exists. To change please disconnect or change connection
fr: Une connexion utilisant le moteur {0} existe déjà. Pour changer, veuillez vous déconnecter ou modifier la connexion.
pt_br: Existe uma conexão usando o mecanismo {0}. Para alterar, por favor desconecte ou altere a conexão
ru: Подключение с использованием {0} уже существует. Чтобы изменить его, пожалуйста отключите или смените существующее подключение.
zh_hans: 使用引擎 {0} 的连接已存在。若要更改, 请先断开或更改连接
zh_hant: 使用引擎 {0} 的連接已存在。若要變更，請中斷連接或變更連接

# noEditor
source: No text editor active at this time
fr: Aucun éditeur de texte actif en ce moment
pt_br: Nenhum editor de texto ativo neste momento
ru: Активные текстовые редакторы отсутствуют
zh_hans: 此时没有活动的文本编辑器
zh_hant: 此時無使用中的文字編輯器

# pickSqlProvider
source: Select SQL Language Provider
fr: Sélectionner le fournisseur de langage SQL
pt_br: Selecione o provedor de linguagem SQL
ru: Выберите поставщика языка SQL
zh_hans: 选择 SQL 语言提供程序
zh_hant: 選擇 SQL 語言提供者

# rowStatus
source: Row Count
fr: Nombre de lignes
pt_br: Contagem de Linhas
ru: Число строк
zh_hans: 行计数
zh_hant: 資料列計數

# rowCount
source: {0} rows
fr: {0} lignes
pt_br: {0} linhas
ru: {0} строк
zh_hans: {0} 行
zh_hant: {0} 個資料列

source: Time Elapsed
ru: Прошедшее время
zh_hant: 已耗用時間

# extensionsInputName
source: Extension
pt_br: Extensão
ru: Расширение
zh_hans: 扩展
zh_hant: 擴充功能

source: disconnected
fr: Déconnecté
pt_br: Desconectado
ru: Отключен
zh_hans: 已断开连接
zh_hant: 已中斷連線

# connectionFailure
source: Edit Data Session Failed To Connect
fr: Échec de connexion de la session de modification des données
pt_br: Editar dados de sessão falhou ao conectar
ru: Не удалось подключиться к сеансу редактирования данных
zh_hans: 编辑数据会话无法连接
zh_hant: 編輯資料工作階段連接失敗

# selectOperationName
source: Select
fr: Sélectionner
pt_br: Selecione
ru: Выбрать
zh_hans: 选择
zh_hant: 選擇

# createOperationName
source: Create
fr: Créer
pt_br: Criar
ru: Создать
zh_hans: 创建
zh_hant: 建立

# insertOperationName
source: Insert
fr: Insérer
pt_br: Inserir
zh_hans: 插入
zh_hant: 插入

# updateOperationName
source: Update
fr: Mettre à jour
pt_br: Atualização
ru: Обновить
zh_hans: 更新
zh_hant: 更新

# deleteOperationName
source: Delete
fr: supprimer
pt_br: Excluir
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# scriptSelectNotFound
source: No script was returned when calling select script on object
fr: Aucun script n'a été retourné lors de l’appel de script select sur l’objet
pt_br: Nenhum script foi retornado ao chamar o script de selecionar objeto
ru: Не было получено ни одного сценария при вызове метода выбора сценария для объекта
zh_hans: 在对象上调用select脚本时，没有返回脚本
zh_hant: 在物件上呼叫選取的指令碼時沒有回傳任何指令碼

# scriptNotFoundForObject
source: No script was returned when scripting as {0} on object {1}
pt_br: Nenhum script foi retornado durante o script como {0} no objeto {1}
ru: При выполнении сценария в режиме {0} для объекта {1} не было возвращено ни одного сценария.
zh_hans: 当在对象 {1} 上运行脚本 {0} 时没有返回任何脚本
zh_hant: 在物件 {1} 指令碼為 {0} 時無回傳任何指令

source: Scripting Failed
fr: Échec de l’écriture de scripts
pt_br: Script falhou
ru: Не удалось создать сценарий
zh_hans: 脚本执行失败
zh_hant: 指令碼失敗

# scriptNotFound
source: No script was returned when scripting as {0}
pt_br: Nenhum script foi retornado quando scripts como {0}
ru: При выполнении сценария в режиме {0} не было возвращено ни одного сценария
zh_hans: 脚本为 {0} 时未返回任何脚本
zh_hant: 指令碼為 {0} 時無回傳任何指令

# optionsDialog.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# optionsDialog.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

source: Backup file path
fr: Chemin du fichier de sauvegarde
pt_br: Caminho do arquivo de backup
ru: Путь к файлу резервной копии
zh_hans: 备份文件路径
zh_hant: 備份檔案路徑

source: Target database
fr: Base de données cible
pt_br: Banco de Dados de destino
ru: Целевая база данных
zh_hans: 目标数据库
zh_hant: 目標資料庫

# RestoreDialogTitle
source: Restore database
fr: Restaurer la base de données
pt_br: Restaurar o banco de dados
ru: Восстановление базы данных
zh_hans: 还原数据库
zh_hant: 還原資料庫

# restoreDialog.restoreTitle
source: Restore database
fr: Restaurer la base de données
pt_br: Restaurar o banco de dados
ru: Восстановление базы данных
zh_hans: 还原数据库
zh_hant: 還原資料庫

# restoreDialog.database
source: Database
fr: Base de données
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# restoreDialog.backupFile
source: Backup file
fr: Fichier de sauvegarde
pt_br: Arquivo de backup
ru: Файл резервной копии
zh_hans: 备份文件
zh_hant: 備份檔案

# restoreDialog.restore
source: Restore
fr: Restaurer
pt_br: Restaurar
ru: Восстановить
zh_hans: 还原
zh_hant: 還原

# restoreDialog.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# restoreDialog.script
source: Script
ru: Скрипт
zh_hans: 脚本
zh_hant: 指令碼

source: Source
pt_br: Fonte
ru: Исходная база данных
zh_hant: 來源

source: Restore from
fr: Restaurer à partir de
pt_br: Restaurar a partir de
ru: Восстановить из
zh_hans: 还原自
zh_hant: 還原自

# missingBackupFilePathError
source: Backup file path is required.
fr: Le chemin du fichier de sauvegarde est requis.
pt_br: Caminho do arquivo de backup é necessário.
ru: Требуется путь к файлу резервной копии.
zh_hans: 备份文件路径是必须的。
zh_hant: 需要備份檔案路徑。

# multipleBackupFilePath
source: Please enter one or more file paths separated by commas
fr: Veuillez saisir un ou plusieurs chemins d’accès séparés par des virgules
pt_br: Por favor, digite um ou mais caminhos de arquivo separados por vírgulas
ru: Пожалуйста, введите один или несколько путей файлов, разделенных запятыми
zh_hans: 请输入一个或多个用逗号分隔的文件路径
zh_hant: 請輸入一個或多個用逗號分隔的檔案路徑

source: Database
fr: Base de données
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

source: Destination
pt_br: Destino
ru: Назначение
zh_hans: 目标
zh_hant: 目的地

# restoreDialog.toggleDatabaseNameDropdown
source: Select Database Toggle Dropdown
fr: Sélectionnez la liste déroulante de bases de données
pt_br: Selecione a lista suspensa de bancos de dados disponíveis
ru: Раскрывающийся список для переключения базы данных
zh_hans: 选择数据库切换下拉列表
zh_hant: 選取資料庫切換下拉式清單

source: Restore to
fr: Restaurer vers
pt_br: Restaurar para
ru: Восстановление
zh_hans: 还原到
zh_hant: 還原到

source: Restore plan
fr: Plan de restauration
pt_br: Restaurar o plano
ru: План восстановления
zh_hans: 还原计划
zh_hant: 還原計劃

source: Backup sets to restore
fr: Jeux de sauvegarde à restaurer
pt_br: Conjuntos de backup para restaurar
ru: Резервные наборы данных для восстановления
zh_hans: 恢复备份集
zh_hant: 要還原的備份組

# restoreDatabaseFileAs
source: Restore database files as
fr: Restaurer les fichiers de base de données en tant que
pt_br: Restaurar arquivos de banco de dados como
ru: Восстановить файлы базы данных как
zh_hans: 将数据库文件还原为
zh_hant: 將資料庫檔案還原為

source: Restore database file details
fr: Restaurer les détails du fichier de base de données
pt_br: Restaurar os detalhes do arquivo de banco de dados
ru: Восстановление сведений о файле базы данных
zh_hans: 还原数据库文件详细信息
zh_hant: 還原資料庫檔詳細資訊

source: Logical file Name
fr: Nom de fichier logique
pt_br: Nome do arquivo lógico
ru: Имя логического файла
zh_hans: 逻辑文件名
zh_hant: 邏輯檔案名稱

source: File type
fr: Type de fichier
pt_br: Tipo de arquivo
ru: Тип файла
zh_hans: 文件类型
zh_hant: 檔案類型

source: Original File Name
fr: Nom de fichier initial
pt_br: Nome do arquivo original
ru: Исходное имя файла
zh_hans: 原始文件名
zh_hant: 原檔案名稱

source: Restore as
fr: Restaurer en tant que
pt_br: Restaurar como
ru: Восстановить как
zh_hans: 还原为
zh_hant: 還原為

source: Restore options
fr: Options de restauration
pt_br: Opções de restauração
ru: Параметры восстановления
zh_hans: 还原选项
zh_hant: 還原選項

source: Tail-Log backup
fr: Sauvegarde de la fin du journal de transaction
pt_br: Backup de Tail-Log
ru: Резервная копия заключительного фрагмента журнала
zh_hans: 尾日志备份
zh_hant: 結尾記錄備份

# serverConnection
source: Server connections
fr: Connexions serveur
pt_br: Conexões de servidor
ru: Соединения с сервером
zh_hans: 服务器连接
zh_hant: 伺服器連接

# generalTitle
source: General
fr: Général
pt_br: Geral
ru: Общее
zh_hans: 常规
zh_hant: 一般

# filesTitle
source: Files
fr: Fichiers
pt_br: Arquivos
ru: Файлы
zh_hans: 文件
zh_hant: 檔案

# optionsTitle
source: Options
pt_br: Opções
ru: Параметры
zh_hans: 选项
zh_hant: 選項

# newDashboardTab.openDashboardExtensions
source: Open dashboard extensions
pt_br: Abrir extensões do dashboard
ru: Открыть расширения панели мониторинга
zh_hans: 打开仪表板扩展
zh_hant: 開啟儀表板延伸模組

# newDashboardTab.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# newDashboardTab.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# newdashboardTabDialog.noExtensionLabel
source: No dashboard extensions are installed at this time. Go to Extension Manager to explore recommended extensions.
pt_br: Não há extensões de painel para serem instaladas neste momento. Vá para o Gerenciador de Extensões para explorar extensões recomendadas.
ru: Расширения панели мониторинга не установлены. Чтобы просмотреть рекомендуемые расширения, перейдите в Диспетчер расширений.
zh_hans: 此时没有安装仪表板扩展。转到扩展管理器来搜索推荐的扩展。
zh_hant: 目前沒有安裝任何儀表板延伸模組。請前往延伸模組管理員探索建議的延伸模組。

# filebrowser.filepath
source: Selected path
fr: Chemin sélectionné
pt_br: Caminho selecionado
ru: Выбранный путь
zh_hans: 选定的路径
zh_hant: 選擇的路徑

# fileFilter
source: Files of type
fr: Fichiers de type
pt_br: Tipo de Arquivos
ru: Файлы данного типа
zh_hans: 文件类型
zh_hant: 檔案類型

# fileBrowser.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# fileBrowser.discard
source: Discard
fr: Annuler
pt_br: Descarte
ru: Отменить
zh_hans: 放弃
zh_hant: 捨棄

# accountDialog.addAccountErrorTitle
source: Error adding account
fr: Erreur lors de l'ajout du compte
pt_br: Erro ao adicionar conta
ru: Ошибка при добавлении учетной записи
zh_hans: 添加帐户时出错
zh_hant: 新增帳戶時發生錯誤

# oauthFlyoutIsAlreadyOpen
source: Cannot start auto OAuth. An auto OAuth is already in progress.
fr: On ne peut pas démarrer une "OAuth auto". Une "OAuth auto" est déjà en cours.
pt_br: Não é possível iniciar o auto OAuth. Um auto OAuth já está em andamento.
ru: Не удается запустить автоматическую авторизацию OAuth. Она уже выполняется.
zh_hans: 无法启动自动 OAuth。自动 OAuth 已在进行中。
zh_hant: 無法啟動自動 OAuth。自動 OAuth 已在進行中。

# manageLinedAccounts
source: Manage Linked Accounts
fr: Gérer les comptes liés
pt_br: Gerenciar contas vinculadas
ru: Управление связанными учетными записями
zh_hans: 管理链接帐户
zh_hant: 管理連結帳戶

# insightsInputError
source: No Connection Profile was passed to insights flyout
fr: Aucun profil de connexion n'a été passé au menu volant d'insights
pt_br: Sem perfil de Conexão foi passado para o submenu de ideias
ru: Профиль подключения не был передан во всплывающий элемент аналитических данных
zh_hans: 没有将连接配置文件传递给洞察弹出
zh_hant: 沒有連接設定傳遞給 insights 彈出式視窗

source: Insights error
fr: Erreur d'aperçus
pt_br: Erro de ideias
ru: Ошибка аналитических данных
zh_hans: 洞察错误
zh_hant: Insights 錯誤

# insightsFileError
source: There was an error reading the query file:
fr: Il y avait une erreur à la lecture du fichier de requête :
pt_br: Houve um erro ao ler o arquivo de consulta:
ru: Произошла ошибка при чтении файла запроса:
zh_hans: 读取查询文件时出错:
zh_hant: 讀取查詢檔案時發生錯誤:

# insightsConfigError
source: There was an error parsing the insight config; could not find query array/string or queryfile
fr: Une erreur s'est produite lors de l'analyse de la configuration de l'aperçu ; Il n’a pas été trouvé de tableau/chaîne de requête ou de fichier de requête
pt_br: Ocorreu um erro ao analisar a configuração de uma visão; Não foi possível encontrar a consulta vetor/string ou arquivo de consulta
ru: Произошла ошибка при синтаксическом анализе конфигурации аналитических данных; не удалось найти массив/строку запроса или файл запроса
zh_hans: 分析洞察配置时出错。找不到查询数组/字符串或查询文件
zh_hant: 解析 insight 設定時發生錯誤。找不到查詢陣列/字串或 queryfile

# insights.item
source: Item
fr: Élément
ru: Элемент
zh_hans: 项
zh_hant: 項目

# insights.value
source: Value
fr: Valeur
pt_br: Valor
ru: Значение
zh_hans: 值
zh_hant: 值

source: Property
fr: propriété
pt_br: Propriedade.
ru: Свойство
zh_hans: 属性
zh_hant: 屬性

source: Value
fr: Valeur
pt_br: Valor
ru: Значение
zh_hans: 值
zh_hant: 值

# insights.dialog.items
source: Items
fr: Éléments
pt_br: Itens
ru: Элементы
zh_hans: 项目
zh_hant: 項目

# insights.dialog.itemDetails
source: Item Details
fr: Détails de l'élément
pt_br: Detalhes do item
ru: Сведения об элементе
zh_hans: 项目详情
zh_hant: 項目詳細資訊

# eventSort
source: Sort by event
fr: Trier par événement
pt_br: Ordenar por evento
ru: Сортировка по событиям
zh_hans: 按事件排序
zh_hant: 按事件排序

# nameColumn
source: Sort by column
fr: Trier par colonne
pt_br: Ordenar por coluna
ru: Сортировка по столбцу
zh_hans: 按列排序
zh_hant: 依資料行排序

# profilerColumnDialog.profiler
source: Profiler
fr: Profileur
ru: Профилировщик
zh_hans: 分析器
zh_hant: 分析器

# profilerColumnDialog.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# profilerColumnDialog.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# profilerFilterDialog.clear
source: Clear All
ru: Очистить все
zh_hant: 全部清除

# profilerFilterDialog.apply
source: Apply
ru: Применить
zh_hant: 套用

# profilerFilterDialog.ok
source: OK
ru: ОК
zh_hant: 確定

# profilerFilterDialog.cancel
source: Cancel
ru: Отмена
zh_hant: 取消

# profilerFilterDialog.title
source: Filters
ru: Фильтры
zh_hant: 篩選

# profilerFilterDialog.remove
source: Remove
ru: Удалить
zh_hant: 移除

# profilerFilterDialog.add
source: Add
ru: добавить
zh_hant: 加入

# profilerFilterDialog.addClauseText
source: Click here to add a clause
ru: Щелкните здесь, чтобы добавить предложение
zh_hant: 按一下這裡即可新增子句

# profilerFilterDialog.fieldColumn
source: Field
ru: Поле
zh_hant: 欄位

# profilerFilterDialog.operatorColumn
source: Operator
ru: Оператор
zh_hant: 運算子

# profilerFilterDialog.valueColumn
source: Value
ru: Значение
zh_hant: 值

# profilerFilterDialog.isNullOperator
source: Is Null
ru: Имеет значение Null
zh_hant: 為 Null

# profilerFilterDialog.isNotNullOperator
source: Is Not Null
ru: Не имеет значение Null
zh_hant: 非 Null

# profilerFilterDialog.containsOperator
source: Contains
ru: Содержит
zh_hant: 包含

# profilerFilterDialog.notContainsOperator
source: Not Contains
ru: Не содержит
zh_hant: 不包含

# profilerFilterDialog.startsWithOperator
source: Starts With
ru: Начинается с
zh_hant: 開始於

# profilerFilterDialog.notStartsWithOperator
source: Not Starts With
ru: Не начинается с
zh_hant: 不以下列項目開始

# firewallDialog.addAccountErrorTitle
source: Error adding account
fr: Erreur lors de l'ajout du compte
pt_br: Erro ao adicionar conta
ru: Ошибка при добавлении учетной записи
zh_hans: 添加帐户时出错
zh_hant: 新增帳戶時發生錯誤

source: Firewall rule error
fr: Erreur de règle du pare-feu
pt_br: Erro de regra de firewall
ru: Ошибка правила брандмауэра
zh_hans: 防火墙规则错误
zh_hant: 防火牆規則錯誤

# carbon.extension.contributes.notebook.provider
source: Identifier of the notebook provider.
ru: Идентификатор поставщика записных книжек.
zh_hant: 筆記本提供者的識別碼。

# carbon.extension.contributes.notebook.fileExtensions
source: What file extensions should be registered to this notebook provider
ru: Расширения файлов, которые должны быть зарегистрированы для этого поставщика записных книжек
zh_hant: 應向此筆記本提供者註冊的檔案副檔名

# carbon.extension.contributes.notebook.standardKernels
source: What kernels should be standard with this notebook provider
ru: Какие ядра следует использовать в качестве стандартных для этого поставщика записных книжек
zh_hant: 應為此筆記本提供者之標準的核心

# vscode.extension.contributes.notebook.providers
source: Contributes notebook providers.
ru: Добавляет поставщиков записных книжек.
zh_hant: 提供筆記本提供者。

# carbon.extension.contributes.notebook.magic
source: Name of the cell magic, such as "%%sql".
ru: Имя магической команды ячейки, например, "%%sql".
zh_hant: 儲存格 magic 的名稱，例如 "%%sql"。

# carbon.extension.contributes.notebook.language
source: The cell language to be used if this cell magic is included in the cell
ru: Язык ячейки, который будет использоваться, если эта магическая команда ячейки включена в ячейку
zh_hant: 儲存格中包含此儲存格 magic 時，要使用的儲存格語言

# carbon.extension.contributes.notebook.executionTarget
source: Optional execution target this magic indicates, for example Spark vs SQL
ru: Необязательная цель выполнения, указанная в этой магической команде, например, Spark vs SQL
zh_hant: 這個 magic 指示的選擇性執行目標，例如 Spark vs SQL

# carbon.extension.contributes.notebook.kernels
source: Optional set of kernels this is valid for, e.g. python3, pyspark3, sql
ru: Необязательный набор подходящих ядер, например, python3, pyspark3, sql
zh_hant: 這個項目有效的一組選擇性核心，例如 python3、pyspark3、sql

# vscode.extension.contributes.notebook.languagemagics
source: Contributes notebook language.
ru: Определяет язык записной книжки.
zh_hant: 貢獻筆記本語言。
