Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

# xAxisMinVal
source: X Axis Minimum Value
fr: Valeur minimale de l'axe X
pt_br: Valor mínimo do eixo X
ru: Минимальное значение по оси x
zh_hans: X 轴最小值
zh_hant: X 軸最小值

# xAxisMaxVal
source: X Axis Maximum Value
fr: Valeur maximale de l'axe X
pt_br: Valor máximo para o eixo X
ru: Максимальное значение по оси x
zh_hans: X 轴最大值
zh_hant: X 軸最大值

# xAxisMinDate
source: X Axis Minimum Date
ru: Минимальная дата по оси x
zh_hant: X 軸最小日期

# xAxisMaxDate
source: X Axis Maximum Date
ru: Максимальная дата по оси x
zh_hant: X 軸最大日期

# dataTypeLabel
source: Data Type
fr: Type de données
pt_br: Tipo de dados
ru: Тип данных
zh_hans: 数据类型
zh_hant: 資料型態

# numberLabel
source: Number
fr: Nombre
pt_br: Número
ru: Число
zh_hans: 编号
zh_hant: 數字

# pointLabel
source: Point
pt_br: Ponto
ru: Точка
zh_hans: 点
zh_hant: 點

# chartTypeLabel
source: Chart Type
fr: Type de graphique
pt_br: Tipo de gráfico
ru: Тип диаграммы
zh_hans: 图表类型
zh_hant: 圖表類型

# encodingOption
source: Encoding
ru: Кодировка
zh_hant: 編碼

# imageFormatOption
source: Image Format
ru: Формат изображения
zh_hant: 映像格式

# createInsightLabel
source: Create Insight
fr: Créer un Insight
pt_br: Criar um insighit
ru: Создать представление
zh_hans: 创建洞察力
zh_hant: 建立 Insight

# createInsightNoEditor
source: Cannot create insight as the active editor is not a SQL Editor
fr: Impossible de créer un aperçu car l’éditeur actif n’est pas un éditeur SQL
pt_br: Não é possível criar informações como o editor ativo não é um Editor SQL
ru: Не удается создать аналитические данные, так как активным редактором не является редактор SQL
zh_hans: 无法创建Insight，因为活动编辑器不是SQL编辑器
zh_hant: 啟用的編輯器不是 SQL 編輯器，無法建立 insight

# myWidgetName
source: My-Widget
fr: Mon-Widget
pt_br: Meu Widget
ru: Мое мини-приложение
zh_hans: 我的小部件
zh_hant: 我的小工具

# copyChartLabel
source: Copy as image
fr: Copier en tant qu'image
pt_br: Copiar como imagem
ru: Копировать как изображение
zh_hans: 复制为图像
zh_hant: 複製為圖像

# chartNotFound
source: Could not find chart to save
fr: Le graphique à sauvegarder n'a pas été trouvé
pt_br: Não foi possível encontrar o gráfico para salvar
ru: Не удалось найти диаграмму для сохранения
zh_hans: 找不到要保存的图表
zh_hant: 找不到要儲存的圖表

# saveImageLabel
source: Save as image
fr: Enregistrer comme image
pt_br: Salvar como imagem
ru: Сохранить как изображение
zh_hans: 另存为图像
zh_hant: 另存為圖像

# chartSaved
source: Saved Chart to path: {0}
fr: Graphique enregistré au chemin d’accès : {0}
pt_br: Gráfico Salvo no caminho: {0}
ru: Диаграмма сохранена по следующему пути: {0}
zh_hans: 保存的图表到路径: {0}
zh_hant: 已儲存圖表到路徑: {0}

# chartViewer.saveAsFileTitle
source: Choose Results File
fr: Choisissez le fichier de résultats
pt_br: Escolha o arquivo de resultados
ru: Выберите файл результатов
zh_hans: 选择结果文件
zh_hant: 選擇結果檔案

# deleteCellFailed
source: Failed to delete cell.
ru: Не удалось удалить ячейку.
zh_hant: 無法刪除儲存格。

# changeKernelFailedRetry
source: Failed to change kernel. Kernel {0} will be used. Error was: {1}
ru: Не удалось изменить ядро. Будет использоваться ядро {0}. Ошибка: {1}
zh_hant: 無法變更核心。將會使用核心 {0}。錯誤為: {1}

# changeKernelFailed
source: Failed to change kernel due to error: {0}
ru: Не удалось изменить ядро из-за ошибки: {0}
zh_hant: 因為錯誤所以無法變更核心: {0}

# changeContextFailed
source: Changing context failed: {0}
ru: Не удалось изменить контекст: {0}
zh_hant: 無法變更內容: {0}

# startSessionFailed
source: Could not start session: {0}
ru: Не удалось запустить сеанс: {0}
zh_hant: 無法啟動工作階段: {0}

# shutdownError
source: An error occurred when closing the notebook: {0}
ru: Произошла ошибка при закрытии записной книжки: {0}
zh_hant: 關閉筆記本時發生錯誤: {0}

# shutdownClientSessionError
source: A client session error occurred when closing the notebook: {0}
ru: При закрытии записной книжки произошла ошибка сеанса клиента: {0}
zh_hant: 關閉筆記本時發生用戶端工作階段錯誤: {0}

# ProviderNoManager
source: Can't find notebook manager for provider {0}
ru: Не удается найти диспетчер записных книжек для поставщика {0}
zh_hant: 找不到提供者 {0} 的筆記本管理員

# changing
source: Changing kernel...
ru: Изменение ядра...
zh_hant: 正在變更核心...

source: Kernel:
ru: Ядро:
zh_hant: 核心:

source: Attach to:
ru: Присоединиться к:
zh_hant: 附加至:

source: Loading contexts...
ru: Загрузка контекстов...
zh_hant: 正在載入內容...

source: Add new connection
ru: Добавить новое подключение
zh_hant: 新增連線

source: Select connection
ru: Выберите подключение
zh_hant: 選取連線

# trustLabel
source: Trusted
ru: Доверенный
zh_hant: 受信任

# untrustLabel
source: Not Trusted
ru: Не доверенный
zh_hant: 不受信任

# alreadyTrustedMsg
source: Notebook is already trusted.
ru: Записная книжка уже является доверенной.
zh_hant: 筆記本已受信任。

source: No Kernel
ru: Нет ядра
zh_hant: 沒有核心

# noContextAvailable
source: None
zh_hant: 無

source: SQL kernel error
ru: Ошибка ядра SQL
zh_hant: SQL 核心錯誤

# connectionRequired
source: A connection must be chosen to run notebook cells
ru: Для запуска ячеек записной книжки необходимо выбрать подключение
zh_hant: 必須選擇連線來執行筆記本儲存格

# sqlMaxRowsDisplayed
source: Displaying Top {0} rows.
ru: Отображаются первые {0} строк.
zh_hant: 目前顯示前 {0} 列。

# doubleClickEdit
source: Double-click to edit
ru: Дважды щелкните, чтобы изменить
zh_hant: 按兩下即可編輯

source: Click on
ru: Щелкните
zh_hant: 按一下

# plusCode
source: + Code
ru: Добавить код
zh_hant: + 程式碼

source: or
ru: Или
zh_hant: 或

# plusText
source: + Text
ru: Добавить текст
zh_hant: + 文字

# toAddCell
source: to add a code or text cell
ru: для добавления кода или текстовой ячейки
zh_hant: 新增程式碼或文字儲存格

# cancelTask.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# errorMsgFromCancelTask
source: The task is failed to cancel.
fr: L'annulation de la tâche a échoué.
pt_br: A tarefa falhou ao ser cancelada.
ru: Ошибка при отмене задачи.
zh_hans: 任务取消失败。
zh_hant: 工作無法取消。

# taskAction.script
source: Script
ru: Скрипт
zh_hans: 脚本
zh_hant: 指令碼

# createDatabase.databaseFiles
source: Database files:
fr: Fichiers de base de données :
pt_br: Arquivos de banco de dados:
ru: Файлы базы данных:
zh_hans: 数据库文件:
zh_hant: 資料庫檔案:

# createDatabase.noRecordsFound
source: No records found
fr: Aucun enregistrement trouvé
pt_br: Nenhum registro encontrado
ru: Записи не найдены
zh_hans: 未找到记录
zh_hant: 未找到紀錄

# homeCrumb
source: Home
fr: Accueil
pt_br: Casa
ru: Домашняя страница
zh_hans: 主页
zh_hant: 首頁

# dashboard.changeDatabaseFailure
source: Failed to change database
fr: Echec lors du changement de base de données
pt_br: Falha ao mudar o banco de dados
ru: Не удалось изменить базу данных
zh_hans: 更改数据库失败
zh_hant: 變更資料庫失敗

# dashboardNavSection_loadTabError
source: The "{0}" section has invalid content. Please contact extension owner.
pt_br: A seção "{0}" tem conteúdo inválido. Entre em contato com o proprietário da extensão.
ru: В разделе "{0}" имеется недопустимое содержание. Свяжитесь с владельцем расширения.
zh_hans: "{0}" 部分的内容无效。请与扩展所有者联系。
zh_hant: "{0}" 區段有無效的內容。請連絡延伸模組擁有者。

# jobColumns.name
source: Name
fr: Nom
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# jobColumns.lastRun
source: Last Run
fr: Dernière exécution
pt_br: Última execução
ru: Последний запуск
zh_hans: 上次运行
zh_hant: 上一個執行

# jobColumns.nextRun
source: Next Run
fr: Prochaine exécution
pt_br: Próxima Execução
ru: Следующий запуск
zh_hans: 下次运行
zh_hant: 下一個執行

# jobColumns.enabled
source: Enabled
fr: Activé
pt_br: Habilitado
ru: Включено
zh_hans: 已启用
zh_hant: 啟用

# jobColumns.status
source: Status
fr: État
ru: Статус
zh_hans: 状态
zh_hant: 狀態

# jobColumns.category
source: Category
fr: Catégorie
pt_br: Categoria
ru: Категория
zh_hans: 类别
zh_hant: 分類

# jobColumns.runnable
source: Runnable
fr: Exécutable
pt_br: Executável
ru: Готово к запуску
zh_hans: 可运行的
zh_hant: 可執行

# jobColumns.schedule
source: Schedule
fr: Planification
pt_br: Agenda
ru: Расписание
zh_hans: 安排
zh_hant: 排程

# jobColumns.lastRunOutcome
source: Last Run Outcome
fr: Résultats de la dernière exécution
pt_br: Resultado da última execução
ru: Результат последнего запуска
zh_hans: 上次运行的结果
zh_hant: 上次執行結果

# jobColumns.previousRuns
source: Previous Runs
pt_br: Execuções anteriores
ru: Предыдущие запуски
zh_hans: 之前的运行
zh_hant: 上一個執行

# jobsView.noSteps
source: No Steps available for this job.
pt_br: Nenhum passo disponível para este job.
ru: Шаги для этого задания недоступны.
zh_hans: 没有可用于此作业的步骤。
zh_hant: 沒有任何此作業可用的步驟。

# jobsView.error
source: Error:
fr: Erreur :
pt_br: Erro:
ru: Ошибка:
zh_hans: 错误:
zh_hant: 錯誤︰

# jobAlertColumns.name
source: Name
fr: Nom
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# jobAlertColumns.lastOccurrenceDate
source: Last Occurrence
fr: Dernière occurrence
pt_br: Última ocorrência
ru: Последнее появление
zh_hans: 最后一次发生
zh_hant: 上次發生

# jobAlertColumns.enabled
source: Enabled
fr: Activé
pt_br: Habilitado
ru: Включено
zh_hans: 已启用
zh_hant: 啟用

# jobAlertColumns.delayBetweenResponses
source: Delay Between Responses (in secs)
ru: Задержка между ответами (в секундах)
zh_hant: 回應之間的延遲 (秒)

# jobAlertColumns.categoryName
source: Category Name
fr: Nom de la catégorie
pt_br: Nome da categoria
ru: Имя категории
zh_hans: 类别名称
zh_hant: 類別名稱

# jobview.Jobs
source: Jobs
fr: Travaux
pt_br: Trabalhos
ru: Задания
zh_hans: 作业
zh_hant: 作業

# jobview.Alerts
source: Alerts
fr: Alertes
pt_br: Alertas
ru: Предупреждения
zh_hans: 警报
zh_hant: 警示

# jobview.Proxies
source: Proxies
ru: Прокси-серверы
zh_hans: 代理
zh_hant: Proxy

# jobview.Operators
source: Operators
fr: Opérateurs
pt_br: Operadores
ru: Операторы
zh_hans: 操作员
zh_hant: 運算子

# jobProxyToolbar-NewItem
source: New Proxy
pt_br: Novo Proxy
ru: Новый прокси-сервер
zh_hans: 新代理
zh_hant: 新增 Proxy

# jobProxyToolbar-Refresh
source: Refresh
fr: Actualiser
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# jobProxiesView.accountName
source: Account Name
fr: Nom du compte
pt_br: Nome da conta
ru: Имя учетной записи
zh_hans: 帐户名
zh_hant: 帳戶名稱

# jobProxiesView.credentialName
source: Credential Name
fr: Nom d'identification
pt_br: Nome da credencial
ru: Имя учетных данных
zh_hans: 凭据名称
zh_hant: 認證名稱

# jobProxiesView.description
source: Description
ru: Описание
zh_hant: 描述

# jobProxiesView.isEnabled
source: Enabled
ru: Включено
zh_hant: 啟用

# stepRow.stepID
source: Step ID
ru: Идентификатор шага
zh_hant: 步驟識別碼

# stepRow.stepName
source: Step Name
ru: Имя шага
zh_hant: 步驟名稱

# stepRow.message
source: Message
ru: Сообщение
zh_hant: 訊息

# jobOperatorsView.name
source: Name
fr: Nom
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# jobOperatorsView.emailAddress
source: Email Address
pt_br: Endereço de e-mail
ru: Адрес электронной почты
zh_hans: 电子邮件地址
zh_hant: 電子郵件地址

# jobOperatorsView.enabled
source: Enabled
fr: Activé
pt_br: Habilitado
ru: Включено
zh_hans: 已启用
zh_hant: 啟用

# serverPageName
source: SERVER DASHBOARD
fr: TABLEAU DE BORD SERVEUR
pt_br: PAINEL DO SERVIDOR
ru: ПАНЕЛЬ МОНИТОРИНГА СЕРВЕРА
zh_hans: 服务器仪表板
zh_hant: 伺服器儀表板

# databasePageName
source: DATABASE DASHBOARD
fr: TABLEAU DE BORD DE BASE DE DONNÉES
pt_br: PAINEL DE BANCO DE DADOS
ru: ПАНЕЛЬ МОНИТОРИНГА БАЗЫ ДАННЫХ
zh_hans: 数据库仪表板
zh_hant: 資料庫儀表板

# dashboard.properties.error
source: Unable to load dashboard properties
fr: Impossible de charger les propriétés du tableau de bord
pt_br: Não é possível carregar as propriedades do painel
ru: Не удалось загрузить свойства панели мониторинга
zh_hans: 无法加载仪表板属性
zh_hant: 無法載入儀表板屬性

# seachObjects
source: Search by name of type (a:, t:, v:, f:, or sp:)
fr: Recherche par nom de type (a:, t:, v:, f: ou sp :)
pt_br: Pesquisar pelo nome do tipo (a:, t:, v:, f:, or sp:)
ru: Поиск по имени типа (a:, t:, v:, f: или sp:)
zh_hans: 按类型名称搜索 (a:, t:, v:, f:, 或 sp:)
zh_hant: 按類型名稱搜索 (a:, t:, v:, f: 或 sp:)

source: Search databases
fr: Rechercher les bases de données
pt_br: Bancos de dados de pesquisa
ru: Поиск базы данных
zh_hans: 搜索数据库
zh_hant: 搜尋資料庫

# dashboard.explorer.objectError
source: Unable to load objects
fr: Impossible de charger les objets
pt_br: Não é possível carregar objetos
ru: Не удается загрузить объекты
zh_hans: 无法加载对象
zh_hant: 無法載入物件

# dashboard.explorer.databaseError
source: Unable to load databases
fr: Impossible de charger les bases de données
pt_br: Não é possível carregar bancos de dados
ru: Не удалось загрузить базы данных
zh_hans: 无法加载数据库
zh_hant: 無法載入資料庫

# editDashboard
source: Edit
fr: Modifier
pt_br: Editar
ru: Изменить
zh_hans: 编辑
zh_hant: 編輯

# editDashboardExit
source: Exit
fr: Quitter
pt_br: Sair
ru: Выход
zh_hans: 退出
zh_hant: 結束

# refreshWidget
source: Refresh
fr: Actualiser
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

source: Toggle More
fr: Activer/désactiver plus
pt_br: Alternar entre mais
ru: Переключить еще
zh_hans: 切换更多
zh_hant: 切換更多

source: Delete Widget
fr: Supprimer le Widget
pt_br: Excluir o Widget
ru: Удалить мини-приложение
zh_hans: 删除小部件
zh_hant: 刪除小工具

source: Click to unpin
fr: Cliquer pour supprimer
pt_br: Clique para Desafixar
ru: Щелкните, чтобы открепить
zh_hans: 单击以解除锁定
zh_hant: 點擊以取消釘選

source: Click to pin
fr: Cliquer pour épingler
pt_br: Clique para fixar
ru: Щелкните, чтобы закрепить
zh_hans: 单击以锁定
zh_hant: 按一下以固定

# addFeatureAction.openInstalledFeatures
source: Open installed features
fr: Ouvrir les fonctionnalités installées
pt_br: Recursos instalados abertos
ru: Открыть установленные компоненты
zh_hans: 打开已安装的功能
zh_hant: 開啟已安裝的功能

# collapseWidget
source: Collapse
fr: Réduire
pt_br: Recolher
zh_hans: 折叠
zh_hant: 摺疊

# expandWidget
source: Expand
fr: Développer
pt_br: Expandir
ru: Развернуть
zh_hans: 扩展
zh_hant: 展開

# insights.lastUpdated
source: Last Updated: {0} {1}
fr: Dernière mise à jour : {0} {1}
pt_br: Ultima atualização: {0} {1}
ru: Последнее обновление: {0} {1}
zh_hans: 最近更新: {0} {1}
zh_hant: 最近更新: {0} {1}

# noResults
source: No results to show
fr: Aucun résultat à afficher
pt_br: Nenhum resultado para mostrar
ru: Результаты для отображения отсутствуют
zh_hans: 没有要显示的结果
zh_hant: 沒有可顯示的結果

source: Delete Row
fr: Supprimer la ligne
pt_br: Excluir linha
ru: Удалить строку
zh_hans: 删除行
zh_hant: 刪除行

# revertRow
source: Revert Current Row
fr: Annuler la ligne actuelle
pt_br: Desfazer a linha atual
ru: Отменить изменения в текущей строке
zh_hans: 还原当前行
zh_hant: 還原目前的列

# chartTabTitle
source: Chart
ru: Диаграмма
zh_hant: 圖表

# label.find
source: Find
fr: Rechercher
pt_br: Encontrar
ru: Найти
zh_hans: 查找
zh_hant: 尋找

# placeholder.find
source: Find
fr: Rechercher
pt_br: Encontrar
ru: Найти
zh_hans: 查找
zh_hant: 尋找

# label.previousMatchButton
source: Previous match
fr: Correspondance précédente
pt_br: Correspondência anterior
ru: Предыдущее совпадение
zh_hans: 上一个匹配项
zh_hant: 上一個符合項目

# label.nextMatchButton
source: Next match
fr: Prochaine correspondance
pt_br: Próxima correspondência
ru: Следующее совпадение
zh_hans: 下一个匹配项
zh_hant: 下一個符合項目

# label.closeButton
source: Close
fr: Fermer
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# title.matchesCountLimit
source: Your search returned a large number of results, only the first 999 matches will be highlighted.
ru: В результате поиска было получено слишком большое число результатов. Будут показаны только первые 999 результатов.
zh_hant: 您的搜尋傳回了大量結果，只會將前 999 個相符項目醒目提示。

# label.matchesLocation
source: {0} of {1}
fr: {0} sur {1}
pt_br: {0} de {1}
ru: {0} из {1}
zh_hans: {1} 中的 {0}
zh_hant: {1} 的 {0}

# label.noResults
source: No Results
fr: Aucun résultat
pt_br: Nenhum resultado
ru: Результаты отсутствуют
zh_hans: 无结果
zh_hant: 查無結果

# unknownComponentType
source: Unkown component type. Must use ModelBuilder to create objects
pt_br: Tipo de componente desconhecido. Deve usar ModelBuilder para criar objetos
ru: Неизвестный тип компонента. Для создания объектов необходимо использовать ModelBuilder
zh_hans: 未知的组件类型。必须使用ModelBuilder来创建对象
zh_hant: 元件類型不明。必須使用 ModelBuilder 才能建立物件

# unknownConfig
source: Unkown component configuration, must use ModelBuilder to create a configuration object
fr: Configuration des composants inconnue, vous devez utiliser ModelBuilder pour créer un objet de configuration
pt_br: Componente de configuração desconhecida, use ModelBuilder para criar um objeto de configuração.
ru: Неизвестная конфигурация компонента. Необходимо использовать ModelBuilder для создания объекта конфигурации
zh_hans: 未知组件配置, 必须使用模型构建器创建配置对象
zh_hant: 元件設定不明，必須使用 ModelBuilder 才能建立設定物件

# treeView.notRegistered
source: No tree view with id '{0}' registered.
fr: Aucune arborescence avec l'ID « {0} » n'est enregistrée.
pt_br: Não há exibição de árvore com id '{0}' registrado.
ru: Представление в виде дерева с идентификатором '{0}' не зарегистрировано.
zh_hans: 没有注册 id 为 "{0}" 的树视图。
zh_hant: 未註冊識別碼為 '{0}' 的樹狀檢視。

# dialogDoneLabel
source: Done
fr: terminé
pt_br: concluído
ru: Договорились
zh_hans: 已完成
zh_hant: 完成

# dialogCancelLabel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# generateScriptLabel
source: Generate script
pt_br: Gerar script
ru: Создать сценарий
zh_hans: 生成脚本
zh_hant: 產生指令碼

# dialogNextLabel
source: Next
fr: Suivant
pt_br: Próximo
ru: Далее
zh_hans: 下一个
zh_hant: 下一個

# dialogPreviousLabel
source: Previous
fr: Précédent
pt_br: Anterior
ru: Назад
zh_hans: 上一个
zh_hant: 上一個

# providerRequired
source: A NotebookProvider with valid providerId must be passed to this method
ru: В качестве параметра этого метода необходимо указать NotebookProvider с действительным providerId
zh_hant: 必須將具有有效 providerId 的 NotebookProvider 傳遞給此方法

# errNoProvider
source: no notebook provider found
ru: поставщики записных книжек не найдены
zh_hant: 找不到任何筆記本提供者

# errNoManager
source: No Manager found
ru: Диспетчер не найден
zh_hant: 找不到管理員

# noServerManager
source: Notebook Manager for notebook {0} does not have a server manager. Cannot perform operations on it
ru: Notebook Manager для записной книжки {0} не содержит диспетчера серверов. Невозможно выполнить операции над ним
zh_hant: 筆記本 {0} 的筆記本管理員沒有伺服器管理員。無法對其執行作業

# noContentManager
source: Notebook Manager for notebook {0} does not have a content manager. Cannot perform operations on it
ru: Notebook Manager для записной книжки {0} не включает диспетчер содержимого. Невозможно выполнить операции над ним
zh_hant: 筆記本 {0} 的筆記本管理員沒有內容管理員。無法對其執行作業

# noSessionManager
source: Notebook Manager for notebook {0} does not have a session manager. Cannot perform operations on it
ru: Notebook Manager для записной книжки {0} не содержит диспетчер сеанса. Невозможно выполнить действия над ним
zh_hant: 筆記本 {0} 的筆記本管理員沒有工作階段管理員。無法對其執行作業

# series
source: Series {0}
ru: Серии {0}
zh_hant: 系列 {0}

# addConnection
source: Add new connection
ru: Добавить новое подключение
zh_hant: 新增連線

# executionCanceled
source: Query execution was canceled
ru: Выполнение запроса отменено
zh_hant: 已取消執行查詢

# notebookNotReady
source: The session for this notebook is not yet ready
ru: Сеанс для этой записной книжки еще не готов
zh_hant: 這個筆記本的工作階段尚未就緒

# sessionNotReady
source: The session for this notebook will start momentarily
ru: Сеанс для этой записной книжки сейчас начнется
zh_hant: 這個筆記本的工作階段即將啟動

# noDefaultKernel
source: No kernel is available for this notebook
ru: Ядро для этой записной книжки недоступно
zh_hant: 沒有任何可供此筆記本使用的核心

# clientSession.unknownError
source: An error occurred while starting the notebook session
ru: Произошла ошибка во время запуска сеанса записной книжки
zh_hant: 啟動筆記本工作階段時發生錯誤

# ServerNotStarted
source: Server did not start for unknown reason
ru: Не удалось запустить сервер по неизвестной причине
zh_hant: 伺服器因為不明原因而未啟動

# kernelRequiresConnection
source: Kernel {0} was not found. The default kernel will be used instead.
ru: Ядро {0} не найдено. Будет использоваться ядро по умолчанию.
zh_hant: 找不到核心 {0}。會改用預設核心。

# runNotebookDisabled
source: Cannot run cells as no kernel has been configured
ru: Не удается запустить ячейки, так как ядро не настроено
zh_hant: 因為未設定任何核心，所以無法執行儲存格

# errorName
source: Error
ru: Ошибка
zh_hant: 錯誤

# codeBefore
source: Insert Code before
ru: Вставить код перед
zh_hant: 在前面插入程式碼

# codeAfter
source: Insert Code after
ru: Вставить код после
zh_hant: 在之後插入程式碼

# markdownBefore
source: Insert Markdown before
ru: Вставить разметку Markdown перед
zh_hant: 在之前插入 Markdown

# markdownAfter
source: Insert Markdown after
ru: Вставить разметку Markdown после
zh_hant: 在之後插入 Markdown

# clear
source: Clear output
ru: Очистить выходные данные
zh_hant: 清除輸出

# notebook.failed
source: Please select active cell and try again
ru: Выберите активную ячейку и повторите попытку
zh_hant: 請選取作用儲存格並再試一次

source: Run cell
ru: Запустить ячейку
zh_hant: 執行儲存格

# stopCell
source: Cancel execution
ru: Отменить выполнение
zh_hant: 取消執行

# errorRunCell
source: Error on last run. Click to run again
ru: Ошибка при последнем запуске. Щелкните, чтобы запустить повторно
zh_hant: 上一個執行發生錯誤。按一下即可重新執行

# unknownDashboardContainerError
source: {0} is an unknown container.
fr: {0} est un conteneur inconnu.
pt_br: {0} é um container desconhecido.
ru: {0} является неизвестным контейнером.
zh_hans: {0} 是未知容器。
zh_hant: {0} 是不明容器。

# componentTypeNotRegistered
source: Could not find component for type {0}
fr: Composant introuvable pour le type {0}
pt_br: Não foi possível localizar componente para tipo {0}
ru: Не удалось найти компонент для типа {0}
zh_hans: 找不到类型 {0} 的组件
zh_hant: 找不到類型 {0} 的元件

# rowDetailView.loadError
source: Loading Error...
pt_br: Erro de carregamento...
ru: Ошибка загрузки...
zh_hans: 加载错误...
zh_hant: 正在載入錯誤...

# jobaction.successLabel
source: Success
ru: Успех
zh_hant: 成功

# jobaction.faillabel
source: Error
ru: Ошибка
zh_hant: 錯誤

# jobaction.refresh
source: Refresh
fr: Actualiser
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# jobaction.newJob
source: New Job
fr: Nouveau travail
pt_br: Novo job
ru: Создание задания
zh_hans: 新作业
zh_hant: 新工作

# jobaction.run
source: Run
fr: Exécuter
pt_br: Executar
ru: Запуск
zh_hans: 运行
zh_hant: 執行

# jobSuccessfullyStarted
source: : The job was successfully started.
fr: : Le travail a été démarré.
pt_br: O job foi iniciado com êxito.
ru: : задание успешно запущено.
zh_hans: : 作业已成功启动。
zh_hant: : 已成功啟動作業。

# jobaction.stop
source: Stop
fr: Arrêter
pt_br: Pare
ru: Остановить
zh_hans: 停止
zh_hant: 停止

# jobSuccessfullyStopped
source: : The job was successfully stopped.
pt_br: : O trabalho foi interrompido com êxito.
ru: : задание успешно остановлено.
zh_hans: ：作业已成功停止。
zh_hant: : 已成功停止作業。

# jobaction.editJob
source: Edit Job
pt_br: Editar job
ru: Изменение задания
zh_hans: 编辑作业
zh_hant: 編輯作業

# jobaction.deleteJob
source: Delete Job
fr: Supprimer le travail
pt_br: Excluir Job
ru: Удалить задание
zh_hans: 删除作业
zh_hant: 刪除作業

# jobaction.deleteJobConfirm
source: Are you sure you'd like to delete the job '{0}'?
ru: Вы действительно хотите удалить задание "{0}"?
zh_hant: 確定要刪除作業 '{0}' 嗎?

# jobaction.failedToDeleteJob
source: Could not delete job '{0}'. Error: {1}
fr: Impossible de supprimer le travail « {0} ». Erreur : {1}
pt_br: Não foi possível excluir o job '{0}'. Erro: {1}
ru: Не удалось удалить задание '{0}'. Ошибка: {1}
zh_hans: 无法删除作业 "{0}"。 错误: {1}
zh_hant: 無法刪除作業 '{0}'。 錯誤: {1}

# jobaction.deletedJob
source: The job was successfully deleted
ru: Задание успешно удалено
zh_hant: 已成功刪除作業

# jobaction.newStep
source: New Step
fr: Nouvelle étape
pt_br: Nova etapa
ru: Новый шаг
zh_hans: 新步骤
zh_hant: 新增步驟

# jobaction.deleteStep
source: Delete Step
ru: Удалить шаг
zh_hant: 刪除步驟

# jobaction.deleteStepConfirm
source: Are you sure you'd like to delete the step '{0}'?
ru: Вы действительно хотите удалить шаг "{0}"?
zh_hant: 確定要刪除步驟 '{0}' 嗎?

# jobaction.failedToDeleteStep
source: Could not delete step '{0}'. Error: {1}
ru: Не удалось удалить шаг "{0}". Ошибка: {1}
zh_hant: 無法刪除步驟 '{0}'。 錯誤: {1}

# jobaction.deletedStep
source: The job step was successfully deleted
ru: Шаг задания был успешно удален
zh_hant: 已成功刪除作業步驟

# jobaction.newAlert
source: New Alert
fr: Nouvelle alerte
pt_br: Novo alerta
ru: Создание предупреждения
zh_hans: 新警报
zh_hant: 新增警示
