Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

# jobaction.editAlert
source: Edit Alert
pt_br: Editar alerta
ru: Изменить оповещение
zh_hans: 编辑警报
zh_hant: 編輯警示

# jobaction.deleteAlert
source: Delete Alert
pt_br: Apagar alerta
ru: Удалить предупреждение
zh_hans: 删除警报
zh_hant: 刪除警示

# jobaction.Cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# jobaction.deleteAlertConfirm
source: Are you sure you'd like to delete the alert '{0}'?
ru: Вы действительно хотите удалить предупреждение "{0}"?
zh_hant: 確定要刪除警示 '{0}' 嗎?

# jobaction.failedToDeleteAlert
source: Could not delete alert '{0}'. Error: {1}
fr: Impossible de supprimer l'alerte « {0} ». Erreur : {1}
pt_br: Não foi possível excluir alerta '{0}'. Erro: {1}
ru: Не удалось удалить оповещение "{0}". Ошибка: {1}
zh_hans: 无法删除警报 "{0}"。 错误: {1}
zh_hant: 無法刪除警示 '{0}'。錯誤: {1}

# jobaction.deletedAlert
source: The alert was successfully deleted
ru: Предупреждение успешно удалено
zh_hant: 已成功刪除警示

# jobaction.newOperator
source: New Operator
fr: Nouvel opérateur
pt_br: Novo operador
ru: Создание оператора
zh_hans: 新建操作符
zh_hant: 新增運算子

# jobaction.editOperator
source: Edit Operator
pt_br: Editar o operador
ru: Оператор редактирования
zh_hans: 编辑操作员
zh_hant: 編輯運算子

# jobaction.deleteOperator
source: Delete Operator
pt_br: Excluir operador
ru: Оператор удаления
zh_hans: 删除运算符
zh_hant: 刪除運算子

# jobaction.deleteOperatorConfirm
source: Are you sure you'd like to delete the operator '{0}'?
ru: Вы действительно хотите удалить оператор "{0}"?
zh_hant: 確定要刪除運算子 "{0}" 嗎?

# jobaction.failedToDeleteOperator
source: Could not delete operator '{0}'. Error: {1}
pt_br: Não foi possível excluir o operador '{0}'. Erro: {1}
ru: Не удалось удалить оператор "{0}". Ошибка: {1}
zh_hans: 无法删除操作员 "{0}"。 错误: {1}
zh_hant: 無法刪除運算子 '{0}'。 錯誤：{1}

# joaction.deletedOperator
source: The operator was deleted successfully
ru: Оператор успешно удален
zh_hant: 已成功刪除運算子

# jobaction.newProxy
source: New Proxy
pt_br: Novo Proxy
ru: Новый прокси-сервер
zh_hans: 新代理
zh_hant: 新增 Proxy

# jobaction.editProxy
source: Edit Proxy
pt_br: Editar proxy
ru: Изменить прокси-сервер
zh_hans: 编辑代理服务器
zh_hant: 編輯 Proxy

# jobaction.deleteProxy
source: Delete Proxy
pt_br: Excluir proxy
ru: Удалить прокси-сервер
zh_hans: 删除代理服务器
zh_hant: 刪除 Proxy

# jobaction.deleteProxyConfirm
source: Are you sure you'd like to delete the proxy '{0}'?
ru: Вы действительно хотите удалить прокси-сервер "{0}"?
zh_hant: 確定要刪除 Proxy '{0}' 嗎?

# jobaction.failedToDeleteProxy
source: Could not delete proxy '{0}'. Error: {1}
pt_br: Não foi possível excluir o proxy '{0}'. Erro: {1}
ru: Не удалось удалить прокси-сервер "{0}". Ошибка: {1}
zh_hans: 无法删除代理 "{0}"。 错误: {1}
zh_hant: 無法刪除 Proxy '{0}'。 錯誤: {1}

# jobaction.deletedProxy
source: The proxy was deleted successfully
ru: Прокси-сервер был успешно удален
zh_hant: 已成功刪除 Proxy

# agentUtilities.failed
source: Failed
fr: Échec
pt_br: falhou
ru: Ошибка
zh_hans: 失败
zh_hant: 失敗

# agentUtilities.succeeded
source: Succeeded
fr: Succès
pt_br: sucedeu
ru: успешно
zh_hans: 成功
zh_hant: 已成功

# agentUtilities.retry
source: Retry
ru: Повторить попытку
zh_hant: 重試

# agentUtilities.canceled
source: Cancelled
ru: Отменено
zh_hant: 已取消

# agentUtilities.inProgress
source: In Progress
ru: Выполняется
zh_hant: 進行中

# agentUtilities.statusUnknown
source: Status Unknown
fr: État inconnu
pt_br: Status desconhecido
ru: Состояние неизвестно
zh_hans: 状态未知
zh_hant: 狀態不明

# agentUtilities.executing
source: Executing
fr: Exécution
pt_br: Executando
ru: Выполнение
zh_hans: 正在执行
zh_hant: 正在執行

# agentUtilities.waitingForThread
source: Waiting for Thread
fr: En attente du thread
pt_br: Esperando pela Thread
ru: Ожидание потока
zh_hans: 等待线程
zh_hant: 正在等待執行緒

# agentUtilities.betweenRetries
source: Between Retries
fr: Entre les tentatives
pt_br: Entre tentativas
ru: Между попытками
zh_hans: 重试之间
zh_hant: 在重試之間

# agentUtilities.idle
source: Idle
fr: Inactif
pt_br: Ocioso
ru: Бездействие
zh_hans: 空闲
zh_hant: 閒置

# agentUtilities.suspended
source: Suspended
fr: Suspendu
pt_br: Suspenso
ru: Приостановлено
zh_hans: 暂停
zh_hant: 暫停

# agentUtilities.obsolete
source: [Obsolete]
fr: [Obsolète]
pt_br: [Obsoleto]
ru: [Устаревший]
zh_hans: [废弃]
zh_hant: [已淘汰]

# agentUtilities.yes
source: Yes
fr: Oui
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# agentUtilities.no
source: No
fr: Non
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# agentUtilities.notScheduled
source: Not Scheduled
fr: Non planifié
pt_br: Não agendado
ru: Не запланировано
zh_hans: 未计划
zh_hant: 未排程

# agentUtilities.neverRun
source: Never Run
pt_br: Nunca executar
ru: Никогда не запускать
zh_hans: 从不运行
zh_hant: 從未執行

source: Home
fr: Accueil
pt_br: Casa
ru: Домашняя страница
zh_hans: 主页
zh_hant: 首頁

# missingConnectionInfo
source: No connection information could be found for this dashboard
fr: Aucune information de connexion n'a pu être trouvée pour ce tableau de bord
pt_br: Nenhuma informação de conexão pôde ser encontrada para este painel
ru: Не удалось найти сведения о подключении для этой панели мониторинга
zh_hans: 无法找到此仪表板的连接信息
zh_hant: 此儀表板上找不到連接資訊

# insights.runQuery
source: Run Query
fr: Exécutez la requête
pt_br: Executar consulta
ru: Выполнить запрос
zh_hans: 运行查询
zh_hant: 執行查詢

# closeTab
source: Close
fr: Fermer
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# InsightsDialogTitle
source: Insights
fr: Aperçus
ru: Аналитические данные
zh_hans: 洞察

# backup.labelFull
source: Full
ru: Полное

# backup.labelUrl
source: Url
ru: URL-адрес

# registeredServers.view
source: View
fr: Afficher
pt_br: Visão
zh_hans: 视图

# profilerCategory
source: Profiler
fr: Profileur
zh_hans: 分析器

# carbon.actions.newProfiler
source: Open up a new profiler window
fr: Ouvrir une nouvelle fenêtre de profileur
pt_br: Abra uma nova janela do profiler
zh_hans: 打开一个新的分析器窗口

# sqlops.extension.contributes.dashboard.container.id
source: Unique identifier for this container.
fr: Identificateur unique pour ce conteneur.
pt_br: Identificador exclusivo para este recipiente.
zh_hans: 此容器的唯一标识符。

# sqlops.extension.contributes.dashboard.container.container
source: The container that will be displayed in the tab.
fr: Le conteneur qui sera affiché dans l’onglet.
pt_br: O contêiner que será exibido na guia.
zh_hans: 将在选项卡中显示的容器。

# sqlops.extension.contributes.containers
source: Contributes a single or multiple dashboard containers for users to add to their dashboard.
fr: Contribue à un ou plusieurs conteneurs de tableau de bord pour que les utilisateurs l'ajoutent à leur tableau de bord.
pt_br: Contribui um único ou vários recipientes de painel para os usuários para adicionar ao seu painel de controle.
zh_hans: 为用户提供单个或多个仪表板容器, 供其添加到其仪表板中。

# sqlops.extension.contributes.dashboard.tab.id
source: Unique identifier for this tab. Will be passed to the extension for any requests.
fr: Identificateur unique pour cet onglet. Sera transmis à l’extension pour toutes les demandes.
pt_br: Identificador exclusivo para este guia. Será passado para a extensão para quaisquer solicitações.
zh_hans: 此选项卡的唯一标识符。将被传递给任何请求的扩展名。

# sqlops.extension.contributes.dashboard.tab.title
source: Title of the tab to show the user.
fr: Titre de l’onglet à montrer à l’utilisateur.
pt_br: Título da guia para mostrar ao usuário.
zh_hans: 显示用户的选项卡的标题。

# sqlops.extension.contributes.dashboard.tab.description
source: Description of this tab that will be shown to the user.
fr: Description de cet onglet qui sera affiché à l’utilisateur.
pt_br: Descrição desta página que será mostrado ao usuário.
zh_hans: 将显示给用户的此选项卡的说明。

# sqlops.extension.contributes.tab.when
source: Condition which must be true to show this item
fr: Condition qui doit être vraie pour afficher cet élément
pt_br: Condição deve ser verdadeira para mostrar este item
zh_hans: 显示此项目时条件必须为 true

# sqlops.extension.contributes.tab.provider
source: Defines the connection types this tab is compatible with. Defaults to "MSSQL" if not set
pt_br: Define os tipos de conexão que essa guia é compatível. O padrão para "MSSQL" se não configurado
zh_hans: 定义此选项卡兼容的连接类型。如果未设置，则默认为“MSSQL”

# sqlops.extension.contributes.dashboard.tab.container
source: The container that will be displayed in this tab.
fr: Le conteneur qui s’affichera dans cet onglet.
pt_br: O contêiner que será exibido nesta aba.
zh_hans: 将在此选项卡中显示的容器。

# sqlops.extension.contributes.dashboard.tab.alwaysShow
source: Whether or not this tab should always be shown or only when the user adds it.
fr: Indique si cet onglet devrait toujours apparaître ou uniquement lorsque l’utilisateur l'ajoute.
pt_br: Se essa guia deve ou não ser sempre exibida ou apenas quando o usuário a adiciona.
zh_hans: 此选项卡是否应始终显示或仅当用户添加时显示。

# sqlops.extension.contributes.dashboard.tab.isHomeTab
source: Whether or not this tab should be used as the Home tab for a connection type.
pt_br: Esta guia pode ou não ser utilizada como guia de início para uma determinado tipo de conexão.
zh_hans: 此选项卡是否作为连接类型的主选项卡。

# sqlops.extension.contributes.tabs
source: Contributes a single or multiple tabs for users to add to their dashboard.
fr: Fournit un onglet simple ou multiple que les utilisateurs peuvent ajouter à leur tableau de bord.
pt_br: Contribuir com uma única ou várias guias para que os usuários possam adicionar ao painel de controle.
zh_hans: 为用户提供一个或多个选项卡以添加到其仪表板中。

# treeNodeNoLongerExists
source: The given tree node no longer exists
pt_br: O nó de árvore fornecido não existe mais
zh_hans: 给定的树节点不再存在

# accountManagementNoProvider
source: Account provider does not exist
fr: Le fournisseur de compte n’existe pas
pt_br: O provedor da conta não existe
zh_hans: 帐户提供程序不存在

source: Clear All
fr: Effacer tout
pt_br: Limpar tudo
zh_hans: 全部清除

# sqlops.extension.contributes.widget.when
source: Condition which must be true to show this item
fr: Condition qui doit être vraie pour afficher cet élément
pt_br: Condição deve ser verdadeira para mostrar este item
zh_hans: 显示此项目时条件必须为 true

# sqlops.extension.contributes.dashboardPage.tab.id
source: Unique identifier for this tab. Will be passed to the extension for any requests.
fr: Identificateur unique pour cet onglet. Sera transmis à l’extension pour toutes les demandes.
pt_br: Identificador exclusivo para este guia. Será passado para a extensão para quaisquer solicitações.
zh_hans: 此选项卡的唯一标识符。将被传递给任何请求的扩展名。

# configureDashboard
source: Configure
fr: Configurer
pt_br: Configurar
zh_hans: 配置

source: Recent history
fr: Historique récent
pt_br: Histórico recente
zh_hans: 最近历史

# query.gettingRowsFailedError
source: Something went wrong getting more rows: {0}
fr: Une erreur s'est produite lors de l'obtention de lignes supplémentaires : {0}
pt_br: Algo deu errado, ficando mais linhas: {0}
zh_hans: 获得更多行时出错了：{0}

# query.moreRowsFailedError
source: Something went wrong getting more rows:
fr: Quelque chose s'est mal passé au moment de la récupération de davantage de lignes :
pt_br: Algo deu errado ao obter mais linhas:
zh_hans: 获取更多的行时出现错误

source: All features
fr: Toutes les fonctionnalités
pt_br: Todos os recursos
zh_hans: 所有功能

source: Results
fr: Résultats
pt_br: Resultados
zh_hans: 结果集

source: Query Plan
fr: Plan de requête
pt_br: Plano de consulta
zh_hans: 查询计划

source: Top Operations
fr: Top opérations
pt_br: Operações principais
zh_hans: 顶部操作

source: Chart Viewer
fr: Afficheur de graphique
pt_br: Visualizador gráfico
zh_hans: 图表查看器

# webViewDialog.ok
source: OK
zh_hans: 确定

# webViewDialog.close
source: Close
fr: Fermer
pt_br: Fechar
zh_hans: 关闭

# infoAltText
source: Info
pt_br: Informação
zh_hans: 信息

# noneServerGroup
source: <None>
fr: <Aucun>
pt_br: <Nenhum>
zh_hans: <无>

# createInsightNoDataService
source: Cannot create insight, backing data model not found
pt_br: Não é possível criar uma visão, apoiando o modelo de dados não encontrado
zh_hans: 无法创建洞察, 未找到支持数据模型

# jobAlertColumns.databaseName
source: Database Name
fr: Nom de la base de données
pt_br: Nome do banco de dados
zh_hans: 数据库名称

# title.matchesCountLimit
source: Only the first 999 results are highlighted, but all find operations work on the entire text.
fr: Seuls les premiers 999 résultats sont mis en évidence, mais toutes les opérations de recherche fonctionnent sur l’ensemble du texte.
pt_br: Destacam-se apenas os primeiro 999 resultados, mas tudo o que encontrar operações funcionam em todo o texto.
zh_hans: 只突出显示前999个结果, 但所有查找操作都对整个文本起作用。

# viewToolbarAriaLabel
source: {0} actions
pt_br: {0} ações
zh_hans: {0}操作

# chartContextRequired
source: Chart View context is required to run this action
pt_br: Contexto de exibição de gráfico é necessário para executar esta ação
zh_hans: 运行此操作需要图表视图上下文

# jobaction.deleteJobConfirm,
source: Are you sure you'd like to delete the job '{0}'?
fr: Voulez-vous vraiment supprimer le travail « {0} » ?
pt_br: Tem certeza de que gostaria de excluir o job '{0}'?
zh_hans: 您确定要删除作业 "{0}" 吗？

# jobaction.deleteAlertConfirm,
source: Are you sure you'd like to delete the alert '{0}'?
fr: Voulez-vous vraiment supprimer l’alerte « {0} » ?
pt_br: Tem certeza que deseja apagar o alerta '{0}'?
zh_hans: 您确定要删除警报 "{0}" 吗？

# jobaction.deleteOperatorConfirm,
source: Are you sure you'd like to delete the operator '{0}'?
pt_br: Você tem certeza que gostaria de excluir o operador '{0}'?
zh_hans: 是否确实要删除操作员 "{0}"？

# jobaction.deleteProxyConfirm,
source: Are you sure you'd like to delete the proxy '{0}'?
pt_br: Tem certeza de que você gostaria de excluir o proxy '{0}'?
zh_hans: 您确定要删除代理 "{0}" 吗？

# agentUtilities.canceled
source: Canceled
fr: Annulé
pt_br: cancelado
zh_hans: 已取消
