Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

# backup.noEncryptorWarning
source: No certificate or asymmetric key is available
pt_br: Nenhum certificado ou chave assimétrica está disponível
ru: Нет доступных сертификатов или ассиметричных ключей.
zh_hans: 没有可用的证书或非对称密钥
zh_hant: 沒有憑證或非對稱金鑰可用

# addFile
source: Add a file
fr: Ajouter un fichier
pt_br: Adicione um arquivo
ru: Добавить файл
zh_hans: 添加文件
zh_hant: 增加檔案

# removeFile
source: Remove files
fr: Supprimer les fichiers
pt_br: Remover arquivos
ru: Удаление файлов
zh_hans: 删除文件
zh_hant: 移除檔案

# backupComponent.invalidInput
source: Invalid input. Value must be greater than or equal 0.
fr: Entrée incorrecte. La valeur doit être supérieure ou égale à 0.
pt_br: Entrada inválida. O valor deve ser maior ou igual a 0.
ru: Некорректные данные. Значение должно быть больше или равно 0.
zh_hans: 输入无效。值必须大于或等于0。
zh_hant: 輸入無效。值必須大於或等於 0。

# backupComponent.script
source: Script
ru: Скрипт
zh_hans: 脚本
zh_hant: 指令碼

# backupComponent.backup
source: Backup
fr: Sauvegarde
ru: Резервное копирование
zh_hans: 备份
zh_hant: 備份

# backupComponent.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# backup.containsBackupToUrlError
source: Only backup to file is supported
fr: Seule la sauvegarde sur fichier est supportée
pt_br: Apenas backup em arquivo é suportado.
ru: Поддерживается только резервное копирование в файл
zh_hans: 只支持备份到文件
zh_hant: 僅支援備份到檔案

# backup.backupFileRequired
source: Backup file path is required
fr: Le chemin du fichier de sauvegarde est nécessaire
pt_br: Caminho do arquivo de backup é necessário
ru: Требуется путь к файлу резервной копии
zh_hans: 备份文件路径是必须的
zh_hant: 需要備份檔案路徑

# optionsDialog.missingRequireField
source: is required.
fr: est nécessaire.
pt_br: é necessário.
ru: требуется.
zh_hans: 是必需的。
zh_hant: 是必要的。

# optionsDialog.invalidInput
source: Invalid input. Numeric value expected.
fr: Entrée incorrecte. Valeur numérique attendue.
pt_br: Entrada inválida. Valor numérico esperado
ru: Введены недопустимые данные. Ожидается числовое значение.
zh_hans: 输入无效。 期待输入的是数值。
zh_hant: 輸入無效。預期為數字。

source: Select/Deselect All
fr: Sélectionner/désélectionner tout
pt_br: Seleccionar/desmarcar tudo
ru: Выбрать все/отменить выбор
zh_hans: 选择/取消选中所有
zh_hant: 選擇/取消全部

# backup.labelDatabase
source: Database
ru: База данных
zh_hant: 資料庫

# backup.labelFilegroup
source: Files and filegroups
ru: Файлы и файловые группы
zh_hant: 檔案與檔案群組

# backup.labelDifferential
source: Differential
ru: Разностное
zh_hant: 差異

# backup.labelLog
source: Transaction Log
ru: Журнал транзакций
zh_hant: 交易記錄

# backup.labelDisk
source: Disk
ru: Диск
zh_hant: 磁碟

# backup.defaultCompression
source: Use the default server setting
ru: Использовать параметр сервера по умолчанию
zh_hant: 使用預設伺服器設定

# backup.compressBackup
source: Compress backup
ru: Сжимать резервные копии
zh_hant: 壓縮備份

# backup.doNotCompress
source: Do not compress backup
ru: Не сжимать резервные копии
zh_hant: 不要壓縮備份

# backup.serverCertificate
source: Server Certificate
ru: Сертификат сервера
zh_hant: 伺服器憑證

# backup.asymmetricKey
source: Asymmetric Key
zh_hant: 非對稱金鑰

# backup.filterBackupFiles
source: Backup Files
fr: Fichiers de sauvegarde
pt_br: Arquivos de backup
ru: Резервные файлы
zh_hans: 备份文件
zh_hant: 備份檔案

# backup.allFiles
source: All Files
fr: Tous les fichiers
pt_br: Todos os Arquivos
ru: Все файлы
zh_hans: 所有文件
zh_hant: 所有檔案

# editableDropdown.errorValidate
source: Must be an option from the list
fr: Doit être une option dans la liste
pt_br: Deve ser uma opção da lista
ru: Необходимо выбрать вариант из списка
zh_hans: 必须是列表中的选项
zh_hant: 必須是清單中的選項

# dropdownAction.toggle
source: Toggle dropdown
fr: Activer/désactiver la liste déroulante
pt_br: Alternar menu suspenso
ru: Переключить раскрывающийся список
zh_hans: 切换下拉列表
zh_hant: 切換下拉清單

source: All files
fr: Tous les fichiers
pt_br: Todos os Arquivos
ru: Все файлы
zh_hans: 所有文件
zh_hant: 所有檔案

# fileBrowser.regTreeAriaLabel
source: File browser tree
fr: Arborescence du navigateur de fichiers
pt_br: Árvore de navegador de arquivo
ru: Дерево обозревателя файлов
zh_hans: 文件浏览树
zh_hant: 樹狀結構檔案瀏覽器

source: Linked accounts
pt_br: Contas vinculadas
ru: Связанные учетные записи
zh_hans: 链接帐户
zh_hant: 連結帳戶

# accountDialog.close
source: Close
fr: Fermer
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# accountDialog.noAccountLabel
source: There is no linked account. Please add an account.
pt_br: Não há nenhuma conta vinculada. Por favor, adicione uma conta.
ru: Связанная учетная запись не существует. Добавьте учетную запись.
zh_hans: 没有链接帐户。请添加一个帐户。
zh_hant: 沒有任何已連結帳戶。請新增帳戶。

# accountDialog.addConnection
source: Add an account
fr: Ajouter un compte
pt_br: Adicionar uma conta
ru: Добавить учетную запись
zh_hans: 添加一个账户
zh_hant: 新增帳戶

# copyAndOpen
source: Copy & Open
pt_br: Copiar & Abrir
ru: Копировать и Открыть
zh_hans: 复制并打开
zh_hant: 複製並開啟

# oauthDialog.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

source: User code
fr: Code utilisateur
pt_br: Código do usuário
ru: Код пользователя
zh_hans: 用户代码
zh_hant: 使用者指令碼

source: Website
fr: Site Web
ru: Веб-сайт
zh_hans: 网站
zh_hant: 網站

# insightsDidNotFindResolvedFile
source: Could not find query file at any of the following paths : {0}
ru: Не удалось найти файл запроса по любому из следующих путей: {0}
zh_hant: 無法在以下任一路徑找到查詢檔案 : {0}

# workbench.action.insights.copySelection
source: Copy Cell
fr: Copier la cellule
pt_br: Copie a célula
ru: Копировать ячейку
zh_hans: 复制单元格
zh_hant: 複製儲存格

# addAccount
source: Add an account
fr: Ajouter un compte
pt_br: Adicionar uma conta
ru: Добавить учетную запись
zh_hans: 添加一个账户
zh_hant: 新增帳戶

source: Remove account
fr: Supprimer le compte
pt_br: Remover conta
ru: Удаление учетной записи
zh_hans: 删除帐户
zh_hant: 移除帳號

# confirmRemoveUserAccountMessage
source: Are you sure you want to remove '{0}'?
fr: Êtes-vous sûr de vouloir supprimer '{0}' ?
pt_br: Tem certeza que deseja remover '{0}'?
ru: Вы действительно хотите удалить '{0}'?
zh_hans: 确实要删除 "{0}" 吗？
zh_hant: 您確定要移除 '{0}' 嗎？

# accountActions.yes
source: Yes
fr: Oui
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# accountActions.no
source: No
fr: Non
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# removeAccountFailed
source: Failed to remove account
fr: Échec de suppression du compte
pt_br: Falha ao remover conta
ru: Не удалось удалить учетную запись
zh_hans: 未能删除帐户
zh_hant: 移除帳戶失敗

source: Apply Filters
fr: Appliquer des filtres
pt_br: Aplicar filtros
ru: Применить фильтры
zh_hans: 应用筛选器
zh_hant: 套用篩選

# refreshAccount
source: Reenter your credentials
fr: Entrez à nouveau vos informations d’identification
pt_br: Digite novamente suas credenciais
ru: Повторно введите учетные данные
zh_hans: 重新输入您的凭据
zh_hant: 重新輸入您的驗證資訊

# NoAccountToRefresh
source: There is no account to refresh
fr: Il n’y a aucun compte à actualiser
pt_br: Não há nenhuma conta para atualizar
ru: Учетные записи для обновления отсутствуют
zh_hans: 没有要刷新的帐户
zh_hant: 沒有帳戶要重新整理

# refreshCredentials
source: You need to refresh the credentials for this account.
fr: Vous devez actualiser les informations d’identification pour ce compte.
pt_br: Você precisa atualizar as credenciais para esta conta.
ru: Вам необходимо обновить учетные данные для этой учетной записи.
zh_hans: 您需要为此用户重新获取凭据。
zh_hant: 您需要更新此帳號驗證資訊。

source: From
fr: De
pt_br: De
ru: С
zh_hans: 从
zh_hant: 從

source: To
fr: Vers
pt_br: Para
ru: До
zh_hans: 到
zh_hant: 至

source: Create new firewall rule
fr: Créer une nouvelle règle de pare-feu
pt_br: Criar nova regra de firewall
ru: Создание нового правила брандмауэра
zh_hans: 创建新的防火墙规则
zh_hant: 建立新的防火牆規則

# firewall.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# firewall.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# firewallRuleDialogDescription
source: Your client IP address does not have access to the server. Sign in to an Azure account and create a new firewall rule to enable access.
fr: Votre adresse IP cliente n'a pas accès au serveur. Connectez-vous à un compte Azure et créez une règle de pare-feu pour autoriser l'accès.
pt_br: Seu endereço IP de cliente não tem acesso ao servidor. Acesse uma conta Azure e criar uma nova regra de firewall para permitir o acesso.
ru: Ваш клиентский IP-адрес не имеет доступа к серверу. Войдите в учетную запись Azure и создайте новое правило брандмауэра, чтобы разрешить доступ.
zh_hans: 您的客户端 IP 无权访问服务器。请登录 Azure 帐户并新建一个防火墙规则以启用访问权限。
zh_hant: 您的用戶端 IP 位址無法訪問伺服器。登錄到 Azure 帳戶並創建新的防火牆規則以啟用存取權限。

# firewallRuleHelpDescription
source: Learn more about firewall settings
fr: En savoir plus sur les paramètres du pare-feu
pt_br: Saiba mais sobre as configurações do firewall
ru: Дополнительные сведения о параметрах брандмауэра
zh_hans: 了解更多有关防火墙设置的信息
zh_hant: 學習更多有關防火牆設定

source: Azure account
fr: Compte Azure
pt_br: Conta do Microsoft Azure
ru: Учетная запись Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶

# filewallRule
source: Firewall rule
fr: Règle de pare-feu
pt_br: Regra de firewall
ru: Правило брандмауэра
zh_hans: 防火墙规则
zh_hant: 防火牆規則

# addIPAddressLabel
source: Add my client IP
fr: Ajouter l'adresse IP de mon client
pt_br: Adicionar o meu IP do cliente
ru: Добавить мой клиентский IP
zh_hans: 添加我的客户端 IP
zh_hant: 加入我的用戶端 IP

# addIpRangeLabel
source: Add my subnet IP range
fr: Ajouter ma plage d'adresses de sous-réseau IP
pt_br: Adicionar a minha faixa de IP de sub-rede
ru: Добавить диапазон IP-адресов моей подсети
zh_hans: 添加我的子网 IP 范围
zh_hant: 新增我的子網路 IP 範圍

# displayFailed
source: Could not display contents: {0}
ru: Не удалось отобразить содержимое: {0}
zh_hant: 無法顯示內容: {0}

# noKernelInstalled
source: Please install the SQL Server 2019 extension to run cells
ru: Для запуска ячеек установите расширение SQL Server 2019
zh_hant: 請安裝 SQL Server 2019 延伸模組以執行儲存格

# installSql2019Extension
source: Install Extension
ru: Установить расширение
zh_hant: 安裝延伸模組

source: Code
ru: Код
zh_hant: 程式碼

source: Clear Results
ru: Очистить результаты
zh_hant: 清除結果

# cellNotFound
source: cell with URI {0} was not found in this model
ru: ячейка с URI {0} не найдена в этой модели
zh_hant: 無法在此模型中找到 URI 為 {0} 的儲存格

# connectingLabel
source: Connecting:
ru: Подключение:
zh_hant: 正在連線:

# runningCommandLabel
source: Running command:
ru: Выполняемая команда:
zh_hant: 正在執行命令:

# openingNewQueryLabel
source: Opening new query:
ru: Открытие нового запроса:
zh_hant: 正在開啟新的查詢:

# tabs
source: Dashboard Tabs ({0})
pt_br: Painel de abas ({0})
ru: Вкладки панели мониторинга ({0})
zh_hans: 仪表板选项卡 ({0})
zh_hant: 儀表板索引標籤 ({0})

# tabId
source: Id
ru: Идентификатор
zh_hant: 識別碼

# tabTitle
source: Title
fr: Titre
pt_br: Título
ru: Название
zh_hans: 标题
zh_hant: 標題

# tabDescription
source: Description
pt_br: Descrição
ru: Описание
zh_hans: 说明
zh_hant: 描述

# insights
source: Dashboard Insights ({0})
pt_br: Painel de Insights ({0})
ru: Аналитические данные панели мониторинга ({0})
zh_hans: 仪表板洞察 ({0})
zh_hant: 儀表板見解 ({0})

# insightId
source: Id
ru: Идентификатор
zh_hant: 識別碼

source: Name
fr: Nom
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# insight condition
source: When
pt_br: Quando
ru: Когда
zh_hans: 当
zh_hant: 當

source: succeeded
fr: Succès
pt_br: sucedeu
ru: успешно
zh_hans: 成功
zh_hant: 已成功

source: failed
fr: Échec
pt_br: falhou
ru: Ошибка
zh_hans: 失败
zh_hant: 失敗

source: in progress
fr: en cours
pt_br: Em andamento
ru: Выполняется
zh_hans: 正在进行
zh_hant: 進行中

source: not started
fr: pas démarré
pt_br: não iniciado
ru: Не запущена
zh_hans: 未启动
zh_hant: 未啟動

source: canceled
fr: Annulé
pt_br: cancelado
ru: Отмененный
zh_hans: 已取消
zh_hant: 已取消

source: canceling
fr: annulation
pt_br: cancelando
ru: выполняется отмена
zh_hans: 取消中
zh_hant: 取消中

# dialogModalDoneButtonLabel
source: Done
fr: terminé
pt_br: concluído
ru: Договорились
zh_hans: 已完成
zh_hant: 完成

# dialogModalCancelButtonLabel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# nbformatNotRecognized
source: nbformat v{0}.{1} not recognized
ru: Формат nbformat v{0}.{1} не распознан
zh_hant: 無法識別 nbformat v{0}.{1}

# nbNotSupported
source: This file does not have a valid notebook format
ru: Формат этого файла не соответствует допустимому формату записной книжки
zh_hant: 檔案不具有效的筆記本格式

# unknownCellType
source: Cell type {0} unknown
ru: Неизвестный тип ячейки {0}
zh_hant: 儲存格類型 {0} 不明

# unrecognizedOutput
source: Output type {0} not recognized
ru: Тип выходных данных {0} не распознан
zh_hant: 無法識別輸出類型 {0}

# invalidMimeData
source: Data for {0} is expected to be a string or an Array of strings
ru: Данные для {0} должны представлять собой строку или массив строк
zh_hant: {0} 的資料應為字串或字串的陣列

# unrecognizedOutputType
source: Output type {0} not recognized
ru: Тип выходных данных {0} не распознан
zh_hant: 無法識別輸出類型 {0}

# runQueryLabel
source: Run
fr: Exécuter
pt_br: Executar
ru: Запуск
zh_hans: 运行
zh_hant: 執行

# cancelQueryLabel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# estimatedQueryPlan
source: Explain
fr: Expliquer
pt_br: Explicar
ru: Объяснить
zh_hans: 解释
zh_hant: 解釋

# actualQueryPlan
source: Actual
fr: Actuel
pt_br: Real
ru: Действительное значение
zh_hans: 实际为
zh_hant: 實際

# disconnectDatabaseLabel
source: Disconnect
fr: Déconnecter
pt_br: Desconectar-se
ru: Отключить
zh_hans: 断开
zh_hant: 中斷連線

# changeConnectionDatabaseLabel
source: Change Connection
fr: Changer la connexion
pt_br: Alterar a Conexão
ru: Изменить соединение
zh_hans: 更改连接
zh_hant: 變更連接

# connectDatabaseLabel
source: Connect
fr: Connecter
pt_br: Conectar-se
ru: Подключиться
zh_hans: 连接
zh_hant: 連接

source: Select Database
fr: Sélectionnez la base de données
pt_br: Selecione o banco de dados
ru: Выберите базу данных
zh_hans: 选择数据库
zh_hant: 選擇資料庫

# listDatabases.toggleDatabaseNameDropdown
source: Select Database Toggle Dropdown
fr: Sélectionnez la liste déroulante de bases de données
pt_br: Selecione a lista suspensa de bancos de dados disponíveis
ru: Раскрывающийся список для переключения базы данных
zh_hans: 选择数据库切换下拉列表
zh_hant: 選取資料庫切換下拉式清單

# changeDatabase.failed
source: Failed to change database
fr: Echec lors du changement de base de données
pt_br: Falha ao mudar o banco de dados
ru: Не удалось изменить базу данных
zh_hans: 更改数据库失败
zh_hant: 變更資料庫失敗

# changeDatabase.failedWithError
source: Failed to change database {0}
fr: Echec du changement de base de données {0}
pt_br: Falha ao alterar o banco de dados {0}
ru: Не удалось изменить базу данных {0}
zh_hans: 更改数据库 {0} 失败
zh_hant: 無法變更資料庫 {0}

# gridPanel
source: Results
ru: Результаты
zh_hant: 結果

# messagePanel
source: Messages
ru: Сообщения
zh_hant: 訊息

# resultsTabTitle
source: Results
ru: Результаты
zh_hant: 結果

# editData.run
source: Run
fr: Exécuter
pt_br: Executar
ru: Запуск
zh_hans: 运行
zh_hant: 執行

# disposeEditFailure
source: Dispose Edit Failed With Error:
fr: La modification (de la disposition) a échoué avec l'erreur :
pt_br: Editar Descarte Falhou com o Erro:
ru: Не удалось отменить изменения. Ошибка:
zh_hans: 处理编辑失败, 出现错误:
zh_hant: 處理編輯失敗, 出現錯誤:

# editData.stop
source: Stop
fr: Arrêter
pt_br: Pare
ru: Остановить
zh_hans: 停止
zh_hant: 停止

# editData.showSql
source: Show SQL Pane
pt_br: Mostrar painel de SQL
ru: Показать панель SQL
zh_hans: 显示 SQL 窗格
zh_hant: 顯示 sql 窗格

# editData.closeSql
source: Close SQL Pane
pt_br: Fechar painel SQL
ru: Закрыть панель SQL
zh_hans: 关闭 SQL 窗格
zh_hant: 關閉 SQL 窗格

# ProfilerTableEditor.eventCountFiltered
source: Events (Filtered): {0}/{1}
ru: События (отфильтровано): {0}/{1}
zh_hant: 事件 (已篩選): {0}/{1}

# ProfilerTableEditor.eventCount
source: Events: {0}
ru: События: {0}
zh_hant: 事件: {0}

# profilerAction.connect
source: Connect
fr: Connecter
pt_br: Conectar-se
ru: Подключиться
zh_hans: 连接
zh_hant: 連接

# profilerAction.disconnect
source: Disconnect
fr: Déconnecter
pt_br: Desconectar-se
ru: Отключить
zh_hans: 断开
zh_hant: 中斷連線

source: Start
fr: Démarrer
pt_br: Início
ru: Запустить
zh_hans: 开始
zh_hant: 開始

# create
source: New Session
fr: Nouvelle session
pt_br: Nova sessão
ru: Создание сеанса
zh_hans: 新会话
zh_hant: 新增工作階段

# profilerAction.pauseCapture
source: Pause
pt_br: Pausa
ru: Приостановить
zh_hans: 暂停
zh_hant: 暫停

# profilerAction.resumeCapture
source: Resume
fr: Reprendre
pt_br: Resumo
ru: Возобновить
zh_hans: 重新开始
zh_hant: 繼續

# profilerStop.stop
source: Stop
fr: Arrêter
pt_br: Pare
ru: Остановить
zh_hans: 停止
zh_hant: 停止

# profiler.clear
source: Clear Data
fr: Effacer les données
pt_br: Limpar dados
ru: Очистить данные
zh_hans: 清除数据
zh_hant: 清除資料

# profilerAction.autoscrollOn
source: Auto Scroll: On
fr: Défilement automatique : activé
pt_br: Auto rolagem: Habilitado
ru: Автоматическая прокрутка: Вкл
zh_hans: 自动滚动：开
zh_hant: 自動捲動: 開啟

# profilerAction.autoscrollOff
source: Auto Scroll: Off
pt_br: Auto Scroll: Desligado
ru: Автоматическая прокрутка: Выкл
zh_hans: 自动滚动: 关闭
zh_hant: 自動捲動: 關閉

# profiler.toggleCollapsePanel
source: Toggle Collapsed Panel
fr: Développer/Réduire le panneau
pt_br: Alternar o painel recolhido
ru: Переключить свернутую панель
zh_hans: 切换折叠面板
zh_hant: 切換折疊面板

# profiler.editColumns
source: Edit Columns
fr: Modifier les colonnes
pt_br: Editar colunas
ru: Редактирование столбцов
zh_hans: 编辑列
zh_hant: 編輯欄位

# profiler.findNext
source: Find Next String
pt_br: Encontrar a próxima sequência de caracteres
ru: Найти следующую строку
zh_hans: 查找下一个字符串
zh_hant: 尋找下一個字串

# profiler.findPrevious
source: Find Previous String
fr: Trouvez la chaîne précédente
pt_br: Encontrar a sequência anterior
ru: Найти предыдущую строку
zh_hans: 查找上一个字符串
zh_hant: 尋找前一個字串

# profilerAction.newProfiler
source: Launch Profiler
pt_br: Executar Profiler
ru: Запустить профилировщик
zh_hans: 启动分析器
zh_hant: 啟動分析工具

# profiler.filter
source: Filter…
ru: Фильтр...
zh_hant: 篩選...

# profiler.clearFilter
source: Clear Filter
ru: Очистить фильтр
zh_hant: 清除篩選

# chartErrorMessage
source: Chart cannot be displayed with the given data
pt_br: Gráfico não pode ser exibido com os dados fornecidos
ru: Не удается отобразить диаграмму с указанными данными.
zh_hans: 无法用给定的数据显示图表
zh_hant: 無法以指定的資料顯示圖表

# profilerTextEditorAriaLabel
source: Profiler editor for event text. Readonly
fr: Editeur de profiler pour le texte d'événement. En lecture uniquement.
pt_br: Editor do Profiler para o texto do evento. ReadOnly
ru: Редактор профилировщика для текста события. Только для чтения.
zh_hans: 事件文本的分析器编辑器。只读
zh_hant: 事件文字的分析編輯器。唯讀

# invalidIndex
source: The index is invalid.
ru: Недопустимый индекс.
zh_hant: 索引無效。

# queryTextEditorAriaLabel
source: modelview code editor for view model.
fr: éditeur de code modelview pour le modèle d’affichage.
pt_br: Editor de código modelview para modelo de exibição.
ru: редактор кода в представлении модели для модели представления.
zh_hans: 用于视图模型的模型视图代码编辑器。
zh_hant: 檢視模型的 modelview 程式碼編輯器。

# mkdirOutputMsg
source: ... Creating {0}
ru: ... Создание {0}
zh_hant: ... 正在建立 {0}

# tableHeaderBackground
source: Table header background color
fr: Couleur d’arrière-plan de l'entete du tableau
pt_br: Cor de fundo do cabeçalho de tabela
ru: Цвет фона заголовка таблицы
zh_hans: 表头背景色
zh_hant: 資料表標題背景顏色

# tableHeaderForeground
source: Table header foreground color
fr: Couleur de premier plan d'en-tête de table
pt_br: Cor de primeiro plano de cabeçalho de tabela
ru: Цвет переднего плана заголовка таблицы
zh_hans: 表头前景色
zh_hant: 資料表標頭的前景色彩

source: Disabled Input box background.
fr: Arrière plan d'une zone de saisie désactivée.
pt_br: Fundo de caixa de entrada desativado.
ru: Фоновый цвет отключенного поля ввода.
zh_hans: 禁用输入框背景。
zh_hant: 禁用輸入框背景。

source: Disabled Input box foreground.
fr: Premier plan de la zone d'entrée désactivée.
pt_br: Caixa de entrada em primeiro plano desativada.
ru: Цвет переднего плана отключенного поля ввода.
zh_hans: 前台禁用输入框。
zh_hant: 禁用輸入框前景。

# buttonFocusOutline
source: Button outline color when focused.
fr: Couleur du contour de bouton quand il a le focus.
pt_br: Cor de contorno do botão quando possui o foco.
ru: Цвет контура кнопки в фокусе.
zh_hans: 聚焦时按钮轮廓颜色。
zh_hant: 聚焦時按鈕輪廓顏色。

source: Disabled checkbox foreground.
ru: Цвет переднего плана отключенного флажка.
zh_hant: 已停用核取方塊前景。

# listFocusAndSelectionBackground
source: List/Table background color for the selected and focus item when the list/table is active
fr: Couleur d’arrière-plan de la liste/table pour les éléments sélectionnés et qui ont le focus quand la liste/table est active
pt_br: Lista/tabela de cor de fundo para o selecionado e item de foco quando a lista/tabela está ativa
ru: Цвет фоны списка или таблицы для выбранного элемента и элемента, на котором находится фокус, когда список или таблица активны
zh_hans: 当列表/表处于活动状态时所选和焦点项的列表/表背景色
zh_hant: 當清單/表格處於使用狀態時，所選項目與聚焦項目的清單/表格背景色彩

# agentTableBackground
source: SQL Agent Table background color.
fr: Couleur d’arrière-plan de la table de l'Agent SQL.
pt_br: Cor de fundo da tabela do SQL Agent.
ru: Цвет фона таблицы для агента SQL.
zh_hans: SQL 代理表的背景色。
zh_hant: SQL Agent 資料表背景色彩。

# agentCellBackground
source: SQL Agent table cell background color.
fr: Couleur d'arrière-plan des cellules du tableau de l'Agent SQL.
pt_br: Cor de fundo célula de tabela SQL Agent.
ru: Цвет фона ячейки таблицы для агента SQL.
zh_hans: SQL 代理表单元格的背景颜色。
zh_hant: SQL Agent 表格儲存格背景色彩。

# agentTableHoverBackground
source: SQL Agent table hover background color.
pt_br: Cor de fundo para tabela no SQL Agent.
ru: Цвет фона таблицы агента SQL при наведении.
zh_hans: SQL 代理表悬停背景颜色。
zh_hant: SQL Agent 表格暫留背景色彩。

# agentJobsHeadingColor
source: SQL Agent heading background color.
fr: Couleur d’arrière-plan de l'en-tête de SQL Agent.
pt_br: Cor de fundo do título do SQL Agent.
ru: Цвет фона заголовка агента SQL.
zh_hans: SQL 代理标题背景颜色。
zh_hant: SQL Agent 標題背景色彩。

# agentCellBorderColor
source: SQL Agent table cell border color.
pt_br: Cor da borda da célula na tabela SQL Agent.
ru: Цвет границы ячейки таблицы для агента SQL.
zh_hans: SQL 代理表的单元格边框颜色。
zh_hant: SQL Agent 表格儲存格邊框色彩。

source: Loading...
fr: Chargement en cours...
pt_br: Carregando...
ru: Загрузка ядер...
zh_hans: 正在加载...
zh_hant: 正在載入核心...

source: Copy All
ru: Копировать все
zh_hant: 全部複製

source: Maximize
ru: Увеличить
zh_hant: 最大化

source: Restore
ru: Восстановить
zh_hant: 還原

source: Chart
ru: Диаграмма
zh_hant: 圖表

source: Show Query Plan
ru: Показать план запроса
zh_hant: 顯示查詢計劃

# dataDirectionLabel
source: Data Direction
fr: Direction des données
pt_br: Direção de dados
ru: Направление передачи данных
zh_hans: 数据方向
zh_hant: 資料方向

# verticalLabel
source: Vertical
ru: По вертикали
zh_hans: 垂直
zh_hant: 垂直

# horizontalLabel
source: Horizontal
ru: По горизонтали
zh_hans: 水平
zh_hant: 水平

# columnsAsLabelsLabel
source: Use column names as labels
pt_br: Use nomes de colunas como rótulos
ru: Использовать имена столбцов в качестве меток
zh_hans: 将列名用作标签
zh_hant: 使用欄位名稱作為標籤

# labelFirstColumnLabel
source: Use first column as row label
pt_br: Usar a primeira coluna como rótulo de linha
ru: Использовать первый столбец в качестве метки строки
zh_hans: 使用第一列作为行标签
zh_hant: 使用第一欄作為列標籤

# legendLabel
source: Legend Position
fr: Position de la légende
pt_br: Posição da legenda
ru: Расположение условных обозначений
zh_hans: 图例位置
zh_hant: 圖例位置

source: Y Axis Label
pt_br: Rótulo de eixo Y
ru: Метка оси Y
zh_hans: Y 轴标签
zh_hant: y 軸標籤

# yAxisMinVal
source: Y Axis Minimum Value
fr: Valeur minimale de l’axe Y
pt_br: Valor mínimo do eixo Y
ru: Минимальное значение по оси Y
zh_hans: Y 轴最小值
zh_hant: y 軸最小值

# yAxisMaxVal
source: Y Axis Maximum Value
fr: Valeur maximale de l’axe Y
pt_br: Valor máximo do eixo Y
ru: Максимальное значение по оси Y
zh_hans: Y 轴最大值
zh_hant: y 軸最大值

source: X Axis Label
fr: Étiquette de l’axe X
pt_br: Rótulo do eixo X
ru: Метка для оси x
zh_hans: X 轴标签
zh_hant: X 軸標籤
