Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

# queryShortcutDescription
source: Set keybinding workbench.action.query.shortcut{0} to run the shortcut text as a procedure call. Any selected text in the query editor will be passed as a parameter
pt_br: Defina keybinding workbench.action.query.shortcut {0} para executar o texto do atalho como uma chamada de procedimento. Qualquer texto selecionado no editor de consultas será passado como um parâmetro
ru: Установка сочетания клавиш workbench.action.query.shortcut{0} для запуска текста ярлыка при вызове процедуры. В качестве параметра будет передан любой выбранный текст в редакторе запросов
zh_hans: 设置 keybinding 工作台. 操作. 查询. 快捷方式 {0} 将快捷方式文本作为过程调用运行。查询编辑器中的任何选定文本都将作为参数传递
zh_hant: 設置按鍵綁定 workbench.action.query.shortcut{0} 以執行快速鍵文字作為程序呼叫。任何選擇的文字在查詢編輯器中將作為參數傳遞

# resultsGridConfigurationTitle
source: Results Grid
fr: Grille de résultats
pt_br: Grade de resultados
ru: Сетка результатов
zh_hans: 结果网格
zh_hant: 結果方格

# fontFamily
source: Controls the font family.
pt_br: Controla a família de fontes.
ru: Определяет семейство шрифтов.
zh_hans: 控制字体系列。
zh_hant: 控制字型家族。

# fontWeight
source: Controls the font weight.
fr: Contrôle l'épaisseur de police.
pt_br: Controles de espessura da fonte.
ru: Управляет насыщенностью шрифта.
zh_hans: 控制字体粗细。
zh_hant: 控制字型粗細。

# fontSize
source: Controls the font size in pixels.
pt_br: Controla o tamanho da fonte em pixels.
ru: Определяет размер шрифта в пикселях.
zh_hans: 以像素为单位控制字体大小。
zh_hant: 控制字型大小 (像素)。

# letterSpacing
source: Controls the letter spacing in pixels.
fr: Contrôle l'espacement des lettres en pixels.
pt_br: Controla o espaçamento de letras, em pixels
ru: Задает интервал между буквами в пикселах.
zh_hans: 控制以像素为单位的字母间距。
zh_hant: 控制字母間距 (像素)。

# rowHeight
source: Controls the row height in pixels
fr: Contrôle la hauteur de ligne en pixels
pt_br: Controle da altura da linha em pixels
ru: Определяет высоту строки в пикселах
zh_hans: 以像素为单位控制行高
zh_hant: 控制列高 (像素)

# cellPadding
source: Controls the cell padding in pixels
pt_br: Controla o enchimento em pixels da célula
ru: Определяет поле ячейки в пикселах
zh_hans: 以像素为单位控制单元格边距
zh_hant: 控制儲存格填補值 (像素)

# autoSizeColumns
source: Auto size the columns width on inital results. Could have performance problems with large number of columns or large cells
ru: Автоматически устанавливать ширину столбцов на основе начальных результатов. При наличии большого числа столбцов или широких ячеек возможны проблемы с производительностью
zh_hant: 自動調整初始結果的欄寬大小。大量欄位或大型儲存格可能會造成效能問題

# maxColumnWidth
source: The maximum width in pixels for auto-sized columns
ru: Максимальная ширина в пикселях для столбцов, размер которых определяется автоматически
zh_hant: 自動調整大小之欄位的寬度上限 (像素)

# profiler.settings.viewTemplates
source: Specifies view templates
pt_br: Especifica os templates de view
ru: Задает шаблоны представления
zh_hans: 指定视图模板
zh_hant: 指定檢視範本

# profiler.settings.sessionTemplates
source: Specifies session templates
pt_br: Especifica modelos de sessão
ru: Определяет шаблоны сессии
zh_hans: 指定会话模板
zh_hant: 指定工作階段範本

# serverGroup.colors
source: Server Group color palette used in the Object Explorer viewlet.
fr: Palette de couleurs du groupe de serveurs utilisée dans le viewlet Explorateur d’objets.
pt_br: Paleta de cores do grupo de servidores usada no explorador de objetos.
ru: Цветовая палитра группы серверов, используемых в представлении Обозревателя объектов.
zh_hans: 在对象资源管理器 viewlet 中使用的服务器组调色板。
zh_hant: 在物件總管 viewlet 中使用的伺服器群組調色盤。

# serverGroup.autoExpand
source: Auto-expand Server Groups in the Object Explorer viewlet.
pt_br: Expanda automaticamente grupos de servidores no explorador de objetos.
ru: Автоматически разворачивать группы серверов в представлении Обозревателя объектов.
zh_hans: 在对象资源管理器 viewlet 中自动展开服务器组。
zh_hant: 物件總管 viewlet 中的自動展開伺服器群組。

# carbon.extension.contributes.account.id
source: Identifier of the account type
fr: Identificateur du type de compte
pt_br: Identificador do tipo de conta
ru: Идентификатор типа учетной записи
zh_hans: 帐户类型的标识符
zh_hant: 帳戶類型的識別碼

# carbon.extension.contributes.account.icon
source: (Optional) Icon which is used to represent the accpunt in the UI. Either a file path or a themable configuration
fr: (Facultatif) L'icône qui est utilisée pour représenter le compte dans l’interface utilisateur. Peut être soit chemin de fichier, soit une configuration de thème
pt_br: (Opcional) Ícone que é usado para representar o accpunt na interface do usuário. Um caminho de arquivo ou uma configuração tematizáveis
ru: (Необязательно) Значок, который используется для представления учетной записи в пользовательском интерфейсе. Путь к файлу или конфигурация с возможностью применения тем
zh_hans: （可选）用于表示UI中的accpunt的图标。文件路径或可配置配置
zh_hant: (選用) 用於 UI 中表示 accpunt 的圖示。任一檔案路徑或主題化的設定。

# carbon.extension.contributes.account.icon.light
source: Icon path when a light theme is used
fr: Chemin de l’icône quand un thème clair est utilisé
pt_br: Caminho do ícone quando um tema leve é usado
ru: Путь к значку, когда используется светлая тема
zh_hans: 使用浅色主题时的图标路径
zh_hant: 使用亮色主題時的圖示路徑

# carbon.extension.contributes.account.icon.dark
source: Icon path when a dark theme is used
fr: Chemin de l’icône quand un thème sombre est utilisé
pt_br: Caminho de ícone quando é usado um tema escuro
ru: Путь к значку, когда используется темная тема
zh_hans: 使用暗主题时的图标路径
zh_hant: 使用暗色主題時的圖像路徑

# carbon.extension.contributes.account
source: Contributes icons to account provider.
fr: Icônes de contribution au fournisseur de compte.
pt_br: Contribui ícones para provedor de conta.
ru: Передает значки поставщику учетной записи.
zh_hans: 将图标贡献给账号提供者。
zh_hant: 貢獻圖示給帳戶供應者。

# yAxisMin
source: Minimum value of the y axis
pt_br: Valor mínimo do eixo y
ru: Минимальное значение для оси y
zh_hans: y 轴的最小值
zh_hant: y 軸的最小值

# yAxisMax
source: Maximum value of the y axis
fr: Valeur maximale de l’axe y
pt_br: Valor máximo do eixo y
ru: Максимальное значение по оси y
zh_hans: y 轴的最大值
zh_hant: y 軸的最大值

# barchart.yAxisLabel
source: Label for the y axis
fr: Étiquette pour l’axe y
pt_br: Rótulo para o eixo y
ru: Метка для оси y
zh_hans: y 轴的标签
zh_hant: Y 軸的標籤

# xAxisMin
source: Minimum value of the x axis
pt_br: Valor mínimo do eixo x
ru: Минимальное значение по оси x
zh_hans: x 轴的最小值
zh_hant: X 軸的最小值

# xAxisMax
source: Maximum value of the x axis
fr: Valeur maximale de l’axe des x
pt_br: Valor máximo do eixo x
ru: Максимальное значение по оси x
zh_hans: x 轴的最大值
zh_hant: X 軸的最大值

# barchart.xAxisLabel
source: Label for the x axis
fr: Étiquette de l’axe des x
pt_br: Rótulo para o eixo x
ru: Метка для оси x
zh_hans: x 轴标签
zh_hant: X 軸標籤

# dataTypeDescription
source: Indicates data property of a data set for a chart.
fr: Indique la propriété d'une donnée d’un jeu de données pour un graphique.
pt_br: Indica a propriedade de um conjunto de dados para um gráfico.
ru: Определяет свойство данных для набора данных диаграммы.
zh_hans: 指示图表数据集的数据属性。
zh_hant: 指定圖表資料集的資料屬性。

# countInsightDescription
source: For each column in a resultset, displays the value in row 0 as a count followed by the column name. Supports "1 Healthy", "3 Unhealthy" for example, where "Healthy" is the column name and 1 is the value in row 1 cell 1
pt_br: Para cada coluna em um conjunto de resultados, exibe o valor na linha 0 como uma contagem seguida pelo nome da coluna. Suporta "1 Saudável", "3 Insalubre" por exemplo, onde "Saudável" é o nome da coluna e 1 é o valor na linha 1 célula 1
ru: Для каждого столбца в результирующем наборе отображает значение в строке 0 как количество, за которым следует имя столбца. Например, поддерживает значения "1 Healthy", "3 Unhealthy", где "Healthy" — имя столбца, а 1 — значение в строке 1 и столбце 1
zh_hans: 对于结果集中的每一列, 将行0中的值显示为计数, 后跟列名。支持 "1 健康", "3 不健康" 例如, 其中 "健康" 是列名, 1 是行1单元格1中的值
zh_hant: 對於結果集每一行資料，列0顯示值作為計數，其次為欄位名稱. 例如: 設定 "1 健康", "3 不健康"，健康是欄位名稱，而1是第1列第1個儲存格的值

# previewFeatures.configTitle
source: Preview Features
ru: Функции предварительной версии
zh_hant: 預覽功能

# previewFeatures.configEnable
source: Enable unreleased preview features
ru: Включить невыпущенные функции предварительной версии
zh_hant: 啟用未發佈的預覽功能

source: Show connect dialog on startup
ru: Показывать диалоговое окно подключения при запуске
zh_hant: 啟動時顯示連線對話方塊

# imageInsightDescription
source: Displays an image, for example one returned by an R query using ggplot2
fr: Affiche une image, par exemple celle retournée par une requête de type R utilisant "ggplot2"
pt_br: Exibe uma imagem, por exemplo, um retornado por uma consulta R usando o ggplot2
ru: Отображает изображение, например, возвращенное с помощью запроса R, с использованием ggplot2
zh_hans: 显示图像，例如使用ggplot2由R查询返回的图像
zh_hant: 顯示圖像， 如使用 ggplot2 R查詢返回的圖像。

# imageFormatDescription
source: What format is expected - is this a JPEG, PNG or other format?
fr: Quel format est attendu - est-ce un JPEG, PNG ou autre format ?
pt_br: Qual o formato que é esperado - este é um JPEG, PNG ou outro formato?
ru: Каков ожидаемый формат изображения: JPEG, PNG или другой формат?
zh_hans: 期望什么格式-这是 JPEG、PNG 还是其他格式？
zh_hant: 預期格式是什麼 - 是 JPEG, PNG 或其他格式?

# encodingDescription
source: Is this encoded as hex, base64 or some other format?
fr: Cela est-il encodé en hexadécimal, base64 ou un autre format?
pt_br: Isso é codificado como hex, base64 ou algum outro formato?
ru: Используется ли кодировка hex, base64 или другой формат кодировки?
zh_hans: 此编码为十六进制、base64 还是其他格式？
zh_hant: 此編碼為十六進位、base64 或是其他格式？

# tableInsightDescription
source: Displays the results in a simple table
fr: Affiche les résultats dans un tableau simple
pt_br: Exibe os resultados em uma tabela simples
ru: Отображает результаты в виде простой таблицы
zh_hans: 在简单表中显示结果
zh_hant: 在簡單表格中顯示結果

# dashboard.container.webview
source: The webview that will be displayed in this tab.
fr: La Webview qui s’affichera dans cet onglet.
pt_br: O webview que será exibido nesta aba.
ru: Веб представление, которое будет отображаться в этой вкладке.
zh_hans: 将在此选项卡中显示的webview。
zh_hant: 顯示在此索引標籤的 webview。

# dashboard.container.controlhost
source: The controlhost that will be displayed in this tab.
fr: Controlhost qui sera affiché sous cet onglet.
pt_br: O host de controle que será exibido nessa guia.
ru: Узел управления, который будет отображаться на этой вкладке.
zh_hans: 将在此选项卡中显示 controlhost
zh_hant: 會在此索引標籤中顯示的 controlhost。

# dashboard.container.gridtab.items
source: The list of widgets or webviews that will be displayed in this tab.
fr: La liste des widgets ou webviews qui s’afficheront dans cet onglet.
pt_br: A lista de widgets ou webviews que serão exibidos nesta aba.
ru: Список виджетов или webviews, которые будут отображаться в этой вкладке.
zh_hans: 将显示在此选项卡中的小部件或 webviews 的列表。
zh_hant: 顯示在此索引標籤的小工具或 webviews 的清單。

# gridContainer.invalidInputs
source: widgets or webviews are expected inside widgets-container for extension.
pt_br: Widgets ou webviews são esperados dentro da extensão de widgets-container.
ru: мини-приложения или веб-представления, которые должны размещаться в контейнере мини-приложений расширения.
zh_hans: 小部件或 webviews 在小部件中被期望为扩展的容器。
zh_hant: 延伸模組的 widgets-container 中應有 widgets 或 webviews。

# dashboard.container.widgets
source: The list of widgets that will be displayed in this tab.
fr: La liste des widgets qui s’afficheront dans cet onglet.
pt_br: A lista de widgets que serão exibidos nesta aba.
ru: Список виджетов, которые будут отображаться на этой вкладке.
zh_hans: 将在此选项卡中显示的小部件列表。
zh_hant: 顯示在此索引標籤中的小工具清單。

# widgetContainer.invalidInputs
source: The list of widgets is expected inside widgets-container for extension.
fr: La liste des widgets est attendue à l’intérieur du conteneur de widgets pour l'extension.
pt_br: A lista de widgets é esperada dentro de contêiner de widgets para a extensão.
ru: Список мини-приложений, которые должны находиться внутри контейнера мини-приложений для расширения.
zh_hans: 控件容器里的控件列表应该是用于扩展的
zh_hant: 延伸模組的 widgets-container 中應有 widgets 的清單。

# azdata.extension.contributes.dashboard.container.id
source: Unique identifier for this container.
ru: Уникальный идентификатор этого контейнера.
zh_hant: 此容器的唯一識別碼。

# azdata.extension.contributes.dashboard.container.container
source: The container that will be displayed in the tab.
ru: Контейнер, который будет отображаться в этой вкладке.
zh_hant: 顯示於索引標籤的容器。

# azdata.extension.contributes.containers
source: Contributes a single or multiple dashboard containers for users to add to their dashboard.
ru: Добавляет один или несколько контейнеров панелей мониторинга, которые пользователи могут добавить на свои панели мониторинга.
zh_hant: 提供一個或多個索引標籤，讓使用者可增加至其儀表板中。

# dashboardContainer.contribution.noIdError
source: No id in dashboard container specified for extension.
pt_br: Nenhuma identificação no contêiner do Dashboard especificado para extensão.
ru: Идентификатор контейнера панели мониторинга для расширения не указан.
zh_hans: 用于扩展的仪表板容器中没有指定Id。
zh_hant: 為延伸模組指定的儀表板容器中沒有任何識別碼。

# dashboardContainer.contribution.noContainerError
source: No container in dashboard container specified for extension.
pt_br: Nenhum container especificado no dashboard de extensões.
ru: В контейнере панели мониторинга для расширения не указан контейнер.
zh_hans: 为扩展指定的仪表板容器中没有容器。
zh_hant: 為延伸模組指定的儀表板容器中沒有任何容器。

# dashboardContainer.contribution.moreThanOneDashboardContainersError
source: Exactly 1 dashboard container must be defined per space.
pt_br: Exatamente 1 contêiner do Dashboard deve ser definido por espaço.
ru: В каждом пространстве необходимо определить ровно один контейнер панели мониторинга
zh_hans: 必须为每个空间定义1个仪表板容器。
zh_hant: 至少須為每個空間定義剛好一個儀表板容器。

# dashboardTab.contribution.unKnownContainerType
source: Unknown container type defines in dashboard container for extension.
fr: Type de conteneur inconnu défini dans le conteneur de tableau de bord pour l’extension.
pt_br: Tipo de container desconhecido definido no dashboard para extensões.
ru: В контейнере панели мониторинга для расширения указан неизвестный тип контейнера.
zh_hans: 在仪表板容器中为扩展定义了未知容器类型。
zh_hant: 延伸模組的儀表板容器中有不明的容器類型定義。

# dashboard.container.left-nav-bar.id
source: Unique identifier for this nav section. Will be passed to the extension for any requests.
fr: Identificateur unique pour cette section de navigation. Sera transmis à l’extension pour toutes les demandes.
pt_br: Identificador exclusivo para esta seção de nav. Será passado para a extensão para quaisquer solicitações.
ru: Уникальный идентификатор для этой секции навигации. Будет передан расширению для любых запросов.
zh_hans: 此导航部分的唯一标识符。将被传递给任何请求的扩展名。
zh_hant: 導覽區的唯一識別碼。將傳遞給任何要求的擴充功能。

# dashboard.container.left-nav-bar.icon
source: (Optional) Icon which is used to represent this nav section in the UI. Either a file path or a themeable configuration
pt_br: (Opcional) Ícone usado para representar essa seção de navegação na interface do usuário. Um caminho de arquivo ou uma configuração com tema
ru: (Необязательно) Значок, который используется для представления раздела навигации в пользовательском интерфейсе. Путь к файлу или к конфигурации с возможностью использования тем
zh_hans: (可选) 用于在UI 中表示此导航节的图标。应为文件路径或可主体化的配置
zh_hant: (選用) 用於 UI 中表示導覽區的圖示。任一檔案路徑或主題化的設定。

# dashboard.container.left-nav-bar.icon.light
source: Icon path when a light theme is used
fr: Chemin de l’icône quand un thème clair est utilisé
pt_br: Caminho do ícone quando um tema leve é usado
ru: Путь к значку, когда используется светлая тема
zh_hans: 使用浅色主题时的图标路径
zh_hant: 使用亮色主題時的圖示路徑

# dashboard.container.left-nav-bar.icon.dark
source: Icon path when a dark theme is used
fr: Chemin de l’icône quand un thème sombre est utilisé
pt_br: Caminho de ícone quando é usado um tema escuro
ru: Путь к значку, когда используется темная тема
zh_hans: 使用暗主题时的图标路径
zh_hant: 使用暗色主題時的圖像路徑

# dashboard.container.left-nav-bar.title
source: Title of the nav section to show the user.
fr: Titre de la section de navigation à afficher à l’utilisateur.
pt_br: Título da seção de nav para mostrar ao usuário.
ru: Название навигационной секции для отображения пользователю.
zh_hans: 要向用户显示的 "导航" 部分的标题。
zh_hant: 顯示給使用者的導覽區標題。

# dashboard.container.left-nav-bar.container
source: The container that will be displayed in this nav section.
fr: Le conteneur qui sera affiché dans cette section de navigation.
pt_br: O contêiner que será exibido nesta seção de nav.
ru: Контейнер, который будет отображаться в разделе навигации.
zh_hans: 容器将显示在此导航节中。
zh_hant: 顯示在此導覽區的容器。

# dashboard.container.left-nav-bar
source: The list of dashboard containers that will be displayed in this navigation section.
fr: La liste des conteneurs de tableau de bord qui s’afficheront dans cette section de navigation.
pt_br: A lista de recipientes de painel de controle que será exibido nesta seção de navegação.
ru: Список контейнеров панелей мониторинга, отображаемых в этом разделе.
zh_hans: 将显示在此导航节中的仪表板容器的列表。
zh_hant: 在導覽區顯示儀表板容器清單。

# opticon
source: property `icon` can be omitted or must be either a string or a literal like `{dark, light}`
pt_br: Propriedade 'ícone' pode ser omitida ou deve ser uma sequência de caracteres ou um literal como '{escuro, luz}'
ru: Свойство "icon" может быть пропущено или должно быть строкой или литералом. Например: "{dark, light}"
zh_hans: 属性 "icon" 可以省略, 或者必须是字符串或文字, 如 "{dark, light}"
zh_hant: 可省略屬性 `icon`，或必須為字串或類似 `{dark, light}` 的常值

# navSection.missingTitle_error
source: No title in nav section specified for extension.
pt_br: Nenhum título na seção NAV especificado para extensão.
ru: Заголовок в разделе навигации для расширения не указан.
zh_hans: 未指定用于扩展的 "导航" 部分中的标题。
zh_hant: 為延伸模組指定的導覽區段中沒有標題。

# navSection.missingContainer_error
source: No container in nav section specified for extension.
fr: Aucun conteneur dans la section de navigation n'a été spécifié pour l’extension.
pt_br: Nenhum container especificado na seção nav para a extensão
ru: Для расширения не указан контейнер в разделе навигации.
zh_hans: 在 "导航" 部分中未指定用于扩展的容器。
zh_hant: 為延伸模組指定的導覽區段中沒有任何容器。

# navSection.moreThanOneDashboardContainersError
source: Exactly 1 dashboard container must be defined per space.
pt_br: Exatamente 1 contêiner do Dashboard deve ser definido por espaço.
ru: Для каждого пространства необходимо определить ровно один контейнер панели мониторинга.
zh_hans: 必须为每个空间定义1个仪表板容器。
zh_hant: 至少須為每個空間定義剛好 1 個儀表板容器。

# navSection.invalidContainer_error
source: NAV_SECTION within NAV_SECTION is an invalid container for extension.
pt_br: NAV_SECTION dentro NAV_SECTION é um contêiner inválido para a extensão.
ru: NAV_SECTION в NAV_SECTION является недопустимым контейнером для расширения.
zh_hans: NAV_SECTION 内的 NAV_SECTION 是一个无效的扩展容器。
zh_hant: NAV_SECTION 中的 NAV_SECTION 對延伸模組而言是無效的容器。

# dashboard.container.modelview
source: The model-backed view that will be displayed in this tab.
pt_br: O modo de exibição de modelo-backed que será exibido nesta guia.
ru: Представление на основе модели, которое будет отображаться в этой вкладке.
zh_hans: 将在此选项卡中显示的模型支持视图。
zh_hant: 將在此索引標籤中顯示的 model-backed 檢視。

# azdata.extension.contributes.dashboard.tab.id
source: Unique identifier for this tab. Will be passed to the extension for any requests.
ru: Уникальный идентификатор этой вкладки. Будет передаваться расширению при выполнении любых запросов.
zh_hant: 此索引標籤的唯一識別碼。將傳遞給任何要求的擴充功能。

# azdata.extension.contributes.dashboard.tab.title
source: Title of the tab to show the user.
ru: Название вкладки, отображаемое для пользователя.
zh_hant: 顯示給使用者的索引標籤的標題。

# azdata.extension.contributes.dashboard.tab.description
source: Description of this tab that will be shown to the user.
ru: Описание этой вкладки, которое будет показано пользователю.
zh_hant: 此索引標籤的描述將顯示給使用者。

# azdata.extension.contributes.tab.when
source: Condition which must be true to show this item
ru: Условие, которое должно иметь значение True, чтобы отображался этот элемент
zh_hant: 必須為 true 以顯示此項目的條件

# azdata.extension.contributes.tab.provider
source: Defines the connection types this tab is compatible with. Defaults to "MSSQL" if not set
ru: Определяет типы подключения, с которыми совместима эта вкладка. Если не задано, используется "MSSQL".
zh_hant: 定義與此索引標籤相容的連線類型。如果未設定，則預設為 "MSSQL"

# azdata.extension.contributes.dashboard.tab.container
source: The container that will be displayed in this tab.
ru: Контейнер, который будет отображаться в этой вкладке.
zh_hant: 將在此索引標籤中顯示的容器。

# azdata.extension.contributes.dashboard.tab.alwaysShow
source: Whether or not this tab should always be shown or only when the user adds it.
ru: Будет ли эта вкладка отображаться всегда или только при добавлении её пользователем.
zh_hant: 此索引標籤是否應總是顯示或僅當使用者增加時。

# azdata.extension.contributes.dashboard.tab.isHomeTab
source: Whether or not this tab should be used as the Home tab for a connection type.
ru: Следует ли использовать эту вкладку в качестве вкладки "Главная" для типа подключения.
zh_hant: 是否應將此索引標籤用作連線類型的 [首頁] 索引標籤。

# azdata.extension.contributes.tabs
source: Contributes a single or multiple tabs for users to add to their dashboard.
ru: Добавляет одну или несколько вкладок для пользователей, которые будут добавлены на их панель мониторинга.
zh_hant: 提供一個或多個索引標籤，讓使用者可增加至其儀表板中。

# dashboardTab.contribution.noTitleError
source: No title specified for extension.
pt_br: Nenhum título especificado para extensão.
ru: Заголовок расширения не указан.
zh_hans: 没有为扩展指定标题。
zh_hant: 未為延伸模組指定標題。

# dashboardTab.contribution.noDescriptionWarning
source: No description specified to show.
fr: Aucune description spécifiée à afficher.
pt_br: Nenhuma descrição especificada para mostrar.
ru: Описание не указано.
zh_hans: 未指定要显示的说明。
zh_hant: 未指定任何要顯示的說明。

# dashboardTab.contribution.noContainerError
source: No container specified for extension.
pt_br: Nenhum container especificado para a extensão.
ru: Не выбран контейнер для расширения.
zh_hans: 没有为扩展指定容器。
zh_hant: 未為延伸模組指定任何容器。

# dashboardTab.contribution.moreThanOneDashboardContainersError
source: Exactly 1 dashboard container must be defined per space
pt_br: Exatamente 1 contêiner de painel deve ser definido por espaço
ru: Для каждого пространства необходимо определить ровно один контейнер панели мониторинга
zh_hans: 每个空间必须定义一个完整的仪表板容器
zh_hant: 每個空間必須明確定義一個儀表板容器

source: Connection
fr: Connexion
pt_br: Conexão
ru: Подключение
zh_hans: 连接
zh_hant: 連接

# connectType
source: Connection type
fr: Type de connexion
pt_br: Tipo de Conexão
ru: Тип подключения
zh_hans: 连接类型
zh_hant: 連接類型

# recentConnectionTitle
source: Recent Connections
fr: Dernières connexions
pt_br: Conexões recentes
ru: Последние соединения
zh_hans: 最近的连接
zh_hant: 最近的連接

# savedConnectionTitle
source: Saved Connections
fr: Connexions enregistrées
pt_br: Conexões salvas
ru: Сохраненные подключения
zh_hans: 保存的连接
zh_hant: 已儲存的連接

# connectionDetailsTitle
source: Connection Details
ru: Сведения о подключении
zh_hant: 連接詳細資料

# connectionDialog.connect
source: Connect
fr: Connecter
pt_br: Conectar-se
ru: Подключиться
zh_hans: 连接
zh_hant: 連接

# connectionDialog.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# noRecentConnections
source: No recent connection
fr: Aucune connexion récente
pt_br: Nenhuma conexão recente
ru: Недавние соединения отсутствуют
zh_hans: 没有最近的连接
zh_hant: 沒有最近使用的連接

# noSavedConnections
source: No saved connection
fr: Aucune connexion enregistrée
pt_br: Nenhuma conexão salva
ru: Сохраненные подключения отсутствуют
zh_hans: 没有保存的连接
zh_hant: 沒有儲存的連接

# ServerGroupsDialogTitle
source: Server Groups
fr: Groupes de serveurs
pt_br: Grupos de servidores
ru: Группы серверов
zh_hans: 服务器组
zh_hant: 伺服器群組

# serverGroup.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# serverGroup.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消
