Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

# dashboardpage.rowNumber
source: The row of the component in the grid
pt_br: A linha do componente no grid
ru: Строке компонента в сетке
zh_hans: 网格中组件的行
zh_hant: 格線中元件的列

# dashboardpage.rowSpan
source: The rowspan of the component in the grid. Default value is 1. Use '*' to set to number of rows in the grid.
pt_br: O rowspan do componente no grid. O valor padrão é 1. Use '*' para definir o número de linhas no grid.
ru: Атрибут rowspan компонента сетки. Значение по умолчанию — 1. Используйте значение '*', чтобы задать количество строк в сетке.
zh_hans: 网格中组件的 rowspan。默认值为1。使用 "*" 设置为网格中的行数。
zh_hant: 網格中元件的 rowspan。預設值為 1。使用 '*' 即可設為網格中的列數。

# dashboardpage.colNumber
source: The column of the component in the grid
fr: Colonne du composant dans la grille
pt_br: A coluna do componente na grade
ru: Столбец компонента в сетке
zh_hans: 网格中组件的列
zh_hant: 網格中元件的欄位

# dashboardpage.colspan
source: The colspan of the component in the grid. Default value is 1. Use '*' to set to number of columns in the grid.
pt_br: O colspan do component no grid. O valor padrão é 1. Use '*'para definir a quantidade de colunas no grid.
ru: Атрибут colspan компонента сетки. Значение по умолчанию — 1. Используйте значение '*', чтобы задать количество столбцов в сетке.
zh_hans: 网格中组件的列跨距。默认值为1。使用 "*" 设置网格中的列数。
zh_hant: 網格內元件的 colspan。預設值為 1。使用 '*' 即可設為網格中的欄位數。

# azdata.extension.contributes.dashboardPage.tab.id
source: Unique identifier for this tab. Will be passed to the extension for any requests.
ru: Уникальный идентификатор этой вкладки. Будет передаваться расширению при выполнении любых запросов.
zh_hant: 此索引標籤的唯一識別碼。將傳遞給任何要求的擴充功能。

# dashboardTabError
source: Extension tab is unknown or not installed.
fr: L'onglet d’extension est inconnu ou non installé.
pt_br: Guia de extensão é desconhecida ou não está instalado.
ru: Вкладка «расширение» неизвестна или не установлена.
zh_hans: "扩展" 选项卡未知或未安装。
zh_hant: 未知的擴充功能索引標籤或未安裝。

# dashboardServerProperties
source: Enable or disable the properties widget
fr: Activer ou désactiver le widget de propriétés
pt_br: Habilitar ou desabilitar o widget Propriedades
ru: Включение или отключение виджета свойств
zh_hans: 启用或禁用属性窗口小部件
zh_hant: 啟用或禁用屬性小工具

# dashboard.serverproperties
source: Property values to show
fr: Valeurs de propriété à afficher
pt_br: Valores de propriedade para mostrar
ru: Значения свойств для отображения
zh_hans: 要显示的属性值
zh_hant: 顯示屬性值

# dashboard.serverproperties.displayName
source: Display name of the property
fr: Nom d'affichage de la propriété
pt_br: Nome para exibição da propriedade
ru: Отображаемое имя свойства
zh_hans: 属性的显示名称
zh_hant: 顯示屬性的名稱

# dashboard.serverproperties.value
source: Value in the Server Info Object
pt_br: Valor no objeto de informação do servidor
ru: Значение в объекте сведений о сервере
zh_hans: 服务器信息对象中的值
zh_hant: 伺服器資訊物件中的值

source: Version
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本

source: Edition
pt_br: Edição
ru: Выпуск
zh_hans: 版
zh_hant: 版本

source: Computer Name
fr: Nom de l'ordinateur
pt_br: Nome do Computador
ru: Имя компьютера
zh_hans: 计算机名
zh_hant: 電腦名稱

source: OS Version
fr: Version du système d'exploitation
pt_br: Versão do sistema operacional
ru: Версия ОС
zh_hans: OS 版本
zh_hant: 作業系統版本

# dashboardServer
source: Customizes the server dashboard page
fr: Personnalise la page de tableau de bord du serveur
pt_br: Personaliza a página de painel de controle do servidor
ru: Настраивает страницу панели мониторинга сервера
zh_hans: 自定义服务器仪表板页面
zh_hant: 自訂伺服器儀表板頁面

# dashboardServerTabs
source: Customizes the Server dashboard tabs
pt_br: Personaliza as guias do painel de controle de servidor
ru: Настраивает вкладки панели мониторинга сервера
zh_hans: 自定义服务器仪表板选项卡
zh_hant: 自訂伺服器儀表板索引標籤

# dashboardDatabaseProperties
source: Enable or disable the properties widget
fr: Activer ou désactiver le widget de propriétés
pt_br: Habilitar ou desabilitar o widget Propriedades
ru: Включение или отключение виджета свойств
zh_hans: 启用或禁用属性窗口小部件
zh_hant: 啟用或禁用屬性小工具

# dashboard.databaseproperties
source: Property values to show
fr: Valeurs de propriété à afficher
pt_br: Valores de propriedade para mostrar
ru: Значения свойств для отображения
zh_hans: 要显示的属性值
zh_hant: 顯示屬性值

# dashboard.databaseproperties.displayName
source: Display name of the property
fr: Nom d'affichage de la propriété
pt_br: Nome para exibição da propriedade
ru: Отображаемое имя свойства
zh_hans: 属性的显示名称
zh_hant: 顯示屬性的名稱

# dashboard.databaseproperties.value
source: Value in the Database Info Object
fr: Valeur de l’objet d’informations de base de données
pt_br: Valor no objeto de banco de dados de informação
ru: Значение в объекте информации базы данных
zh_hans: 数据库信息对象中的值
zh_hant: 資料庫資訊物件中的值

# dashboard.databaseproperties.ignore
source: Specify specific values to ignore
fr: Spécifiez des valeurs spécifiques à ignorer
pt_br: Especificar valores específicos para ignorar
ru: Укажите конкретные значения, которые нужно пропустить
zh_hans: 指定要忽略的特定值
zh_hant: 指定要忽略的特定值

source: Recovery Model
fr: Mode de récupération
pt_br: Modo de Recuperação
zh_hans: 恢复模型
zh_hant: 復原模式

source: Last Database Backup
fr: Dernière sauvegarde de base de données
pt_br: Último Backup de banco de dados
ru: Последнее резервное копирование базы данных
zh_hans: 上次数据库备份
zh_hant: 上次資料庫備份

source: Last Log Backup
fr: Dernière sauvegarde du journal
pt_br: Último Backup de Log
ru: Последняя резервная копия журнала
zh_hans: 上次日志备份
zh_hant: 上次日誌備份

source: Compatibility Level
fr: Niveau de compatibilité
pt_br: Nível de compatibilidade
zh_hans: 兼容级别
zh_hant: 相容層級

source: Owner
fr: Propriétaire
pt_br: Proprietário
ru: Владелец
zh_hans: 所有者
zh_hant: 擁有者

# dashboardDatabase
source: Customizes the database dashboard page
fr: Personnalise la page "Tableau de bord de la base de données"
pt_br: Personaliza a página do painel de banco de dados
ru: Настраивает страницу панели мониторинга базы данных
zh_hans: 自定义 "数据库仪表板" 页
zh_hant: 自訂 "資料庫儀表板" 頁

# dashboardDatabaseTabs
source: Customizes the database dashboard tabs
fr: Personnalise les onglets du tableau de bord de base de données
pt_br: Personaliza as guias do painel de controle de banco de dados
ru: Настраивает вкладки панели мониторинга базы данных
zh_hans: 自定义数据库仪表板选项卡
zh_hant: 自訂資料庫儀表板索引標籤

# invalidValueError
source: Invalid value
fr: Valeur non valide
pt_br: Valor inválido
ru: Недопустимое значение
zh_hans: 无效值
zh_hant: 值無效

# loadingMessage
source: Loading
fr: Chargement
pt_br: Carregando
ru: Загрузка
zh_hans: 正在加载
zh_hant: 正在載入

# dashboard.properties.property
source: Defines a property to show on the dashboard
fr: Définit une propriété à afficher sur le tableau de bord
pt_br: Define uma propriedade para mostrar no painel de controle
ru: Определяет свойство для отображения на панели мониторинга
zh_hans: 定义要在仪表板上显示的属性
zh_hant: 定義顯示於儀表板上的屬性

# dashboard.properties.property.displayName
source: What value to use as a label for the property
fr: Quelle est la valeur à utiliser comme étiquette pour la propriété
pt_br: Qual o valor a ser usado como um rótulo para a propriedade
ru: Какое значение использовать в качестве метки для свойства
zh_hans: 用作属性标签的值
zh_hant: 做為屬性標籤的值

# dashboard.properties.property.value
source: What value in the object to access for the value
fr: Quelle valeur dans les objets pour accéder à la valeur
pt_br: Qual o valor do objeto para acessar o valor
ru: Значение объекта, используемое для доступа к значению
zh_hans: 定义该值访问的对象中的值
zh_hant: 要存取何值於該物件中

# dashboard.properties.property.ignore
source: Specify values to be ignored
fr: Spécifiez des valeurs à ignorer
pt_br: Especifique valores para ser ignorado.
ru: Укажите игнорируемые значения
zh_hans: 指定要忽略的值
zh_hant: 指定要忽略的值

# dashboard.properties.property.default
source: Default value to show if ignored or no value
fr: Valeur par défaut à afficher si ignoré ou aucune valeur
pt_br: Valor padrão para mostrar se ignorado ou nenhum valor
ru: Значение по умолчанию, которое отображается в том случае, если значение игнорируется или не указано.
zh_hans: 在忽略或没有值时显示的默认值
zh_hant: 如果忽略或沒有值，則顯示預設值

# dashboard.properties.flavor
source: A flavor for defining dashboard properties
fr: Une option pour définir les propriétés de tableau de bord
pt_br: Um sabor para definir as propriedades do painel de controle
ru: Особые свойства панели мониторинга
zh_hans: 用于定义仪表板属性的风格
zh_hant: 定義儀表板屬性類別

# dashboard.properties.flavor.id
source: Id of the flavor
fr: Id de la préférence
pt_br: Identificação do Flavor
ru: Идентификатор варианта приложения
zh_hans: 风格的 Id
zh_hant: 類別的 id

# dashboard.properties.flavor.condition
source: Condition to use this flavor
pt_br: Condição para usar o flavor
ru: Условие использования этого варианта приложения
zh_hans: 使用这种风格的条件
zh_hant: 使用此類別的條件

# dashboard.properties.flavor.condition.field
source: Field to compare to
fr: Champ à comparer à
pt_br: Campo para comparar a
ru: Поле для сравнения
zh_hans: 要比较的字段
zh_hant: 要比較的欄位

# dashboard.properties.flavor.condition.operator
source: Which operator to use for comparison
fr: Quel opérateur utiliser pour la comparaison
pt_br: Qual operador usar para comparação
ru: Какой оператор использовать для сравнения
zh_hans: 用于比较的运算符
zh_hant: 用於比較的運算子

# dashboard.properties.flavor.condition.value
source: Value to compare the field to
fr: Valeur avec laquelle comparer le champ
pt_br: Valor para comparar o campo para
ru: Значение для сравнения поля
zh_hans: 用于和字段比较的值
zh_hant: 用於比較該欄位的值

# dashboard.properties.databaseProperties
source: Properties to show for database page
fr: Propriétés à afficher pour la page de base de données
pt_br: Propriedades para mostrar a página de banco de dados
ru: Свойства для отображения на странице базы данных
zh_hans: 用于显示于数据库页的属性
zh_hant: 顯示資料庫頁的屬性

# dashboard.properties.serverProperties
source: Properties to show for server page
fr: Propriétés à afficher pour la page du serveur
pt_br: Propriedades para mostrar para a página do servidor
ru: Отображаемые свойства для страницы сервера
zh_hans: 用于显示服务器页的属性
zh_hant: 顯示伺服器頁的屬性

# carbon.extension.dashboard
source: Defines that this provider supports the dashboard
fr: Définit que ce fournisseur prend en charge le tableau de bord
pt_br: Define que este provedor oferece suporte para o painel de controle
ru: Определяет, что этот поставщик поддерживает панель мониторинга
zh_hans: 定义此提供程序支持仪表板
zh_hant: 定義此提供者支援儀表板

# dashboard.id
source: Provider id (ex. MSSQL)
fr: Id du fournisseur (p. ex. MSSQL)
pt_br: Id do provedor (ex. MSSQL)
ru: Идентификатор поставщика (пример: MSSQL)
zh_hans: 提供程序ID (如： MSSQL)
zh_hant: 提供者 id (ex. MSSQL)

# dashboard.properties
source: Property values to show on dashboard
fr: Valeurs de propriétés à afficher sur le tableau de bord
pt_br: Valores de propriedade a serem exibidos no painel de controle
ru: Значения свойства для отображения на панели мониторинга
zh_hans: 要在仪表板上显示的属性值
zh_hant: 在儀表板上顯示的屬性值

# alertErrorMessage
source: Error: {0}
fr: Erreur : {0}
pt_br: Erro: {0}
ru: Ошибка: {0}
zh_hans: 错误: {0}
zh_hant: 錯誤: {0}

# alertWarningMessage
source: Warning: {0}
fr: Avertissement : {0}
pt_br: Aviso: {0}
ru: Предупреждение: {0}
zh_hans: 警告: {0}
zh_hant: 警告: {0}

# alertInfoMessage
source: Info: {0}
ru: Информация: {0}
zh_hans: 信息: {0}
zh_hant: 資訊: {0}

# infoAltText
source: Information
ru: Сведения
zh_hant: 資訊

# warningAltText
source: Warning
fr: Avertissement
pt_br: Aviso
ru: Предупреждение
zh_hans: 警告
zh_hant: 警告

# errorAltText
source: Error
fr: Erreur
pt_br: Erro
ru: Ошибка
zh_hans: 错误
zh_hant: 錯誤

# showMessageDetails
source: Show Details
ru: Показать подробные сведения
zh_hant: 顯示詳細資訊

# hideMessageDetails
source: Hide Details
ru: Скрыть подробные сведения
zh_hant: 隱藏詳細資料

# copyMessage
source: Copy
ru: Копирование
zh_hant: 複製

# closeMessage
source: Close
ru: Закрыть
zh_hant: 關閉

# modalBack
source: Back
fr: Précédent
pt_br: voltar
ru: Назад
zh_hans: 上一步
zh_hant: 上一頁

# treeAriaLabel
source: Recent Connections
fr: Dernières connexions
pt_br: Conexões recentes
ru: Последние соединения
zh_hans: 最近的连接
zh_hant: 最近的連接

# treeCreation.regTreeAriaLabel
source: Servers
fr: Serveurs
pt_br: Servidores
ru: Серверы
zh_hans: 服务器
zh_hant: 伺服器

# connectionAdvancedProperties
source: Advanced Properties
fr: Propriétés avancées
pt_br: Propriedades avançadas
ru: Дополнительные свойства
zh_hans: 高级属性
zh_hant: 進階屬性

# advancedProperties.discard
source: Discard
fr: Annuler
pt_br: Descarte
ru: Отменить
zh_hans: 放弃
zh_hant: 捨棄

# onDidConnectMessage
source: Connected to
fr: Connecté à
pt_br: Conectado a
ru: Подключен к
zh_hans: 连接到
zh_hant: 已連接到

# onDidDisconnectMessage
source: Disconnected
fr: Déconnecté
pt_br: Desconectado
ru: Отключен
zh_hans: 已断开连接
zh_hant: 已中斷連線

# unsavedGroupLabel
source: Unsaved Connections
fr: Connexions non enregistrées
pt_br: Conexões não salvas
ru: Несохраненные соединения
zh_hans: 未保存的连接
zh_hant: 未儲存的連結

# connectionWidget.AddAzureAccount
source: Add an account...
ru: Добавить учетную запись...
zh_hant: 新增帳戶...

# defaultDatabaseOption
source: <Default>
fr: <Par défaut>
pt_br: <Padrão>
ru: <По умолчанию>
zh_hans: <默认值>
zh_hant: <預設>

# loadingDatabaseOption
source: Loading...
fr: Chargement en cours...
pt_br: Carregando...
ru: Загрузка...
zh_hans: 正在加载...
zh_hant: 正在載入...

source: Server group
fr: Groupe de serveurs
pt_br: Grupo de servidores
ru: Группа серверов
zh_hans: 服务器组
zh_hant: 伺服器群組

# defaultServerGroup
source: <Default>
fr: <Par défaut>
pt_br: <Padrão>
ru: <По умолчанию>
zh_hans: <默认值>
zh_hant: <預設>

# addNewServerGroup
source: Add new group...
fr: Ajouter un nouveau groupe...
pt_br: Adicionar novo grupo...
ru: Добавить группу...
zh_hans: 添加新组..。
zh_hant: 新增群組...

# noneServerGroup
source: <Do not save>
ru: <Не сохранять>
zh_hant: <不要儲存>

# connectionWidget.missingRequireField
source: {0} is required.
fr: {0} est requis.
pt_br: {0} é necessária.
ru: {0} является обязательным.
zh_hans: {0} 是必需的。
zh_hant: {0} 為必要項。

# connectionWidget.fieldWillBeTrimmed
source: {0} will be trimmed.
pt_br: {0} será removido.
ru: {0} будет обрезан.
zh_hans: 将修剪 {0}。
zh_hant: {0} 將受到修剪。

source: Remember password
fr: Se souvenir du mot de passe
pt_br: Lembrar senha
ru: Запомнить пароль
zh_hans: 记住密码
zh_hant: 記住密碼

# connection.azureAccountDropdownLabel
source: Account
ru: Учетная запись
zh_hant: 帳戶

# connectionWidget.refreshAzureCredentials
source: Refresh account credentials
ru: Обновите учетные данные учетной записи
zh_hant: 重新整理帳戶認證

# connection.azureTenantDropdownLabel
source: Azure AD tenant
ru: Клиент Azure AD
zh_hant: Azure AD 租用戶

# connectionWidget.toggleDatabaseNameDropdown
source: Select Database Toggle Dropdown
fr: Sélectionnez la liste déroulante de bases de données
pt_br: Selecione a lista suspensa de bancos de dados disponíveis
ru: Раскрывающийся список для переключения базы данных
zh_hans: 选择数据库切换下拉列表
zh_hant: 選取資料庫切換下拉式清單

source: Advanced...
fr: Avancé...
pt_br: Avançada...
ru: Дополнительно...
zh_hans: 高级选项...
zh_hant: 進階...

# connectionWidget.invalidAzureAccount
source: You must select an account
ru: Необходимо выбрать учетную запись
zh_hant: 您必須選取帳戶

# resultsSerializer.saveAsFileTitle
source: Choose Results File
fr: Choisissez le fichier de résultats
pt_br: Escolha o arquivo de resultados
ru: Выберите файл результатов
zh_hans: 选择结果文件
zh_hant: 選擇結果檔案

# resultsSerializer.saveAsFileExtensionCSVTitle
source: CSV (Comma delimited)
fr: CSV (valeurs séparées par des virgules)
pt_br: CSV (separado por vírgula)
ru: CSV (с разделением запятыми)
zh_hans: CSV (逗号分隔)
zh_hant: CSV (逗點分隔)

# resultsSerializer.saveAsFileExtensionExcelTitle
source: Excel Workbook
fr: Classeur Excel
pt_br: Pasta de trabalho do Excel
ru: Книга Excel
zh_hans: Excel 工作簿
zh_hant: excel 活頁簿

# resultsSerializer.saveAsFileExtensionTXTTitle
source: Plain Text
fr: Texte brut
pt_br: Texto Sem Formatação
ru: Простой текст
zh_hans: 纯文本
zh_hant: 純文字

# openLocation
source: Open file location
fr: Ouvrir l'emplacement du fichier
pt_br: Abrir arquivo de localização
ru: Расположение для открытия файла
zh_hans: 打开文件所在位置
zh_hant: 開啟檔案位置

source: Open file
fr: Ouvrir un fichier
pt_br: Abrir arquivo
ru: Открыть файл
zh_hans: 打开文件
zh_hant: 開啟檔案

# invalidServerName
source: A server group with the same name already exists.
fr: Un groupe de serveurs avec le même nom existe déjà.
pt_br: Um grupo de servidores com o mesmo nome já existe.
ru: Группа серверов с таким именем уже существует.
zh_hans: 已存在同名的服务器组。
zh_hant: 伺服器群組名稱已經存在。

# queryPlanTitle
source: Query Plan
ru: План запроса
zh_hant: 查詢計劃

# topOperations.operation
source: Operation
fr: Opération
pt_br: Operação
ru: Операция
zh_hans: 操作
zh_hant: 操作

# topOperations.object
source: Object
fr: Objet
pt_br: Objeto
ru: Объект
zh_hans: 对象
zh_hant: 物件

# topOperations.estCost
source: Est Cost
fr: Coût estimé
pt_br: Custo est
ru: Оценка стоимости
zh_hans: 预计消耗
zh_hant: 估計成本

# topOperations.estSubtreeCost
source: Est Subtree Cost
fr: Coût estimé de la sous-arborescence
pt_br: Custo est da subárvore
ru: Оценка стоимости поддерева
zh_hans: 估计子树成本
zh_hant: 估計的子樹成本

# topOperations.actualRows
source: Actual Rows
fr: Lignes actuelles
pt_br: Linhas atuais
ru: Фактических строк
zh_hans: 实际行数
zh_hant: 實際行數

# topOperations.estRows
source: Est Rows
fr: Nombre de lignes estimées
pt_br: Linhas de est
ru: Оценка строк
zh_hans: 估计行数
zh_hant: 估計行數

# topOperations.actualExecutions
source: Actual Executions
fr: Exécutions actuelles
pt_br: Execuções reais
ru: Фактическое выполнение
zh_hans: 实际执行
zh_hant: 實際執行

# topOperations.estCPUCost
source: Est CPU Cost
fr: Coût processeur estimé
pt_br: Custo de CPU est
ru: Приблизительные расходы на ЦП
zh_hans: CPU 成本
zh_hant: 估計 CPU 成本

# topOperations.estIOCost
source: Est IO Cost
fr: Coût Estimé des E/S
pt_br: Custo de IO est
ru: Приблизительные затраты на операции ввода/вывода
zh_hans: 预估IO成本
zh_hant: 估計 IO 成本

# topOperations.parallel
source: Parallel
fr: Parallèle
pt_br: Paralelo
ru: Параллельный
zh_hans: 并行
zh_hant: 並排

# topOperations.actualRebinds
source: Actual Rebinds
fr: Reliaisons actuelles
pt_br: Reassociações reais
ru: Фактическое число повторных привязок
zh_hans: 实际的重新绑定
zh_hant: 實際重新綁定

# topOperations.estRebinds
source: Est Rebinds
pt_br: Est reassociações
ru: Приблизительное число повторных привязок
zh_hans: 评估重新绑定
zh_hant: 估計重新繫結

# topOperations.actualRewinds
source: Actual Rewinds
fr: Retourner réellement en arrière
ru: Фактическое число сбросов на начало
zh_hans: 实际后退
zh_hant: 實際倒轉

# topOperations.estRewinds
source: Est Rewinds
fr: Rembobinages estimés
pt_br: Retroceder
ru: Приблизительное число возвратов
zh_hans: Est 后退
zh_hant: 估計倒轉

# topOperations.partitioned
source: Partitioned
fr: Partitionné
pt_br: Particionado
ru: Секционированный
zh_hans: 分区
zh_hant: 已分割

# topOperationsTitle
source: Top Operations
ru: Основные операции
zh_hant: 最前幾項操作

# backup.backupName
source: Backup name
fr: Nom de la sauvegarde
pt_br: Nome do backup
ru: Имя резервной копии
zh_hans: 备份名称
zh_hant: 備份名稱

# backup.recoveryModel
source: Recovery model
fr: Mode de récupération
pt_br: Modo de Recuperação
zh_hans: 恢复模型
zh_hant: 復原模式

# backup.backupType
source: Backup type
fr: Type de sauvegarde
pt_br: Tipo de backup
ru: Тип резервной копии
zh_hans: 备份类型
zh_hant: 備份類型

# backup.backupDevice
source: Backup files
fr: Fichiers de sauvegarde
pt_br: Arquivos de backup
ru: Резервные файлы
zh_hans: 备份文件
zh_hant: 備份檔案

# backup.algorithm
source: Algorithm
fr: Algorithme
pt_br: Algoritmo de
ru: Алгоритм
zh_hans: 算法
zh_hant: 演算法

# backup.certificateOrAsymmetricKey
source: Certificate or Asymmetric key
fr: Certificat ou clé asymétrique
pt_br: Chave de certificado ou assimétrica
ru: Сертификат или асимметричный ключ
zh_hans: 证书或非对称密钥
zh_hant: 憑證或非對稱金鑰

# backup.media
source: Media
fr: Support
pt_br: Mídia
ru: Носитель
zh_hans: 媒体
zh_hant: 媒體

# backup.mediaOption
source: Backup to the existing media set
fr: Sauvegarder dans le jeu de media existant
pt_br: Backup para o conjunto de mídia existente
ru: Создать резервную копию в существующем наборе носителей
zh_hans: 备份到已有的媒体集
zh_hant: 備份到現有的媒體集

# backup.mediaOptionFormat
source: Backup to a new media set
fr: Sauvegarder sur un nouveau jeu de sauvegarde
pt_br: Backup em um novo conjunto de mídias
ru: Создать резервную копию на новом наборе носителей
zh_hans: 备份到新媒体集
zh_hant: 備份到新媒體集

# backup.existingMediaAppend
source: Append to the existing backup set
fr: Ajouter au jeu de sauvegarde existant
pt_br: Acrescentar ao conjunto de backup existente
ru: Добавить к существующему резервному набору данных
zh_hans: 追加到现有备份集
zh_hant: 附加至現有的備份組

# backup.existingMediaOverwrite
source: Overwrite all existing backup sets
fr: Remplacer tous les jeux de sauvegarde existants
pt_br: Substituir todos os conjuntos de backup existentes
ru: Перезаписать все существующие резервные наборы данных
zh_hans: 覆盖所有现有备份集
zh_hant: 覆寫所有現有的備份集

# backup.newMediaSetName
source: New media set name
fr: Nouveau nom de jeu de supports
pt_br: Novo nome do conjunto de mídia
ru: Имя нового набора носителей
zh_hans: 新媒体集名称
zh_hant: 新媒體集名稱

# backup.newMediaSetDescription
source: New media set description
pt_br: Nova descrição do conjunto de mídia
ru: Описание нового набора носителей
zh_hans: 新建媒体集描述
zh_hant: 新媒體集說明

# backup.checksumContainer
source: Perform checksum before writing to media
fr: Effectuer la somme de contrôle avant d’écrire sur le support
pt_br: Realize o checksum antes de gravar na mídia
ru: Рассчитать контрольную сумму перед записью на носитель
zh_hans: 在写入介质前执行和校验
zh_hant: 在寫入媒體前執行檢查碼

# backup.verifyContainer
source: Verify backup when finished
fr: Vérifier la sauvegarde après son achèvement
pt_br: Verificar backup quando terminar
ru: Проверить резервную копию после завершения
zh_hans: 完成后验证备份
zh_hant: 完成後驗證備份

# backup.continueOnErrorContainer
source: Continue on error
fr: Continuer en cas d’erreur
pt_br: Continuar no erro
ru: Продолжать при ошибке
zh_hans: 错误发生时继续
zh_hant: 錯誤時仍繼續

# backup.expiration
source: Expiration
pt_br: Expiração
ru: Истечение срока
zh_hans: 过期
zh_hant: 逾期

# backup.setBackupRetainDays
source: Set backup retain days
fr: Définir le délai de rétention en jours
pt_br: Defina os dias de retenção de backup
ru: Установить время хранения резервной копии в днях
zh_hans: 设置备份保留天数
zh_hant: 設置備份保留天數

# backup.copyOnly
source: Copy-only backup
fr: Sauvegarde en mode copie seule
pt_br: Backup somente cópia
ru: Только архивное копирование
zh_hans: 仅复制备份
zh_hant: 僅複製備份

# backup.advancedConfiguration
source: Advanced Configuration
fr: Configuration avancée
pt_br: Configuração avançada
ru: Расширенная конфигурация
zh_hans: 高级配置
zh_hant: 進階設置

# backup.compression
source: Compression
pt_br: Compressão
ru: Сжатие
zh_hans: 压缩
zh_hant: 壓縮

# backup.setBackupCompression
source: Set backup compression
fr: Activer la compression de la sauvegarde
pt_br: Definir a compactação de backup
ru: Настройка сжатия резервной копии
zh_hans: 设置备份压缩
zh_hant: 設定備份壓縮

# backup.encryption
source: Encryption
fr: Chiffrement
pt_br: Criptografia
ru: Шифрование
zh_hans: 加密
zh_hant: 加密

# backup.transactionLog
source: Transaction log
fr: Journal des transactions
pt_br: Log de transações
ru: Журнал транзакций
zh_hans: 事务日志
zh_hant: 交易記錄

# backup.truncateTransactionLog
source: Truncate the transaction log
fr: Tronquer le journal des transactions
pt_br: Truncar o log de transações
ru: Обрежьте журнал транзакций
zh_hans: 截断事务日志
zh_hant: 截斷交易記錄

# backup.backupTail
source: Backup the tail of the log
fr: Sauvegarder la fin du journal
pt_br: Backup do final do log
ru: Резервное копирование заключительного фрагмента журнала
zh_hans: 备份日志的尾部
zh_hant: 備份最後的日誌內容

# backup.reliability
source: Reliability
fr: Fiabilité
pt_br: Confiabilidade
ru: Надежность
zh_hans: 可靠性
zh_hant: 可靠性

# backup.mediaNameRequired
source: Media name is required
fr: Un nom de média est nécessaire
pt_br: Nome da mídia é necessária
ru: Требуется имя носителя
zh_hans: 需要媒体名称
zh_hant: 需要媒體名稱
