Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

# enablePreviewFeatures.notice
source: Preview features are required in order for extensions to be fully supported and for some actions to be available. Would you like to enable preview features?
ru: Функции предварительной версии требуются для полной поддержки расширений и для обеспечения доступности некоторых действий. Вы хотите включить функции предварительной версии?
zh_hant: 需要預覽功能才能完整支援延伸模組和使用部分動作。要啟用預覽功能嗎?

# enablePreviewFeatures.yes
source: Yes
ru: Да
zh_hant: 是

# enablePreviewFeatures.no
source: No
ru: Нет
zh_hant: 否

# enablePreviewFeatures.never
source: No, don't show again
ru: Больше не показывать
zh_hant: 不，不要再顯示

# noTaskMessage
source: No task history to display. Try backup or restore task to view its execution status.
fr: Aucun historique de tâche à afficher. Essayez de sauvegarder ou de restaurer la tâche pour voir son statut d’exécution.
pt_br: Nenhum histórico de tarefas para exibição. Tente uma tarefa de backup ou restauração para visualizar seu status de execução.
ru: История задач пуста. Попробуйте запустить задачу резервного копирования или восстановления, чтобы просмотреть состояние ее выполнения.
zh_hans: 没有要显示的任务历史记录。尝试备份或还原任务以查看其执行状态。
zh_hant: 沒有工作歷史紀錄可以顯示。請嘗試備份或還原工作以檢視執行狀態。

# taskHistory.regTreeAriaLabel
source: Task history
fr: Historique de la tâche
pt_br: Tarefa de história
ru: История задач
zh_hans: 任务历史记录
zh_hant: 工作歷史紀錄

source: Task error
fr: Erreur de la tâche
pt_br: Erro de tarefa
ru: Ошибка выполнения задачи
zh_hans: 任务错误
zh_hant: 工作錯誤

# no-dataprovider
source: There is no data provider registered that can provide view data.
ru: Отсутствует зарегистрированный поставщик данных, который может предоставить сведения о просмотрах.
zh_hant: 沒有任何已註冊的資料提供者可提供檢視資料。

source: Collapse
zh_hant: 摺疊

# serverTree.addConnection
source: Add Connection
fr: Ajouter une connexion
pt_br: Adicionar Conexão
ru: Добавить подключение
zh_hans: 添加连接
zh_hant: 加入連接

# connectionTree.refresh
source: Refresh
fr: Actualiser
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# DisconnectAction
source: Disconnect
fr: Déconnecter
pt_br: Desconectar-se
ru: Отключить
zh_hans: 断开
zh_hant: 中斷連線

# connectionTree.addConnection
source: New Connection
fr: Nouvelle connexion
pt_br: Nova Conexão
ru: Создание соединения
zh_hans: 新建连接
zh_hant: 新增連接

# connectionTree.addServerGroup
source: New Server Group
fr: Nouveau groupe de serveurs
pt_br: Novo Server Group
ru: Новая группа серверов
zh_hans: 新服务器组
zh_hant: 新伺服器群組

# connectionTree.editServerGroup
source: Edit Server Group
fr: Modifier le groupe de serveurs
pt_br: Editar grupo de servidores
ru: Редактировать группу серверов
zh_hans: 编辑服务器组
zh_hant: 編輯伺服器群組

# activeConnections
source: Show Active Connections
fr: Voir les connexions actives
pt_br: Mostrar conexões ativas
ru: Показать активные соединения
zh_hans: 显示活动连接
zh_hant: 顯示使用中的連接

source: Show All Connections
ru: Показать все подключения
zh_hant: 顯示所有連線

source: Recent Connections
fr: Dernières connexions
pt_br: Conexões recentes
ru: Последние соединения
zh_hans: 最近的连接
zh_hant: 最近的連接

# registeredServers.newQuery
source: New Query
fr: Nouvelle requête
pt_br: Nova consulta
ru: Создать запрос
zh_hans: 新建查询
zh_hant: 新增查詢

source: Delete Connection
fr: Supprimer la connexion
pt_br: Excluir a Conexão
ru: Удалить подключение
zh_hans: 删除连接
zh_hant: 刪除連接

# deleteConnectionGroup
source: Delete Group
fr: Supprimer le groupe
pt_br: Excluir grupo
ru: Удалить группу
zh_hans: 删除组
zh_hant: 刪除群組

source: Clear Search
fr: Effacer la recherche
pt_br: Limpar pesquisa
ru: Очистить поиск
zh_hans: 清除搜索
zh_hant: 清除搜尋

# ClearRecentlyUsedLabel
source: Clear List
pt_br: Limpar lista
ru: Очистить список
zh_hans: 清除列表
zh_hant: 清除清單

# ClearedRecentConnections
source: Recent connections list cleared
fr: Liste des connexions récentes supprimée
pt_br: Lista de conexões recentes limpa
ru: Cписок последних подключений очищен
zh_hans: 已清空最近的连接列表
zh_hant: 最近的連接清單已清除

# connectionAction.yes
source: Yes
fr: Oui
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# connectionAction.no
source: No
fr: Non
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# clearRecentConnectionMessage
source: Are you sure you want to delete all the connections from the list?
fr: Êtes-vous sûr de vouloir supprimer toutes les connexions de la liste ?
pt_br: Você tem certeza que deseja excluir todas as conexões da lista?
ru: Вы уверены, что хотите удалить все соединения из списка?
zh_hans: 确定要删除列表中的所有连接吗?
zh_hant: 您確定要刪除清單中的所有連接嗎？

# connectionDialog.yes
source: Yes
fr: Oui
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# connectionDialog.no
source: No
fr: Non
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

source: Delete
fr: supprimer
pt_br: Excluir
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# connectionAction.GetCurrentConnectionString
source: Get Current Connection String
pt_br: Obter a String de Conexão atual
ru: Получить текущую строку подключения
zh_hans: 获取当前连接字符串
zh_hant: 取得目前的連接字串

# connectionAction.connectionString
source: Connection string not available
pt_br: Connection String não disponível
ru: Строка подключения недоступна
zh_hans: 连接字符串不可用
zh_hant: 連接字串無法使用

# connectionAction.noConnection
source: No active connection available
fr: Aucune connexion active disponible
pt_br: Nenhuma conexão ativa disponível
ru: Активные подключения отсутствуют
zh_hans: 没有可用的活动连接
zh_hant: 沒有可用的有效連線

# maxRowTaskbar
source: Max Rows:
fr: Nombre maximum de lignes :
pt_br: Máximo de linhas:
ru: Максимальное число строк:
zh_hans: 最大行数:
zh_hant: 最大行數:

# focusOnCurrentQueryKeyboardAction
source: Focus on Current Query
pt_br: Foco na consulta atual
ru: Фокус на текущем запросе
zh_hans: 关注当前查询
zh_hant: 聚焦於目前的查詢

# runQueryKeyboardAction
source: Run Query
fr: Exécutez la requête
pt_br: Executar consulta
ru: Выполнить запрос
zh_hans: 运行查询
zh_hant: 執行查詢

# runCurrentQueryKeyboardAction
source: Run Current Query
fr: Exécutez la requête en cours
pt_br: Executar consulta atual
ru: Выполнить текущий запрос
zh_hans: 运行当前查询
zh_hant: 執行目前查詢

# runCurrentQueryWithActualPlanKeyboardAction
source: Run Current Query with Actual Plan
fr: Exécutez la requête en cours avec le Plan réel
pt_br: Executar a consulta atual com o plano real
ru: Выполнить текущий запрос с фактическим планом
zh_hans: 使用实际计划运行当前查询
zh_hant: 使用實際計畫執行目前的查詢

# cancelQueryKeyboardAction
source: Cancel Query
fr: Annuler la requête
pt_br: Cancelar a consulta
ru: Отменить запрос
zh_hans: 取消查询
zh_hant: 取消查詢

# refreshIntellisenseKeyboardAction
source: Refresh IntelliSense Cache
fr: Actualiser le Cache IntelliSense
pt_br: Atualizar Cache do IntelliSense
ru: Обновить кэш IntelliSense
zh_hans: 刷新智能感知缓存
zh_hant: 更新 IntelliSense 快取

# toggleQueryResultsKeyboardAction
source: Toggle Query Results
fr: Activer/désactiver les résultats de requête
pt_br: Alternar resultados da consulta
ru: Переключить результаты запроса
zh_hans: 切换查询结果
zh_hant: 開啟查詢結果

# queryShortcutNoEditor
source: Editor parameter is required for a shortcut to be executed
fr: Le paramètre de l’éditeur est nécessaire pour qu'un raccourci soit exécuter
pt_br: Editor de parâmetro é necessário para um atalho a ser executado
ru: Для выполнения ярлыка требуется параметр редактора.
zh_hans: 要执行的快捷方式需要编辑器参数
zh_hant: 要執行的捷徑需要編輯器參數

# parseSyntaxLabel
source: Parse Query
pt_br: Analisar a consulta
ru: Синтаксический анализ запроса
zh_hans: 解析查询
zh_hant: 剖析查詢

# queryActions.parseSyntaxSuccess
source: Commands completed successfully
pt_br: Comandos concluídos com sucesso
ru: Команды успешно выполнены
zh_hans: 命令已成功完成
zh_hant: 已成功完成命令

# queryActions.parseSyntaxFailure
source: Command failed:
pt_br: Falha no comando:
ru: Не удалось выполнить команду:
zh_hans: 命令失败:
zh_hant: 命令失敗:

# queryActions.notConnected
source: Please connect to a server
pt_br: Por favor, conecte-se a um servidor
ru: Подключитесь к серверу
zh_hans: 请连接到服务器
zh_hant: 請連線至伺服器

source: Save As CSV
fr: Enregistrer au format CSV
pt_br: Salve como CSV
ru: Сохранить в формате CSV
zh_hans: 另存为 CSV
zh_hant: 另存為 CSV

source: Save As JSON
fr: Enregistrer au format JSON
pt_br: Salvar como JSON
ru: Сохранить в формате JSON
zh_hans: 另存为 JSON
zh_hant: 另存為 JSON

source: Save As Excel
fr: Enregistrer au format Excel
pt_br: Salvar como Excel
ru: Сохранить в файле Excel
zh_hans: 另存为 Excel
zh_hant: 另存為 Excel

source: Save As XML
ru: Сохранить как XML
zh_hant: 另存為 XML

# copySelection
source: Copy
fr: Copier
pt_br: Copiar
ru: Копирование
zh_hans: 复制
zh_hant: 複製

source: Copy With Headers
fr: Copier avec en-têtes
pt_br: Copie com cabeçalhos
ru: Копировать с заголовками
zh_hans: 连同标题一起复制
zh_hant: 隨標頭一同複製

source: Select All
fr: Tout sélectionner
pt_br: Selecionar tudo
ru: Выбрать все
zh_hans: 选择全部
zh_hant: 全選

# copyMessages
source: Copy
fr: Copier
pt_br: Copiar
ru: Копирование
zh_hans: 复制
zh_hant: 複製

# profilerInput.profiler
source: Profiler
fr: Profileur
ru: Профилировщик
zh_hans: 分析器
zh_hant: 分析器

# profilerInput.notConnected
source: Not connected
fr: Non connecté
pt_br: Não conectado
ru: Нет соединения
zh_hans: 未连接
zh_hant: 未連線

# profiler.sessionStopped
source: XEvent Profiler Session stopped unexpectedly on the server {0}.
pt_br: Sessão do Profiler XEvent parou inesperadamente no servidor {0}.
ru: Сеанс профилировщика XEvent был неожиданно остановлен на сервере {0}.
zh_hans: XEvent 探查器会话在服务器 {0} 上意外停止。
zh_hant: 伺服器 {0} 上的 XEvent 分析工具工作階段意外停止。

# profiler.sessionCreationError
source: Error while starting new session
pt_br: Erro enquanto se inicia uma nova sessão.
ru: Ошибка при запуске нового сеанса
zh_hans: 启动新会话时出错
zh_hant: 啟動新的工作階段時發生錯誤

# profiler.eventsLost
source: The XEvent Profiler session for {0} has lost events.
pt_br: A sessão de XEvent Profiler para {0} perdeu eventos.
ru: В сеансе профилировщика XEvent для {0} были потеряны события.
zh_hans: {0} 的 XEvent 分析会话已丢失事件。
zh_hant: {0} 的 XEvent 分析工具工作階段遺失事件。

# confirmStopProfilerSession
source: Would you like to stop the running XEvent session?
pt_br: Gostaria de parar a execução da sessão XEvent?
ru: Вы хотите остановить запущенный сеанс XEvent?
zh_hans: 是否要停止正在运行的 XEvent 会话？
zh_hant: 要停止正在執行的 XEvent 工作階段嗎?

# profilerClosingActions.yes
source: Yes
fr: Oui
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# profilerClosingActions.no
source: No
fr: Non
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# profilerClosingActions.cancel
source: Cancel
ru: Отмена
zh_hant: 取消

# profiler.viewSelectAccessibleName
source: Select View
ru: Выберите представление
zh_hant: 選取檢視

# profiler.sessionSelectAccessibleName
source: Select Session
ru: Выберите сеанс
zh_hant: 選取工作階段

# profiler.sessionSelectLabel
source: Select Session:
ru: Выберите сеанс:
zh_hant: 選取工作階段:

# profiler.viewSelectLabel
source: Select View:
ru: Выберите представление:
zh_hant: 選取檢視:

source: Text
fr: Texte
pt_br: Texto
ru: Текст
zh_hans: 文本
zh_hant: 文字

source: Label
fr: Étiquette
pt_br: Rótulo
ru: Этикетка
zh_hans: 标签
zh_hant: 標籤

# profilerEditor.value
source: Value
fr: Valeur
pt_br: Valor
ru: Значение
zh_hans: 值
zh_hant: 值

source: Details
fr: Détails
pt_br: Detalhes
ru: Подробные сведения
zh_hans: 细节
zh_hant: 詳細資料

# ManageAction
source: Manage
fr: Gérer
pt_br: Gerenciar
ru: Управление
zh_hans: 管理
zh_hant: 管理

# schema.dashboardWidgets.InsightsRegistry
source: Widget used in the dashboards
fr: Widget utilisé dans les tableaux de bord
pt_br: Widget usado nos painéis de controle
ru: Мини-приложение, используемое на панелях мониторинга
zh_hans: 仪表板中使用的小部件
zh_hant: 儀表板中使用的小工具

# chartInsightDescription
source: Displays results of a query as a chart on the dashboard
fr: Affiche les résultats d’une requête sous forme de diagramme sur le tableau de bord
pt_br: Exibe os resultados de uma consulta como um gráfico no painel
ru: Отображает результаты запроса в виде диаграммы на панели мониторинга
zh_hans: 将查询结果显示为仪表板上的图表
zh_hant: 將查詢結果以圖表方式顯示在儀表板上

# colorMapDescription
source: Maps "column name" -> color. for example add "column1": red to ensure this column uses a red color
ru: Сопоставляет цвет "имени столбца" ->. Например, добавьте "column1": red, чтобы сделать этот столбец красным
zh_hans: 映射“列名”->颜色。例如，添加“column1”:红色以确保该列使用红色
zh_hant: 對應「欄位名稱」-& gt;色彩。例如以紅色新增 "column1": 即可確保此欄位使用紅色

# legendDescription
source: Indicates preferred position and visibility of the chart legend. These are the column names from your query, and map to the label of each chart entry
fr: Indique la position préférée et la visibilité de la légende du graphique. Ce sont les noms des colonnes de votre requête reliés à l’étiquette de chaque entrée du tableau
pt_br: Indica a posição preferida e a visibilidade da legenda do gráfico. Estes são os nomes das colunas da sua consulta e mapeados para o rótulo de cada entrada do gráfico
ru: Указывает предпочтительное положение и видимость условных обозначений диаграммы. Это имена столбцов из вашего запроса и карта для сопоставления с каждой записью диаграммы
zh_hans: 表示图表图例的首选位置和可见性。这些是查询中的列名称，并映射到每个图表条目的标签
zh_hant: 指定圖表圖例的優先位置和可見度。這些是您查詢中的欄位名稱, 並對應到每個圖表項目的標籤

# labelFirstColumnDescription
source: If dataDirection is horizontal, setting this to true uses the first columns value for the legend.
fr: Si la direction des données est horizontale, définir cette valeur à "true" utilisera la valeur des premières colonnes pour la légende.
pt_br: Se dataDirection é horizontal, alterar essa configuração para true usa o valor das primeiras colunas para a legenda.
ru: Если направление данные (dataDirection) горизонтальное, то при указании значения true для этого параметра для условных обозначений будут использоваться значения в первом столбце.
zh_hans: 如果 dataDirection 是水平的, 则将其设置为 true 将使用图例的第一列值。
zh_hant: 若 dataDirection 是水平的，設置為 true 時則使用第一個欄位值為其圖例。

# columnsAsLabels
source: If dataDirection is vertical, setting this to true will use the columns names for the legend.
fr: Si dataDirection est verticale, mettre ceci à vrai fera que les noms de colonnes seront utilisés pour la légende.
pt_br: Se dataDirection for vertical, definindo como verdadeiro usará os nomes das colunas para a legenda.
ru: Если dataDirection равно vertical и это значение равно true, то для условных обозначений будут использованы имена столбцов.
zh_hans: 如果dataDirection是垂直的，则将其设置为true将使用图例的列名称。
zh_hant: 若 dataDirection 是垂直的，設置為 true 時則使用欄位名稱為其圖例。

# dataDirectionDescription
source: Defines whether the data is read from a column (vertical) or a row (horizontal). For time series this is ignored as direction must be vertical.
pt_br: Define se os dados são lidos a partir de uma coluna (vertical) ou uma linha (horizontal). Para séries temporais, isso é ignorado, pois a direção deve ser vertical.
ru: Определяет, считываются ли данные из столбцов (по вертикали) или из строк (по горизонтали). Для временных рядов это игнорируется, так как для них всегда используется направление по вертикали.
zh_hans: 定义无论是从列（垂直）还是从行（水平）读取数据。对于时间序列，这都将被忽略，因为方向必须是垂直的。
zh_hant: 定義是否從行 (垂直) 或列 (水平) 讀取資料。對於時間序列, 當呈現方向為垂直時會被忽略。

# showTopNData
source: If showTopNData is set, showing only top N data in the chart.
pt_br: Se showTopNData for definido, mostre somente os dados top N no gráfico.
ru: Если параметр showTopNData установлен, отображаются только первые N данных на диаграмме.
zh_hans: 如果设置了 showTopNData, 则只在图表中显示前 N 个数据。
zh_hant: 如已設定 showTopNData，則僅顯示圖表中的前 N 個資料。

# newQueryAction.newQuery
source: New Query
fr: Nouvelle requête
pt_br: Nova consulta
ru: Создать запрос
zh_hans: 新建查询
zh_hant: 新增查詢

# scriptSelect
source: Select Top 1000
fr: Sélectionnez les 1000 premiers
pt_br: Selecione Top 1000
ru: Выберите первые 1000
zh_hans: 选择前 1000 项
zh_hant: 選取前 1000

# scriptExecute
source: Script as Execute
pt_br: Script executar como
ru: Выполнение сценария в режиме выполнения
zh_hans: 作为执行的脚本
zh_hant: 作為指令碼執行

# scriptAlter
source: Script as Alter
fr: Script Alter
pt_br: Script como Alter
ru: Выполнение сценария в режиме изменения
zh_hans: 生成Alter脚本
zh_hant: 修改指令碼

source: Edit Data
fr: Modifier les données
pt_br: Editar dados
ru: Редактировать данные
zh_hans: 编辑数据
zh_hant: 編輯資料

# scriptCreate
source: Script as Create
fr: Script de création
pt_br: Script de criação
ru: Выполнение сценария в режиме создания
zh_hans: 编写脚本为创建
zh_hant: 建立指令碼

# scriptDelete
source: Script as Drop
pt_br: Script apagado
ru: Сценарий как удаление
zh_hans: 生成DROP脚本
zh_hant: 編寫指令碼為 Drop

# backupAction.backup
source: Backup
fr: Sauvegarde
ru: Резервное копирование
zh_hans: 备份
zh_hant: 備份

# backup.isPreviewFeature
source: You must enable preview features in order to use backup
ru: Для использования резервного копирования необходимо включить функции предварительного просмотра
zh_hant: 您必須啟用預覽功能才能使用備份

# restoreAction.restore
source: Restore
fr: Restaurer
pt_br: Restaurar
ru: Восстановить
zh_hans: 还原
zh_hant: 還原

# restore.isPreviewFeature
source: You must enable preview features in order to use restore
ru: Чтобы использовать восстановление, необходимо включить функции предварительного просмотра
zh_hant: 您必須啟用預覽功能才能使用還原

source: Show Details
fr: Afficher les détails
pt_br: Mostrar detalhes
ru: Показать подробные сведения
zh_hans: 显示详细信息
zh_hant: 顯示詳細資訊

source: New Database
fr: Nouvelle base de données
pt_br: Novo banco de dados
ru: Новая база данных
zh_hans: 新建数据库
zh_hant: 新增資料庫

# configureDashboard
source: Learn How To Configure The Dashboard
ru: Сведения о настройке панели мониторинга
zh_hant: 了解如何設定儀表板

# gettingStarted
source: Get Started
fr: Mise en route
pt_br: Iniciar
ru: Начать работу
zh_hans: 入门
zh_hant: 入門指南

# showReleaseNotes
source: Show Getting Started
fr: Voir la mise en route
pt_br: Mostrar como começar
ru: Показать "Приступая к работе"
zh_hans: 显示入门
zh_hant: 顯示入門指南

# miGettingStarted
source: Getting &&Started
ru: Приступая к р&&аботе
zh_hant: 開始使用(&&S)

# schema.dashboardWidgets.all
source: Widget used in the dashboards
fr: Widget utilisé dans les tableaux de bord
pt_br: Widget usado nos painéis de controle
ru: Мини-приложение, используемое на панелях мониторинга
zh_hans: 仪表板中使用的小部件
zh_hant: 儀表板中使用的小工具

# schema.dashboardWidgets.database
source: Widget used in the dashboards
fr: Widget utilisé dans les tableaux de bord
pt_br: Widget usado nos painéis de controle
ru: Мини-приложение, используемое на панелях мониторинга
zh_hans: 仪表板中使用的小部件
zh_hant: 儀表板中使用的小工具

# schema.dashboardWidgets.server
source: Widget used in the dashboards
fr: Widget utilisé dans les tableaux de bord
pt_br: Widget usado nos painéis de controle
ru: Мини-приложение, используемое на панелях мониторинга
zh_hans: 仪表板中使用的小部件
zh_hant: 儀表板中使用的小工具

# insightWidgetDescription
source: Adds a widget that can query a server or database and display the results in multiple ways - as a chart, summarized count, and more
fr: Ajoute un widget qui peut interroger un serveur ou une base de données et afficher les résultats de plusieurs façons - tel qu'un graphique, un compte résumé, ou autre...
pt_br: Adiciona um widget que pode consultar um servidor ou banco de dados e exibir os resultados de várias maneiras - como um gráfico, resumida contagem e muito mais
ru: Добавляет мини-приложение, которое может опрашивать сервер или базу данных и отображать результаты различными способами — в виде диаграмм, сводных данных и т.д.
zh_hans: 添加一个可以查询服务器或数据库并以多种方式显示结果的小部件, 如图表、汇总计数等。
zh_hant: 加入一個可查詢伺服器或資料庫並以多種方式呈現結果的小工具，如圖表、計數總結等。

# insightIdDescription
source: Unique Identifier used for cacheing the results of the insight.
fr: Identificateur unique utilisé pour mettre en cache les résultats de l'aperçu.
pt_br: Identificador exclusivo usado para armazenar em cache os resultados do insight.
ru: Уникальный идентификатор, используемый для кэширования результатов анализа.
zh_hans: 用于缓存洞察结果的唯一标识符
zh_hant: 用於快取 insight 結果的唯一識別碼。

# insightQueryDescription
source: SQL query to run. This should return exactly 1 resultset.
fr: Requête SQL à exécuter. Cela devrait renvoyer exactement 1 jeu de résultat.
pt_br: Consulta SQL para executar. Isso deve retornar exatamente 1 resultset.
ru: SQL-запрос для выполнения. Он должен возвратить ровно один набор данных.
zh_hans: 要运行的 SQL 查询。这应该返回恰好1结果集。
zh_hant: 要執行的 SQL 查詢。這僅會回傳一個結果集。

# insightQueryFileDescription
source: [Optional] path to a file that contains a query. Use if "query" is not set
fr: [Facultatif] chemin vers un fichier qui contient une requête. A utiliser si la « requête » n’est pas définie
pt_br: [Opcional] caminho para um arquivo que contém uma consulta. Use se a "consulta" não estiver configurada
ru: [Опционально] путь к файлу, который содержит запрос. Используйте, если не задан "запрос"
zh_hans: [可选] 指向包含一个查询的文件路径。在未设置 "查询"时使用
zh_hant: [選用] 包含查詢之檔案的路徑。請於未設定 "query" 時使用

# insightAutoRefreshIntervalDescription
source: [Optional] Auto refresh interval in minutes, if not set, there will be no auto refresh
pt_br: [Opcional] Auto intervalo de atualização em minutos, se não estiver definido, não haverá atualização automática
ru: [Необязательно] Интервал автоматического обновления в минутах. Если значение не задано, то автоматическое обновление не будет выполняться.
zh_hans: [可选] 以分钟为单位的自动刷新频率，如未设置将不会自动刷新。
zh_hant: [選擇性] 自動重新整理間隔 (分鐘)，如未設定，就不會自動重新整理

# actionTypes
source: Which actions to use
fr: Quelles actions utiliser
pt_br: Quais ações para usar
ru: Используемые действия
zh_hans: 要使用的操作
zh_hant: 要使用的動作

# actionDatabaseDescription
source: Target database for the action; can use the format "${columnName}" to use a data driven column name.
pt_br: Banco de dados de destino para a ação; pode usar o formato "$ {ColumnName} " para usar um nome de coluna de dados orientados.
ru: Целевая база данных для выполнения действия; можно использовать формат "${columnName}", если имя столбца формируется с помощью данных.
zh_hans: 要操作的目标数据库;可以使用 "${columnName}" 格式使用数据驱动的列名。
zh_hant: 將資料庫設為動作的目標; 可使用 "${columnName}" 格式來使用資料驅動的欄位名稱。

# actionServerDescription
source: Target server for the action; can use the format "${columnName}" to use a data driven column name.
fr: Serveur cible pour l’action ; vous pouvez utiliser le format « ${columnName} » pour utiliser un nom de colonne piloté par les données.
pt_br: Servidor de destino para a ação; pode usar o formato "${columnName}" para usar um nome de coluna de dados orientados.
ru: Целевой сервер для действия; можно использовать формат "${columnName}" для столбцов, управляемых данными
zh_hans: 操作的目标服务器;可以使用 "${columnName}" 格式使用数据驱动的列名。
zh_hant: 將伺服器設為動作的目標; 可使用格式 "${columnName}" 來使用資料驅動的欄位名稱。

# actionUserDescription
source: Target user for the action; can use the format "${columnName}" to use a data driven column name.
fr: Utilisateur cible pour l’action ; vous pouvez utiliser le format « ${columnName} » pour utiliser un nom de colonne piloté par les données.
pt_br: Usuário de destino para a ação; pode usar o formato "${columnName}" para usar um nome de coluna de dados orientados.
ru: Целевой пользователь для действия. Можно использовать формат "${columnName}", если имя столбца определяется с помощью данных.
zh_hans: 用于操作的目标用户；可以使用格式“$ {columnName}”来使用数据驱动的列名。
zh_hant: 將使用者設為動作的目標; 可以使用格式 "${columnName}" 來使用資料驅動的欄位名稱。

# carbon.extension.contributes.insightType.id
source: Identifier of the insight
fr: Identificateur de aperçu
pt_br: Identificador da percepção
ru: Идентификатор аналитических данных
zh_hans: 智能见解的标识符
zh_hant: Insight 的識別碼

# carbon.extension.contributes.insights
source: Contributes insights to the dashboard palette.
fr: Contribue à des insights de la palette de tableau de bord.
pt_br: Contribuir com ideias para a paleta do painel de controle.
ru: Добавляет аналитические сведения на палитру панели мониторинга.
zh_hans: 为仪表板调色板提供见解。
zh_hant: 貢獻 insights 至儀表板選擇區。

# azdata.extension.contributes.widget.when
source: Condition which must be true to show this item
ru: Условие, которое должно иметь значение True, чтобы отображался этот элемент
zh_hant: 必須為 true 以顯示此項目的條件

# dashboardpage.tabName
source: The title of the container
fr: Titre du conteneur
pt_br: O título do container
ru: Название контейнера
zh_hans: 容器的标题
zh_hant: 容器的標題
