Repository: microsoft/azuredatastudio
Catalog: resources/xlf/sqlops-core/sql.*.xlf
Languages: fr, pt_br, ru, zh_hans, zh_hant

source: Connection error
fr: Erreur de connexion
pt_br: Erro de Conexão
ru: Ошибка подключения
zh_hans: 连接错误
zh_hant: 連接錯誤

# kerberosErrorStart
source: Connection failed due to Kerberos error.
fr: La connexion a échoué en raison d'une erreur Kerberos.
pt_br: Conexão falhou devido a um erro de Kerberos.
ru: Сбой подключения из-за ошибок Kerberos.
zh_hans: 由于 Kerberos 错误, 连接失败。
zh_hant: 因為 Kerberos 錯誤導致連接失敗。

# kerberosHelpLink
source: Help configuring Kerberos is available at {0}
pt_br: Ajuda para configurar o Kerberos está disponível em {0}
ru: Справка по настройке Kerberos доступна на странице {0}
zh_hans: 帮助配置 Kerberos 使其在 {0} 上可用
zh_hant: 您可於 {0} 取得設定 Kerberos 的說明

# kerberosKinit
source: If you have previously connected you may need to re-run kinit.
pt_br: Se você conectou previamente você pode precisar de re-Run kinit.
ru: Если вы подключались ранее, может потребоваться запустить kinit повторно.
zh_hans: 如果您之前已连接过，则可能需要重新运行kinit。
zh_hant: 如果您之前曾連線，則可能需要重新執行 kinit。

source: Error
fr: Erreur
pt_br: Erro
ru: Ошибка
zh_hans: 错误
zh_hant: 錯誤

source: Warning
fr: Avertissement
pt_br: Aviso
ru: Предупреждение
zh_hans: 警告
zh_hant: 警告

source: Info
pt_br: Informação
ru: Информация
zh_hans: 信息
zh_hant: 資訊

# connection.noAzureAccount
source: Failed to get Azure account token for connection
ru: Не удалось получить маркер учетной записи Azure для подключения
zh_hant: 無法取得連線的 Azure 帳戶權杖

# connectionNotAcceptedError
source: Connection Not Accepted
fr: Connexion non acceptée
pt_br: Conexão não aceita
ru: Подключение не принято
zh_hans: 连接未被接受
zh_hant: 連接未被接受

# connectionService.yes
source: Yes
fr: Oui
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# connectionService.no
source: No
fr: Non
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# cancelConnectionConfirmation
source: Are you sure you want to cancel this connection?
fr: Êtes-vous certain de vouloir annuler cette connexion ?
pt_br: Tem certeza que deseja cancelar esta conexão?
ru: Вы действительно хотите отменить это подключение?
zh_hans: 您确定要取消此连接吗？
zh_hant: 您確定要取消此連接嗎?

# InProgressWarning
source: 1 or more tasks are in progress. Are you sure you want to quit?
fr: 1 ou plusieurs tâches sont en cours. Êtes-vous sûr de vouloir quitter ?
pt_br: 1 ou mais tarefas estão em andamento. Tem certeza que deseja sair?
ru: Выполняется одна или несколько задач. Вы действительно хотите завершить работу?
zh_hans: 一个或多个任务正在运行中，确定要退出吗？
zh_hant: 1 個或更多的工作正在進行中。是否確實要退出？

# taskService.yes
source: Yes
fr: Oui
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# taskService.no
source: No
fr: Non
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# OeSessionFailedError
source: Failed to create Object Explorer session
fr: Echec de la création d'une session de l’Explorateur d’objets
pt_br: Falha ao criar sessão do Object Explorer
ru: Не удалось создать сессию Object Explorer
zh_hans: 未能创建对象资源管理器会话
zh_hant: 建立物件總管工作階段失敗

# nodeExpansionError
source: Multiple errors:
ru: Несколько ошибок:
zh_hant: 多個錯誤:

# commitEditFailed
source: Commit row failed:
fr: La validation de l'enregistrement a échoué:
pt_br: A linha de confirmação falhou:
ru: Не удалось зафиксировать строку:
zh_hans: 提交行失败:
zh_hant: 提交行失敗:

# runQueryStringBatchStartMessage
source: Started executing query "{0}"
fr: La requête "{0}" a démarré son exécution
pt_br: Começou a executar consulta "{0}"
ru: Начато выполнение запроса "{0}"
zh_hans: 已开始执行查询 "{0}"
zh_hant: 已開始執行查詢 "{0}"

source: Update cell failed:
fr: Échec de la mise à jour de la cellule :
pt_br: Falha na célula de atualização:
ru: Сбой обновления ячейки:
zh_hans: 更新单元格失败:
zh_hant: 更新儲存格失敗:

# providerIdNotValidError
source: Connection is required in order to interact with JobManagementService
pt_br: A conexão é necessária para interagir com JobManagementService
ru: Для взаимодействия со службой DacFxService требуется подключение.
zh_hans: 为了与 JobManagementService 交互, 需要连接
zh_hant: 必須連線才能與 DacFxService 互動

source: No Handler Registered
fr: Aucun gestionnaire enregistré
pt_br: Nenhum manipulador registrado
ru: Нет зарегистрированного обработчика
zh_hans: 未注册处理程序
zh_hant: 未註冊處理常式

# queryEditorServiceChangeUnsupportedError
source: Change Language Mode is not supported for unsaved queries
fr: Changer le mode de langage n’est pas pris en charge pour les requêtes non enregistrées
pt_br: Alterar o modo de idioma não é suportado para consultas não salvas
ru: Изменение языкового режима не поддерживается для несохраненных запросов
zh_hans: 未保存的查询不支持更改语言模式
zh_hant: 變更語言模式不支援未儲存的查詢

# queryEditorServiceChangeError
source: Please save or discard changes before switching to/from the SQL Language Mode
fr: Enregistrez ou annulez les changements avant de passer au mode de langage SQL ou d'en sortir
pt_br: Por favor, salvar ou descartar as alterações antes de mudar de/para o modo de linguagem SQL
ru: Сохраните или отмените изменения перед переключением в режим языка SQL или из него
zh_hans: 请在切换到/自 SQL 语言模式之前保存或放弃更改
zh_hant: 請在切換到 SQL 語言模式之前儲存或捨棄變更

# adminService.providerIdNotValidError
source: Connection is required in order to interact with adminservice
fr: La connexion est nécessaire pour interagir avec adminservice
pt_br: Conexão é necessário para interagir com adminservice
ru: Требуется подключение для взаимодействия с adminservice
zh_hans: 为了与 adminservice 交互, 需要连接
zh_hant: 必需連線以便與 adminservice 互動

# adminService.noHandlerRegistered
source: No Handler Registered
fr: Aucun gestionnaire enregistré
pt_br: Nenhum manipulador registrado
ru: Нет зарегистрированного обработчика
zh_hans: 未注册处理程序
zh_hant: 未註冊處理常式

# filebrowser.selectFile
source: Select a file
fr: Sélectionnez un fichier
pt_br: Selecione um arquivo
ru: Выберите файл
zh_hans: 选择文件
zh_hant: 選擇檔案

# fileBrowserErrorMessage
source: An error occured while loading the file browser.
fr: Une erreur s’est produite lors du chargement de l’Explorateur de fichiers.
pt_br: Ocorreu um erro ao carregar o navegador de arquivos.
ru: Произошла ошибка при загрузке браузера файлов.
zh_hans: 加载文件浏览器时出错。
zh_hant: 載入檔案瀏覽器時發生錯誤。

# fileBrowserErrorDialogTitle
source: File browser error
fr: Erreur du navigateur de fichier
pt_br: Erro do navegador de arquivo
ru: Ошибка браузера файлов
zh_hans: 文件浏览器错误
zh_hant: 檔案瀏覽器錯誤

# notebookUriNotDefined
source: No URI was passed when creating a notebook manager
ru: При создании диспетчера записных книжек не был передан URI
zh_hant: 建立筆記本管理員時未傳遞任何 URI

# notebookServiceNoProvider
source: Notebook provider does not exist
ru: Поставщик записных книжек не существует
zh_hant: 筆記本提供者不存在

# inProgressTasksChangesBadge
source: {0} in progress tasks
fr: {0} tâches en cours
pt_br: {0} tarefas em andamento
ru: {0} выполняющихся задач
zh_hans: {0} 正在执行任务
zh_hant: {0} 正在執行的工作

source: Show Task History
pt_br: Mostrar o histórico de tarefa
ru: Показать историю задачи
zh_hans: 显示任务历史
zh_hant: 顯示工作歷史紀錄

# taskHistory.view
source: View
fr: Afficher
pt_br: Visão
ru: Вид
zh_hans: 视图
zh_hant: 檢視

source: Task History
fr: Historique de la tâche
pt_br: Tarefa de história
ru: История задач
zh_hans: 任务历史记录
zh_hant: 工作歷史紀錄

# datasource.task
source: Operation Task Status
fr: État de la tâche de l'opération
pt_br: Status da Tarefa de Operação
ru: Статус задачи операции
zh_hans: 操作任务状态
zh_hant: 運作工作狀態

# miViewTasks
source: &&Tasks
ru: &&Задачи
zh_hant: 工作(&&T)

source: Show Data Explorer
ru: Показать обозреватель данных
zh_hant: 顯示資料總管

# workbench.dataExplorer
source: Data Explorer
ru: Обозреватель данных
zh_hant: 資料總管

# dataExplorer.view
source: View
ru: Вид
zh_hant: 檢視

source: Database Connections
fr: Connexions de base de données
pt_br: Conexões de banco de dados
ru: Подключения к базе данных
zh_hans: 数据库连接
zh_hant: 資料庫連接

source: data source connections
pt_br: conexões de fonte de dados
ru: подключения источника данных
zh_hans: 数据源连接
zh_hant: 資料來源連接

# datasource.connectionGroups
source: data source groups
fr: groupes de source de données
pt_br: grupos de fonte de dados
ru: группы источника данных
zh_hans: 数据源组
zh_hant: 資料來源群組

# startupConfig
source: Startup Configuration
fr: Configuration de démarrage
pt_br: Configuração de inicialização
ru: Конфигурация запуска
zh_hans: 启动配置
zh_hant: 啟動配置

# startup.alwaysShowServersView
source: True for the Servers view to be shown on launch of Azure Data Studio default; false if the last opened view should be shown
fr: True pour afficher la vue des serveurs au lancement d'Azure Data Studio par défaut ; false si la dernière vue ouverte doit être affichée
pt_br: Verdadeiro para a exibição Servidores a ser mostrada na inicialização do padrão do Azure Data Studio; falso se a última visualização aberta deve ser mostrada
ru: Задайте значение true, чтобы при запуске Azure Data Studio отображалось представление "Серверы"; задайте значение false, чтобы при запуске Azure Data Studio отображалось последнее открытое представление
zh_hans: 如果在Azure Data Studio默认启动时显示服务器视图，则为True;如果应显示上次打开的视图，则返回false
zh_hant: 預設為在 Azure Data Studio 啟動時要顯示的伺服器檢視即為 True; 如應顯示上次開啟的檢視則為 false

# vscode.extension.contributes.view.id
source: Identifier of the view. Use this to register a data provider through `vscode.window.registerTreeDataProviderForView` API. Also to trigger activating your extension by registering `onView:${id}` event to `activationEvents`.
ru: Идентификатор представления. Используйте его для регистрации поставщика данных с помощью API-интерфейса "vscode.window.registerTreeDataProviderForView", а также для активации расширения с помощью регистрации события "onView:${id}" в "activationEvents".
zh_hant: 檢視的識別碼。請使用此識別碼透過 `vscode.window.registerTreeDataProviderForView` API 登錄資料提供者。並藉由將 `onView:${id}` 事件登錄至 `activationEvents` 以觸發啟用您的延伸模組。

# vscode.extension.contributes.view.name
source: The human-readable name of the view. Will be shown
ru: Понятное имя представления. Будет отображаться на экране
zh_hant: 使用人性化顯示名稱.

# vscode.extension.contributes.view.when
source: Condition which must be true to show this view
ru: Условие, которое должно иметь значение 'true', чтобы отображалось это представление
zh_hant: 必須為 true 以顯示此檢視的條件

# extension.contributes.dataExplorer
source: Contributes views to the editor
ru: Добавляет представления в редактор
zh_hant: 提供意見給編輯者

# extension.dataExplorer
source: Contributes views to Data Explorer container in the Activity bar
ru: Добавляет представления в контейнер Обозревателя данных на панели действий
zh_hant: 將檢視提供到活動列中的資料總管容器

# dataExplorer.contributed
source: Contributes views to contributed views container
ru: Добавляет представления в контейнер добавленных представлений
zh_hant: 提供檢視給參與檢視容器

# ViewsContainerDoesnotExist
source: View container '{0}' does not exist and all views registered to it will be added to 'Data Explorer'.
ru: Представление контейнера '{0}' не существует, и все представления, зарегистрированные в нем, будут добавлены в обозреватель данных.
zh_hant: 檢視容器 '{0}' 並不存在，且所有向其註冊的檢視都將新增至「資料總管」。

# duplicateView1
source: Cannot register multiple views with same id `{0}` in the view container `{1}`
ru: Не удается зарегистрировать несколько представлений с одинаковым идентификатором '{0}' в контейнере представления '{1}'
zh_hant: 無法在檢視容器 '{1}' 中以同一個識別碼 '{0}' 註冊多個檢視

# duplicateView2
source: A view with id `{0}` is already registered in the view container `{1}`
ru: Представление с идентификатором '{0}' уже зарегистрировано в контейнере представления '{1}'
zh_hant: 已在檢視容器 '{1}' 中註冊識別碼為 '{0}' 的檢視

# requirearray
source: views must be an array
ru: представления должны быть массивом
zh_hant: 項目必須為陣列

# requirestring
source: property `{0}` is mandatory and must be of type `string`
ru: свойство "{0}" является обязательным и должно иметь тип string
zh_hant: 屬性 '{0}' 為強制項目且必須屬於 `string` 類型

# optstring
source: property `{0}` can be omitted or must be of type `string`
ru: свойство "{0}" может быть опущено или должно иметь тип string
zh_hant: 屬性 `{0}` 可以省略或必須屬於 `string` 類型

source: Disconnect
ru: Отключить
zh_hant: 中斷連線

source: New Query
ru: Создать запрос
zh_hant: 新增查詢

source: Manage
fr: Gérer
pt_br: Gerenciar
ru: Управление
zh_hans: 管理
zh_hant: 管理

source: Refresh
ru: Обновить
zh_hant: 重新整理

# dataExplorer.servers
source: Servers
ru: Серверы
zh_hant: 伺服器

source: Search server names
pt_br: Nomes de servidores de pesquisa
ru: Поиск имен серверов
zh_hans: 搜索服务器名称
zh_hant: 搜尋伺服器名稱

# sql.maxRecentConnectionsDescription
source: The maximum number of recently used connections to store in the connection list.
fr: Le nombre maximal de connexions récemment utilisées à stocker dans la liste de connexions.
pt_br: O número máximo de conexões usados recentemente para armazenar na lista de conexão.
ru: Максимальное количество недавно использованных соединений для хранения в списке подключений.
zh_hans: 连接列表中保存的最近使用连接的最大值
zh_hant: 連接列表內最近使用的最大連結數。

# sql.defaultEngineDescription
source: Default SQL Engine to use. This drives default language provider in .sql files and the default to use when creating a new connection. Valid option is currently MSSQL
fr: Moteur SQL par défaut à utiliser. Cela définit le fournisseur de langage par défaut dans les fichiers .sql et la valeur par défaut lorsque vous créez une nouvelle connexion. Une option valide est actuellement MSSQL
pt_br: Mecanismo de SQL padrão para uso. Isso leva o provedor de idioma padrão em arquivos .sql e o padrão para usar ao criar uma nova conexão. Opção válida atualmente é MSSQL
ru: Ядро СУБД, используемое по умолчанию. Оно определяет поставщик языка по умолчанию в файлах .sql и используется по умолчанию при создании новых подключений. Допустимое значение: MSSQL
zh_hans: 要使用的默认SQL引擎。这将驱动.sql文件中的默认语言提供程序，以及创建新连接时使用的默认语言提供程序。有效选项目前是MSSQL
zh_hant: 使用預設 SQL 引擎。在 .sql 檔案預設驅動的預設語言提供者，以及建立新連接時使用的預設設定。有效選項目前為 MSSQL

# connection.parseClipboardForConnectionStringDescription
source: Attempt to parse the contents of the clipboard when the connection dialog is opened or a paste is performed.
pt_br: Tentativa de analisar o conteúdo da área de transferência quando a caixa de diálogo conexão é aberta ou a cópia é executada.
ru: Попытка проанализировать содержимое буфера обмена, когда открыто диалоговое окно подключения или выполняется вставка.
zh_hans: 在打开连接对话框或执行粘贴时尝试解析剪贴板的内容。
zh_hant: 嘗試在連線對話方塊開啟或已執行貼上時剖析剪貼簿的內容。

# sql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
fr: True pour ouvrir le volet de messages par défaut; false pour le fermer
pt_br: Verdadeiro para o painel de mensagens ser aberto por padrão; false para fechado
ru: Состояние панели сообщений по умолчанию: true - открыта; false - закрыта
zh_hans: "true" 时默认开启消息面板；"false" 时默认关闭
zh_hant: 預設 true 為開啟訊息視窗; false 為關閉

# sql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
fr: [Facultatif] Lorsque la valeur est true, les en-têtes de colonnes sont inclus lors de l’enregistrement des résultats en CSV
pt_br: [Opcional] Quando verdadeiro, os cabeçalhos de coluna são incluídos ao salvar os resultados como CSV
ru: [Необязательно] Если этот параметр имеет значение true, то при сохранении результата в файле CSV в файл будут включены заголовки столбцов
zh_hans: [可选] 当为 "true" 时，将在保存结果为 CSV 时包含列标题
zh_hant: [選用] 設定為 true，當另存結果為 CSV 時包含行標題

# sql.saveAsCsv.delimiter
source: [Optional] The custom delimiter to use between values when saving as CSV
fr: [Facultatif] Délimiteur personnalisé à utiliser entre les valeurs durant l'enregistrement au format CSV
pt_br: [Opcional] Delimitador personalizado para ser usado entre valores ao ser salvo como CSV
ru: [Необязательно] Пользовательский разделитель значений при сохранении в формате CSV
zh_hans: [可选] 保存为 CSV 时使用的自定义分隔符
zh_hant: [選擇性] 另存為 CSV 時要在值之間使用的自訂分隔符號

# sql.saveAsCsv.lineSeperator
source: [Optional] Character(s) used for seperating rows when saving results as CSV
fr: [Facultatif] Caractère(s) utilisé(s) pour séparer les lignes durant l’enregistrement des résultats au format CSV
pt_br: [Opcional] Caractere (s) usado para separar linhas ao salvar os resultados como CSV
ru: [Необязательно] Символы, используемые для разделения строк при сохранении результатов в файле CSV
zh_hans: [可选] 将结果保存为CSV文件时，用于分离行的字符 (s)
zh_hant: [可選] 將結果另存為 CSV 時使用斷行字元

# sql.saveAsCsv.textIdentifier
source: [Optional] Character used for enclosing text fields when saving results as CSV
fr: [Facultatif] Caractère utilisé pour entourer les champs de texte durant l'enregistrement des résultats au format CSV
pt_br: [Opcional] Caractere usado para delimitador de campos de texto ao salvar os resultados como CSV
ru: [Необязательно] Символ, используемый для обрамления текстовых полей при сохранении результатов в CSV
zh_hans: [可选]将结果保存为CSV时用于封闭文本字段的字符
zh_hant: [選擇性] 另存結果為 CSV 時要用於括住文字欄位的字元

# sql.saveAsCsv.encoding
source: [Optional] File encoding used when saving results as CSV
fr: [Facultatif] Encodage de fichier utilisé durant l'enregistrement des résultats au format CSV
pt_br: [Opcional] Arquivo de codificação usado ao salvar os resultados como CSV
ru: [Необязательно] Кодировка файла, используемая при сохранении результатов в формате CSV
zh_hans: [可选]将结果保存为 CSV 时使用的文件编码
zh_hant: [選擇性] 另存結果為 CSV 時要使用的檔案編碼

# sql.results.streaming
source: Enable results streaming; contains few minor visual issues
ru: Включить потоковую передачу результатов; имеется несколько небольших проблем с отображением
zh_hant: 啟用結果串流; 包含些許輕微視覺效果問題

# sql.saveAsXml.formatted
source: [Optional] When true, XML output will be formatted when saving results as XML
ru: [Опционально] Если этот параметр имеет значение true, выходные данные XML будут отформатированы при сохранении результатов в виде XML
zh_hant: [選擇性] 若為 true，則會於將結果儲存回 XML 時將輸出格式化

# sql.saveAsXml.encoding
source: [Optional] File encoding used when saving results as XML
ru: [Необязательно] Кодировка файла, которая используется при сохранении результатов в виде XML
zh_hant: [選擇性] 將結果儲存為 XML 時使用檔案編碼

# sql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
fr: [Facultatif] Options de configuration pour la copie des résultats à partir de la Vue Résultats
pt_br: [Opcional] Opções de configuração para copiar os resultados da exibição de resultados
ru: [Необязательно] Параметры конфигурации для копирования результатов из представления результатов
zh_hans: [可选] 从结果视图复制结果的配置选项
zh_hant: [選用] 從結果檢視內複製結果的組態選項

# sql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
fr: [Facultatif] Options de configuration pour la copie de résultats multi-lignes depuis la vue Résultats
pt_br: [Opcional] Opções de configuração para copiar os resultados de várias linhas do modo de exibição de resultados
ru: [Необязательно] Параметры конфигурации для копирования многострочных результатов из представления результатов
zh_hans: [可选]从结果视图中复制多行结果的配置选项
zh_hant: [選用] 從結果檢視內複製多行結果的組態選項

# sql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
fr: [Facultatif] Le temps d’exécution doit-il être indiqué pour chaque lot
pt_br: [Opcional] Tempo de execução deve ser mostrado para lotes individuais
ru: [Опционально] Должно ли время выполнения отображаться для отдельных пакетов
zh_hans: [可选] 是否显示每个批处理的执行时间
zh_hant: [選用] 是否顯示個別批次的執行時間

# defaultChartType
source: [Optional] the default chart type to use when opening Chart Viewer from a Query Results
fr: [Optionnel] le type de graphique par défaut à utiliser lors de l’ouverture de la visionneuse graphique à partir d’un résultat de requête
pt_br: [Opcional] o tipo de gráfico padrão para usar ao abrir o visualizador gráfico dos resultados da consulta
ru: [Необязательно] тип диаграммы по умолчанию, используемый при открытии средства просмотра диаграмм из результатов запроса
zh_hans: [可选] 从查询结果打开图表查看器时要使用的默认图表类型
zh_hant: [選用] 從查詢結果開啟圖表檢視器時使用預設圖表類型

# tabColorMode.off
source: Tab coloring will be disabled
fr: La coloration des onglets sera désactivée
pt_br: Coloração de guia será desativada
ru: Цветовое выделение вкладок будет отключено
zh_hans: 选项卡着色将被禁用
zh_hant: 索引標籤著色將被禁用

# tabColorMode.border
source: The top border of each editor tab will be colored to match the relevant server group
fr: La bordure supérieure de chaque onglet Éditeur sera colorée pour correspondre au groupe concerné
pt_br: Borda superior de cada guia editor irá ser colorida para combinar com o grupo de servidor relevantes
ru: Верхняя граница каждой вкладки редактора будет окрашена в цвет соответствующей группы серверов
zh_hans: 每个编辑器选项卡的上边框将被着色以匹配相关的服务器组
zh_hant: 在每個編輯器索引標籤的上邊框著上符合相關的伺服器群組的顏色

# tabColorMode.fill
source: Each editor tab's background color will match the relevant server group
fr: La couleur de fond de chaque onglet d'édition correspondra au groupe de serveurs concerné
pt_br: Cor de fundo de cada editor do guia irá corresponder o grupo relevante no servidor
ru: Цвет фона каждой вкладки редактора будет соответствовать связанной группе серверов
zh_hans: 每个编辑器选项卡的背景颜色将与相关的服务器组匹配
zh_hant: 每個編輯器索引標籤的背景顏色將與相關的伺服器群組相符

# tabColorMode
source: Controls how to color tabs based on the server group of their active connection
fr: Contrôle comment coloriser les onglets en fonction du groupe de serveurs de leur connexion active
pt_br: Controla como colorir as abas com base no grupo de servidores de sua conexão ativa
ru: Управляет тем, как определяются цвета вкладок на основе группы серверов активного подключения
zh_hans: 控制如何根据活动连接的服务器组为选项卡着色
zh_hant: 依據連接的伺服器群組控制索引頁籤如何著色

# showConnectionInfoInTitle
source: Controls whether to show the connection info for a tab in the title.
pt_br: Controla se deseja mostrar a informação de conexão para uma guia no título.
ru: Управляет тем, следует ли отображать сведения о подключении для вкладки в заголовке.
zh_hans: 控制是否显示标题中选项卡的连接信息。
zh_hant: 控制是否要在標題中顯示索引標籤的連線資訊。

# sql.promptToSaveGeneratedFiles
source: Prompt to save generated SQL files
ru: Запрашивать сохранение созданных файлов SQL
zh_hant: 提示儲存產生的 SQL 檔案

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
fr: L'IntelliSense doit-il être activé
pt_br: O IntelliSense deve ser habilitado
ru: Должен ли быть включен IntelliSense
zh_hans: 是否应启用智能感知
zh_hant: 是否啟用IntelliSense

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
fr: La vérification des erreurs à travers IntelliSense doit-elle être activée
pt_br: Verificação de erros de IntelliSense devem ser habilitados?
ru: Должна ли быть включена проверка ошибок IntelliSense
zh_hans: 是否开启IntelliSense错误检查
zh_hant: 是否啟用 IntelliSense 錯誤檢查

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
fr: Spécifie si les suggestions IntelliSense doivent être activées
pt_br: Sugestões de IntelliSense devem ser habilitados?
ru: Должны ли быть включены подсказки IntelliSense
zh_hans: 是否应启用智能感知建议
zh_hant: 是否啟用 IntelliSense 建議

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
fr: Spécifie si les infos rapides IntelliSense doivent être activées
pt_br: Devem ser habilitada para IntelliSense informações rápidas
ru: Должны ли быть включены краткие сведения IntelliSense
zh_hans: 是否开启IntelliSense快速信息
zh_hant: 是否啟用 IntelliSense 快速諮詢

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
fr: Spécifie si les suggestions IntelliSense doivent être en minuscules
pt_br: IntelliSense sugestões devem ser em letras minúsculas
ru: Следует ли подсказкам IntelliSense использовать строчные буквы
zh_hans: 是否小写显示IntelliSense建议
zh_hant: 是否設定 IntelliSense 建議為小寫
