{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"SchemaCompare.Aggregates": "Статистические выражения",
			"SchemaCompare.AllowDropBlockingAssemblies": "Разрешить удаление блокирующих сборок",
			"SchemaCompare.AllowIncompatiblePlatform": "Разрешить несовместимые платформы",
			"SchemaCompare.AllowUnsafeRowLevelSecurityDataMovement": "Разрешить небезопасное перемещение данных безопасности на уровне строк",
			"SchemaCompare.ApplicationRoles": "Роли приложений",
			"SchemaCompare.Assemblies": "Сборки",
			"SchemaCompare.AssemblyFiles": "Файлы сборки",
			"SchemaCompare.AsymmetricKeys": "Асимметричные ключи",
			"SchemaCompare.Audits": "Аудиты",
			"SchemaCompare.BackupDatabaseBeforeChanges": "Создать резервную копию базы данных перед изменением",
			"SchemaCompare.BlockOnPossibleDataLoss": "Блокировать при возможной потере данных",
			"SchemaCompare.BlockWhenDriftDetected": "Блокировать при обнаружении смещения",
			"SchemaCompare.BrokerPriorities": "Приоритеты компонента Service Broker",
			"SchemaCompare.Certificates": "Сертификаты",
			"SchemaCompare.ClrUserDefinedTypes": "Определяемые пользователем типы данных CLR",
			"SchemaCompare.ColumnEncryptionKeys": "Ключи шифрования столбца",
			"SchemaCompare.ColumnMasterKeys": "Главные ключи столбцов",
			"SchemaCompare.CommentOutSetVarDeclarations": "Закомментировать объявления заданных переменных",
			"SchemaCompare.CompareUsingTargetCollation": "Сравнивать с помощью параметров сортировки целевого объекта",
			"SchemaCompare.Contracts": "Контракты",
			"SchemaCompare.CreateNewDatabase": "Создать базу данных",
			"SchemaCompare.Credentials": "Учетные данные",
			"SchemaCompare.CryptographicProviders": "Поставщики служб шифрования",
			"SchemaCompare.DatabaseAuditSpecifications": "Спецификации аудита базы данных",
			"SchemaCompare.DatabaseEncryptionKeys": "Ключи шифрования базы данных",
			"SchemaCompare.DatabaseOptions": "Параметры базы данных",
			"SchemaCompare.DatabaseRoles": "Роли базы данных",
			"SchemaCompare.DatabaseScopedCredentials": "Учетные данные для базы данных",
			"SchemaCompare.DatabaseTriggers": "Триггеры базы данных",
			"SchemaCompare.Defaults": "Значения по умолчанию",
			"SchemaCompare.DeployDatabaseInSingleUserMode": "Развернуть базу данных в однопользовательском режиме",
			"SchemaCompare.Description.AllowDropBlockingAssemblies": "Это свойство используется развертыванием SqlClr, чтобы выполнять удаление блокирующих сборок в рамках плана развертывания. По умолчанию любая блокирующая/ссылающаяся сборка блокирует обновление сборки, если ссылающуюся сборку необходимо удалить.",
			"SchemaCompare.Description.AllowIncompatiblePlatform": "Определяет, будет ли выполняться действие в случае несовместимости платформ SQL Server.",
			"SchemaCompare.Description.AllowUnsafeRowLevelSecurityDataMovement": "Не блокировать перемещение данных в таблице с безопасностью на уровне строк, если свойство имеет значение TRUE. Значение по умолчанию — FALSE.",
			"SchemaCompare.Description.BackupDatabaseBeforeChanges": "Создает резервную копию базы данных перед развертыванием любых изменений.",
			"SchemaCompare.Description.BlockOnPossibleDataLoss": "Указывает, что следует завершать эпизод публикации, если есть возможность потери данных в результате операции публикации.",
			"SchemaCompare.Description.BlockWhenDriftDetected": "Указывает, блокировать ли обновление базы данных, схема которой больше не соответствует ее регистрации или является незарегистрированной.",
			"SchemaCompare.Description.CommentOutSetVarDeclarations": "Указывает, нужно ли заключать в комментарий объявление переменных SETVAR в формируемом скрипте публикации. Так можно делать, если эти значения планируется указывать в командной строке при публикации с помощью программы, подобной SQLCMD.EXE.",
			"SchemaCompare.Description.CompareUsingTargetCollation": "Этот параметр указывает, как обрабатывать параметры сортировки базы данных при развертывании. По умолчанию параметры сортировки целевой базы данных будут обновлены, если они не соответствуют аналогичным параметрам, указанным в источнике. Когда этот параметр задан, требуется использовать параметры сортировки целевой базы данных (или сервера).",
			"SchemaCompare.Description.CreateNewDatabase": "Определяет, должна ли целевая база обновляться или удаляться и создаваться повторно при публикации в базе данных.",
			"SchemaCompare.Description.DeployDatabaseInSingleUserMode": "Если задано значение TRUE, то перед развертыванием база данных переводится в однопользовательский режим.",
			"SchemaCompare.Description.DisableAndReenableDdlTriggers": "Определяет, отключаются ли триггеры языка описания данных DDL в начале процесса публикации с повторным включением по завершении действия публикации.",
			"SchemaCompare.Description.DoNotAlterChangeDataCaptureObjects": "Если этот параметр имеет значение TRUE, объекты отслеживания измененных данных не изменяются.",
			"SchemaCompare.Description.DoNotAlterReplicatedObjects": "Указывает, определяются ли во время проверки реплицируемые объекты.",
			"SchemaCompare.Description.DropConstraintsNotInSource": "Определяет, будут ли ограничения, которые не существуют в моментальном снимке базы данных (.dacpac), удаляться из целевой базы данных при публикации в базе данных.",
			"SchemaCompare.Description.DropDmlTriggersNotInSource": "Определяет, будут ли триггеры DML, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации в базе данных.",
			"SchemaCompare.Description.DropExtendedPropertiesNotInSource": "Определяет, будут ли расширенные свойства, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации в базе данных.",
			"SchemaCompare.Description.DropIndexesNotInSource": "Определяет, будут ли индексы, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации в базе данных.",
			"SchemaCompare.Description.DropObjectsNotInSource": "Указывает, будут ли объекты, которые отсутствуют в файле моментального снимка базы данных (DACPAC), удалены из целевой базы данных при публикации в базе данных. Данное значение имеет приоритет над DropExtendedProperties.",
			"SchemaCompare.Description.DropPermissionsNotInSource": "Определяет, будут ли разрешения, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации обновлений в базе данных.",
			"SchemaCompare.Description.DropRoleMembersNotInSource": "Определяет, будут ли члены ролей, которые не определены в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации обновлений в базе данных.</",
			"SchemaCompare.Description.DropStatisticsNotInSource": "Указывает, будет ли статистика, которая не существует в файле моментального снимка базы данных (DACPAC), удалена из целевой базы данных при выполнении публикации в нее.",
			"SchemaCompare.Description.GenerateSmartDefaults": "Автоматически предоставляет значение по умолчанию при обновлении таблицы данных со столбцом, который не допускает значения NULL.",
			"SchemaCompare.Description.IgnoreAnsiNulls": "Определяет, пропускаются или обновляются различия в параметре ANSI NULLS при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreAuthorizer": "Определяет, пропускаются или обновляются различия в Authorizer при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreColumnCollation": "Определяет, пропускаются или обновляются различия в параметрах сортировки столбцов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreColumnOrder": "Указывает, следует ли игнорировать или обновлять различия в порядке столбцов таблицы при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreComments": "Определяет, пропускаются или обновляются различия в комментариях при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreCryptographicProviderFilePath": "Определяет, пропускаются или обновляются различия в пути к файлам для поставщика служб шифрования при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreDdlTriggerOrder": "Определяет, пропускаются или обновляются различия в порядке триггеров языка описания данных DDL при публикации в базе данных или на сервере.",
			"SchemaCompare.Description.IgnoreDdlTriggerState": "Определяет, пропускаются или обновляются различия в состоянии (включен-выключен) триггеров языка описания данных DDL при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreDefaultSchema": "Определяет, пропускаются или обновляются различия в схеме по умолчанию при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreDmlTriggerOrder": "Определяет, пропускаются или обновляются различия в порядке триггеров языка обработки данных Data Manipulation Language (DML) при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreDmlTriggerState": "Определяет, пропускаются или обновляются различия в состоянии (включен-выключен) триггеров DML при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreExtendedProperties": "Указывает, следует ли игнорировать расширенные свойства.",
			"SchemaCompare.Description.IgnoreFileAndLogFilePath": "Определяет, пропускаются или обновляются различия в путях к файлам и файлам журнала при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreFileSize": "Определяет, создается ли предупреждение о различиях в размерах файлов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreFilegroupPlacement": "Определяет, пропускаются или обновляются различия в размещении объектов в файловых группах FILEGROUP при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreFillFactor": "Определяет, создается ли предупреждение о различиях в коэффициенте заполнения для хранилища индексов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreFullTextCatalogFilePath": "Определяет, создается ли предупреждение о различиях в пути к файлам для полнотекстового каталога при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreIdentitySeed": "Определяет, пропускаются или обновляются различия в начальном значении для столбца идентификаторов при публикации обновлений в базе данных.",
			"SchemaCompare.Description.IgnoreIncrement": "Определяет, пропускаются или обновляются различия в шаге приращения для столбца идентификаторов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreIndexOptions": "Определяет, пропускаются или обновляются различия в параметрах индексов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreIndexPadding": "Определяет, пропускаются или обновляются различия в заполнении индекса при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreKeywordCasing": "Определяет, пропускаются или обновляются различия в регистре ключевых слов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreLockHintsOnIndexes": "Определяет, пропускаются или обновляются различия в указаниях блокировки для индексов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreLoginSids": "Определяет, пропускаются или обновляются различия в идентификаторе безопасности (SID) при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreNotForReplication": "Определяет, пропускаются или обновляются параметры \"не для репликации\" при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreObjectPlacementOnPartitionScheme": "Определяет, пропускается или обновляется размещение объекта в схеме секционирования при публикации в базе данных.",
			"SchemaCompare.Description.IgnorePartitionSchemes": "Определяет, пропускаются или обновляются различия в схемах и функциях секционирования при публикации в базе данных.",
			"SchemaCompare.Description.IgnorePermissions": "Указывает, следует ли игнорировать разрешения.",
			"SchemaCompare.Description.IgnoreQuotedIdentifiers": "Определяет, пропускаются или обновляются различия в параметре заключенных в кавычки идентификаторов при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreRoleMembership": "Определяет, пропускаются или обновляются различия в членстве в ролях для имен входа при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreRouteLifetime": "Определяет, пропускаются или обновляются различия в продолжительности периода, в течение которого SQL Server сохраняет маршрут в таблице маршрутизации, при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreSemicolonBetweenStatements": "Определяет, пропускаются или обновляются различия в точках с запятой между инструкциями T-SQL при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreTableOptions": "Определяет, пропускаются или обновляются различия в параметрах таблиц при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreUserSettingsObjects": "Определяет, пропускаются или обновляются различия в объектах параметров пользователя при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreWhitespace": "Определяет, пропускаются или обновляются различия в пробелах при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreWithNocheckOnCheckConstraints": "Определяет, пропускаются или обновляются различия в значении предложения WITH NOCHECK для проверочных ограничений при публикации в базе данных.",
			"SchemaCompare.Description.IgnoreWithNocheckOnForeignKeys": "Определяет, пропускаются или обновляются различия в значении предложения WITH NOCHECK для внешних ключей при публикации в базе данных.",
			"SchemaCompare.Description.IncludeCompositeObjects": "Включить все составные элементы в единую операцию публикации.",
			"SchemaCompare.Description.IncludeTransactionalScripts": "Определяет, будут ли по возможности использоваться инструкции транзакций при публикации в базе данных.",
			"SchemaCompare.Description.NoAlterStatementsToChangeClrTypes": "Указывает, что при обнаружении различий в процессе публикации всегда следует удалять и повторно создавать сборку, а не использовать инструкцию ALTER ASSEMBLY.",
			"SchemaCompare.Description.PopulateFilesOnFileGroups": "Указывает, будет ли также создан файл при создании файловой группы FileGroup в целевой базе данных.",
			"SchemaCompare.Description.RegisterDataTierApplication": "Указывает, регистрируется ли схема на сервере базы данных.",
			"SchemaCompare.Description.RunDeploymentPlanExecutors": "Указывает, должны ли участники DeploymentPlanExecutor запускаться при выполнении других операций.",
			"SchemaCompare.Description.ScriptDatabaseCollation": "Указывает, будут пропускаться или обновляться различия в параметрах сортировки базы данных при выполнении публикации в нее.",
			"SchemaCompare.Description.ScriptDatabaseCompatibility": "Определяет, пропускаются или обновляются различия в уровне совместимости базы данных при публикации в базе данных.",
			"SchemaCompare.Description.ScriptDatabaseOptions": "Определяет, будут ли свойства целевой базы данных задаваться или обновляться в рамках действия публикации.",
			"SchemaCompare.Description.ScriptDeployStateChecks": "Определяет, создаются ли инструкции в скрипте публикации, чтобы проверить соответствие имен базы данных и сервера с именами, указанными в проекте базы данных.",
			"SchemaCompare.Description.ScriptFileSize": "Определяет, указывается ли размер при добавлении файла в файловую группу filegroup.",
			"SchemaCompare.Description.ScriptNewConstraintValidation": "В конце публикации все ограничения будут проверяться как один набор, что позволяет избежать ошибок данных, вызванных проверочным ограничением или ограничением внешнего ключа в середине публикации. Если задано значение FALSE, то ограничения будут публиковаться без проверки соответствующих данных.",
			"SchemaCompare.Description.ScriptRefreshModule": "Включать инструкции обновления в конец скрипта публикации.",
			"SchemaCompare.Description.TreatVerificationErrorsAsWarnings": "Определяет, будут ли ошибки, обнаруженные при проверке публикации, обрабатываться как предупреждения. Проверка созданного плана развертывания проводится до его выполнения в целевой базе данных. При проверке плана обнаруживаются такие проблемы, как потеря объектов, которые существуют только в целевой базе данных (например, индексы) и которые необходимо удалить для внесения изменения. Также выявляются ситуации, в которых зависимые объекты (например, таблицы и представления) должны существовать из-за ссылки на составной проект, но не существуют в целевой базе данных. Выбрав этот вариант, можно получить полный список проблем, а не прекращать действие публикации после первой ошибки.",
			"SchemaCompare.Description.UnmodifiableObjectWarnings": "Определяет, должны ли формироваться предупреждения в тех случаях, когда обнаруживаются различия в объектах, которые нельзя изменить, например в размерах файлов или в том случае, когда к файлу указаны разные пути.",
			"SchemaCompare.Description.VerifyCollationCompatibility": "Указывает, проверяется ли совместимость параметров сортировки.",
			"SchemaCompare.Description.VerifyDeployment": "Определяет, должны ли перед публикацией выполняться проверки, останавливающие действие публикации, если обнаружатся проблемы, которые могут помешать успешной публикации. Например, действие публикации может остановиться, если в целевой базе данных существуют внешние ключи, которые не существуют в проекте базы данных (это вызовет ошибки при публикации).",
			"SchemaCompare.DisableAndReenableDdlTriggers": "Отключить и снова включить триггеры DDL",
			"SchemaCompare.DoNotAlterChangeDataCaptureObjects": "Не выполнять операцию ALTER для объектов отслеживания измененных данных",
			"SchemaCompare.DoNotAlterReplicatedObjects": "Не изменяйте реплицированные объекты",
			"SchemaCompare.DropConstraintsNotInSource": "Удалить ограничения, отсутствующие в источнике",
			"SchemaCompare.DropDmlTriggersNotInSource": "Удалить триггеры DML, отсутствующие в источнике",
			"SchemaCompare.DropExtendedPropertiesNotInSource": "Удалить расширенные свойства, отсутствующие в источнике",
			"SchemaCompare.DropIndexesNotInSource": "Удалить индексы, отсутствующие в источнике",
			"SchemaCompare.DropObjectsNotInSource": "Удалить объекты, отсутствующие в источнике",
			"SchemaCompare.DropPermissionsNotInSource": "Удалить разрешения, отсутствующие в источнике",
			"SchemaCompare.DropRoleMembersNotInSource": "Удалить члены ролей, отсутствующие в источнике",
			"SchemaCompare.DropStatisticsNotInSource": "Удалить статистику, отсутствующую в источнике",
			"SchemaCompare.Endpoints": "Конечные точки",
			"SchemaCompare.ErrorMessages": "Сообщения об ошибках",
			"SchemaCompare.EventNotifications": "Уведомления о событиях",
			"SchemaCompare.EventSessions": "Сеансы событий",
			"SchemaCompare.ExtendedProperties": "Расширенные свойства",
			"SchemaCompare.ExternalDataSources": "Источники внешних данных",
			"SchemaCompare.ExternalFileFormats": "Форматы внешних файлов",
			"SchemaCompare.ExternalStreamingJobs": "Задания внешней потоковой передачи",
			"SchemaCompare.ExternalStreams": "Внешние потоки",
			"SchemaCompare.ExternalTables": "Внешние таблицы",
			"SchemaCompare.FileTables": "Таблицы файлов",
			"SchemaCompare.Filegroups": "Файловые группы",
			"SchemaCompare.Files": "Файлы",
			"SchemaCompare.FullTextCatalogs": "Полнотекстовые каталоги",
			"SchemaCompare.FullTextStoplists": "Полнотекстовые списки стоп-слов",
			"SchemaCompare.GeneralOptionsLabel": "Общие параметры",
			"SchemaCompare.GenerateSmartDefaults": "Создание интеллектуальных умолчаний",
			"SchemaCompare.IgnoreAnsiNulls": "Игнорировать AnsiNulls",
			"SchemaCompare.IgnoreAuthorizer": "Игнорировать операции авторизации",
			"SchemaCompare.IgnoreColumnCollation": "Игнорировать параметры сортировки столбцов",
			"SchemaCompare.IgnoreColumnOrder": "Игнорировать порядок столбцов",
			"SchemaCompare.IgnoreComments": "Игнорировать комментарии",
			"SchemaCompare.IgnoreCryptographicProviderFilePath": "Игнорировать путь к файлу поставщика служб шифрования",
			"SchemaCompare.IgnoreDdlTriggerOrder": "Игнорировать порядок триггеров DDL",
			"SchemaCompare.IgnoreDdlTriggerState": "Игнорировать состояние триггеров DDL",
			"SchemaCompare.IgnoreDefaultSchema": "Игнорировать схему по умолчанию",
			"SchemaCompare.IgnoreDmlTriggerOrder": "Игнорировать порядок триггеров DML",
			"SchemaCompare.IgnoreDmlTriggerState": "Игнорировать состояние триггеров DML",
			"SchemaCompare.IgnoreExtendedProperties": "Игнорировать расширенные свойства",
			"SchemaCompare.IgnoreFileAndLogFilePath": "Игнорировать путь к файлу и файлу журнала",
			"SchemaCompare.IgnoreFileSize": "Игнорировать размер файла",
			"SchemaCompare.IgnoreFilegroupPlacement": "Игнорировать размещение файловой группы",
			"SchemaCompare.IgnoreFillFactor": "Игнорировать коэффициент заполнения",
			"SchemaCompare.IgnoreFullTextCatalogFilePath": "Игнорировать путь к файлу полнотекстового каталога",
			"SchemaCompare.IgnoreIdentitySeed": "Игнорировать начальное значение IDENTITY",
			"SchemaCompare.IgnoreIncrement": "Игнорировать приращение",
			"SchemaCompare.IgnoreIndexOptions": "Игнорировать параметры индекса",
			"SchemaCompare.IgnoreIndexPadding": "Игнорировать заполнение индекса",
			"SchemaCompare.IgnoreKeywordCasing": "Игнорировать регистр ключевых слов",
			"SchemaCompare.IgnoreLockHintsOnIndexes": "Игнорировать указания блокировки для индексов",
			"SchemaCompare.IgnoreLoginSids": "Игнорировать идентификаторы SID имени входа",
			"SchemaCompare.IgnoreNotForReplication": "Игнорировать указание \"Не для репликации\"",
			"SchemaCompare.IgnoreObjectPlacementOnPartitionScheme": "Пропускать размещение объекта в схеме секционирования",
			"SchemaCompare.IgnorePartitionSchemes": "Игнорировать схемы секционирования",
			"SchemaCompare.IgnorePermissions": "Игнорировать разрешения",
			"SchemaCompare.IgnoreQuotedIdentifiers": "Игнорировать нестандартные идентификаторы",
			"SchemaCompare.IgnoreRoleMembership": "Игнорировать членство в роли",
			"SchemaCompare.IgnoreRouteLifetime": "Игнорировать время существования маршрута",
			"SchemaCompare.IgnoreSemicolonBetweenStatements": "Игнорировать точки с запятой между инструкциями",
			"SchemaCompare.IgnoreTableOptions": "Игнорировать параметры таблицы",
			"SchemaCompare.IgnoreUserSettingsObjects": "Игнорировать объекты параметров пользователей",
			"SchemaCompare.IgnoreWhitespace": "Игнорировать пробелы",
			"SchemaCompare.IgnoreWithNocheckOnCheckConstraints": "Игнорировать со значением \"Без проверки\" для параметра \"Проверочные ограничения\"",
			"SchemaCompare.IgnoreWithNocheckOnForeignKeys": "Игнорировать со значением Nocheck для ForeignKeys",
			"SchemaCompare.IncludeCompositeObjects": "Включить составные объекты",
			"SchemaCompare.IncludeTransactionalScripts": "Включить транзакционные сценарии",
			"SchemaCompare.LinkedServerLogins": "Имена входа на связанный сервер",
			"SchemaCompare.LinkedServers": "Связанные серверы",
			"SchemaCompare.Logins": "Имена для входа",
			"SchemaCompare.MasterKeys": "Главные ключи",
			"SchemaCompare.MessageTypes": "Типы сообщений",
			"SchemaCompare.NoAlterStatementsToChangeClrTypes": "Не использовать инструкции ALTER для изменения типов CLR",
			"SchemaCompare.ObjectTypesOptionsLabel": "Включить типы объектов",
			"SchemaCompare.PartitionFunctions": "Функции секционирования",
			"SchemaCompare.PartitionSchemes": "Схемы секционирования",
			"SchemaCompare.Permissions": "Разрешения",
			"SchemaCompare.PopulateFilesOnFileGroups": "Заполнить файл в группах файлов",
			"SchemaCompare.Queues": "Очереди",
			"SchemaCompare.RegisterDataTierApplication": "Регистрация приложения DataTier",
			"SchemaCompare.RemoteServiceBindings": "Привязки удаленных служб",
			"SchemaCompare.RoleMembership": "Членство в роли",
			"SchemaCompare.Routes": "Маршруты",
			"SchemaCompare.Rules": "Правила",
			"SchemaCompare.RunDeploymentPlanExecutors": "Запустить исполнители плана развертывания",
			"SchemaCompare.ScalarValuedFunctions": "Скалярные функции",
			"SchemaCompare.SchemaCompareOptionsDialogLabel": "Параметры Сравнения схем",
			"SchemaCompare.ScriptDatabaseCollation": "Параметры сортировки базы данных сценариев",
			"SchemaCompare.ScriptDatabaseCompatibility": "Совместимость базы данных сценариев",
			"SchemaCompare.ScriptDatabaseOptions": "Параметры базы данных сценариев",
			"SchemaCompare.ScriptDeployStateChecks": "Проверки состояния для развертывания сценария",
			"SchemaCompare.ScriptFileSize": "Размер файла сценария",
			"SchemaCompare.ScriptNewConstraintValidation": "Проверка новых ограничений для сценария",
			"SchemaCompare.ScriptRefreshModule": "Модуль обновления сценария",
			"SchemaCompare.SearchPropertyLists": "Списки свойств поиска",
			"SchemaCompare.SecurityPolicies": "Политики безопасности",
			"SchemaCompare.Sequences": "Последовательности",
			"SchemaCompare.ServerAuditSpecifications": "Спецификации аудита сервера",
			"SchemaCompare.ServerRoleMembership": "Участие в роли сервера",
			"SchemaCompare.ServerRoles": "Роли сервера",
			"SchemaCompare.ServerTriggers": "Триггеры сервера",
			"SchemaCompare.Services": "Службы",
			"SchemaCompare.Signatures": "Подписи",
			"SchemaCompare.StoredProcedures": "Хранимые процедуры",
			"SchemaCompare.SymmetricKeys": "Симметричные ключи",
			"SchemaCompare.Synonyms": "Синонимы",
			"SchemaCompare.TableValuedFunctions": "Функции с табличным значением",
			"SchemaCompare.Tables": "Таблицы",
			"SchemaCompare.TreatVerificationErrorsAsWarnings": "Рассматривать ошибки проверок как предупреждения",
			"SchemaCompare.UnmodifiableObjectWarnings": "Предупреждения о невозможности изменения объекта",
			"SchemaCompare.UserDefinedDataTypes": "Определяемые пользователем типы данных",
			"SchemaCompare.UserDefinedTableTypes": "Определяемые пользователем табличные типы",
			"SchemaCompare.Users": "Пользователи",
			"SchemaCompare.VerifyCollationCompatibility": "Проверить совместимость параметров сортировки",
			"SchemaCompare.VerifyDeployment": "Проверить развертывание",
			"SchemaCompare.Views": "Представления",
			"SchemaCompare.XmlSchemaCollections": "Коллекции схем XML",
			"SchemaCompareOptionsDialog.Reset": "Сброс",
			"schemaCompare.ApplyConfirmation": "Вы действительно хотите обновить целевой объект?",
			"schemaCompare.CompareDetailsTitle": "Сравнить сведения",
			"schemaCompare.GetConnectionString": "Установить подключение к {0}?",
			"schemaCompare.RecompareToRefresh": "Нажмите \"Сравнить\", чтобы обновить сравнение.",
			"schemaCompare.actionColumn": "Действие",
			"schemaCompare.addAction": "Добавить",
			"schemaCompare.applyButtonDisabledTitle": "Применение включено, когда целевой объект является базой данных",
			"schemaCompare.applyButtonEnabledTitle": "Применить изменения к целевому объекту",
			"schemaCompare.applyNoChanges": "Нет изменений для применения",
			"schemaCompare.cancelCompareButton": "Остановить",
			"schemaCompare.cancelErrorMessage": "Сбой при отмене сравнения схем: \"{0}\"",
			"schemaCompare.cannotExcludeMessage": "Невозможно исключить {0}. Существуют включенные зависимости",
			"schemaCompare.cannotExcludeMessageWithDependent": "Невозможно исключить {0}. Существуют включенные зависимости, например {1}",
			"schemaCompare.cannotIncludeMessage": "Невозможно включить {0}. Существуют исключенные зависимости",
			"schemaCompare.cannotIncludeMessageWithDependent": "Невозможно включить {0}. Существуют исключенные зависимости, например {1}",
			"schemaCompare.changeAction": "Изменить",
			"schemaCompare.compareButton": "Сравнить",
			"schemaCompare.compareErrorMessage": "Сбой при сравнении схем: {0}",
			"schemaCompare.dacpacRadioButtonLabel": "Файл приложения уровня данных (DACPAC)",
			"schemaCompare.databaseButtonLabel": "База данных",
			"schemaCompare.deleteAction": "Удалить",
			"schemaCompare.dialogTitle": "Сравнение схем",
			"schemaCompare.differencesTableTitle": "Сравнение между исходным и целевым объектами",
			"schemaCompare.generateScriptButton": "Создать сценарий",
			"schemaCompare.generateScriptButtonDisabledTitle": "Создание сценария включено, когда целевой объект является базой данных",
			"schemaCompare.generateScriptEnabledButton": "Создать сценарий для развертывания изменений в целевом объекте",
			"schemaCompare.generateScriptErrorMessage": "Сбой при создании сценария: \"{0}\"",
			"schemaCompare.generateScriptNoChanges": "Нет изменений в сценарии",
			"schemaCompare.includeColumnName": "Включить",
			"schemaCompare.includeExcludeInfoMessage": "Обратите внимание, что операции включения и исключения могут занять некоторое время, чтобы вычислить затронутые зависимости",
			"schemaCompare.noDifferences": "Различия в схемах не найдены.",
			"schemaCompare.openFile": "Открыть",
			"schemaCompare.openScmpButton": "Открыть файл SCMP",
			"schemaCompare.openScmpButtonTitle": "Загрузить источник, целевой объект и параметры, сохраненные в файле SCMP",
			"schemaCompare.openScmpErrorMessage": "Сбой при открытии файла SCMP: \"{0}\"",
			"schemaCompare.optionsButton": "Параметры",
			"schemaCompare.radioButtonsLabel": "Тип",
			"schemaCompare.saveFile": "Сохранить",
			"schemaCompare.saveScmpButton": "Сохранить файл SCMP",
			"schemaCompare.saveScmpButtonTitle": "Сохранить источник, целевой объект, параметры и исключенные элементы",
			"schemaCompare.saveScmpErrorMessage": "Сбой при сохранении файла SCMP: \"{0}\"",
			"schemaCompare.selectConnection": "Выберите подключение",
			"schemaCompare.selectSourceFile": "Выберите исходный файл",
			"schemaCompare.selectTargetFile": "Выберите целевой файл",
			"schemaCompare.sourceButtonTitle": "Выбор источника",
			"schemaCompare.sourceNameColumn": "Имя источника",
			"schemaCompare.startText": "Чтобы сравнить две схемы, сначала выберите исходную и целевую схему, а затем нажмите кнопку \"Сравнить\".",
			"schemaCompare.switchButtonTitle": "Поменять местами источник и назначение",
			"schemaCompare.switchDirectionButton": "Сменить направление",
			"schemaCompare.targetButtonTitle": "Выберите целевой объект",
			"schemaCompare.targetNameColumn": "Имя цели",
			"schemaCompare.typeColumn": "Тип",
			"schemaCompare.updateButton": "Применить",
			"schemaCompare.updateErrorMessage": "Сбой при применении Сравнения схем \"{0}\"",
			"schemaCompare.waitText": "Инициализация сравнения. Это может занять некоторое время.",
			"schemaCompareDialog.No": "Нет",
			"schemaCompareDialog.SourceTitle": "Исходная база данных",
			"schemaCompareDialog.TargetTitle": "Целевой объект",
			"schemaCompareDialog.Yes": "Да",
			"schemaCompareDialog.cancel": "Отмена",
			"schemaCompareDialog.databaseDropdownTitle": "База данных",
			"schemaCompareDialog.defaultUser": "По умолчанию",
			"schemaCompareDialog.differentSourceMessage": "Выбрана другая исходная схема. Выполнить сравнение для просмотра его результатов?",
			"schemaCompareDialog.differentSourceTargetMessage": "Выбраны другие исходная и целевая схемы. Выполнить сравнение для просмотра его результатов?",
			"schemaCompareDialog.differentTargetMessage": "Выбрана другая целевая схема. Выполнить сравнение для просмотра его результатов?",
			"schemaCompareDialog.fileTextBoxLabel": "Файл",
			"schemaCompareDialog.ok": "ОК",
			"schemaCompareDialog.serverDropdownTitle": "Сервер",
			"schemaCompareDialog.sourceDatabaseDropdown": "Исходная база данных",
			"schemaCompareDialog.sourceServerDropdown": "Исходный сервер",
			"schemaCompareDialog.sourceTextBox": "Исходный файл",
			"schemaCompareDialog.targetDatabaseDropdown": "Целевая база данных",
			"schemaCompareDialog.targetServerDropdown": "Целевой сервер",
			"schemaCompareDialog.targetTextBox": "Целевой файл",
			"schemaCompareOptions.RecompareMessage": "Параметры изменились. Выполнить повторное сравнение для просмотра его результатов?"
		},
		"package": {
			"description": "Сравнение схем SQL для Azure Data Studio поддерживает сравнение схем баз данных и файлов DACPAC.",
			"displayName": "Сравнение схем SQL Server",
			"schemaCompare.start": "Сравнение схем"
		}
	}
}