{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Continue to GitHub": "Перейти в GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Перейдите в GitHub, чтобы создать личный маркер доступа",
			"Copy & Continue to GitHub": "Копировать и продолжить в GitHub",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "URI сервера GitHub Enterprise не является допустимым URI: {0}",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Проблемы со входом? Хотите попробовать другой способ? ({0})",
			"No": "Нет",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Откройте [{0}]({0}) на новой вкладке и вставьте одноразовый код: {1}",
			"Sign in failed: {0}": "Не удалось войти: {0}",
			"Sign out failed: {0}": "Не удалось выйти: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Выполняется вход в {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Чтобы завершить проверку подлинности, перейдите в GitHub и вставьте приведенный выше одноразовый код.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Чтобы завершить проверку подлинности, перейдите в GitHub для создания личного маркера доступа, а затем вставьте личный маркер доступа в поле ввода.",
			"Yes": "Да",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Вы еще не завершили авторизацию этого расширения для использования GitHub. Хотите попробовать другой способ? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Ваш код: {0}",
			"device code": "код устройства",
			"local server": "локальный сервер",
			"personal access token": "личный маркер доступа",
			"url handler": "обработчик URL-адресов"
		},
		"package": {
			"description": "Поставщик проверки подлинности GitHub",
			"displayName": "Проверка подлинности GitHub"
		}
	}
}