{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"azdata.displayName": "Interfaccia della riga di comando di Azure Data",
			"azdata.description": "Supporto per l’Interfaccia della riga di comando di Azure Data.",
			"azdata.config.title": "Configurazione dell'interfaccia della riga di comando di Azure Data",
			"azdata.config.debug": "Registrare le informazioni di debug nel canale di output per tutti i comandi azdata eseguiti",
			"command.category": "Interfaccia della riga di comando di Azure Data",
			"azdata.acceptEula.command.name": "Accetta le Condizioni di licenza",
			"azdata.install.command.name": "Installa",
			"azdata.update.command.name": "Controllare la disponibilità di aggiornamenti",
			"azdata.category": "Interfaccia della riga di comando di Azure Data",
			"azdata.acceptEula.description": "Scegliere l'operazione di accettazione del contratto di licenza per l'interfaccia della riga di comando di Azure Data",
			"azdata.acceptEula.prompt.description": "All'utente verrà richiesta l'accettazione del contratto di licenza per l'interfaccia della riga di comando di Azure Data",
			"azdata.acceptEula.dontPrompt.description": "All'utente non verrà richiesta l'accettazione del contratto di licenza per l'interfaccia della riga di comando di Azure Data",
			"azdata.install.description": "Scegliere l'operazione di installazione dell'interfaccia della riga di comando di Azure Data",
			"azdata.install.prompt.description": "All'utente verrà richiesta l’installazione dell’interfaccia della riga di comando di Azure Data",
			"azdata.install.dontPrompt.description": "All'utente non verrà richiesta l’installazione dell’interfaccia della riga di comando di Azure Data",
			"azdata.update.description": "Consente di scegliere se verrà richiesto quando è disponibile un aggiornamento dell'interfaccia della riga di comando di Azure Data.",
			"azdata.requiredUpdate.description": "Consente di scegliere se verrà richiesto quando è disponibile l’aggiornamento richiesto dell'interfaccia della riga di comando di Azure Data.",
			"azdata.update.prompt.description": "All'utente verrà richiesto l'aggiornamento dell’interfaccia della riga di comando di Azure Data",
			"azdata.update.dontPrompt.description": "All'utente non verrà richiesto l'aggiornamento dell’interfaccia della riga di comando di Azure Data"
		},
		"dist/localizedConstants": {
			"azdata.azdata": "Interfaccia della riga di comando di Azure Data",
			"azdata.searchingForAzdata": "Ricerca dell'installazione dell’interfaccia della riga di comando di Azure Data esistente in corso...",
			"azdata.foundExistingAzdata": "È stata trovata un'installazione della versione dell’interfaccia della riga di comando di Azure Data (v{0}) nel percorso: {1}",
			"azdata.downloadingProgressMb": "Downloading di ({0}/{1}MB)",
			"azdata.downloadFinished": "Download completato",
			"azdata.installingAzdata": "Installazione dell'interfaccia della riga di comando di Azure Data...",
			"azdata.updatingAzdata": "Aggiornamento interfaccia della riga di comando di Azure Data...",
			"azdata.azdataInstalled": "L'installazione dell’interfaccia della riga di comando di Azure Data è stata completata. Il riavvio di Azure Data Studio è necessario per completare la configurazione: le funzionalità non verranno attivate finché non viene completata.",
			"azdata.azdataUpdated": "L'interfaccia della riga di comando di Azure Data è stata aggiornata alla versione: {0}.",
			"azdata.yes": "Sì",
			"azdata.no": "No",
			"azdata.accept": "Accetto",
			"azdata.decline": "Rifiuta",
			"azdata.doNotAskAgain": "Non chiedere più",
			"azdata.askLater": "Chiedi più tardi",
			"azdata.downloadingTo": "Downloading {0} da {1} a {2} in corso",
			"azdata.executingCommand": "Esecuzione del comando: '{0} {1}‘",
			"azdata.stdoutOutput": "stdout: {0}",
			"azdata.stderrOutput": "stderr: {0}",
			"azdata.checkingLatestAzdataVersion": "Verifica della versione più recente disponibile dell'interfaccia della riga di comando di Azure Data",
			"azdata.gettingTextContentsOfUrl": "Recupero dei contenuti di testo della risorsa all'URL {0}",
			"azdata.versionForUpdate": "Versione trovata: {0} è quindi possibile aggiornare l’interfaccia della riga di comando di Azure Data dalla versione corrente: {1}.",
			"azdata.latestAzdataVersionAvailable": "Versione più recente disponibile dell’interfaccia della riga di comando di Azure Data: {0}.",
			"azdata.couldNotFindAzdata": "Non è stato possibile trovare l’interfaccia della riga di comando di Azure Data. Errore: {0}",
			"azdata.currentlyInstalledVersionIsLatest": "La versione attualmente installata dell'interfaccia della riga di comando di Azure Data: {0} è uguale o successiva a qualsiasi altra versione disponibile",
			"azdata.promptLog": "Verrà richiesto all'utente di accettare quanto segue: {0}",
			"azdata.couldNotFindAzdataWithPrompt": "Non è stato possibile trovare l’Interfaccia della riga di comando di Azure Data, installarla adesso? In caso contrario, alcune funzionalità non saranno in grado di funzionare.",
			"azdata.promptForAzdataUpdate": "È disponibile una nuova versione dell’interfaccia della riga di comando di Azure Data ({0}), aggiornarla adesso?",
			"azdata.promptForRequiredAzdataUpdate": "Questa estensione richiede l'installazione dell’interfaccia della riga di comando di Azure Data >= {0} eseguire l'aggiornamento alla versione più recente ({1}) adesso? In caso contrario, alcune funzionalità potrebbero non funzionare.",
			"azdata.requiredVersionNotAvailable": "Questa estensione richiede l'installazione dell'interfaccia della riga di comando di Azure Data >= {0}, ma la versione corrente disponibile è solo {1}. Installare manualmente la versione corretta da [here] (https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata), quindi riavviare Azure Data Studio.",
			"azdata.missingRequiredVersion": "Per questa funzionalità è necessario il >di Azure Data CLI = {0}. Eseguire il comando ' Azure Data CLI: check for Update ' per installare questo comando, quindi riprovare.",
			"azdata.downloadError": "Si è verificato un errore durante il download",
			"azdata.installError": "Errore durante l'installazione dell'interfaccia della riga di comando di Azure Data: {0}",
			"azdata.updateError": "Errore durante l'aggiornamento dell'interfaccia della riga di comando di Dati di Azure: {0}",
			"azdata.platformUnsupported": "La piattaforma '{0}' non è attualmente supportata",
			"azdata.unexpectedCommandError": "Errore imprevisto durante l'esecuzione del comando: {0}",
			"azdata.unexpectedExitCode": "Codice di uscita imprevisto dal comando: {1} ({0})",
			"azdata.noAzdata": "Non è disponibile alcuna interfaccia della riga di comando di Azure Data, eseguire il comando 'Azure Data CLI: Install' per abilitare le funzionalità che lo richiedono.",
			"azdata.noAzdataWithLink": "Non è disponibile alcuna interfaccia della riga di comando di Azure Data, [install the Azure Data CLI] (comando: azdata. Install) per abilitare le funzionalità che lo richiedono.",
			"azdata.skipInstall": "L'installazione dell’interfaccia della riga di comando di Azure Data verrà ignorata perché l'operazione non è richiesta dall'utente e l'opzione di configurazione: {0}. {1} è {2}",
			"azdata.skipUpdate": "L’aggiornamento dell’interfaccia della riga di comando di Azure Data verrà ignorata perché l'operazione non è richiesta dall'utente e l'opzione di configurazione: {0}. {1} è {2}",
			"azdata.skipRequiredUpdate": "L’aggiornamento richiesto dell’interfaccia della riga di comando di Azure Data verrà ignorata perché l'operazione non è richiesta dall'utente e l'opzione di configurazione: {0}. {1} è {2}",
			"azdata.noReleaseVersion": "Nessuna versione release disponibile per la piattaforma '{0}'\r\nInformazioni sulla versione: ${1}",
			"azdata.noDownloadLink": "Nessun collegamento di download disponibile per la piattaforma '{0}'\r\nInformazioni sulla versione: ${1}",
			"azdata.failedToParseReleaseInfo": "Non è stato possibile analizzare il JSON dei contenuti in: {0}.\r\nContenuti file:\r\n{1}\r\nErrore: {2}",
			"azdata.azdataUserSettingReadLog": "Configurazione utente dell'interfaccia della riga di comando di Azure Data: {0}. {1} lettura, valore: {2}",
			"azdata.azdataUserSettingUpdatedLog": "Configurazione utente dell’interfaccia della riga di comando di Azure Data: {0}. {1} aggiornata, newValue: {2}",
			"azdata.userResponseInstall": "Risposta dell'utente alla richiesta di installazione dell'interfaccia della riga di comando di Azure Data: {0}",
			"azdata.userResponseUpdate": "Risposta dell'utente alla richiesta di aggiornamento dell'interfaccia della riga di comando di Azure Data: {0}",
			"azdata.userRequestedInstall": "L'utente ha richiesto di installare l’interfaccia della riga di comando di Azure Data usando il comando ' Azure Data CLI: install '",
			"azdata.userRequestedUpdate": "L'utente ha richiesto di aggiornare l'interfaccia della riga di comando di Azure Data usando il comando ' Azure Data CLI: check for Update '",
			"azdata.acceptEula": "L'utente ha richiesto che gli venga inviata la richiesta di accettare il contratto di licenza richiamando il comando 'Azure Data CLI: Accept EULA '",
			"azdata.updateCheckSkipped": "Non è stato trovato alcun controllo per la nuova disponibilità della versione dell'interfaccia della riga di comando di Azure Data per l'installazione",
			"azdata.eulaNotAccepted": "L'informativa sulla privacy Microsoft e le condizioni di licenza dell’interfaccia della riga di comando di Azure Data non sono state accettate. Eseguire il comando: [Azure Data CLI: Accept EULA] (comando: azdata. acceptEula) per accettare il contratto di licenza per abilitare le funzionalità che richiedono l’interfaccia della riga di comando di Azure Data.",
			"azdata.promptForEula": "Per usare questa estensione, è necessario accettare [Microsoft Privacy Statement] ({0}) e [Azure Data CLI license terms] ({1}). Se questi criteri non vengono accettati, le funzionalità non verranno attivate.",
			"azdata.promptForEulaResponse": "Risposta dell'utente alla richiesta di EULA: {0}",
			"azdata.eulaAcceptedStateOnStartup": "Stato ' EULA accettato ' all'avvio: {0}",
			"azdata.endpointOrNamespaceRequired": "È necessario specificare un endpoint o uno spazio dei nomi"
		}
	}
}