{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/configurationEditingMain": {
			"cwd": "Directory di lavoro corrente dello strumento di esecuzione attività all'avvio",
			"defaultBuildTask": "Nome dell'attività di compilazione predefinita. Se non è presente un'unica attività di compilazione predefinita, viene mostrata una selezione rapida per consentire la selezione dell'attività di compilazione.",
			"file": "File attualmente aperto",
			"fileBasename": "Nome di base del file attualmente aperto",
			"fileBasenameNoExtension": "Nome di base del file attualmente aperto senza estensione",
			"fileDirname": "Nome della directory del file attualmente aperto",
			"fileExtname": "Estensione del file attualmente aperto",
			"lineNumber": "Numero di riga corrente selezionato nel file attivo",
			"relativeFile": "File attualmente aperto relativo a ${workspaceFolder}",
			"relativeFileDirname": "Nome di directory del file attualmente aperto relativo a ${workspaceFolder}",
			"selectedText": "Testo selezionato nel file attivo",
			"workspaceFolder": "Percorso della cartella aperta in VS Code",
			"workspaceFolderBasename": "Nome della cartella aperta In VS Code senza barre di separazione (/)"
		},
		"dist/extensionsProposals": {
			"exampleExtension": "esempio"
		},
		"dist/settingsDocumentHelper": {
			"activeEditor": "Usa la lingua dell'editor di testo attualmente attivo se presente",
			"activeEditorLong": "percorso completo del file (ad esempio /Utenti/Sviluppo/Cartella/CartellaFile/File.txt)",
			"activeEditorMedium": "percorso del file relativo alla cartella dell'area di lavoro (ad esempio Cartella/CartellaFile/File.txt)",
			"activeEditorShort": "il nome del file (ad esempio MyFile.txt)",
			"activeFolderLong": "percorso completo della cartella che contiene il file (ad esempio /Utenti/Sviluppo/Cartella/CartellaFile)",
			"activeFolderMedium": "percorso della cartella che contiene il file, relativo alla cartella dell'area di lavoro (ad esempio Cartella/CartellaFile)",
			"activeFolderShort": "nome della cartella in cui si trova il file (ad esempio CartellaFile)",
			"appName": "ad esempio VS Code",
			"assocDescriptionFile": "Esegue il mapping di tutti i file il cui nome file corrisponde al criterio GLOB alla lingua con l'identificatore specificato.",
			"assocDescriptionPath": "Esegue il mapping di tutti i file il cui percorso assoluto corrisponde al criterio GLOB alla lingua con l'identificatore specificato.",
			"assocLabelFile": "File con estensione",
			"assocLabelPath": "File con percorso",
			"derivedDescription": "Trova file con elementi di pari livello e nome identico ma estensione diversa.",
			"derivedLabel": "File con elementi di pari livello in base al nome",
			"dirty": "indicatore che segnala se l'editor attivo è modificato ma non salvato",
			"falseDescription": "Disabilita il criterio.",
			"fileDescription": "Trova tutti i file di un'estensione di file specifica.",
			"fileLabel": "File in base all'estensione",
			"filesDescription": "Trova tutti i file con qualsiasi estensione di file.",
			"filesLabel": "File con più estensioni",
			"folderDescription": "Trova una cartella con un nome specifico in qualsiasi percorso.",
			"folderLabel": "Cartella in base al nome (qualsiasi percorso)",
			"folderName": "nome della cartella dell'area di lavoro in cui è contenuto il file (ad es. myFolder)",
			"folderPath": "percorso della cartella dell'area di lavoro in cui è contenuto il file (ad es. /Users/Development/myFolder)",
			"languageSpecificEditorSettings": "Impostazioni dell'editor specifiche del linguaggio",
			"languageSpecificEditorSettingsDescription": "Esegue l'override delle impostazioni dell'editor per il linguaggio",
			"remoteName": "ad esempio SSH",
			"rootName": "nome dell'Area di lavoro (ad es. myFolder o myWorkspace)",
			"rootPath": "percorso dell'Area di lavoro (ad es. /Users/Development/myWorkspace)",
			"separator": "un separatore condizionale (' - ') visualizzato solo se circondato da variabili con valori",
			"siblingsDescription": "Trova file con elementi di pari livello e nome identico ma estensione diversa.",
			"topFolderDescription": "Trova una cartella di primo livello con un nome specifico.",
			"topFolderLabel": "Cartella in base al nome (primo livello)",
			"topFoldersDescription": "Trova più cartelle di primo livello.",
			"topFoldersLabel": "Cartella con più nomi (primo livello)",
			"trueDescription": "Abilita il criterio."
		},
		"package": {
			"description": "Offre funzionalità (IntelliSense avanzato, correzione automatica) nei file di configurazione come quelli degli elementi consigliati per impostazioni, avvio ed estensioni.",
			"displayName": "Modifica della configurazione"
		}
	}
}