{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"az.promptForAzUpdate": "È disponibile una nuova versione dell'interfaccia della riga di comando di Azure ( {0} ). Eseguire l'aggiornamento ora?",
			"az.accept": "Accetto",
			"az.parseVersionError": "Si è verificato un errore durante l'analisi dell'output di az --version.",
			"az.azOutputParseErrorCaught": "Si è verificato un errore durante l'analisi dell'output del comando az: {0}. L'output non è JSON.",
			"az.askLater": "Chiedi più tardi",
			"az.az": "Interfaccia della riga di comando di Azure",
			"az.missingRequiredVersion": "L'interfaccia della riga di comando di Azure >= {0} è necessaria per questa funzionalità. Eseguire il comando 'Interfaccia della riga di comando di Azure: check for Update' per installare questa opzione e riprovare.",
			"az.azUserSettingReadLog": "Configurazione utente dell'interfaccia della riga di comando di Azure: {0}.{1} lettura, valore: {2}",
			"az.azUserSettingUpdatedLog": "Configurazione utente dell'interfaccia della riga di comando di Azure: {0}.{1} aggiornata, newValue: {2}",
			"az.azInstalled": "L’installazione dell'interfaccia della riga di comando di Azure completata. Il riavvio di Azure Studio è necessario per completare la configurazione. Le funzionalità non verranno attivate fino a quando l’operazione non verrà completata.",
			"az.checkingLatestAzVersion": "Verifica della disponibilità della versione più recente dell'interfaccia della riga di comando di Azure",
			"az.couldNotFindAzWithPrompt": "Non è stato possibile trovare l'interfaccia della riga di comando di Azure. Installarla ora? In caso contrario, alcune funzionalità non saranno in grado di funzionare.",
			"az.couldNotFindAz": "Non è stato possibile trovare l'interfaccia della riga di comando di Azure. Errore: {0}",
			"az.couldNotFindArcdataWithPrompt": "Non è stato possibile trovare l'estensione arcdata dell'interfaccia della riga di comando di Azure. Installarla ora? In caso contrario, alcune funzionalità non saranno in grado di funzionare.",
			"az.couldNotFindAzArc": "Non è stato possibile trovare l'estensione arcdata dell'interfaccia della riga di comando di Azure. Errore: {0}",
			"az.currentlyInstalledVersionIsLatest": "La versione attualmente installata dell'interfaccia della riga di comando di Azure: {0} è uguale o successiva a qualsiasi altra versione disponibile",
			"az.decline": "Rifiuta",
			"az.doNotAskAgain": "Non chiedere più",
			"az.downloadFinished": "Download completato",
			"az.downloadingProgressMb": "Downloading di ({0}/{1}MB)",
			"az.downloadingTo": "Downloading {0} da {1} a {2} in corso",
			"az.endpointOrNamespaceRequired": "È necessario specificare un endpoint o uno spazio dei nomi",
			"az.installError": "Si è verificato un errore durante l'installazione dell'interfaccia della riga di comando di Azure e dell'estensione arcdata: {0}",
			"az.updateError": "Errore durante l'aggiornamento dell'interfaccia della riga di comando di Azure: {0}",
			"az.downloadError": "Si è verificato un errore durante il download",
			"az.executingCommand": "Esecuzione del comando: '{0} {1}‘",
			"az.failedToParseReleaseInfo": "Non è stato possibile analizzare il JSON dei contenuti in: {0}.\r\nContenuti file:\r\n{1}\r\nErrore: {2}",
			"az.foundExistingAz": "È stata trovata l'installazione dell'interfaccia della riga di comando di Azure esistente della versione (v{0}) nel percorso:{1} con versione arcdata: {2}.",
			"az.versionForUpdate": "Versione trovata: {0} alla quale è possibile aggiornare l'interfaccia della riga di comando di Azure dalla versione corrente: {1}.",
			"az.gettingTextContentsOfUrl": "Recupero dei contenuti di testo della risorsa all'URL {0}",
			"az.installingAz": "Installazione dell'interfaccia della riga di comando di Azure in corso...",
			"az.installingArcdata": "Installazione dell'estensione arcdata dell'interfaccia della riga di comando di Azure in corso...",
			"az.latestAzVersionAvailable": "Ultima versione disponibile dell’interfaccia della riga di comando di Azure: {0}.",
			"az.no": "No",
			"az.noAzArc": "Non è disponibile alcuna estensione arcdata dell'interfaccia della riga di comando di Azure.",
			"az.noAzWithLink": "Non è disponibile alcuna interfaccia della riga di comando di Azure, [installare l'interfaccia della riga di comando di Azure](comando:az.install) per abilitare le funzionalità che lo richiedono.",
			"az.noAz": "Non è disponibile alcuna interfaccia della riga di comando di Azure. Eseguire il comando 'Interfaccia della riga di comando di Azure: Install' per abilitare le funzionalità che lo richiedono.",
			"az.noAzureCLI": "Non è disponibile alcuna interfaccia della riga di comando di Azure. Installare manualmente la versione più recente da [qui](https://docs.microsoft.com/cli/azure/install-azure-cli), poi riavviare Azure Studio.",
			"az.updateCheckSkipped": "Non è stato effettuato il controllo sulla disponibilità della nuova versione dell'interfaccia della riga di comando di Azure, in quanto non è presente alcuna installazione.",
			"az.noDownloadLink": "Nessun collegamento di download disponibile per la piattaforma '{0}'\r\nInformazioni sulla versione: ${1}",
			"az.noReleaseVersion": "Nessuna versione release disponibile per la piattaforma '{0}'\r\nInformazioni sulla versione: ${1}",
			"az.platformUnsupported": "La piattaforma '{0}' non è attualmente supportata",
			"az.promptLog": "Verrà richiesto all'utente di accettare quanto segue: {0}",
			"arc.releaseDateNotParsed": "Non è stato possibile analizzare la data di rilascio.",
			"az.searchingForAz": "Ricerca dell'installazione dell'interfaccia della riga di comando di Azure esistente in corso...",
			"az.skipInstall": "L'installazione dell'interfaccia della riga di comando di Azure e dell'estensione arcdata verrà ignorata perché l'operazione non è stata richiesta dall'utente e l'opzione di configurazione: {0}.{1} è {2}",
			"az.arcdataInstalled": "L'estensione arcdata dell'interfaccia della riga di comando di Azure è stata installata. Il riavvio di Azure Studio è necessario per completare la configurazione. Le funzionalità non verranno attivate fino a quando l’operazione non sarà completata.",
			"az.promptForRequiredAzUpdate": "Questa estensione richiede l'installazione dell'interfaccia della riga di comando di Azure >= {0}. Eseguire l'aggiornamento alla versione più recente ({1}) adesso? In caso contrario, alcune funzionalità potrebbero non funzionare.",
			"az.arcdataExtensionNotInstalled": "Questa estensione richiede l'installazione dell'estensione 'arcdata' dell'interfaccia della riga di comando di Azure. Installare la versione più recente seguendo le istruzioni riportate [qui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.requiredVersionNotAvailable": "Questa estensione richiede l'installazione dell'estensione 'arcdata' dell'interfaccia della riga di comando di Azure >= {0}, ma la versione corrente disponibile è solo {1}. Installare la versione corretta seguendo le istruzioni riportate [qui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.unexpectedCommandError": "Errore imprevisto durante l'esecuzione del comando: {0}",
			"az.unexpectedExitCode": "Codice di uscita imprevisto dal comando: {1} ({0})",
			"az.updatingAz": "Aggiornamento dell'interfaccia della riga di comando di Azure in corso...",
			"az.userResponseInstall": "Risposta dell’utente alla richiesta di installazione dell'interfaccia della riga di comando di Azure: {0}",
			"az.userResponseUpdate": "Risposta dell’utente alla richiesta di aggiornamento dell'interfaccia della riga di comando di Azure: {0}",
			"az.userRequestedInstall": "L'utente ha richiesto di installare l'interfaccia della riga di comando di Azure e l'estensione arcdata usando il comando 'Interfaccia della riga di comando di Azure: Install'",
			"az.yes": "Sì",
			"az.unsupportedArcDataVersion": "La versione scaricata {1} dell'estensione 'arcdata' dell'interfaccia della riga di comando di Azure non è ancora supportata. La versione più recente è {0}. Installare la versione corretta seguendo le istruzioni riportate [qui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.stderrOutput": "stderr: {0}",
			"az.stdoutOutput": "stdout: {0}"
		},
		"package": {
			"azcli.arc.category": "Interfaccia della riga di comando di Azure",
			"command.category": "Interfaccia della riga di comando di Azure",
			"azcli.arc.displayName": "Interfaccia della riga di comando di Azure",
			"azcli.arc.config.title": "Configurazione dell'interfaccia della riga di comando di Azure",
			"azcli.arc.azArcdataInstallKey.description": "Scegliere se verrà richiesto di scaricare l'estensione arcdata dell'interfaccia della riga di comando di Azure.",
			"azcli.azCliInstallKey.description": "Scegliere se verrà richiesto di installare l'interfaccia della riga di comando di Azure.",
			"azcli.arc.azArcdataUpdateKey.description": "Scegliere se verrà visualizzata una richiesta quando è disponibile un aggiornamento dell'estensione dell’interfaccia della riga di comando di Azure.",
			"azcli.arc.config.debug": "Registrare le informazioni di debug nel canale di output per tutti i comandi az eseguiti",
			"azcli.arc.description": "Supporto per l'interfaccia della riga di comando di Azure.",
			"azcli.arc.update.prompt.description": "All'utente verrà richiesto di aggiornare l'estensione arcdata dell'interfaccia della riga di comando di Azure",
			"azcli.install.prompt.description": "All'utente verrà richiesto di installare l'interfaccia della riga di comando di Azure",
			"azcli.arc.install.prompt.description": "All'utente verrà richiesto di installare l'estensione arcdata dell'interfaccia della riga di comando di Azure",
			"azcli.arc.update.dontPrompt.description": "All'utente non verrà richiesto di aggiornare l'estensione arcdata dell'interfaccia della riga di comando di Azure",
			"azcli.install.dontPrompt.description": "All'utente non verrà richiesto di installare l'interfaccia della riga di comando di Azure",
			"azcli.arc.install.dontPrompt.description": "All'utente non verrà richiesto di installare l'estensione arcdata dell'interfaccia della riga di comando di Azure"
		}
	}
}