{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"SchemaCompare.Aggregates": "Aggregati",
			"SchemaCompare.AllowDropBlockingAssemblies": "Consenti rimozione assembly di blocco",
			"SchemaCompare.AllowIncompatiblePlatform": "Consenti piattaforma incompatibile",
			"SchemaCompare.AllowUnsafeRowLevelSecurityDataMovement": "Consenti spostamento dati con Sicurezza a livello di riga non sicuro",
			"SchemaCompare.ApplicationRoles": "Ruoli applicazione",
			"SchemaCompare.Assemblies": "Assembly",
			"SchemaCompare.AssemblyFiles": "File di assembly",
			"SchemaCompare.AsymmetricKeys": "Chiavi asimmetriche",
			"SchemaCompare.Audits": "Controlli",
			"SchemaCompare.BackupDatabaseBeforeChanges": "Esegui backup del database prima delle modifiche",
			"SchemaCompare.BlockOnPossibleDataLoss": "Blocca in caso di possibile perdita di dati",
			"SchemaCompare.BlockWhenDriftDetected": "Blocca se viene rilevata una deviazione",
			"SchemaCompare.BrokerPriorities": "Priorità di Service Broker",
			"SchemaCompare.Certificates": "Certificati",
			"SchemaCompare.ClrUserDefinedTypes": "Tipi CLR definiti dall'utente",
			"SchemaCompare.ColumnEncryptionKeys": "Chiavi di crittografia della colonna",
			"SchemaCompare.ColumnMasterKeys": "Chiavi master della colonna",
			"SchemaCompare.CommentOutSetVarDeclarations": "Imposta come commento le dichiarazioni SetVar",
			"SchemaCompare.CompareUsingTargetCollation": "Confronta usando regole di confronto di destinazione",
			"SchemaCompare.Contracts": "Contratti",
			"SchemaCompare.CreateNewDatabase": "Crea nuovo database",
			"SchemaCompare.Credentials": "Credenziali",
			"SchemaCompare.CryptographicProviders": "Provider del servizio di crittografia",
			"SchemaCompare.DatabaseAuditSpecifications": "Specifiche di controllo database",
			"SchemaCompare.DatabaseEncryptionKeys": "Chiavi di crittografia del database",
			"SchemaCompare.DatabaseOptions": "Opzioni database",
			"SchemaCompare.DatabaseRoles": "Ruoli database",
			"SchemaCompare.DatabaseScopedCredentials": "Credenziali con ambito database",
			"SchemaCompare.DatabaseTriggers": "Trigger database",
			"SchemaCompare.Defaults": "Impostazioni predefinite",
			"SchemaCompare.DeployDatabaseInSingleUserMode": "Distribuisci database in modalità utente singolo",
			"SchemaCompare.Description.AllowDropBlockingAssemblies": "Questa proprietà viene usata dalla distribuzione SqlClr per causare la rimozione degli assembly di blocco come parte del piano di distribuzione. Per impostazione predefinita, gli assembly di blocco/riferimento bloccheranno un aggiornamento degli assembly se l'assembly a cui viene fatto riferimento deve essere rimosso.",
			"SchemaCompare.Description.AllowIncompatiblePlatform": "Specifica se provare a eseguire l'azione nonostante sia incompatibile con le piattaforme di SQL Server.",
			"SchemaCompare.Description.AllowUnsafeRowLevelSecurityDataMovement": "Non blocca il movimento di dati in una tabella con Sicurezza a livello di riga se questa proprietà è impostata su true. L'impostazione predefinita è false.",
			"SchemaCompare.Description.BackupDatabaseBeforeChanges": "Esegue il backup del database prima di distribuire eventuali modifiche.",
			"SchemaCompare.Description.BlockOnPossibleDataLoss": "Specifica che, se esiste la possibilità di perdita di dati derivante dall'operazione di pubblicazione, l'episodio di pubblicazione deve essere interrotto.",
			"SchemaCompare.Description.BlockWhenDriftDetected": "Specifica se bloccare l'aggiornamento di un database il cui schema non corrisponde più alla registrazione o la cui registrazione è stata annullata.",
			"SchemaCompare.Description.CommentOutSetVarDeclarations": "Specifica se la dichiarazione delle variabili SETVAR verrà impostata come commento nello script di pubblicazione generato. È possibile scegliere questa opzione se si intende specificare i valori nella riga di comando usando uno strumento quale SQLCMD.EXE.",
			"SchemaCompare.Description.CompareUsingTargetCollation": "Questa impostazione indica come vengono gestite le regole di confronto del database durante la distribuzione. Per impostazione predefinita, le regole di confronto del database di destinazione verranno aggiornate se non corrispondono alle regole di confronto specificate dall'origine. Quando questa opzione è impostata, è necessario usare le regole di confronto del server o del database di destinazione.",
			"SchemaCompare.Description.CreateNewDatabase": "Specifica se il database di destinazione deve essere aggiornato oppure rimosso e ricreato quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.DeployDatabaseInSingleUserMode": "Se è true, il database viene impostato sulla modalità utente singolo prima della distribuzione.",
			"SchemaCompare.Description.DisableAndReenableDdlTriggers": "Specifica se i trigger Data Definition Language (DDL) vengono disabilitati all'inizio del processo di pubblicazione e riabilitati alla fine del processo di pubblicazione.",
			"SchemaCompare.Description.DoNotAlterChangeDataCaptureObjects": "Se è true, gli oggetti Change Data Capture non vengono modificati.",
			"SchemaCompare.Description.DoNotAlterReplicatedObjects": "Specifica se gli oggetti replicati vengono identificati durante la verifica.",
			"SchemaCompare.Description.DropConstraintsNotInSource": "Specifica se i vincoli che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.DropDmlTriggersNotInSource": "Specifica se i trigger DML che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.DropExtendedPropertiesNotInSource": "Specifica se le proprietà estese che non esistono nel file snapshot del database (con estensione dacpac) vengono rimosse dal database di destinazione quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.DropIndexesNotInSource": "Specifica se gli indici che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.DropObjectsNotInSource": "Specifica se oggetti che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database. Questo valore ha precedenza su DropExtendedProperties.",
			"SchemaCompare.Description.DropPermissionsNotInSource": "Specifica se le autorizzazioni che non esistono nel file snapshot del database (con estensione dacpac) vengono rimosse dal database di destinazione quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.DropRoleMembersNotInSource": "Specifica se i membri del ruolo non distribuiti nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si pubblicano aggiornamenti in un database.</",
			"SchemaCompare.Description.DropStatisticsNotInSource": "Specifica se le statistiche che non esistono nel file snapshot del database (con estensione dacpac) vengono rimosse dal database di destinazione quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.GenerateSmartDefaults": "Fornisce automaticamente un valore predefinito quando si aggiorna una tabella contenente dati con una colonna che non consente valori Null.",
			"SchemaCompare.Description.IgnoreAnsiNulls": "Specifica se le differenze nell'impostazione ANSI NULLS devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreAuthorizer": "Specifica se le differenze nel provider di autorizzazioni devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreColumnCollation": "Specifica se le differenze nelle regole di confronto colonna devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreColumnOrder": "Specifica se le differenze nell'ordine colonne della tabella devono essere ignorate o aggiornate durante la pubblicazione di un database.",
			"SchemaCompare.Description.IgnoreComments": "Specifica se le differenze nei commenti devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreCryptographicProviderFilePath": "Specifica se le differenze nel percorso file del provider del servizio di crittografia devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreDdlTriggerOrder": "Specifica se le differenze nell'ordine dei trigger DDL (Data Definition Language) devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database o in un server.",
			"SchemaCompare.Description.IgnoreDdlTriggerState": "Specifica se le differenze nello stato abilitato o disabilitato dei trigger DDL (Data Definition Language) devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreDefaultSchema": "Specifica se le differenze nello schema predefinito devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreDmlTriggerOrder": "Specifica se le differenze nell'ordine dei trigger DML (Data Manipulation Language) triggers devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreDmlTriggerState": "Specifica se le differenze nello stato abilitato o disabilitato dei trigger DML devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreExtendedProperties": "Specifica se le proprietà estese devono essere ignorate.",
			"SchemaCompare.Description.IgnoreFileAndLogFilePath": "Specifica se le differenze nel percorso dei file e dei file di log devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreFileSize": "Specifica se le differenze nelle dimensioni dei file devono essere ignorate o se viene inviato un avviso quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreFilegroupPlacement": "Specifica se le differenze nella posizione degli oggetti in FILEGROUP devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreFillFactor": "Specifica se le differenze nel fattore di riempimento per l'archiviazione degli indici devono essere ignorate o se viene inviato un avviso quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreFullTextCatalogFilePath": "Specifica se le differenze nel percorso file per il catalogo full-text devono essere ignorate o se viene inviato un avviso quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreIdentitySeed": "Specifica se le differenze nel valore di inizializzazione per una colonna Identity devono essere ignorate o aggiornate quando si pubblicano aggiornamenti in un database.",
			"SchemaCompare.Description.IgnoreIncrement": "Specifica se le differenze nell'incremento per una colonna Identity devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreIndexOptions": "Specifica se le differenze nelle opzioni di indice devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreIndexPadding": "Specifica se le differenze nel riempimento indice devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreKeywordCasing": "Specifica se le differenze nell'uso di maiuscole e minuscole delle parole chiave devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreLockHintsOnIndexes": "Specifica se le differenze negli hint di blocco negli indici devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreLoginSids": "Specifica se le differenze nell'ID di sicurezza (SID) devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreNotForReplication": "Specifica se le impostazioni Non per la replica devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreObjectPlacementOnPartitionScheme": "Specifica se la posizione di un oggetto in uno schema di partizione deve essere ignorata o aggiornata quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnorePartitionSchemes": "Specifica se le differenze negli schemi di partizione e nelle funzioni devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnorePermissions": "Specifica se le autorizzazioni devono essere ignorate.",
			"SchemaCompare.Description.IgnoreQuotedIdentifiers": "Specifica se le differenze nell'impostazione degli identificatori delimitati devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreRoleMembership": "Specifica se le differenze nelle appartenenze al ruolo degli account di accesso devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreRouteLifetime": "Specifica se le differenze nel tempo di conservazione in SQL Server della route nella tabella di routing devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreSemicolonBetweenStatements": "Specifica se le differenze nei punti e virgola tra le istruzioni T-SQL verranno ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreTableOptions": "Specifica se le differenze nelle opzioni di tabella devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreUserSettingsObjects": "Specifica se le differenze negli oggetti impostazioni utente devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreWhitespace": "Specifica se le differenze nello spazio vuoto devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreWithNocheckOnCheckConstraints": "Specifica se le differenze nel valore della clausola WITH NOCHECK per vincoli CHECK devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IgnoreWithNocheckOnForeignKeys": "Specifica se le differenze nel valore della clausola WITH NOCHECK per chiavi esterne devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.IncludeCompositeObjects": "Include tutti gli elementi compositi in un'unica operazione di pubblicazione.",
			"SchemaCompare.Description.IncludeTransactionalScripts": "Specifica se usare quando possibile le istruzioni transazionali quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.NoAlterStatementsToChangeClrTypes": "Specifica che se durante la pubblicazione viene rilevata una differenza, viene sempre rimosso e ricreato un assembly invece di eseguire un'istruzione ALTER ASSEMBLY",
			"SchemaCompare.Description.PopulateFilesOnFileGroups": "Specifica se viene anche creato un nuovo file quando si crea un nuovo oggetto FileGroup nel database di destinazione.",
			"SchemaCompare.Description.RegisterDataTierApplication": "Specifica se lo schema viene registrato con il server di database.",
			"SchemaCompare.Description.RunDeploymentPlanExecutors": "Specifica se eseguire i collaboratori DeploymentPlanExecutor quando vengono eseguite le altre operazioni.",
			"SchemaCompare.Description.ScriptDatabaseCollation": "Specifica se le differenze nelle regole di confronto del database devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.ScriptDatabaseCompatibility": "Specifica se le differenze nella compatibilità del database devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.",
			"SchemaCompare.Description.ScriptDatabaseOptions": "Specifica se le proprietà del database di destinazione devono essere impostate o aggiornate durante l'azione di pubblicazione.",
			"SchemaCompare.Description.ScriptDeployStateChecks": "Specifica se le istruzioni vengono generate nello script di pubblicazione per verificare che il nome del database e il nome del server corrispondano ai nomi specificati nel progetto di database.",
			"SchemaCompare.Description.ScriptFileSize": "Controlla se nell'aggiunta di un file a un filegroup vengono specificate le dimensioni.",
			"SchemaCompare.Description.ScriptNewConstraintValidation": "Al termine della pubblicazione tutti i vincoli verranno verificati come un unico set, in modo da evitare errori di dati provocati da vincoli CHECK o di chiave esterna durante la pubblicazione. Se l'impostazione è False, i vincoli verranno pubblicati senza il controllo dei dati corrispondenti.",
			"SchemaCompare.Description.ScriptRefreshModule": "Includi istruzioni di aggiornamento alla fine dello script di pubblicazione.",
			"SchemaCompare.Description.TreatVerificationErrorsAsWarnings": "Specifica se gli errori rilevati durante la verifica della pubblicazione devono essere considerati avvisi. Il controllo viene effettuato sul piano di distribuzione generato prima che questo venga eseguito sul database di destinazione. La verifica del piano rileva problemi quali la perdita di oggetti della sola destinazione (ad esempio gli indici) che devono essere rimossi per apportare una modifica. La verifica inoltre individua le dipendenze (ad esempio una tabella o una visualizzazione) che sono presenti a causa di un riferimento a un progetto composito, ma che non esistono nel database di destinazione. È possibile scegliere di eseguire questo controllo per ottenere un elenco completo di tutti i problemi anziché l'arresto dell'azione di pubblicazione al primo errore.",
			"SchemaCompare.Description.UnmodifiableObjectWarnings": "Specifica se devono essere generati avvisi quando vengono rilevate differenze negli oggetti che non possono essere modificati, ad esempio quando le dimensioni o i percorsi di file risultano diversi.",
			"SchemaCompare.Description.VerifyCollationCompatibility": "Specifica se la compatibilità delle regole di confronto viene verificata.",
			"SchemaCompare.Description.VerifyDeployment": "Specifica se prima della pubblicazione devono essere eseguiti i controlli che arrestano l'azione di distribuzione quando vengono rilevati problemi che potrebbero impedire la corretta pubblicazione. Ad esempio, l'azione di pubblicazione potrebbe essere arrestata se le chiavi esterne presenti nel database di destinazione non esistono nel progetto di database e questa situazione genera errori durante la pubblicazione.",
			"SchemaCompare.DisableAndReenableDdlTriggers": "Disabilita e riabilita trigger DDL",
			"SchemaCompare.DoNotAlterChangeDataCaptureObjects": "Non modificare oggetti Change Data Capture",
			"SchemaCompare.DoNotAlterReplicatedObjects": "Non modificare oggetti replicati",
			"SchemaCompare.DropConstraintsNotInSource": "Rimuovi vincoli non nell'origine",
			"SchemaCompare.DropDmlTriggersNotInSource": "Rimuovi trigger DML non nell'origine",
			"SchemaCompare.DropExtendedPropertiesNotInSource": "Rimuovi proprietà estese non nell'origine",
			"SchemaCompare.DropIndexesNotInSource": "Rimuovi indici non nell'origine",
			"SchemaCompare.DropObjectsNotInSource": "Rimuovi oggetti non nell'origine",
			"SchemaCompare.DropPermissionsNotInSource": "Rimuovi autorizzazioni non nell'origine",
			"SchemaCompare.DropRoleMembersNotInSource": "Rimuovi membri del ruolo non nell'origine",
			"SchemaCompare.DropStatisticsNotInSource": "Rimuovi statistiche non nell'origine",
			"SchemaCompare.Endpoints": "Endpoint",
			"SchemaCompare.ErrorMessages": "Messaggi di errore",
			"SchemaCompare.EventNotifications": "Notifiche degli eventi",
			"SchemaCompare.EventSessions": "Sessioni eventi",
			"SchemaCompare.ExtendedProperties": "Proprietà estese",
			"SchemaCompare.ExternalDataSources": "Origini dati esterne",
			"SchemaCompare.ExternalFileFormats": "Formati di file esterni",
			"SchemaCompare.ExternalStreamingJobs": "Processi di streaming esterni",
			"SchemaCompare.ExternalStreams": "Flussi esterni",
			"SchemaCompare.ExternalTables": "Tabelle esterne",
			"SchemaCompare.FileTables": "Tabelle file",
			"SchemaCompare.Filegroups": "Filegroup",
			"SchemaCompare.Files": "File",
			"SchemaCompare.FullTextCatalogs": "Cataloghi full-text",
			"SchemaCompare.FullTextStoplists": "Elenchi di parole non significative full-text",
			"SchemaCompare.GeneralOptionsLabel": "Opzioni generali",
			"SchemaCompare.GenerateSmartDefaults": "Genera impostazioni predefinite intelligenti",
			"SchemaCompare.IgnoreAnsiNulls": "Ignora ANSI NULLS",
			"SchemaCompare.IgnoreAuthorizer": "Ignora provider di autorizzazioni",
			"SchemaCompare.IgnoreColumnCollation": "Ignora regole di confronto delle colonne",
			"SchemaCompare.IgnoreColumnOrder": "Ignora ordine delle colonne",
			"SchemaCompare.IgnoreComments": "Ignora commenti",
			"SchemaCompare.IgnoreCryptographicProviderFilePath": "Ignora percorso file del provider del servizio di crittografia",
			"SchemaCompare.IgnoreDdlTriggerOrder": "Ignora ordine trigger DDL",
			"SchemaCompare.IgnoreDdlTriggerState": "Ignora stato trigger DDL",
			"SchemaCompare.IgnoreDefaultSchema": "Ignora schema predefinito",
			"SchemaCompare.IgnoreDmlTriggerOrder": "Ignora ordine trigger DML",
			"SchemaCompare.IgnoreDmlTriggerState": "Ignora stato trigger DML",
			"SchemaCompare.IgnoreExtendedProperties": "Ignora proprietà estese",
			"SchemaCompare.IgnoreFileAndLogFilePath": "Ignora percorso di file e file di log",
			"SchemaCompare.IgnoreFileSize": "Ignora dimensioni file",
			"SchemaCompare.IgnoreFilegroupPlacement": "Ignora posizione filegroup",
			"SchemaCompare.IgnoreFillFactor": "Ignora fattore di riempimento",
			"SchemaCompare.IgnoreFullTextCatalogFilePath": "Ignora percorso del file di catalogo full-text",
			"SchemaCompare.IgnoreIdentitySeed": "Ignora valore di inizializzazione Identity",
			"SchemaCompare.IgnoreIncrement": "Ignora incremento",
			"SchemaCompare.IgnoreIndexOptions": "Ignora opzioni di indice",
			"SchemaCompare.IgnoreIndexPadding": "Ignora riempimento indice",
			"SchemaCompare.IgnoreKeywordCasing": "Ignora maiuscole/minuscole parole chiave",
			"SchemaCompare.IgnoreLockHintsOnIndexes": "Ignora hint di blocco in indici",
			"SchemaCompare.IgnoreLoginSids": "Ignora SID di accesso",
			"SchemaCompare.IgnoreNotForReplication": "Ignora non per la replica",
			"SchemaCompare.IgnoreObjectPlacementOnPartitionScheme": "Ignora posizione oggetto nello schema di partizione",
			"SchemaCompare.IgnorePartitionSchemes": "Ignora schemi di partizione",
			"SchemaCompare.IgnorePermissions": "Ignora autorizzazioni",
			"SchemaCompare.IgnoreQuotedIdentifiers": "Ignora identificatori delimitati",
			"SchemaCompare.IgnoreRoleMembership": "Ignora appartenenza al ruolo",
			"SchemaCompare.IgnoreRouteLifetime": "Ignora durata route",
			"SchemaCompare.IgnoreSemicolonBetweenStatements": "Ignora punto e virgola tra istruzioni",
			"SchemaCompare.IgnoreTableOptions": "Ignora opzioni di tabella",
			"SchemaCompare.IgnoreUserSettingsObjects": "Ignora oggetti impostazioni utente",
			"SchemaCompare.IgnoreWhitespace": "Ignora spazio vuoto",
			"SchemaCompare.IgnoreWithNocheckOnCheckConstraints": "Ignora WITH NOCHECK in vincoli CHECK",
			"SchemaCompare.IgnoreWithNocheckOnForeignKeys": "Ignora WITH NOCHECK in chiavi esterne",
			"SchemaCompare.IncludeCompositeObjects": "Includi oggetti compositi",
			"SchemaCompare.IncludeTransactionalScripts": "Includi script transazionali",
			"SchemaCompare.LinkedServerLogins": "Accessi server collegato",
			"SchemaCompare.LinkedServers": "Server collegati",
			"SchemaCompare.Logins": "Account di accesso",
			"SchemaCompare.MasterKeys": "Chiavi master",
			"SchemaCompare.MessageTypes": "Tipi di messaggio",
			"SchemaCompare.NoAlterStatementsToChangeClrTypes": "Non modificare istruzioni per cambiare i tipi CLR",
			"SchemaCompare.ObjectTypesOptionsLabel": "Includi tipi di oggetto",
			"SchemaCompare.PartitionFunctions": "Funzioni di partizione",
			"SchemaCompare.PartitionSchemes": "Schemi di partizione",
			"SchemaCompare.Permissions": "Autorizzazioni",
			"SchemaCompare.PopulateFilesOnFileGroups": "Popola file in gruppi di file",
			"SchemaCompare.Queues": "Code",
			"SchemaCompare.RegisterDataTierApplication": "Registra applicazione del livello dati",
			"SchemaCompare.RemoteServiceBindings": "Associazioni al servizio remoto",
			"SchemaCompare.RoleMembership": "Appartenenza al ruolo",
			"SchemaCompare.Routes": "Route",
			"SchemaCompare.Rules": "Regole",
			"SchemaCompare.RunDeploymentPlanExecutors": "Esegui executor di piani di distribuzione",
			"SchemaCompare.ScalarValuedFunctions": "Funzioni a valori scalari",
			"SchemaCompare.SchemaCompareOptionsDialogLabel": "Opzioni di confronto schemi",
			"SchemaCompare.ScriptDatabaseCollation": "Crea script per regole di confronto database",
			"SchemaCompare.ScriptDatabaseCompatibility": "Crea script per compatibilità database",
			"SchemaCompare.ScriptDatabaseOptions": "Crea script per opzioni database",
			"SchemaCompare.ScriptDeployStateChecks": "Crea script per verifiche stato di distribuzione",
			"SchemaCompare.ScriptFileSize": "Crea script per dimensioni file",
			"SchemaCompare.ScriptNewConstraintValidation": "Crea script per convalida nuovi vincoli",
			"SchemaCompare.ScriptRefreshModule": "Crea script per modulo di aggiornamento",
			"SchemaCompare.SearchPropertyLists": "Elenchi delle proprietà di ricerca",
			"SchemaCompare.SecurityPolicies": "Criteri di sicurezza",
			"SchemaCompare.Sequences": "Sequenze",
			"SchemaCompare.ServerAuditSpecifications": "Specifiche di controllo server",
			"SchemaCompare.ServerRoleMembership": "Appartenenze al ruolo del server",
			"SchemaCompare.ServerRoles": "Ruoli del server",
			"SchemaCompare.ServerTriggers": "Trigger server",
			"SchemaCompare.Services": "Servizi",
			"SchemaCompare.Signatures": "Firme",
			"SchemaCompare.StoredProcedures": "Stored procedure",
			"SchemaCompare.SymmetricKeys": "Chiavi simmetriche",
			"SchemaCompare.Synonyms": "Sinonimi",
			"SchemaCompare.TableValuedFunctions": "Funzioni con valori di tabella",
			"SchemaCompare.Tables": "Tabelle",
			"SchemaCompare.TreatVerificationErrorsAsWarnings": "Considera errori di verifica come avvisi",
			"SchemaCompare.UnmodifiableObjectWarnings": "Avvisi per oggetti non modificabili",
			"SchemaCompare.UserDefinedDataTypes": "Tipi di dati definiti dall'utente",
			"SchemaCompare.UserDefinedTableTypes": "Tipi di tabella definiti dall'utente",
			"SchemaCompare.Users": "Utenti",
			"SchemaCompare.VerifyCollationCompatibility": "Verifica compatibilità regole di confronto",
			"SchemaCompare.VerifyDeployment": "Verifica distribuzione",
			"SchemaCompare.Views": "Visualizzazioni",
			"SchemaCompare.XmlSchemaCollections": "Raccolte XML Schema",
			"SchemaCompareOptionsDialog.Reset": "Reimposta",
			"schemaCompare.ApplyConfirmation": "Aggiornare la destinazione?",
			"schemaCompare.CompareDetailsTitle": "Dettagli confronto",
			"schemaCompare.GetConnectionString": "Si desidera connettersi a {0}?",
			"schemaCompare.RecompareToRefresh": "Fare clic su Confronta per aggiornare il confronto.",
			"schemaCompare.actionColumn": "Azione",
			"schemaCompare.addAction": "Aggiungi",
			"schemaCompare.applyButtonDisabledTitle": "L'opzione Applica è abilitata quando la destinazione è un database",
			"schemaCompare.applyButtonEnabledTitle": "Applica modifiche alla destinazione",
			"schemaCompare.applyNoChanges": "Non sono presenti modifiche da applicare",
			"schemaCompare.cancelCompareButton": "Arresta",
			"schemaCompare.cancelErrorMessage": "L'annullamento del confronto schemi non è riuscito: '{0}'",
			"schemaCompare.cannotExcludeMessage": "Non è possibile escludere {0}. Esistono dipendenti inclusi",
			"schemaCompare.cannotExcludeMessageWithDependent": "Non è possibile escludere {0}. Esistono dipendenti inclusi, ad esempio {1}",
			"schemaCompare.cannotIncludeMessage": "Non è possibile includere {0}. Esistono dipendenti esclusi",
			"schemaCompare.cannotIncludeMessageWithDependent": "Non è possibile includere {0}. Esistono dipendenti esclusi, ad esempio {1}",
			"schemaCompare.changeAction": "Modifica",
			"schemaCompare.compareButton": "Confronta",
			"schemaCompare.compareErrorMessage": "Il confronto schemi non è riuscito: {0}",
			"schemaCompare.dacpacRadioButtonLabel": "File dell'applicazione livello dati (con estensione dacpac)",
			"schemaCompare.databaseButtonLabel": "Database",
			"schemaCompare.deleteAction": "Elimina",
			"schemaCompare.dialogTitle": "Confronto schemi",
			"schemaCompare.differencesTableTitle": "Confronto tra origine e destinazione",
			"schemaCompare.generateScriptButton": "Genera script",
			"schemaCompare.generateScriptButtonDisabledTitle": "L'opzione Genera script è abilitata quando la destinazione è un database",
			"schemaCompare.generateScriptEnabledButton": "Genera script per distribuire le modifiche nella destinazione",
			"schemaCompare.generateScriptErrorMessage": "La generazione dello script non è riuscita: '{0}'",
			"schemaCompare.generateScriptNoChanges": "Non sono presenti modifiche per cui generare lo script",
			"schemaCompare.includeColumnName": "Includi",
			"schemaCompare.includeExcludeInfoMessage": "Tenere presente che le operazioni di inclusione/esclusione possono richiedere qualche minuto per calcolare le dipendenze interessate",
			"schemaCompare.noDifferences": "Non sono state trovate differenze di schema.",
			"schemaCompare.openFile": "Apri",
			"schemaCompare.openScmpButton": "Apri file con estensione scmp",
			"schemaCompare.openScmpButtonTitle": "Carica origine, destinazione e opzioni salvate in un file con estensione scmp",
			"schemaCompare.openScmpErrorMessage": "L'apertura del file scmp non è riuscita: '{0}'",
			"schemaCompare.optionsButton": "Opzioni",
			"schemaCompare.radioButtonsLabel": "Tipo",
			"schemaCompare.saveFile": "Salva",
			"schemaCompare.saveScmpButton": "Salva file con estensione scmp",
			"schemaCompare.saveScmpButtonTitle": "Salva origine e destinazione, opzioni ed elementi esclusi",
			"schemaCompare.saveScmpErrorMessage": "Il salvataggio del file scmp non è riuscito: '{0}'",
			"schemaCompare.selectConnection": "Selezionare connessione",
			"schemaCompare.selectSourceFile": "Selezionare file di origine",
			"schemaCompare.selectTargetFile": "Selezionare il file di destinazione",
			"schemaCompare.sourceButtonTitle": "Seleziona origine",
			"schemaCompare.sourceNameColumn": "Nome origine",
			"schemaCompare.startText": "Per confrontare due schemi, selezionare lo schema di origine e quello di destinazione, quindi fare clic su Confronta.",
			"schemaCompare.switchButtonTitle": "Scambia origine e destinazione",
			"schemaCompare.switchDirectionButton": "Cambia direzione",
			"schemaCompare.targetButtonTitle": "Seleziona destinazione",
			"schemaCompare.targetNameColumn": "Nome destinazione",
			"schemaCompare.typeColumn": "Tipo",
			"schemaCompare.updateButton": "Applica",
			"schemaCompare.updateErrorMessage": "L'applicazione del confronto schemi non è riuscita: '{0}'",
			"schemaCompare.waitText": "Inizializzazione del confronto. L'operazione potrebbe richiedere qualche istante.",
			"schemaCompareDialog.No": "No",
			"schemaCompareDialog.SourceTitle": "Origine",
			"schemaCompareDialog.TargetTitle": "Destinazione",
			"schemaCompareDialog.Yes": "Sì",
			"schemaCompareDialog.cancel": "Annulla",
			"schemaCompareDialog.databaseDropdownTitle": "Database",
			"schemaCompareDialog.defaultUser": "predefinito",
			"schemaCompareDialog.differentSourceMessage": "È stato selezionato uno schema di origine diverso. Eseguire il confronto?",
			"schemaCompareDialog.differentSourceTargetMessage": "Sono stati selezionati schemi di origine e di destinazione diversi. Eseguire il confronto?",
			"schemaCompareDialog.differentTargetMessage": "È stato selezionato uno schema di destinazione diverso. Eseguire il confronto?",
			"schemaCompareDialog.fileTextBoxLabel": "File",
			"schemaCompareDialog.ok": "OK",
			"schemaCompareDialog.serverDropdownTitle": "Server",
			"schemaCompareDialog.sourceDatabaseDropdown": "Database di origine",
			"schemaCompareDialog.sourceServerDropdown": "Server di origine",
			"schemaCompareDialog.sourceTextBox": "File di origine",
			"schemaCompareDialog.targetDatabaseDropdown": "Database di destinazione",
			"schemaCompareDialog.targetServerDropdown": "Server di destinazione",
			"schemaCompareDialog.targetTextBox": "File di destinazione",
			"schemaCompareOptions.RecompareMessage": "Le opzioni sono state modificate. Ripetere il confronto?"
		},
		"package": {
			"description": "La funzionalità Confronto schemi di SQL Server per Azure Data Studio supporta il confronto degli schemi di database e pacchetti di applicazione livello dati.",
			"displayName": "Confronto schemi di SQL Server",
			"schemaCompare.start": "Confronto schemi"
		}
	}
}