{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Continue to GitHub": "Passa a GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Passa a GitHub per creare un token di accesso personale (PAT)",
			"Copy & Continue to GitHub": "Copia e continua in GitHub",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "L'URI di GitHub Enterprise Server non è un URI valido: {0}",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Si sono verificati problemi durante l'accesso? Si vuole provare in un modo diverso? ({0})",
			"No": "No",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Aprire [{0}]({0}) in una nuova scheda e incollare il time code: {1}",
			"Sign in failed: {0}": "Accesso non riuscito: {0}",
			"Sign out failed: {0}": "Disconnessione non riuscita: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Accesso in corso a {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Per completare l'autenticazione, passare a GitHub e incollare il time code precedente.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Per completare l'autenticazione, passa a GitHub per creare un token di accesso personale (PAT), quindi incolla il token di accesso personale nella casella di input.",
			"Yes": "Sì",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Non è ancora stata completata l'autorizzazione di questa estensione per usare GitHub. Provare in un modo diverso? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Codice: {0}",
			"device code": "codice dispositivo",
			"local server": "server locale",
			"personal access token": "token di accesso personale",
			"url handler": "gestore URL"
		},
		"package": {
			"description": "Provider di autenticazione GitHub",
			"displayName": "Autenticazione GitHub"
		}
	}
}