{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"azdata.displayName": "CLI de Dados do Azure",
			"azdata.description": "Suporte para a CLI de Dados do Azure.",
			"azdata.config.title": "Configuração da CLI de Dados do Azure",
			"azdata.config.debug": "Registrar informações de depuração no canal de saída para todos os comandos azdata executados",
			"command.category": "CLI de Dados do Azure",
			"azdata.acceptEula.command.name": "Aceitar o EULA",
			"azdata.install.command.name": "Instalar",
			"azdata.update.command.name": "Verificar se há Atualizações",
			"azdata.category": "CLI de Dados do Azure",
			"azdata.acceptEula.description": "Escolha como a aceitação do EULA para a CLI de Dados do Azure será feita",
			"azdata.acceptEula.prompt.description": "O usuário será solicitado a aceitar o EULA para a CLI de Dados do Azure",
			"azdata.acceptEula.dontPrompt.description": "O usuário não será solicitado a aceitar o EULA para a CLI de Dados do Azure",
			"azdata.install.description": "Escolha como a instalação da CLI de Dados do Azure é feita",
			"azdata.install.prompt.description": "O usuário será solicitado a instalar a CLI de Dados do Azure",
			"azdata.install.dontPrompt.description": "O usuário não será solicitado a instalar a CLI de Dados do Azure",
			"azdata.update.description": "Escolha se você será solicitado quando uma atualização da CLI de Dados do Azure estiver disponível.",
			"azdata.requiredUpdate.description": "Escolha se você será solicitado quando uma atualização necessária da CLI de Dados do Azure estiver disponível.",
			"azdata.update.prompt.description": "O usuário será solicitado a atualizar a CLI de Dados do Azure",
			"azdata.update.dontPrompt.description": "O usuário não será solicitado a atualizar a CLI de Dados do Azure"
		},
		"dist/localizedConstants": {
			"azdata.azdata": "CLI de Dados do Azure",
			"azdata.searchingForAzdata": "Procurando instalação existente da CLI de Dados do Azure...",
			"azdata.foundExistingAzdata": "Foi encontrada uma instalação existente da CLI de Dados do Azure da versão (v{0}) no caminho: {1}",
			"azdata.downloadingProgressMb": "Baixando ({0} / {1} MB)",
			"azdata.downloadFinished": "Download concluído",
			"azdata.installingAzdata": "Instalando a CLI de Dados do Azure...",
			"azdata.updatingAzdata": "Atualizando a CLI de Dados do Azure...",
			"azdata.azdataInstalled": "A CLI de Dados do Azure foi instalada com êxito. A reinicialização do Azure Data Studio é necessária para concluir a configuração. Os recursos não serão ativados até que isso seja feito.",
			"azdata.azdataUpdated": "A CLI de Dados do Azure foi atualizada com êxito para a versão: {0}.",
			"azdata.yes": "Sim",
			"azdata.no": "Não",
			"azdata.accept": "Aceitar",
			"azdata.decline": "Recusar",
			"azdata.doNotAskAgain": "Não perguntar novamente",
			"azdata.askLater": "Perguntar mais tarde",
			"azdata.downloadingTo": "Baixando {0} de {1} para {2}",
			"azdata.executingCommand": "Executando comando: '{0}{1}'",
			"azdata.stdoutOutput": "stdout: {0}",
			"azdata.stderrOutput": "stderr: {0}",
			"azdata.checkingLatestAzdataVersion": "Verificando a versão mais recente disponível da CLI de Dados do Azure",
			"azdata.gettingTextContentsOfUrl": "Obtendo conteúdo de texto do recurso em URL {0}",
			"azdata.versionForUpdate": "Versão encontrada: {0} a CLI de Dados do Azure pode ser atualizada da versão atual: {1}.",
			"azdata.latestAzdataVersionAvailable": "Versão mais recente da CLI de Dados do Azure: {0}.",
			"azdata.couldNotFindAzdata": "Não foi possível localizar a CLI de Dados do Azure. Erro: {0}",
			"azdata.currentlyInstalledVersionIsLatest": "Versão atualmente instalada da CLI de Dados do Azure: {0} é igual ou mais recente do que qualquer outra versão disponível",
			"azdata.promptLog": "Solicitando que o usuário aceite o seguinte: {0}",
			"azdata.couldNotFindAzdataWithPrompt": "Não foi possível localizar a CLI de Dados do Azure, deseja instalar agora? Caso contrário, alguns recursos não poderão funcionar.",
			"azdata.promptForAzdataUpdate": "Uma nova versão da CLI de Dados do Azure ({0}) está disponível. Deseja atualizá-la agora?",
			"azdata.promptForRequiredAzdataUpdate": "Esta extensão requer que a CLI de Dados do Azure >= seja{0} instalada. Deseja atualizar para a versão mais recente ({1}) agora? Se você não fizer isso, algumas funcionalidades poderão não funcionar.",
			"azdata.requiredVersionNotAvailable": "Essa extensão requer que a CLI de Dados do Azure >= {0} seja instalada, mas a versão atual disponível é apenas {1}. Instale a versão correta manualmente [aqui](https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata) e reinicie o Azure Data Studio.",
			"azdata.missingRequiredVersion": "A CLI de Dados do Azure >= {0} é necessária para esse recurso. Execute o comando 'CLI de Dados do Azure: verificar se há atualização' para instalá-lo e tente novamente.",
			"azdata.downloadError": "Erro ao baixar",
			"azdata.installError": "Erro ao instalar a CLI de Dados do Azure: {0}",
			"azdata.updateError": "Erro ao atualizar a CLI de Dados do Azure: {0}",
			"azdata.platformUnsupported": "A plataforma '{0}' não tem suporte no momento",
			"azdata.unexpectedCommandError": "Erro inesperado ao executar o comando: {0}",
			"azdata.unexpectedExitCode": "Código de saída inesperado do comando: {1}({0})",
			"azdata.noAzdata": "Nenhuma CLI de Dados do Azure está disponível. Execute o comando 'CLI de Dados do Azure: Instalar' para habilitar os recursos que a exigem.",
			"azdata.noAzdataWithLink": "Nenhuma CLI de Dados do Azure está disponível, [instale a CLI de Dados do Azure](command:azdata.install) para habilitar os recursos que a exigem.",
			"azdata.skipInstall": "Ignorando a instalação da CLI de Dados do Azure, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1} é {2}",
			"azdata.skipUpdate": "Ignorando a atualização da CLI de Dados do Azure, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1}é {2}",
			"azdata.skipRequiredUpdate": "Ignorando a atualização necessária da CLI de Dados do Azure, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1}é {2}",
			"azdata.noReleaseVersion": "Nenhuma versão de lançamento disponível para a plataforma ' {0} '\r\nInformações sobre a versão: ${1}",
			"azdata.noDownloadLink": "Nenhum link de download disponível para a plataforma ' {0} '\r\nInformações sobre a versão: ${1}",
			"azdata.failedToParseReleaseInfo": "Falha ao analisar o JSON de conteúdo em: {0}.\r\nConteúdo do arquivo:\r\n{1}\r\nErro: {2}",
			"azdata.azdataUserSettingReadLog": "Configuração do usuário da CLI de Dados do Azure: {0}.{1}leitura, valor: {2}",
			"azdata.azdataUserSettingUpdatedLog": "Configuração do usuário da CLI de Dados do Azure: {0}.{1}updated, newValue: {2}",
			"azdata.userResponseInstall": "Resposta do usuário no prompt para instalar a CLI de Dados do Azure: {0}",
			"azdata.userResponseUpdate": "Resposta do usuário no prompt para atualizar a CLI de Dados do Azure: {0}",
			"azdata.userRequestedInstall": "O usuário solicitou a instalação da CLI de Dados do Azure usando o comando 'CLI de Dados do Azure: Instalar'",
			"azdata.userRequestedUpdate": "O usuário solicitou a atualização da CLI de Dados do Azure usando o comando 'CLI de Dados do Azure: verificar se há atualização'",
			"azdata.acceptEula": "O usuário solicitou a aceitação do EULA invocando o comando 'CLI de Dados do Azure: Aceitar EULA'",
			"azdata.updateCheckSkipped": "Nenhuma verificação para a nova disponibilidade de versão da CLI de Dados do Azure foi executada, pois a CLI de Dados do Azure não foi encontrada para ser instalada",
			"azdata.eulaNotAccepted": "A Política de Privacidade da Microsoft e os termos de licença da CLI de Dados do Azure não foram aceitos. Execute o comando: [CLI de Dados do Azure: Aceitar EULA](command:azdata.acceptEula) para aceitar o EULA e habilitar os recursos que exigem a CLI de Dados do Azure.",
			"azdata.promptForEula": "É necessário aceitar a [Política de Privacidade da Microsoft]({0}) e os [termos de licença da CLI de Dados do Azure]({1}) para usar esta extensão. Recusar isso fará com que alguns recursos não funcionem.",
			"azdata.promptForEulaResponse": "Resposta do usuário ao prompt do EULA: {0}",
			"azdata.eulaAcceptedStateOnStartup": "Estado 'EULA Aceito' na inicialização: {0}",
			"azdata.endpointOrNamespaceRequired": "Um ponto de extremidade ou um namespace deve ser especificado"
		}
	}
}