{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/configurationEditingMain": {
			"cwd": "O diretório de trabalho atual do executor de tarefas na inicialização",
			"defaultBuildTask": "O nome da tarefa de build padrão. Se não houver uma tarefa de build única padrão, uma seleção rápida será mostrada para escolher a tarefa de build.",
			"file": "O arquivo aberto no momento",
			"fileBasename": "O nome base do arquivo aberto no momento",
			"fileBasenameNoExtension": "O nome base do arquivo aberto no momento sem nenhuma extensão de arquivo",
			"fileDirname": "O nome do diretório do arquivo aberto no momento",
			"fileExtname": "A extensão do arquivo aberto no momento",
			"lineNumber": "O número de linha selecionado no momento no arquivo ativo",
			"pathSeparator": "O caractere usado pelo sistema operacional para separar componentes em caminhos de arquivo",
			"relativeFile": "O arquivo aberto no momento em relação a ${workspaceFolder}",
			"relativeFileDirname": "O nome do diretório do arquivo aberto no momento em relação a ${workspaceFolder}",
			"selectedText": "O texto selecionado no momento no arquivo ativo",
			"workspaceFolder": "O caminho da pasta aberta no VS Code",
			"workspaceFolderBasename": "O nome da pasta aberta no VS Code sem barras (/)"
		},
		"dist/extensionsProposals": {
			"exampleExtension": "Exemplo"
		},
		"dist/settingsDocumentHelper": {
			"activeEditor": "Use a linguagem do editor de texto ativo no momento, se houver",
			"activeEditorLong": "o caminho completo do arquivo (por exemplo, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"activeEditorMedium": "o caminho do arquivo em relação à pasta do workspace (por exemplo, myFolder/myFileFolder/myFile.txt)",
			"activeEditorShort": "o nome do arquivo (por exemplo, myFile.txt)",
			"activeFolderLong": "o caminho completo da pasta na qual o arquivo está contido (por exemplo, /Users/Development/myFolder/myFileFolder)",
			"activeFolderMedium": "o caminho da pasta na qual o arquivo está contido em relação à pasta do workspace (por exemplo, myFolder/myFileFolder)",
			"activeFolderShort": "o nome da pasta na qual o arquivo está contido (por exemplo, myFileFolder)",
			"appName": "por exemplo, VS Code",
			"assocDescriptionFile": "Mapear todos os arquivos que correspondem ao padrão glob no nome de arquivo deles para a linguagem com o identificador especificado.",
			"assocDescriptionPath": "Mapear todos os arquivos que correspondem ao padrão glob de caminho absoluto no caminho deles para a linguagem com o identificador especificado.",
			"assocLabelFile": "Arquivos com Extensão",
			"assocLabelPath": "Arquivos com Caminho",
			"derivedDescription": "Corresponder arquivos que têm irmãos com o mesmo nome, mas com uma extensão diferente.",
			"derivedLabel": "Arquivos com Irmãos por Nome",
			"dirty": "um indicador para quando o editor ativo tem alterações não salvas",
			"falseDescription": "Desabilitar o padrão.",
			"fileDescription": "Corresponder todos os arquivos de uma extensão de arquivo específica.",
			"fileLabel": "Arquivos por Extensão",
			"filesDescription": "Comparar todos os arquivos com qualquer uma das extensões de arquivo.",
			"filesLabel": "Arquivos com Várias Extensões",
			"folderDescription": "Corresponder uma pasta com um nome específico em qualquer localização.",
			"folderLabel": "Pasta por Nome (Qualquer Localização)",
			"folderName": "nome da pasta do workspace na qual o arquivo está contido (por exemplo, myFolder)",
			"folderPath": "caminho do arquivo da pasta do workspace na qual o arquivo está contido (por exemplo, /Users/Development/myFolder)",
			"languageSpecificEditorSettings": "Configurações de editor específicas do idioma",
			"languageSpecificEditorSettingsDescription": "Substituir as configurações do editor para o idioma",
			"remoteName": "por exemplo, SSH",
			"rootName": "nome do workspace (por exemplo, myFolder ou myWorkspace)",
			"rootPath": "caminho do arquivo do workspace (por exemplo, /Users/Development/myWorkspace)",
			"separator": "um separador condicional (' - ') que é mostrado apenas quando circundado por variáveis com valores",
			"siblingsDescription": "Corresponder arquivos que têm irmãos com o mesmo nome, mas com uma extensão diferente.",
			"topFolderDescription": "Corresponder uma pasta de nível superior com um nome específico.",
			"topFolderLabel": "Pasta por Nome (Nível Superior)",
			"topFoldersDescription": "Corresponder várias pastas de nível superior.",
			"topFoldersLabel": "Pastas com Vários Nomes (Nível Superior)",
			"trueDescription": "Habilitar o padrão."
		},
		"package": {
			"description": "Fornece recursos (IntelliSense avançado, correção automática) em arquivos de configuração, como arquivos de recomendação de extensão, de inicialização e de configuração.",
			"displayName": "Edição de Configuração"
		}
	}
}