{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"az.promptForAzUpdate": "Uma nova versão da CLI do Azure ({0}) está disponível. Deseja atualizá-la agora?",
			"az.accept": "Aceitar",
			"az.parseVersionError": "Erro ao analisar a saída de az --version.",
			"az.azOutputParseErrorCaught": "Erro ao analisar a saída do comando Az: {0}. A saída não é JSON.",
			"az.askLater": "Perguntar mais tarde",
			"az.az": "CLI do Azure",
			"az.missingRequiredVersion": "A CLI do Azure >= {0} é necessária para esse recurso. Execute o comando 'Azure CLI: Check for Update' para instalá-lo e tente novamente.",
			"az.azUserSettingReadLog": "Configuração de usuário da CLI do Azure: {0}.{1}leitura, valor: {2}",
			"az.azUserSettingUpdatedLog": "Configuração do usuário da CLI do Azure: {0}.{1}atualizado, newValue: {2}",
			"az.azInstalled": "A CLI do Azure foi instalada com êxito. A reinicialização do Azure Studio é necessária para concluir a configuração. Os recursos não serão ativados até que isso seja feito.",
			"az.checkingLatestAzVersion": "Verificando a versão mais recente disponível da CLI do Azure",
			"az.couldNotFindAzWithPrompt": "Não foi possível localizar a CLI do Azure. Deseja instalar agora? Caso contrário, alguns recursos poderão não funcionar.",
			"az.couldNotFindAz": "Não foi possível localizar a CLI do Azure. Erro: {0}",
			"az.couldNotFindArcdataWithPrompt": "Não foi possível localizar a extensão arcdata da CLI do Azure. Deseja instalar agora? Caso contrário, alguns recursos poderão não funcionar.",
			"az.couldNotFindAzArc": "Não foi possível localizar a extensão arcdata da CLI do Azure. Erro: {0}",
			"az.currentlyInstalledVersionIsLatest": "Versão atualmente instalada da CLI do Azure: {0} é igual ou mais recente do que qualquer outra versão disponível",
			"az.decline": "Recusar",
			"az.doNotAskAgain": "Não perguntar novamente",
			"az.downloadFinished": "Download concluído",
			"az.downloadingProgressMb": "Baixando ({0} / {1} MB)",
			"az.downloadingTo": "Baixando {0} de {1} para {2}",
			"az.endpointOrNamespaceRequired": "Um ponto de extremidade ou um namespace deve ser especificado",
			"az.installError": "Erro ao instalar a CLI do Azure e a extensão arcdata: {0}",
			"az.updateError": "Erro ao atualizar o CLI do Azure: {0}",
			"az.downloadError": "Erro durante o download",
			"az.executingCommand": "Executando comando: '{0}{1}'",
			"az.failedToParseReleaseInfo": "Falha ao analisar o JSON de conteúdo em: {0}.\r\nConteúdo do arquivo:\r\n{1}\r\nErro: {2}",
			"az.foundExistingAz": "Foi encontrada uma instalação de CLI do Azure existente da versão (v{0}) no caminho:{1} com a versão do arcdata: {2}.",
			"az.versionForUpdate": "Versão encontrada: {0} a CLI do Azure pode ser atualizada da versão atual: {1}.",
			"az.gettingTextContentsOfUrl": "Obtendo conteúdo de texto do recurso em URL {0}",
			"az.installingAz": "Instalando a CLI do Azure…",
			"az.installingArcdata": "Instalando a extensão arcdata da CLI do Azure...",
			"az.latestAzVersionAvailable": "Versão mais recente da CLI do Azure: {0}.",
			"az.no": "Não",
			"az.noAzArc": "Nenhuma extensão de arcdata da CLI do Azure está disponível.",
			"az.noAzWithLink": "Nenhuma CLI do Azure está disponível, [instale a CLI do Azure](command:azdata.install) para habilitar os recursos que a exigem.",
			"az.noAz": "Nenhuma CLI do Azure está disponível. Execute o comando 'Azure CLI: Install' para habilitar os recursos que a exigem.",
			"az.noAzureCLI": "Nenhum CLI do Azure está disponível. Instale a versão mais recente manualmente [aqui](https://docs.microsoft.com/cli/azure/install-azure-cli) e reinicie o Azure Studio.",
			"az.updateCheckSkipped": "Nenhuma verificação para a nova disponibilidade de versão da CLI do Azure foi executada, pois a CLI do Azure não foi encontrada para ser instalada",
			"az.noDownloadLink": "Nenhum link de download disponível para a plataforma ''{0}''\r\nInformações sobre a versão: ${1}",
			"az.noReleaseVersion": "Nenhuma versão de lançamento disponível para a plataforma \"{0}\"\r\nInformações sobre a versão: ${1}",
			"az.platformUnsupported": "A plataforma '{0}' não tem suporte no momento",
			"az.promptLog": "Solicitando que o usuário aceite o seguinte: {0}",
			"arc.releaseDateNotParsed": "A data de lançamento não pôde ser analisada.",
			"az.searchingForAz": "Procurando pela instalação existente da CLI do Azure...",
			"az.skipInstall": "Ignorando a instalação do CLI do Azure e da extensão arcdata, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1} é {2}",
			"az.arcdataInstalled": "A extensão arcdata da CLI do Azure foi instalada com êxito. A reinicialização do Azure Data Studio é necessária para concluir a configuração. Os recursos não serão ativados até que isso seja feito.",
			"az.promptForRequiredAzUpdate": "Esta extensão requer que a CLI do Azure >= {0} seja instalada. Deseja atualizar para a versão mais recente ({1}) agora? Se você não fizer isso, algumas funcionalidades poderão não funcionar.",
			"az.arcdataExtensionNotInstalled": "Essa extensão requer que a extensão 'arcdata' da CLI do Azure seja instalada. Instale a versão mais recente usando as instruções fornecidas [aqui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.requiredVersionNotAvailable": "Essa extensão requer que a extensão 'arcdata' do CLI do Azure versão >= {0} seja instalada, mas a versão atual disponível é apenas {1}. Instale a versão correta usando as instruções [aqui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.unexpectedCommandError": "Erro inesperado ao executar o comando: {0}",
			"az.unexpectedExitCode": "Código de saída inesperado do comando: {1}({0})",
			"az.updatingAz": "Atualizando a CLI do Azure...",
			"az.userResponseInstall": "Resposta do usuário no prompt para instalar a CLI do Azure: {0}",
			"az.userResponseUpdate": "Resposta do usuário no prompt para atualizar a CLI do Azure: {0}",
			"az.userRequestedInstall": "O usuário solicitou a instalação da CLI do Azure e a extensão arcdata usando o comando 'Azure CLI: Install'",
			"az.yes": "Sim",
			"az.unsupportedArcDataVersion": "Ainda não há suporte para versão {1} baixada da extensão “arcdata” da CLI do Azure. A versão mais recente é {0}. Instale a versão correta usando as instruções encontradas [aqui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.stderrOutput": "stderr: {0}",
			"az.stdoutOutput": "stdout: {0}"
		},
		"package": {
			"azcli.arc.category": "CLI do Azure",
			"command.category": "CLI do Azure",
			"azcli.arc.displayName": "CLI do Azure",
			"azcli.arc.config.title": "Configuração da CLI do Azure",
			"azcli.arc.azArcdataInstallKey.description": "Escolha se você será solicitado a baixar a extensão arcdata da CLI do Azure.",
			"azcli.azCliInstallKey.description": "Escolha se você será solicitado a instalar a CLI do Azure.",
			"azcli.arc.azArcdataUpdateKey.description": "Escolha se você será solicitado quando uma atualização da extensão de arcdata do CLI do Azure estiver disponível.",
			"azcli.arc.config.debug": "Registrar informações de depuração no canal de saída para todos os comandos az executados",
			"azcli.arc.description": "Suporte à CLI do Azure.",
			"azcli.arc.update.prompt.description": "O usuário será solicitado a atualizar a extensão de arcdata da CLI do Azure",
			"azcli.install.prompt.description": "O usuário será solicitado a instalar o CLI do Azure",
			"azcli.arc.install.prompt.description": "O usuário será solicitado a instalar a extensão de arcdata do CLI do Azure",
			"azcli.arc.update.dontPrompt.description": "O usuário não será solicitado a atualizar a extensão arcdata da CLI do Azure",
			"azcli.install.dontPrompt.description": "O usuário não será solicitado a instalar a CLI do Azure",
			"azcli.arc.install.dontPrompt.description": "O usuário não será solicitado a instalar a extensão de arcdata do CLI do Azure"
		}
	}
}