{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"SchemaCompare.Aggregates": "Agregações",
			"SchemaCompare.AllowDropBlockingAssemblies": "Permitir a Remoção de Assemblies de Bloqueio",
			"SchemaCompare.AllowIncompatiblePlatform": "Permitir Plataforma Incompatível",
			"SchemaCompare.AllowUnsafeRowLevelSecurityDataMovement": "Permitir a Movimentação Não Segura de Dados de Segurança em Nível de Linha",
			"SchemaCompare.ApplicationRoles": "Funções de Aplicativo",
			"SchemaCompare.Assemblies": "Assemblies",
			"SchemaCompare.AssemblyFiles": "Arquivos do Assembly",
			"SchemaCompare.AsymmetricKeys": "Chaves Assimétricas",
			"SchemaCompare.Audits": "Auditorias",
			"SchemaCompare.BackupDatabaseBeforeChanges": "Fazer Backup do Banco de Dados Antes das Alterações",
			"SchemaCompare.BlockOnPossibleDataLoss": "Bloquear Em Uma Possível Perda de Dados",
			"SchemaCompare.BlockWhenDriftDetected": "Bloquear Quando For Detectado Descompasso",
			"SchemaCompare.BrokerPriorities": "Prioridades do Agente",
			"SchemaCompare.Certificates": "Certificados",
			"SchemaCompare.ClrUserDefinedTypes": "Tipos Definidos pelo Usuário CLR",
			"SchemaCompare.ColumnEncryptionKeys": "Chaves de Criptografia de Coluna",
			"SchemaCompare.ColumnMasterKeys": "Chaves Mestras de Coluna",
			"SchemaCompare.CommentOutSetVarDeclarations": "Comentário nas Declarações de Definição de Var",
			"SchemaCompare.CompareUsingTargetCollation": "Comparar Usando a Ordenação de Destino",
			"SchemaCompare.Contracts": "Contratos",
			"SchemaCompare.CreateNewDatabase": "Criar Banco de Dados",
			"SchemaCompare.Credentials": "Credenciais",
			"SchemaCompare.CryptographicProviders": "Provedores Criptográficos",
			"SchemaCompare.DatabaseAuditSpecifications": "Especificações de Auditoria de Banco de Dados",
			"SchemaCompare.DatabaseEncryptionKeys": "Chaves de Criptografia de Banco de Dados",
			"SchemaCompare.DatabaseOptions": "Opções de Banco de Dados",
			"SchemaCompare.DatabaseRoles": "Funções de Banco de Dados",
			"SchemaCompare.DatabaseScopedCredentials": "Credenciais no Escopo do Banco de Dados",
			"SchemaCompare.DatabaseTriggers": "Gatilhos de Banco de Dados",
			"SchemaCompare.Defaults": "Padrões",
			"SchemaCompare.DeployDatabaseInSingleUserMode": "Implantar o Banco de Dados no Modo de Usuário Único",
			"SchemaCompare.Description.AllowDropBlockingAssemblies": "Esta propriedade é usada pela implantação de SqlClr para que todos os assemblies de bloqueio sejam removidos como parte do plano de implantação. Por padrão, todos os assemblies de bloqueio/referência bloquearão uma atualização de assembly se o assembly de referência precisar ser removido.",
			"SchemaCompare.Description.AllowIncompatiblePlatform": "Especifica se a ação deve ser tentada apesar de plataformas SQL Server incompatíveis.",
			"SchemaCompare.Description.AllowUnsafeRowLevelSecurityDataMovement": "Não bloqueie a movimentação de dados em uma tabela que tem Segurança em Nível de Linha se esta propriedade estiver definida como true. O padrão é false.",
			"SchemaCompare.Description.BackupDatabaseBeforeChanges": "Faz backups do banco de dados antes de implantar alterações.",
			"SchemaCompare.Description.BlockOnPossibleDataLoss": "Especifica se o episódio de publicação deve ser terminado na possibilidade de perda de dados resultante da operação de publicação.",
			"SchemaCompare.Description.BlockWhenDriftDetected": "Especifica se a atualização de um banco de dados cujo esquema não corresponde mais a seu registro ou que não está registrado deverá ser bloqueada.",
			"SchemaCompare.Description.CommentOutSetVarDeclarations": "Especifica se a declaração de variáveis SETVAR deve ser comentada no script de publicação gerado. Convém fazer isso se você pretende especificar os valores na linha de comando ao publicar usando uma ferramenta, como SQLCMD.EXE.",
			"SchemaCompare.Description.CompareUsingTargetCollation": "Essa configuração determina como a ordenação do banco de dados é manipulada durante a implantação. Por padrão, a ordenação do banco de dados de destino será atualizada se não corresponder à ordenação especificada pela origem. Quando essa opção estiver definida, a ordenação do banco de dados de destino (ou do servidor) deverá ser usada.",
			"SchemaCompare.Description.CreateNewDatabase": "Especifica se o banco de dados de destino deverá ser atualizado ou removido e recriado quando você publicar em um banco de dados.",
			"SchemaCompare.Description.DeployDatabaseInSingleUserMode": "Se true, o banco de dados será definido para o Modo de Usuário Único antes da implantação.",
			"SchemaCompare.Description.DisableAndReenableDdlTriggers": "Especifica se os gatilhos DDL (Data Definition Language) são desabilitados no início do processo de publicação e reabilitados ao final da ação de publicação.",
			"SchemaCompare.Description.DoNotAlterChangeDataCaptureObjects": "Se true, os objetos do Change Data Capture não serão alterados.",
			"SchemaCompare.Description.DoNotAlterReplicatedObjects": "Especifica se os objetos replicados são identificados durante a verificação.",
			"SchemaCompare.Description.DropConstraintsNotInSource": "Especifica se restrições que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar em um banco de dados.",
			"SchemaCompare.Description.DropDmlTriggersNotInSource": "Especifica se gatilhos DML que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidos do banco de dados de destino quando você publicar em um banco de dados.",
			"SchemaCompare.Description.DropExtendedPropertiesNotInSource": "Especifica se as propriedades estendidas que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar em um banco de dados.",
			"SchemaCompare.Description.DropIndexesNotInSource": "Especifica se os índices que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidos do banco de dados de destino quando você publicar em um banco de dados.",
			"SchemaCompare.Description.DropObjectsNotInSource": "Especifica se objetos que não existem no arquivo de instantâneo de banco de dados (.dacpac) serão removidos do banco de dados de destino quando você publicar em um banco de dados. Esse valor prevalece sobre DropExtendedProperties.",
			"SchemaCompare.Description.DropPermissionsNotInSource": "Especifica se as permissões que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar atualizações em um banco de dados.",
			"SchemaCompare.Description.DropRoleMembersNotInSource": "Especifica se os membros da função que não estão definidos no arquivo de instantâneo (.dacpac) do banco de dados serão removidos do banco de dados de destino quando você publicar as atualizações em um banco de dados.</",
			"SchemaCompare.Description.DropStatisticsNotInSource": "Especifica se as estatísticas que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar em um banco de dados.",
			"SchemaCompare.Description.GenerateSmartDefaults": "Automaticamente fornece um valor padrão ao atualizar uma tabela que contém dados com uma coluna que não permite valores nulos.",
			"SchemaCompare.Description.IgnoreAnsiNulls": "Especifica se diferenças na configuração ANSI NULLS deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreAuthorizer": "Especifica se diferenças no Autorizador deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreColumnCollation": "Especifica se diferenças nos agrupamentos de colunas deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreColumnOrder": "Especifica se as diferenças na ordem das colunas da tabela deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreComments": "Especifica se diferenças nos comentários deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreCryptographicProviderFilePath": "Especifica se as diferenças no caminho do arquivo para o provedor de criptografia deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreDdlTriggerOrder": "Especifica se diferenças na ordem de gatilhos DDL (linguagem de definição de dados) deverão ser ignoradas ou atualizadas quando você publicar em um servidor ou banco de dados.",
			"SchemaCompare.Description.IgnoreDdlTriggerState": "Especifica se diferenças no estado habilitado ou desabilitado de gatilhos DDL (linguagem de definição de dados) deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreDefaultSchema": "Especifica se diferenças no esquema padrão deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreDmlTriggerOrder": "Especifica se diferenças na ordem de gatilhos DML (linguagem de manipulação de dados) deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreDmlTriggerState": "Especifica se diferenças no estado habilitado ou desabilitado de gatilhos DML deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreExtendedProperties": "Especifica se as propriedades estendidas devem ser ignoradas.",
			"SchemaCompare.Description.IgnoreFileAndLogFilePath": "Especifica se diferenças nos caminhos para arquivos e arquivos de log deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreFileSize": "Especifica se diferenças nos tamanhos de arquivos deverão ser ignoradas ou se um aviso deverá ser emitido quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreFilegroupPlacement": "Especifica se diferenças no posicionamento de objetos em FILEGROUPs deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreFillFactor": "Especifica se diferenças no fator de preenchimento de armazenamento de índice deverão ser ignoradas ou se um aviso deverá ser emitido quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreFullTextCatalogFilePath": "Especifica se diferenças no caminho do arquivo do catálogo de texto completo deverão ser ignoradas ou se um aviso deverá ser emitido quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreIdentitySeed": "Especifica se diferenças na semente de uma coluna de identidade deverão ser ignoradas ou atualizadas quando você publicar atualizações em um banco de dados.",
			"SchemaCompare.Description.IgnoreIncrement": "Especifica se diferenças no incremento de uma coluna de identidade deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreIndexOptions": "Especifica se diferenças nas opções de índice deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreIndexPadding": "Especifica se diferenças no preenchimento de índices deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreKeywordCasing": "Especifica se diferenças de uso de maiúsculas em palavras-chave deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreLockHintsOnIndexes": "Especifica se diferenças nas dicas de bloqueio em índices deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreLoginSids": "Especifica se diferenças no SID (número de identificação de segurança) deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreNotForReplication": "Especifica se as configurações que não sejam para replicação deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreObjectPlacementOnPartitionScheme": "Especifica se o posicionamento de um objeto em um esquema de partição deverá ser ignorado ou atualizado quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnorePartitionSchemes": "Especifica se diferenças em esquemas de partição e funções deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnorePermissions": "Especifica se as permissões deverão ser ignoradas.",
			"SchemaCompare.Description.IgnoreQuotedIdentifiers": "Especifica se diferenças na configuração de identificadores entre aspas deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreRoleMembership": "Especifica se diferenças na associação de funções de logons deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreRouteLifetime": "Especifica se diferenças na quantidade de tempo que o SQL Server retém a rota na tabela de roteamento deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreSemicolonBetweenStatements": "Especifica se diferenças nos pontos e vírgulas entre instruções T-SQL serão ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreTableOptions": "Especifica se diferenças nas opções de tabela serão ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreUserSettingsObjects": "Especifica se diferenças nos objetos de configuração de usuário serão ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreWhitespace": "Especifica se diferenças de espaço em branco serão ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreWithNocheckOnCheckConstraints": "Especifica se diferenças no valor da cláusula WITH NOCHECK para restrições de verificação serão ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IgnoreWithNocheckOnForeignKeys": "Especifica se diferenças no valor da cláusula WITH NOCHECK para chaves estrangeiras serão ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.IncludeCompositeObjects": "Inclua todos os elementos compostos como parte de uma única operação de publicação.",
			"SchemaCompare.Description.IncludeTransactionalScripts": "Especifica se instruções transacionais deverão ser usadas onde possível quando você publicar em um banco de dados.",
			"SchemaCompare.Description.NoAlterStatementsToChangeClrTypes": "Especifica que a publicação sempre deverá remover e recriar um assembly quando houver uma diferença em vez de emitir uma instrução ALTER ASSEMBLY",
			"SchemaCompare.Description.PopulateFilesOnFileGroups": "Especifica se um novo arquivo também será criado quando um novo FileGroup for criado no banco de dados de destino.",
			"SchemaCompare.Description.RegisterDataTierApplication": "Especifica se o esquema é registrado no servidor de banco de dados.",
			"SchemaCompare.Description.RunDeploymentPlanExecutors": "Especifica se os colaboradores de DeploymentPlanExecutor deverão ser executados quando outras operações forem executadas.",
			"SchemaCompare.Description.ScriptDatabaseCollation": "Especifica se diferenças no agrupamento do banco de dados deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.ScriptDatabaseCompatibility": "Especifica se diferenças na compatibilidade do banco de dados deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.",
			"SchemaCompare.Description.ScriptDatabaseOptions": "Especifica se as propriedades do banco de dados de destino devem ser definidas ou atualizadas como parte da ação de publicação.",
			"SchemaCompare.Description.ScriptDeployStateChecks": "Especifica se as instruções serão geradas no script de publicação para verificar se o nome do banco de dados e o nome do servidor correspondem aos nomes especificados no projeto de banco de dados.",
			"SchemaCompare.Description.ScriptFileSize": "Determina se o tamanho é especificado ao adicionar um arquivo a um filegroup.",
			"SchemaCompare.Description.ScriptNewConstraintValidation": "Ao final da publicação, todas as restrições serão verificadas em conjunto, evitando erros de dados causados por uma restrição de verificação ou chave estrangeira no meio da publicação. Se o item for definido como False, as restrições serão publicadas sem que os dados correspondentes sejam verificados.",
			"SchemaCompare.Description.ScriptRefreshModule": "Inclui instruções de atualização no fim do script de publicação.",
			"SchemaCompare.Description.TreatVerificationErrorsAsWarnings": "Especifica se erros encontrados durante a verificação de publicação deverão ser tratados como avisos. A verificação é executada no plano de implantação gerado antes de o plano ser executado no banco de dados de destino. A verificação do plano detecta problemas, como a perda de objetos somente destino (como índices), que deverão ser removidos para fazer uma alteração. A verificação também detecta situações em que dependências (como uma tabela ou exibição) existem por causa de uma referência a um projeto composto, mas não existem no banco de dados de destino. Convém fazer isso para obter uma lista completa de todos os problemas, ao invés de interromper a publicação no primeiro erro.",
			"SchemaCompare.Description.UnmodifiableObjectWarnings": "Especifica se avisos deverão ser gerados quando diferenças forem encontradas em objetos que não podem ser modificados, por exemplo, se o tamanho de arquivo ou caminho de arquivo for diferente para um arquivo.",
			"SchemaCompare.Description.VerifyCollationCompatibility": "Especifica se a compatibilidade do agrupamento é verificada.",
			"SchemaCompare.Description.VerifyDeployment": "Especifica se, antes da publicação, deverão ser executadas verificações, que interromperão a ação de publicação se houver problemas presentes que possam impedir uma publicação bem-sucedida. Por exemplo, a ação de publicação poderá ser interrompida se houver chaves estrangeiras no banco de dados de destino que não existam no projeto de banco de dados e que causarão erros na publicação.",
			"SchemaCompare.DisableAndReenableDdlTriggers": "Desabilitar e Reabilitar os Gatilhos DDL",
			"SchemaCompare.DoNotAlterChangeDataCaptureObjects": "Não Alterar os Objetos de Captura de Dados de Alterações",
			"SchemaCompare.DoNotAlterReplicatedObjects": "Não Alterar os Objetos Replicados",
			"SchemaCompare.DropConstraintsNotInSource": "Remover as Restrições que Não Estão na Origem",
			"SchemaCompare.DropDmlTriggersNotInSource": "Remover os Gatilhos DML que Não Estão na Origem",
			"SchemaCompare.DropExtendedPropertiesNotInSource": "Remover as Propriedades Estendidas que Não Estão na Origem",
			"SchemaCompare.DropIndexesNotInSource": "Remover os Índices que Não Estão na Origem",
			"SchemaCompare.DropObjectsNotInSource": "Remover os Objetos que Não Estão na Origem",
			"SchemaCompare.DropPermissionsNotInSource": "Remover as Permissões que Não Estão na Origem",
			"SchemaCompare.DropRoleMembersNotInSource": "Remover os Membros da Função que Não Estão na Origem",
			"SchemaCompare.DropStatisticsNotInSource": "Remover as Estatísticas que Não Estão na Origem",
			"SchemaCompare.Endpoints": "Pontos de Extremidade",
			"SchemaCompare.ErrorMessages": "Mensagens de Erro",
			"SchemaCompare.EventNotifications": "Notificações de Evento",
			"SchemaCompare.EventSessions": "Sessões de Evento",
			"SchemaCompare.ExtendedProperties": "Propriedades Estendidas",
			"SchemaCompare.ExternalDataSources": "Fontes de Dados Externas",
			"SchemaCompare.ExternalFileFormats": "Formatos de Arquivo Externos",
			"SchemaCompare.ExternalStreamingJobs": "Trabalhos de Streaming Externos",
			"SchemaCompare.ExternalStreams": "Fluxos Externos",
			"SchemaCompare.ExternalTables": "Tabelas Externas",
			"SchemaCompare.FileTables": "Tabelas de Arquivos",
			"SchemaCompare.Filegroups": "Grupos de Arquivos",
			"SchemaCompare.Files": "Arquivos",
			"SchemaCompare.FullTextCatalogs": "Catálogos de Texto Completo",
			"SchemaCompare.FullTextStoplists": "Listas de Palavras Irrelevantes de Texto Completo",
			"SchemaCompare.GeneralOptionsLabel": "Opções Gerais",
			"SchemaCompare.GenerateSmartDefaults": "Gerar SmartDefaults",
			"SchemaCompare.IgnoreAnsiNulls": "Ignorar AnsiNulls",
			"SchemaCompare.IgnoreAuthorizer": "Ignorar o Autorizador",
			"SchemaCompare.IgnoreColumnCollation": "Ignorar a Ordenação de Colunas",
			"SchemaCompare.IgnoreColumnOrder": "Ignorar a Ordem de Colunas",
			"SchemaCompare.IgnoreComments": "Ignorar Comentários",
			"SchemaCompare.IgnoreCryptographicProviderFilePath": "Ignorar o FilePath do Provedor de Criptografia",
			"SchemaCompare.IgnoreDdlTriggerOrder": "Ignorar a Ordem do Gatilho DDL",
			"SchemaCompare.IgnoreDdlTriggerState": "Ignorar o Estado do Gatilho DDL",
			"SchemaCompare.IgnoreDefaultSchema": "Ignorar o Esquema Padrão",
			"SchemaCompare.IgnoreDmlTriggerOrder": "Ignorar a Ordem do Gatilho DML",
			"SchemaCompare.IgnoreDmlTriggerState": "Ignorar o Estado do Gatilho DML",
			"SchemaCompare.IgnoreExtendedProperties": "Ignorar as Propriedades Estendidas",
			"SchemaCompare.IgnoreFileAndLogFilePath": "Ignorar o Arquivo e o Caminho do Arquivo de Log",
			"SchemaCompare.IgnoreFileSize": "Ignorar o Tamanho do Arquivo",
			"SchemaCompare.IgnoreFilegroupPlacement": "Ignorar o Posicionamento do Grupo de Arquivos",
			"SchemaCompare.IgnoreFillFactor": "Ignorar Fator de Preenchimento",
			"SchemaCompare.IgnoreFullTextCatalogFilePath": "Ignorar o FilePath do Catálogo de Texto Completo",
			"SchemaCompare.IgnoreIdentitySeed": "Ignorar Semente de Identidade",
			"SchemaCompare.IgnoreIncrement": "Ignorar Incremento",
			"SchemaCompare.IgnoreIndexOptions": "Ignorar as Opções de Índice",
			"SchemaCompare.IgnoreIndexPadding": "Ignorar o Preenchimento de Índice",
			"SchemaCompare.IgnoreKeywordCasing": "Ignorar o Uso de Maiúsculas e Minúsculas em Palavra-chave",
			"SchemaCompare.IgnoreLockHintsOnIndexes": "Ignorar Dicas de Bloqueio Em Índices",
			"SchemaCompare.IgnoreLoginSids": "Ignorar os SIDs de Logon",
			"SchemaCompare.IgnoreNotForReplication": "Ignorar os que Não São para Replicação",
			"SchemaCompare.IgnoreObjectPlacementOnPartitionScheme": "Ignorar o Posicionamento de Objeto no Esquema de Partição",
			"SchemaCompare.IgnorePartitionSchemes": "Ignorar os Esquemas de Partição",
			"SchemaCompare.IgnorePermissions": "Ignorar Permissões",
			"SchemaCompare.IgnoreQuotedIdentifiers": "Ignorar Identificadores Entre Aspas",
			"SchemaCompare.IgnoreRoleMembership": "Ignorar Associação de Função",
			"SchemaCompare.IgnoreRouteLifetime": "Ignorar o Tempo de Vida da Rota",
			"SchemaCompare.IgnoreSemicolonBetweenStatements": "Ignorar Ponto e Vírgula Entre Instruções",
			"SchemaCompare.IgnoreTableOptions": "Ignorar as Opções de Tabela",
			"SchemaCompare.IgnoreUserSettingsObjects": "Ignorar os Objetos de Configurações do Usuário",
			"SchemaCompare.IgnoreWhitespace": "Ignorar Espaço em Branco",
			"SchemaCompare.IgnoreWithNocheckOnCheckConstraints": "Ignorar Sem Nenhuma Verificação nas Restrições de Verificação",
			"SchemaCompare.IgnoreWithNocheckOnForeignKeys": "Ignorar Com Nocheck Em ForeignKeys",
			"SchemaCompare.IncludeCompositeObjects": "Incluir Objetos Compostos",
			"SchemaCompare.IncludeTransactionalScripts": "Incluir Scripts Transacionais",
			"SchemaCompare.LinkedServerLogins": "Logons de Servidor Vinculado",
			"SchemaCompare.LinkedServers": "Servidores Vinculados",
			"SchemaCompare.Logins": "Logons",
			"SchemaCompare.MasterKeys": "Chaves Mestras",
			"SchemaCompare.MessageTypes": "Tipos de Mensagem",
			"SchemaCompare.NoAlterStatementsToChangeClrTypes": "Sem instruções Alter para alterar tipos Clr",
			"SchemaCompare.ObjectTypesOptionsLabel": "Incluir Tipos de Objetos",
			"SchemaCompare.PartitionFunctions": "Funções de Partição",
			"SchemaCompare.PartitionSchemes": "Esquemas de Partição",
			"SchemaCompare.Permissions": "Permissões",
			"SchemaCompare.PopulateFilesOnFileGroups": "Popular Arquivos em Grupos de Arquivos",
			"SchemaCompare.Queues": "Filas",
			"SchemaCompare.RegisterDataTierApplication": "Registrar o Aplicativo DataTier",
			"SchemaCompare.RemoteServiceBindings": "Associações de Serviço Remoto",
			"SchemaCompare.RoleMembership": "Associação de Função",
			"SchemaCompare.Routes": "Rotas",
			"SchemaCompare.Rules": "Regras",
			"SchemaCompare.RunDeploymentPlanExecutors": "Executar Executores do Plano de Implantação",
			"SchemaCompare.ScalarValuedFunctions": "Funções de Valor Escalar",
			"SchemaCompare.SchemaCompareOptionsDialogLabel": "Opções da Comparação de Esquemas",
			"SchemaCompare.ScriptDatabaseCollation": "Ordenação de Banco de Dados de Script",
			"SchemaCompare.ScriptDatabaseCompatibility": "Compatibilidade do Banco de Dados de Script",
			"SchemaCompare.ScriptDatabaseOptions": "Opções de Banco de Dados de Script",
			"SchemaCompare.ScriptDeployStateChecks": "StateChecks de Implantação de Script",
			"SchemaCompare.ScriptFileSize": "Tamanho do Arquivo de Script",
			"SchemaCompare.ScriptNewConstraintValidation": "Validação de Nova Restrição de Script",
			"SchemaCompare.ScriptRefreshModule": "Módulo de Atualização de Script",
			"SchemaCompare.SearchPropertyLists": "Listas de Propriedades de Pesquisa",
			"SchemaCompare.SecurityPolicies": "Políticas de Segurança",
			"SchemaCompare.Sequences": "Sequências",
			"SchemaCompare.ServerAuditSpecifications": "Especificações de Auditoria de Servidor",
			"SchemaCompare.ServerRoleMembership": "Associação de Função de Servidor",
			"SchemaCompare.ServerRoles": "Funções de Servidor",
			"SchemaCompare.ServerTriggers": "Gatilhos de Servidor",
			"SchemaCompare.Services": "Serviços",
			"SchemaCompare.Signatures": "Assinaturas",
			"SchemaCompare.StoredProcedures": "Procedimentos Armazenados",
			"SchemaCompare.SymmetricKeys": "Chaves Simétricas",
			"SchemaCompare.Synonyms": "Sinônimos",
			"SchemaCompare.TableValuedFunctions": "Funções com Valor de Tabela",
			"SchemaCompare.Tables": "Tabelas",
			"SchemaCompare.TreatVerificationErrorsAsWarnings": "Tratar os Erros de Verificação Como Avisos",
			"SchemaCompare.UnmodifiableObjectWarnings": "Avisos de Objeto Não Modificável",
			"SchemaCompare.UserDefinedDataTypes": "Tipos de Dados Definidos pelo Usuário",
			"SchemaCompare.UserDefinedTableTypes": "Tipos de Tabela Definidos pelo Usuário",
			"SchemaCompare.Users": "Usuários",
			"SchemaCompare.VerifyCollationCompatibility": "Verificar a Compatibilidade da Ordenação",
			"SchemaCompare.VerifyDeployment": "Verificar a Implantação",
			"SchemaCompare.Views": "Exibições",
			"SchemaCompare.XmlSchemaCollections": "Coleções de Esquema XML",
			"SchemaCompareOptionsDialog.Reset": "Redefinir",
			"schemaCompare.ApplyConfirmation": "Tem certeza de que deseja atualizar o destino?",
			"schemaCompare.CompareDetailsTitle": "Comparar os Detalhes",
			"schemaCompare.GetConnectionString": "Você deseja se conectar a {0}?",
			"schemaCompare.RecompareToRefresh": "Pressione Comparar para atualizar a comparação.",
			"schemaCompare.actionColumn": "Ação",
			"schemaCompare.addAction": "Adicionar",
			"schemaCompare.applyButtonDisabledTitle": "Aplicar é habilitado quando o destino é um banco de dados",
			"schemaCompare.applyButtonEnabledTitle": "Aplicar alterações ao destino",
			"schemaCompare.applyNoChanges": "Não há nenhuma alteração a ser aplicada",
			"schemaCompare.cancelCompareButton": "Parar",
			"schemaCompare.cancelErrorMessage": "Falha no cancelamento da comparação de esquemas: '{0}'",
			"schemaCompare.cannotExcludeMessage": "Não é possível excluir {0}. Existem dependentes incluídos",
			"schemaCompare.cannotExcludeMessageWithDependent": "Não é possível excluir {0}. Existem dependentes incluídos, como {1}",
			"schemaCompare.cannotIncludeMessage": "Não é possível incluir {0}. Existem dependentes excluídos",
			"schemaCompare.cannotIncludeMessageWithDependent": "Não é possível incluir {0}. Existem dependentes excluídos, como {1}",
			"schemaCompare.changeAction": "Alterar",
			"schemaCompare.compareButton": "Comparar",
			"schemaCompare.compareErrorMessage": "Falha na Comparação de Esquemas: {0}",
			"schemaCompare.dacpacRadioButtonLabel": "Arquivo do Aplicativo da Camada de Dados (.dacpac)",
			"schemaCompare.databaseButtonLabel": "Banco de dados",
			"schemaCompare.deleteAction": "Excluir",
			"schemaCompare.dialogTitle": "Comparação de Esquemas",
			"schemaCompare.differencesTableTitle": "Comparação entre Origem e Destino",
			"schemaCompare.generateScriptButton": "Gerar script",
			"schemaCompare.generateScriptButtonDisabledTitle": "Gerar script é habilitado quando o destino é um banco de dados",
			"schemaCompare.generateScriptEnabledButton": "Gerar script para implantar alterações no destino",
			"schemaCompare.generateScriptErrorMessage": "Falha ao gerar script: '{0}'",
			"schemaCompare.generateScriptNoChanges": "Nenhuma alteração no script",
			"schemaCompare.includeColumnName": "Incluir",
			"schemaCompare.includeExcludeInfoMessage": "Observe que as operações incluir/excluir podem demorar um pouco para calcular as dependências afetadas",
			"schemaCompare.noDifferences": "Não foi encontrada nenhuma diferença de esquema.",
			"schemaCompare.openFile": "Abrir",
			"schemaCompare.openScmpButton": "Abrir arquivo .scmp",
			"schemaCompare.openScmpButtonTitle": "Carregar a origem, o destino e as opções salvas em um arquivo .scmp",
			"schemaCompare.openScmpErrorMessage": "Falha ao abrir o scmp: '{0}'",
			"schemaCompare.optionsButton": "Opções",
			"schemaCompare.radioButtonsLabel": "Tipo",
			"schemaCompare.saveFile": "Salvar",
			"schemaCompare.saveScmpButton": "Salvar o arquivo .scmp",
			"schemaCompare.saveScmpButtonTitle": "Salvar a origem e o destino, as opções e os elementos excluídos",
			"schemaCompare.saveScmpErrorMessage": "Falha ao salvar scmp: '{0}'",
			"schemaCompare.selectConnection": "Selecionar a conexão",
			"schemaCompare.selectSourceFile": "Selecione o arquivo de origem",
			"schemaCompare.selectTargetFile": "Selecionar a pasta de destino",
			"schemaCompare.sourceButtonTitle": "Selecionar Origem",
			"schemaCompare.sourceNameColumn": "Nome da Origem",
			"schemaCompare.startText": "Para comparar dois esquemas, primeiro selecione um esquema de origem e um esquema de destino e, em seguida, pressione Comparar.",
			"schemaCompare.switchButtonTitle": "Alternar origem e destino",
			"schemaCompare.switchDirectionButton": "Alternar direção",
			"schemaCompare.targetButtonTitle": "Selecionar Destino",
			"schemaCompare.targetNameColumn": "Nome do Destino",
			"schemaCompare.typeColumn": "Tipo",
			"schemaCompare.updateButton": "Aplicar",
			"schemaCompare.updateErrorMessage": "Falha ao Aplicar a Comparação de Esquemas '{0}'",
			"schemaCompare.waitText": "Inicializando a comparação. Isso pode demorar um pouco.",
			"schemaCompareDialog.No": "Não",
			"schemaCompareDialog.SourceTitle": "Fonte",
			"schemaCompareDialog.TargetTitle": "Destino",
			"schemaCompareDialog.Yes": "Sim",
			"schemaCompareDialog.cancel": "Cancelar",
			"schemaCompareDialog.databaseDropdownTitle": "Banco de dados",
			"schemaCompareDialog.defaultUser": "padrão",
			"schemaCompareDialog.differentSourceMessage": "Um esquema de origem diferente foi selecionado. Comparar para ver a comparação?",
			"schemaCompareDialog.differentSourceTargetMessage": "Diferentes esquemas de origem e de destino foram selecionados. Comparar para ver a comparação?",
			"schemaCompareDialog.differentTargetMessage": "Um esquema de destino diferente foi selecionado. Comparar para ver a comparação?",
			"schemaCompareDialog.fileTextBoxLabel": "Arquivo",
			"schemaCompareDialog.ok": "OK",
			"schemaCompareDialog.serverDropdownTitle": "Servidor",
			"schemaCompareDialog.sourceDatabaseDropdown": "Banco de Dados de Origem",
			"schemaCompareDialog.sourceServerDropdown": "Servidor de Origem",
			"schemaCompareDialog.sourceTextBox": "Arquivo de origem",
			"schemaCompareDialog.targetDatabaseDropdown": "Banco de Dados de Destino",
			"schemaCompareDialog.targetServerDropdown": "Servidor de Destino",
			"schemaCompareDialog.targetTextBox": "Arquivo de destino",
			"schemaCompareOptions.RecompareMessage": "As opções mudaram. Comparar novamente para ver a comparação?"
		},
		"package": {
			"description": "A Comparação de Esquemas do SQL Server para o Azure Data Studio dá suporte à comparação de esquemas de bancos de dados e dacpacs.",
			"displayName": "Comparação de Esquemas do SQL Server",
			"schemaCompare.start": "Comparação de Esquemas"
		}
	}
}