{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"msgInstallPkgProgress": "A instalação de dependências do Notebook está em andamento",
	"msgPythonDownloadComplete": "O download do Python está concluído",
	"msgPythonDownloadError": "Erro ao baixar a configuração do Python",
	"msgPythonDownloadPending": "Baixando o pacote Python",
	"msgPythonUnpackPending": "Descompactando o pacote Python",
	"msgPythonDirectoryError": "Erro ao criar o diretório de instalação do Python",
	"msgPythonUnpackError": "Erro ao descompactar o pacote Python",
	"msgTaskName": "Instalando as dependências do Notebook",
	"msgInstallPkgStart": "Instalando as dependências do Notebook. Confira a exibição Tarefas para obter mais informações",
	"msgInstallPkgFinish": "A instalação das dependências do Notebook está concluída",
	"msgPythonRunningError": "Não é possível substituir uma instalação do Python existente enquanto o Python está em execução. Feche todos os notebooks ativos antes de prosseguir.",
	"msgSkipPythonInstall": "O Python já existe no local específico. Ignorando a instalação.",
	"msgWaitingForInstall": "Outra instalação do Python está em andamento no momento. Esperando a conclusão.",
	"msgDependenciesInstallationFailed": "Falha na instalação das dependências do Notebook com o erro: {0}",
	"msgDownloadPython": "Baixando o Python local para a plataforma: {0} a {1}",
	"confirmPackageUpgrade": "Alguns pacotes do Python instalados precisam ser atualizados. Deseja atualizá-los agora?",
	"upgradePackages.pipInstall": "Instalando {0}",
	"msgInstallStart": "Instalando os pacotes necessários para executar Notebooks...",
	"msgJupyterInstallDone": "...Instalação do Jupyter concluída."
}