{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"errorLoading": "Erreur lors du chargement des éléments d’historique des requêtes enregistrées. {0}",
			"failed": "Échec",
			"succeeded": "Réussite"
		},
		"package": {
			"queryHistory.clear": "Effacer tout l'historique",
			"queryHistory.delete": "Supprimer",
			"queryHistory.loading": "Chargement des entrées enregistrées...",
			"queryHistory.maxEntries": "Nombre maximal d’entrées à stocker. 0 signifie que des entrées illimitées sont stockées. L’augmentation de cette limite peut avoir un impact sur les performances, en particulier si la persistance est activée.",
			"queryHistory.noEntries": "Aucune requête à afficher",
			"queryHistory.open": "Ouvrir la requête",
			"queryHistory.doubleClickAction.run": "Ouvrir un nouvel éditeur connecté avec la requête et la connexion de l'élément d'historique sélectionné et exécuter automatiquement la requête",
			"queryHistory.doubleClickAction.open": "Ouvrir un nouvel éditeur déconnecté avec la requête de l'élément d'historique sélectionné",
			"queryHistory.openStorageFolder": "Ouvrir le dossier de stockage",
			"queryHistory.disableCapture": "Suspendre la capture de l'historique des requêtes",
			"queryHistory.displayName": "Historique des requêtes",
			"queryHistory.run": "Exécuter la requête",
			"queryHistory.enableCapture": "Démarrer la capture de l'historique des requêtes",
			"queryHistory.doubleClickAction": "L'action entreprise lorsqu'un élément de l'historique est double-cliqué",
			"queryHistory.description": "Afficher et exécuter des requêtes exécutées précédemment",
			"queryHistory.captureEnabledDesc": "Indique si la capture de l'historique des requêtes est activée. Si la valeur est false, les requêtes exécutées ne sont pas capturées.",
			"queryHistory.persistHistory": "Indique si l’historique des requêtes est conservé lors des redémarrages. Si la valeur est false, l’historique est effacé à la fermeture de l’application."
		}
	}
}