{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"SchemaCompare.Aggregates": "Agrégats",
			"SchemaCompare.AllowDropBlockingAssemblies": "Autoriser la suppression des assemblys bloquants",
			"SchemaCompare.AllowIncompatiblePlatform": "Autoriser une plateforme incompatible",
			"SchemaCompare.AllowUnsafeRowLevelSecurityDataMovement": "Autoriser le déplacement non sécurisé des données de sécurité au niveau des lignes",
			"SchemaCompare.ApplicationRoles": "Rôles d'application",
			"SchemaCompare.Assemblies": "Assemblys",
			"SchemaCompare.AssemblyFiles": "Fichiers d'assembly",
			"SchemaCompare.AsymmetricKeys": "Clés asymétriques",
			"SchemaCompare.Audits": "Audits",
			"SchemaCompare.BackupDatabaseBeforeChanges": "Sauvegarder la base de données avant les changements",
			"SchemaCompare.BlockOnPossibleDataLoss": "Bloquer en cas de perte de données possible",
			"SchemaCompare.BlockWhenDriftDetected": "Bloquer en cas de dérive détectée",
			"SchemaCompare.BrokerPriorities": "Priorités de Service Broker",
			"SchemaCompare.Certificates": "Certificats",
			"SchemaCompare.ClrUserDefinedTypes": "Types CLR définis par l'utilisateur",
			"SchemaCompare.ColumnEncryptionKeys": "Clés de chiffrement de colonne",
			"SchemaCompare.ColumnMasterKeys": "Clés principales de colonne",
			"SchemaCompare.CommentOutSetVarDeclarations": "Annuler les marques de commentaire des déclarations de variable définies",
			"SchemaCompare.CompareUsingTargetCollation": "Comparer à l'aide du classement cible",
			"SchemaCompare.Contracts": "Contrats",
			"SchemaCompare.CreateNewDatabase": "Créer une base de données",
			"SchemaCompare.Credentials": "Informations d'identification",
			"SchemaCompare.CryptographicProviders": "Fournisseurs de chiffrement",
			"SchemaCompare.DatabaseAuditSpecifications": "Spécifications de l'audit de base de données",
			"SchemaCompare.DatabaseEncryptionKeys": "Clés de chiffrement de base de données",
			"SchemaCompare.DatabaseOptions": "Options de base de données",
			"SchemaCompare.DatabaseRoles": "Rôles de base de données",
			"SchemaCompare.DatabaseScopedCredentials": "Informations d'identification limitées à la base de données",
			"SchemaCompare.DatabaseTriggers": "Déclencheurs de base de données",
			"SchemaCompare.Defaults": "Valeurs par défaut",
			"SchemaCompare.DeployDatabaseInSingleUserMode": "Déployer la base de données en mode mono-utilisateur",
			"SchemaCompare.Description.AllowDropBlockingAssemblies": "Cette propriété est utilisée par le déploiement SqlClr pour permettre la suppression de tout assembly bloquant dans le cadre du plan de déploiement. Par défaut, un assembly bloquant ou de référence bloque une mise à jour d'assembly s'il faut supprimer l'assembly de référence.",
			"SchemaCompare.Description.AllowIncompatiblePlatform": "Spécifie s'il faut tenter l'action en dépit de plateformes SQL Server incompatibles.",
			"SchemaCompare.Description.AllowUnsafeRowLevelSecurityDataMovement": "Ne bloquez pas le déplacement des données sur une table avec sécurité au niveau des lignes si cette propriété est définie sur true. La valeur par défaut est false.",
			"SchemaCompare.Description.BackupDatabaseBeforeChanges": "Sauvegarde la base de données avant le déploiement de changements.",
			"SchemaCompare.Description.BlockOnPossibleDataLoss": "Spécifie que l'épisode de publication doit être arrêté en cas de risque de perte de données suite à l'opération de publication.",
			"SchemaCompare.Description.BlockWhenDriftDetected": "Spécifie s'il faut bloquer la mise à jour d'une base de données dont le schéma ne correspond plus à son inscription ou n'est pas inscrit.",
			"SchemaCompare.Description.CommentOutSetVarDeclarations": "Spécifie si la déclaration de variables SETVAR doit être commentée dans le script de publication généré. Vous pouvez choisir cette option si vous prévoyez de spécifier des valeurs sur la ligne de commande quand vous effectuez la publication à l'aide d'un outil, comme SQLCMD.EXE.",
			"SchemaCompare.Description.CompareUsingTargetCollation": "Ce paramètre définit la façon dont le classement de la base de données est géré pendant le déploiement. Par défaut, le classement de la base de données cible est mis à jour s'il ne correspond pas au classement spécifié par la source. Quand cette option est définie, le classement de la base de données (ou du serveur) cible doit être utilisé.",
			"SchemaCompare.Description.CreateNewDatabase": "Spécifie si la base de données cible doit être mise à jour, ou si elle doit être supprimée et recréée quand vous publiez dans une base de données.",
			"SchemaCompare.Description.DeployDatabaseInSingleUserMode": "Si la valeur est true, la base de données est définie sur le mode mono-utilisateur avant le déploiement.",
			"SchemaCompare.Description.DisableAndReenableDdlTriggers": "Spécifie si les déclencheurs de langage de description de données (DDL) sont désactivés au début du processus de publication et réactivés à la fin de l'action de publication.",
			"SchemaCompare.Description.DoNotAlterChangeDataCaptureObjects": "Si la valeur est true, les objets de capture des changements de données ne sont pas modifiés.",
			"SchemaCompare.Description.DoNotAlterReplicatedObjects": "Indique si les objets répliqués sont identifiés pendant la vérification.",
			"SchemaCompare.Description.DropConstraintsNotInSource": "Spécifie si des contraintes qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez dans une base de données.",
			"SchemaCompare.Description.DropDmlTriggersNotInSource": "Spécifie si les déclencheurs DML qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimés de la base de données cible quand vous publiez dans une base de données.",
			"SchemaCompare.Description.DropExtendedPropertiesNotInSource": "Spécifie si les propriétés étendues qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez dans une base de données.",
			"SchemaCompare.Description.DropIndexesNotInSource": "Spécifie si des index qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimés de la base de données cible quand vous publiez dans une base de données.",
			"SchemaCompare.Description.DropObjectsNotInSource": "Spécifie si les objets qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimés de la base de données cible quand vous publiez dans une base de données. Cette valeur est prioritaire sur DropExtendedProperties.",
			"SchemaCompare.Description.DropPermissionsNotInSource": "Spécifie si les autorisations qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez des mises à jour sur une base de données.",
			"SchemaCompare.Description.DropRoleMembersNotInSource": "Spécifie si les membres de rôle qui ne sont pas définis dans le fichier d'instantané de base de données (.dacpac) sont supprimés de la base de données cible quand vous publiez des mises à jour sur une base de données.</",
			"SchemaCompare.Description.DropStatisticsNotInSource": "Spécifie si les statistiques qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez dans une base de données.",
			"SchemaCompare.Description.GenerateSmartDefaults": "Fournit automatiquement une valeur par défaut pendant la mise à jour d'une table dont les données comprennent une colonne qui n'autorise pas les valeurs Null.",
			"SchemaCompare.Description.IgnoreAnsiNulls": "Spécifie si les différences de paramètre ANSI NULLS doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreAuthorizer": "Spécifie si les différences de l'agent d'autorisation doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreColumnCollation": "Spécifie si les différences de classement de colonnes doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreColumnOrder": "Spécifie si les différences d'ordre des colonnes de table doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreComments": "Spécifie si les différences de commentaire doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreCryptographicProviderFilePath": "Spécifie si les différences de chemin de fichier du fournisseur de chiffrement doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreDdlTriggerOrder": "Spécifie si les différences d'ordre des déclencheurs de langage de description de données (DDL) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreDdlTriggerState": "Spécifie si les différences d'état activé ou désactivé des déclencheurs de langage de description de données (DDL) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreDefaultSchema": "Spécifie si les différences de schéma par défaut doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreDmlTriggerOrder": "Spécifie si les différences d'ordre des déclencheurs de langage de manipulation de données (DML) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreDmlTriggerState": "Spécifie si les différences d'état activé ou désactivé des déclencheurs DML doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreExtendedProperties": "Spécifie si les propriétés étendues doivent être ignorées.",
			"SchemaCompare.Description.IgnoreFileAndLogFilePath": "Spécifie si les différences de chemin de fichier et fichier journal doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreFileSize": "Spécifie si les différences de taille de fichier doivent être ignorées ou si un avertissement doit être envoyé quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreFilegroupPlacement": "Spécifie si les différences de placement des objets dans des groupes de fichiers doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreFillFactor": "Spécifie si les différences de facteur de remplissage du stockage d'index doivent être ignorées ou si un avertissement doit être envoyé quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreFullTextCatalogFilePath": "Spécifie si les différences de chemin du catalogue de texte intégral doivent être ignorées ou si un avertissement doit être émis quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreIdentitySeed": "Spécifie si les différences de seed d'une colonne d'identité doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreIncrement": "Spécifie si les différences d'incrément d'une colonne d'identité doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreIndexOptions": "Spécifie si les différences d'option d'index doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreIndexPadding": "Spécifie si les différences de remplissage d'index doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreKeywordCasing": "Spécifie si les différences de casse des mots clés doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreLockHintsOnIndexes": "Spécifie si les différences d'indicateur de verrou sur les index doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreLoginSids": "Spécifie si les différences de numéro d'identification de sécurité (SID) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreNotForReplication": "Spécifie si le paramètre Pas pour la réplication doit être ignoré ou mis à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreObjectPlacementOnPartitionScheme": "Spécifie si le placement d'un objet dans un schéma de partition doit être ignoré ou mis à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnorePartitionSchemes": "Spécifie si les différences de schéma et fonction de partition doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnorePermissions": "Spécifie si les autorisations doivent être ignorées.",
			"SchemaCompare.Description.IgnoreQuotedIdentifiers": "Spécifie si les différences de paramètre des identificateurs entre guillemets doivent être ignorées ou mises à jour en case de publication dans une base de données.",
			"SchemaCompare.Description.IgnoreRoleMembership": "Spécifie si les différences d'appartenance au rôle des connexions doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreRouteLifetime": "Spécifie si les différences de durée de conservation de la route dans la table de route par SQL Server doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreSemicolonBetweenStatements": "Spécifie si les différences de point-virgule des instructions T-SQL sont ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreTableOptions": "Spécifie si les différences des options de table sont ignorées ou mises à jour pour la publication dans une base de données.",
			"SchemaCompare.Description.IgnoreUserSettingsObjects": "Spécifie si les différences d'objet de paramètres utilisateur sont ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreWhitespace": "Spécifie si les différences d'espace blanc sont ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreWithNocheckOnCheckConstraints": "Spécifie si les différences de valeur de la clause WITH NOCHECK pour les contraintes de validation sont ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IgnoreWithNocheckOnForeignKeys": "Spécifie si les différences de valeur de la clause WITH NOCHECK pour les clés étrangères sont ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.IncludeCompositeObjects": "Incluez tous les éléments composites dans une seule et même opération de publication.",
			"SchemaCompare.Description.IncludeTransactionalScripts": "Spécifie s'il faut utiliser des instructions transactionnelles quand cela est possible quand vous publiez dans une base de données.",
			"SchemaCompare.Description.NoAlterStatementsToChangeClrTypes": "Spécifie que la publication doit toujours supprimer et recréer un assembly en cas de différence, au lieu d'envoyer une instruction ALTER ASSEMBLY",
			"SchemaCompare.Description.PopulateFilesOnFileGroups": "Spécifie si un fichier est créé en même temps qu'un groupe de fichiers dans la base de données cible.",
			"SchemaCompare.Description.RegisterDataTierApplication": "Indique si le schéma est inscrit dans le serveur de base de données.",
			"SchemaCompare.Description.RunDeploymentPlanExecutors": "Spécifie si les contributeurs DeploymentPlanExecutor doivent être exécutés quand d'autres opérations sont exécutées.",
			"SchemaCompare.Description.ScriptDatabaseCollation": "Spécifie si les différences de classement de base de données doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.ScriptDatabaseCompatibility": "Spécifie si les différences de compatibilité de base de données doivent être ignorées ou mises à jour quand vous publiez dans une base de données.",
			"SchemaCompare.Description.ScriptDatabaseOptions": "Spécifie si les propriétés de la base de données cible doivent être définies ou mises à jour dans le cadre de l'action de publication.",
			"SchemaCompare.Description.ScriptDeployStateChecks": "Spécifie si des instructions sont générées dans le script de publication pour vérifier que le nom de base de données et le nom de serveur correspondent aux noms spécifiés dans le projet de base de données.",
			"SchemaCompare.Description.ScriptFileSize": "Détermine si la taille est spécifiée pendant l'ajout d'un fichier à un groupe de fichiers.",
			"SchemaCompare.Description.ScriptNewConstraintValidation": "À la fin de la publication, toutes les contraintes sont vérifiées comme un ensemble, ce qui permet d'éviter les erreurs de données provoquées par une contrainte de validation ou de clé étrangère pendant la publication. Si la valeur est False, vos contraintes sont publiées sans vérification des données correspondantes.",
			"SchemaCompare.Description.ScriptRefreshModule": "Inclure des instructions d'actualisation à la fin du script de publication.",
			"SchemaCompare.Description.TreatVerificationErrorsAsWarnings": "Spécifie si les erreurs rencontrées au cours de la vérification de publication doivent être considérées comme des avertissements. La vérification est effectuée sur le plan de déploiement généré, avant qu'il ne soit exécuté sur la base de données cible. La vérification du plan détecte des problèmes comme la perte d'objets cibles uniquement (par ex., des index) qui doivent être supprimés pour effectuer un changement. La vérification détecte également des situations où des dépendances (table ou vue par exemple) existent en raison d'une référence à un projet composite, mais n'existent pas dans la base de données cible. Vous pouvez choisir d'effectuer cette opération pour obtenir la liste complète de tous les problèmes, au lieu de définir l'action de publication pour qu'elle s'arrête à la première erreur.",
			"SchemaCompare.Description.UnmodifiableObjectWarnings": "Spécifie si des avertissements doivent être générés en cas de différences détectées dans des objets non modifiables, par exemple, si la taille de fichier ou les chemins de fichier sont différents pour un fichier.",
			"SchemaCompare.Description.VerifyCollationCompatibility": "Spécifie si la compatibilité du classement est vérifiée.",
			"SchemaCompare.Description.VerifyDeployment": "Spécifie s'il faut effectuer avant la publication des vérifications qui arrêtent l'action de publication quand des problèmes risquant de bloquer la publication sont détectés. Par exemple, l'action de publication peut s'arrêter si vous avez des clés étrangères sur la base de données cible qui n'existent pas dans le projet de base de données, ce qui entraîne des erreurs pendant la publication.",
			"SchemaCompare.DisableAndReenableDdlTriggers": "Désactiver et réactiver les déclencheurs DDL",
			"SchemaCompare.DoNotAlterChangeDataCaptureObjects": "Ne pas modifier les objets de capture des changements de données",
			"SchemaCompare.DoNotAlterReplicatedObjects": "Ne pas modifier les objets répliqués",
			"SchemaCompare.DropConstraintsNotInSource": "Supprimer les contraintes qui ne sont pas dans la source",
			"SchemaCompare.DropDmlTriggersNotInSource": "Supprimer les déclencheurs DML qui ne sont pas dans la source",
			"SchemaCompare.DropExtendedPropertiesNotInSource": "Supprimer les propriétés étendues qui ne sont pas dans la source",
			"SchemaCompare.DropIndexesNotInSource": "Supprimer les index qui ne sont pas dans la source",
			"SchemaCompare.DropObjectsNotInSource": "Supprimer les objets qui ne sont pas dans la source",
			"SchemaCompare.DropPermissionsNotInSource": "Supprimer les autorisations qui ne sont pas dans la source",
			"SchemaCompare.DropRoleMembersNotInSource": "Supprimer les membres de rôle qui ne sont pas dans la source",
			"SchemaCompare.DropStatisticsNotInSource": "Supprimer les statistiques qui ne sont pas dans la source",
			"SchemaCompare.Endpoints": "Points de terminaison",
			"SchemaCompare.ErrorMessages": "Messages d'erreur",
			"SchemaCompare.EventNotifications": "Notifications d'événements",
			"SchemaCompare.EventSessions": "Sessions d'événements",
			"SchemaCompare.ExtendedProperties": "Propriétés étendues",
			"SchemaCompare.ExternalDataSources": "Sources de données externes",
			"SchemaCompare.ExternalFileFormats": "Formats de fichier externe",
			"SchemaCompare.ExternalStreamingJobs": "Travaux de streaming externes",
			"SchemaCompare.ExternalStreams": "Flux externes",
			"SchemaCompare.ExternalTables": "Tables externes",
			"SchemaCompare.FileTables": "Tables de fichiers",
			"SchemaCompare.Filegroups": "Groupes de fichiers",
			"SchemaCompare.Files": "Fichiers",
			"SchemaCompare.FullTextCatalogs": "Catalogues de texte intégral",
			"SchemaCompare.FullTextStoplists": "Listes de mots vides de texte intégral",
			"SchemaCompare.GeneralOptionsLabel": "Options générales",
			"SchemaCompare.GenerateSmartDefaults": "Générer des SmartDefaults",
			"SchemaCompare.IgnoreAnsiNulls": "Ignorer AnsiNulls",
			"SchemaCompare.IgnoreAuthorizer": "Ignorer l'agent d'autorisation",
			"SchemaCompare.IgnoreColumnCollation": "Ignorer le classement de colonne",
			"SchemaCompare.IgnoreColumnOrder": "Ignorer l'ordre des colonnes",
			"SchemaCompare.IgnoreComments": "Ignorer les commentaires",
			"SchemaCompare.IgnoreCryptographicProviderFilePath": "Ignorer le chemin de fichier du fournisseur de chiffrement",
			"SchemaCompare.IgnoreDdlTriggerOrder": "Ignorer l'ordre des déclencheurs DDL",
			"SchemaCompare.IgnoreDdlTriggerState": "Ignorer l'état des déclencheurs DDL",
			"SchemaCompare.IgnoreDefaultSchema": "Ignorer le schéma par défaut",
			"SchemaCompare.IgnoreDmlTriggerOrder": "Ignorer l'ordre des déclencheurs DML",
			"SchemaCompare.IgnoreDmlTriggerState": "Ignorer l'état des déclencheurs DML",
			"SchemaCompare.IgnoreExtendedProperties": "Ignorer les propriétés étendues",
			"SchemaCompare.IgnoreFileAndLogFilePath": "Ignorer le chemin de fichier et de fichier journal",
			"SchemaCompare.IgnoreFileSize": "Ignorer la taille de fichier",
			"SchemaCompare.IgnoreFilegroupPlacement": "Ignorer le placement de groupe de fichiers",
			"SchemaCompare.IgnoreFillFactor": "Ignorer le facteur de remplissage",
			"SchemaCompare.IgnoreFullTextCatalogFilePath": "Ignorer le chemin de fichier du catalogue de texte intégral",
			"SchemaCompare.IgnoreIdentitySeed": "Ignorer le seed d'identité",
			"SchemaCompare.IgnoreIncrement": "Ignorer l'incrément",
			"SchemaCompare.IgnoreIndexOptions": "Ignorer les options d'index",
			"SchemaCompare.IgnoreIndexPadding": "Ignorer le remplissage d'index",
			"SchemaCompare.IgnoreKeywordCasing": "Ignorer la casse des mots clés",
			"SchemaCompare.IgnoreLockHintsOnIndexes": "Ignorer les indicateurs de verrou sur les index",
			"SchemaCompare.IgnoreLoginSids": "Ignorer les SID de connexion",
			"SchemaCompare.IgnoreNotForReplication": "Ignorer l'option Pas pour la réplication",
			"SchemaCompare.IgnoreObjectPlacementOnPartitionScheme": "Ignorer le placement d'objet sur le schéma de partition",
			"SchemaCompare.IgnorePartitionSchemes": "Ignorer les schémas de partition",
			"SchemaCompare.IgnorePermissions": "Ignorer les autorisations",
			"SchemaCompare.IgnoreQuotedIdentifiers": "Ignorer les identificateurs entre guillemets",
			"SchemaCompare.IgnoreRoleMembership": "Ignorer l'appartenance à un rôle",
			"SchemaCompare.IgnoreRouteLifetime": "Ignorer la durée de vie de la route",
			"SchemaCompare.IgnoreSemicolonBetweenStatements": "Ignorer le point-virgule entre les instructions",
			"SchemaCompare.IgnoreTableOptions": "Ignorer les options de table",
			"SchemaCompare.IgnoreUserSettingsObjects": "Ignorer les objets des paramètres utilisateur",
			"SchemaCompare.IgnoreWhitespace": "Ignorer les espaces blancs",
			"SchemaCompare.IgnoreWithNocheckOnCheckConstraints": "Ignorer WITH NO CHECK sur les contraintes de validation",
			"SchemaCompare.IgnoreWithNocheckOnForeignKeys": "Ignorer WITH NOCHECK sur les clés étrangères",
			"SchemaCompare.IncludeCompositeObjects": "Inclure des objets composites",
			"SchemaCompare.IncludeTransactionalScripts": "Inclure des scripts transactionnels",
			"SchemaCompare.LinkedServerLogins": "Connexions de serveur lié",
			"SchemaCompare.LinkedServers": "Serveurs liés",
			"SchemaCompare.Logins": "Connexions",
			"SchemaCompare.MasterKeys": "Clés principales",
			"SchemaCompare.MessageTypes": "Types de messages",
			"SchemaCompare.NoAlterStatementsToChangeClrTypes": "Aucune instruction ALTER pour changer les types CLR",
			"SchemaCompare.ObjectTypesOptionsLabel": "Inclure les types d'objet",
			"SchemaCompare.PartitionFunctions": "Fonctions de partition",
			"SchemaCompare.PartitionSchemes": "Schémas de partition",
			"SchemaCompare.Permissions": "Autorisations",
			"SchemaCompare.PopulateFilesOnFileGroups": "Remplir les fichiers dans des groupes de fichiers",
			"SchemaCompare.Queues": "Files d'attente",
			"SchemaCompare.RegisterDataTierApplication": "Inscrire l'application de la couche Données",
			"SchemaCompare.RemoteServiceBindings": "Liaisons de service distant",
			"SchemaCompare.RoleMembership": "Appartenance au rôle",
			"SchemaCompare.Routes": "Routes",
			"SchemaCompare.Rules": "Règles",
			"SchemaCompare.RunDeploymentPlanExecutors": "Exécuter des exécuteurs de plan de déploiement",
			"SchemaCompare.ScalarValuedFunctions": "Fonctions scalaires",
			"SchemaCompare.SchemaCompareOptionsDialogLabel": "Options Comparer les schémas",
			"SchemaCompare.ScriptDatabaseCollation": "Classement de base de données de script",
			"SchemaCompare.ScriptDatabaseCompatibility": "Compatibilité de base de données de script",
			"SchemaCompare.ScriptDatabaseOptions": "Options de base de données de script",
			"SchemaCompare.ScriptDeployStateChecks": "StateChecks du déploiement de script",
			"SchemaCompare.ScriptFileSize": "Taille du fichier de script",
			"SchemaCompare.ScriptNewConstraintValidation": "Validation de la nouvelle contrainte de script",
			"SchemaCompare.ScriptRefreshModule": "Module d'actualisation de script",
			"SchemaCompare.SearchPropertyLists": "Listes de propriétés de recherche",
			"SchemaCompare.SecurityPolicies": "Stratégies de sécurité",
			"SchemaCompare.Sequences": "Séquences",
			"SchemaCompare.ServerAuditSpecifications": "Spécifications de l'audit de serveur",
			"SchemaCompare.ServerRoleMembership": "Appartenance au rôle serveur",
			"SchemaCompare.ServerRoles": "Rôles serveur",
			"SchemaCompare.ServerTriggers": "Déclencheurs de serveur",
			"SchemaCompare.Services": "Services",
			"SchemaCompare.Signatures": "Signatures",
			"SchemaCompare.StoredProcedures": "Procédures stockées",
			"SchemaCompare.SymmetricKeys": "Clés symétriques",
			"SchemaCompare.Synonyms": "Synonymes",
			"SchemaCompare.TableValuedFunctions": "Fonctions table",
			"SchemaCompare.Tables": "Tables",
			"SchemaCompare.TreatVerificationErrorsAsWarnings": "Traiter les erreurs de vérification comme des avertissements",
			"SchemaCompare.UnmodifiableObjectWarnings": "Avertissements d'objet non modifiable",
			"SchemaCompare.UserDefinedDataTypes": "Types de données définis par l'utilisateur",
			"SchemaCompare.UserDefinedTableTypes": "Types de table définis par l'utilisateur",
			"SchemaCompare.Users": "Utilisateurs",
			"SchemaCompare.VerifyCollationCompatibility": "Vérifier la compatibilité du classement",
			"SchemaCompare.VerifyDeployment": "Vérifier le déploiement",
			"SchemaCompare.Views": "Vues",
			"SchemaCompare.XmlSchemaCollections": "Collections de schémas XML",
			"SchemaCompareOptionsDialog.Reset": "Réinitialiser",
			"schemaCompare.ApplyConfirmation": "Voulez-vous vraiment mettre à jour la cible ?",
			"schemaCompare.CompareDetailsTitle": "Comparer les détails",
			"schemaCompare.GetConnectionString": "Voulez-vous vous connecter à {0}?",
			"schemaCompare.RecompareToRefresh": "Appuyez sur Comparer pour actualiser la comparaison.",
			"schemaCompare.actionColumn": "Action",
			"schemaCompare.addAction": "Ajouter",
			"schemaCompare.applyButtonDisabledTitle": "L'option Appliquer est activée quand la cible est une base de données",
			"schemaCompare.applyButtonEnabledTitle": "Appliquer les changements à la cible",
			"schemaCompare.applyNoChanges": "Aucun changement à appliquer",
			"schemaCompare.cancelCompareButton": "Arrêter",
			"schemaCompare.cancelErrorMessage": "L'annulation de Comparer les schémas a échoué : « {0} »",
			"schemaCompare.cannotExcludeMessage": "Impossible d’exclure {0}. Il existe des dépendants inclus",
			"schemaCompare.cannotExcludeMessageWithDependent": "Impossible d’exclure {0}. Les dépendants inclus existent, tels que {1}",
			"schemaCompare.cannotIncludeMessage": "Ne peut pas inclure {0}. Il existe des dépendants exclus",
			"schemaCompare.cannotIncludeMessageWithDependent": "Ne peut pas inclure {0}. Il existe des dépendants exclus, tels que {1}",
			"schemaCompare.changeAction": "Changer",
			"schemaCompare.compareButton": "Comparer",
			"schemaCompare.compareErrorMessage": "Comparer les schémas a échoué : {0}",
			"schemaCompare.dacpacRadioButtonLabel": "Fichier d'application de la couche Données (.dacpac)",
			"schemaCompare.databaseButtonLabel": "Base de données",
			"schemaCompare.deleteAction": "Supprimer",
			"schemaCompare.dialogTitle": "Comparer les schémas",
			"schemaCompare.differencesTableTitle": "Comparaison entre source et cible",
			"schemaCompare.generateScriptButton": "Générer le script",
			"schemaCompare.generateScriptButtonDisabledTitle": "La génération de script est activée quand la cible est une base de données",
			"schemaCompare.generateScriptEnabledButton": "Générer un script pour déployer les changements sur la cible",
			"schemaCompare.generateScriptErrorMessage": "La génération de script a échoué : '{0}'",
			"schemaCompare.generateScriptNoChanges": "Aucun changement de script",
			"schemaCompare.includeColumnName": "Inclure",
			"schemaCompare.includeExcludeInfoMessage": "Veuillez noter que le calcul des dépendances affectées peut prendre quelques instants si les opérations incluent/exclues.",
			"schemaCompare.noDifferences": "Aucune différence de schéma.",
			"schemaCompare.openFile": "Ouvrir",
			"schemaCompare.openScmpButton": "Ouvrir le fichier .scmp",
			"schemaCompare.openScmpButtonTitle": "Charger la source, la cible et les options enregistrées dans un fichier .scmp",
			"schemaCompare.openScmpErrorMessage": "L'ouverture de scmp a échoué : '{0}'",
			"schemaCompare.optionsButton": "Options",
			"schemaCompare.radioButtonsLabel": "Type",
			"schemaCompare.saveFile": "Enregistrer",
			"schemaCompare.saveScmpButton": "Enregistrer le fichier .scmp",
			"schemaCompare.saveScmpButtonTitle": "Enregistrer la source et la cible, les options et les éléments exclus",
			"schemaCompare.saveScmpErrorMessage": "L'enregistrement de scmp a échoué : '{0}'",
			"schemaCompare.selectConnection": "Sélectionner la connexion",
			"schemaCompare.selectSourceFile": "Sélectionner un fichier source",
			"schemaCompare.selectTargetFile": "Sélectionner le fichier cible",
			"schemaCompare.sourceButtonTitle": "Sélectionner la source",
			"schemaCompare.sourceNameColumn": "Nom de la source",
			"schemaCompare.startText": "Pour comparer deux schémas, sélectionnez d'abord un schéma source et un schéma cible, puis appuyez sur Comparer.",
			"schemaCompare.switchButtonTitle": "Basculer entre la source et la cible",
			"schemaCompare.switchDirectionButton": "Changer de sens",
			"schemaCompare.targetButtonTitle": "Sélectionner la cible",
			"schemaCompare.targetNameColumn": "Nom de la cible",
			"schemaCompare.typeColumn": "Type",
			"schemaCompare.updateButton": "Appliquer",
			"schemaCompare.updateErrorMessage": "Échec d'application de Comparer les schémas « {0} »",
			"schemaCompare.waitText": "Initialisation de la comparaison. Cette opération peut durer un certain temps.",
			"schemaCompareDialog.No": "Non",
			"schemaCompareDialog.SourceTitle": "Source",
			"schemaCompareDialog.TargetTitle": "Cible",
			"schemaCompareDialog.Yes": "Oui",
			"schemaCompareDialog.cancel": "Annuler",
			"schemaCompareDialog.databaseDropdownTitle": "Base de données",
			"schemaCompareDialog.defaultUser": "par défaut",
			"schemaCompareDialog.differentSourceMessage": "Un autre schéma source a été sélectionné. Comparer pour voir les différences ?",
			"schemaCompareDialog.differentSourceTargetMessage": "Vous avez sélectionné des schémas cible et source différents. Comparer pour voir les différences ?",
			"schemaCompareDialog.differentTargetMessage": "Un autre schéma cible a été sélectionné. Comparer pour voir les différences ?",
			"schemaCompareDialog.fileTextBoxLabel": "Fichier",
			"schemaCompareDialog.ok": "OK",
			"schemaCompareDialog.serverDropdownTitle": "Serveur",
			"schemaCompareDialog.sourceDatabaseDropdown": "Base de données source",
			"schemaCompareDialog.sourceServerDropdown": "Serveur source",
			"schemaCompareDialog.sourceTextBox": "Fichier source",
			"schemaCompareDialog.targetDatabaseDropdown": "Base de données cible",
			"schemaCompareDialog.targetServerDropdown": "Serveur cible",
			"schemaCompareDialog.targetTextBox": "Fichier cible",
			"schemaCompareOptions.RecompareMessage": "Les options ont changé. Relancer la comparaison pour voir les différences ?"
		},
		"package": {
			"description": "Comparer les schémas SQL Server pour Azure Data Studio prend en charge la comparaison des schémas de bases de données et de fichiers dacpac.",
			"displayName": "Comparer les schémas SQL Server",
			"schemaCompare.start": "Comparer les schémas"
		}
	}
}