{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"sql.messagesDefaultOpen": "Vero per fare in modo che il pannello messaggi venga aperto di default; Falso per tenerlo chiuso",
	"sql.saveAsCsv.includeHeaders": "[Facoltativo] Quando è true, le intestazioni di colonna sono incluse nel salvataggio dei risultati come file CSV",
	"sql.copyIncludeHeaders": "[Facoltativo] Opzioni di configurazione per copiare i risultati dalla vista dei risultati",
	"sql.copyRemoveNewLine": "[Facoltativo] Opzioni di configurazione per la copia di risultati multi-linea dalla vista dei risultati",
	"sql.showBatchTime": "[Facoltativo] Il tempo di esecuzione deve essere mostrato per singoli batch",
	"defaultChartType": "[Facoltativo] tipo di grafico predefinito da utilizzare quando si apre il visualizzatore grafico dai risultati di una Query",
	"tabColorMode.off": "La colorazione delle schede verrà disabilitata",
	"tabColorMode.border": "Il bordo superiore di ogni scheda sarà colorato con il colore del relativo gruppo di server",
	"tabColorMode.fill": "Il colore di sfondo di ogni tab di editor corrisponderà con il rispettivo gruppo di server",
	"tabColorMode": "Controlla la colorazione delle schede in base al gruppo di server della connessione attiva",
	"mssql.intelliSense.enableIntelliSense": "IntelliSense dovrebbe essere abilitato",
	"mssql.intelliSense.enableErrorChecking": "Il controllo errori di IntelliSense dovrebbe essere abilitato",
	"mssql.intelliSense.enableSuggestions": "I suggerimenti dell'IntelliSense dovrebbero essere abilitati",
	"mssql.intelliSense.enableQuickInfo": "Le informazioni rapide di IntelliSense dovrebbero essere abilitate",
	"mssql.intelliSense.lowerCaseSuggestions": "I suggerimenti di IntelliSense dovrebbero essere in lettere minuscole",
	"queryShortcutDescription": "Impostare la combinazione di tasti workbench.action.query.shortcut{0} per eseguire il testo come una chiamata a procedura. Qualsiasi testo selezionato nell'editor di query verrà passato come parametro"
}