{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"sql.messagesDefaultOpen": "Vero per fare in modo che il pannello messaggi venga aperto di default; Falso per tenerlo chiuso",
	"sql.saveAsCsv.includeHeaders": "[Facoltativo] Quando è 'true', le intestazioni di colonna sono incluse quando si salvano i risultati come file CSV",
	"sql.saveAsCsv.delimiter": "[Facoltativo] Delimitatore personalizzato da usare tra i valori durante il salvataggio in formato CSV",
	"sql.saveAsCsv.lineSeperator": "[Facoltativo] Caratteri usati per delimitare le righe durante il salvataggio dei risultati in formato CSV",
	"sql.saveAsCsv.textIdentifier": "[Facoltativo] Carattere usato per racchiudere i campi di testo durante il salvataggio dei risultati in formato CSV",
	"sql.saveAsCsv.encoding": "[Facoltativo] Codifica del file utilizzata per il salvataggio dei risultati in formato CSV",
	"sql.results.streaming": "Abilita lo streaming dei risultati. Contiene alcuni problemi minori relativi a oggetti visivi",
	"sql.saveAsXml.formatted": "[Facoltativo] Quando è true, l'output XML verrà formattato durante il salvataggio dei risultati in formato XML",
	"sql.saveAsXml.encoding": "[Facoltativo] Codifica di file usata durante il salvataggio dei risultati in formato XML",
	"sql.copyIncludeHeaders": "[Facoltativo] Opzioni di configurazione per copiare i risultati dalla vista dei risultati",
	"sql.copyRemoveNewLine": "[Facoltativo] Opzioni di configurazione per la copia di risultati multi-linea dalla vista dei risultati",
	"sql.showBatchTime": "[Facoltativo] Il tempo di esecuzione deve essere mostrato per singoli batch",
	"defaultChartType": "[Facoltativo] tipo di grafico predefinito da utilizzare quando si apre il visualizzatore grafico dai risultati di una Query",
	"tabColorMode.off": "La colorazione delle schede verrà disabilitata",
	"tabColorMode.border": "Il bordo superiore di ogni scheda sarà colorato con il colore del relativo gruppo di server",
	"tabColorMode.fill": "Il colore di sfondo di ogni tab di editor corrisponderà con il rispettivo gruppo di server",
	"tabColorMode": "Controlla la colorazione delle schede in base al gruppo di server della connessione attiva",
	"showConnectionInfoInTitle": "Controlla se visualizzare le informazioni sulla connessione per una scheda nel titolo.",
	"sql.promptToSaveGeneratedFiles": "Richiedi di salvare i file SQL generati",
	"mssql.intelliSense.enableIntelliSense": "IntelliSense deve essere abilitato?",
	"mssql.intelliSense.enableErrorChecking": "Il controllo errori di IntelliSense dovrebbe essere abilitato",
	"mssql.intelliSense.enableSuggestions": "I suggerimenti dell'IntelliSense dovrebbero essere abilitati",
	"mssql.intelliSense.enableQuickInfo": "Le informazioni rapide di IntelliSense dovrebbero essere abilitate",
	"mssql.intelliSense.lowerCaseSuggestions": "I suggerimenti di IntelliSense devono essere in lettere minuscole?",
	"queryShortcutDescription": "Impostare la combinazione di tasti workbench.action.query.shortcut{0} per eseguire il testo come una chiamata a procedura. Qualsiasi testo selezionato nell'editor di query verrà passato come parametro"
}