{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"SchemaCompare.Aggregates": "Aggregate",
			"SchemaCompare.AllowDropBlockingAssemblies": "Löschen von Blockierungsassemblys zulassen",
			"SchemaCompare.AllowIncompatiblePlatform": "Inkompatible Plattform zulassen",
			"SchemaCompare.AllowUnsafeRowLevelSecurityDataMovement": "Unsichere Datenverschiebung bei Sicherheit auf Zeilenebene zulassen",
			"SchemaCompare.ApplicationRoles": "Anwendungsrollen",
			"SchemaCompare.Assemblies": "Assemblys",
			"SchemaCompare.AssemblyFiles": "Assemblydateien",
			"SchemaCompare.AsymmetricKeys": "Asymmetrische Schlüssel",
			"SchemaCompare.Audits": "Überwachungen",
			"SchemaCompare.BackupDatabaseBeforeChanges": "Datenbank vor Änderungen sichern",
			"SchemaCompare.BlockOnPossibleDataLoss": "Bei möglichem Datenverlust blockieren",
			"SchemaCompare.BlockWhenDriftDetected": "Bei erkannter Abweichung blockieren",
			"SchemaCompare.BrokerPriorities": "Brokerprioritäten",
			"SchemaCompare.Certificates": "Zertifikate",
			"SchemaCompare.ClrUserDefinedTypes": "Benutzerdefinierte CLR-Typen",
			"SchemaCompare.ColumnEncryptionKeys": "Spaltenverschlüsselungsschlüssel",
			"SchemaCompare.ColumnMasterKeys": "Spaltenhauptschlüssel",
			"SchemaCompare.CommentOutSetVarDeclarations": "SetVar-Deklarationen auskommentieren",
			"SchemaCompare.CompareUsingTargetCollation": "Unter Verwendung der Zielsortierung vergleichen",
			"SchemaCompare.Contracts": "Verträge",
			"SchemaCompare.CreateNewDatabase": "Neue Datenbank erstellen",
			"SchemaCompare.Credentials": "Anmeldeinformationen",
			"SchemaCompare.CryptographicProviders": "Kryptografieanbieter",
			"SchemaCompare.DatabaseAuditSpecifications": "Spezifikationen für Datenbanküberwachung",
			"SchemaCompare.DatabaseEncryptionKeys": "Verschlüsselungsschlüssel für Datenbank",
			"SchemaCompare.DatabaseOptions": "Datenbankoptionen",
			"SchemaCompare.DatabaseRoles": "Datenbankrollen",
			"SchemaCompare.DatabaseScopedCredentials": "Datenbankweit gültige Anmeldeinformationen",
			"SchemaCompare.DatabaseTriggers": "Datenbanktrigger",
			"SchemaCompare.Defaults": "Standardwerte",
			"SchemaCompare.DeployDatabaseInSingleUserMode": "Datenbank im Einzelbenutzermodus bereitstellen",
			"SchemaCompare.Description.AllowDropBlockingAssemblies": "Diese Eigenschaft wird von der SqlClr-Bereitstellung verwendet, um sämtliche Blockierungsassemblys im Rahmen des Bereitstellungsplans zu löschen. Standardmäßig blockieren Blockierungs-/Verweisassemblys Assemblyupdates, wenn die Verweisassembly gelöscht werden muss.",
			"SchemaCompare.Description.AllowIncompatiblePlatform": "Gibt an, ob die Aktion trotz inkompatibler SQL Server-Plattformen versucht werden soll.",
			"SchemaCompare.Description.AllowUnsafeRowLevelSecurityDataMovement": "Bei Festlegung dieser Eigenschaft auf TRUE wird das Verschieben von Daten in einer Tabelle mit Sicherheit auf Zeilenebene nicht blockiert. Der Standardwert lautet FALSE.",
			"SchemaCompare.Description.BackupDatabaseBeforeChanges": "Hiermit wird die Datenbank gesichert, bevor Änderungen bereitgestellt werden.",
			"SchemaCompare.Description.BlockOnPossibleDataLoss": "Gibt an, dass der Veröffentlichungszeitraum beendet werden soll, wenn aufgrund des Veröffentlichungsvorgangs die Möglichkeit eines Datenverlusts besteht.",
			"SchemaCompare.Description.BlockWhenDriftDetected": "Gibt an, ob die Aktualisierung einer Datenbank blockiert wird, deren Schema nicht mehr mit der Registrierung übereinstimmt bzw. nicht registriert ist.",
			"SchemaCompare.Description.CommentOutSetVarDeclarations": "Gibt an, ob die Deklaration von SETVAR-Variablen im generierten Veröffentlichungsskript auskommentiert werden soll. Sie können diese Option verwenden, wenn Sie bei der Veröffentlichung mit einem Tool wie SQLCMD.EXE die Werte in der Befehlszeile angeben möchten.",
			"SchemaCompare.Description.CompareUsingTargetCollation": "Diese Einstellung legt fest, wie die Sortierung der Datenbank während der Bereitstellung verarbeitet wird. Standardmäßig wird die Sortierung der Zieldatenbank aktualisiert, wenn sie nicht mit der von der Quelle angegebenen Sortierung übereinstimmt. Wenn diese Option festgelegt ist, muss die Sortierung der Zieldatenbank (oder des Servers) verwendet werden.",
			"SchemaCompare.Description.CreateNewDatabase": "Gibt an, ob die Zieldatenbank beim Veröffentlichen einer Datenbank aktualisiert oder aber gelöscht und erneut erstellt werden soll.",
			"SchemaCompare.Description.DeployDatabaseInSingleUserMode": "Bei Festlegung auf TRUE wird die Datenbank vor der Bereitstellung auf den Einzelbenutzermodus festgelegt.",
			"SchemaCompare.Description.DisableAndReenableDdlTriggers": "Gibt an, ob DDL-Trigger (Data Definition Language) zu Beginn des Veröffentlichungsprozesses deaktiviert und am Ende des Veröffentlichungsvorgangs wieder aktiviert werden.",
			"SchemaCompare.Description.DoNotAlterChangeDataCaptureObjects": "Bei Festlegung auf TRUE werden Change Data Capture-Objekte nicht geändert.",
			"SchemaCompare.Description.DoNotAlterReplicatedObjects": "Gibt an, ob replizierte Objekte während der Überprüfung identifiziert werden.",
			"SchemaCompare.Description.DropConstraintsNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Einschränkungen aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.",
			"SchemaCompare.Description.DropDmlTriggersNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene DML-Trigger aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.",
			"SchemaCompare.Description.DropExtendedPropertiesNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene erweiterte Eigenschaften aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.",
			"SchemaCompare.Description.DropIndexesNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Indizes aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.",
			"SchemaCompare.Description.DropObjectsNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Objekte aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.Dieser Wert hat Vorrang vor \"DropExtendedProperties\".",
			"SchemaCompare.Description.DropPermissionsNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Berechtigungen aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.",
			"SchemaCompare.Description.DropRoleMembersNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Rollenmitglieder aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.",
			"SchemaCompare.Description.DropStatisticsNotInSource": "Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Statistiken aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.",
			"SchemaCompare.Description.GenerateSmartDefaults": "Hiermit wird automatisch ein Standardwert bereitgestellt, wenn eine Tabelle mit Daten in einer Spalte aktualisiert wird, die keine NULL-Werte zulässt.",
			"SchemaCompare.Description.IgnoreAnsiNulls": "Gibt an, ob Unterschiede in der ANSI NULLS-Einstellung beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreAuthorizer": "Gibt an, ob Unterschiede im Autorisierer beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreColumnCollation": "Gibt an, ob Unterschiede in den Spaltensortierungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreColumnOrder": "Gibt an, ob Unterschiede in der Tabellenspaltenreihenfolge beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreComments": "Gibt an, ob Unterschiede in den Kommentaren beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreCryptographicProviderFilePath": "Gibt an, ob Unterschiede im Dateipfad für den Kryptografieanbieter beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreDdlTriggerOrder": "Gibt an, ob Unterschiede in der Reihenfolge von DDL-Triggern (Data Definition Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreDdlTriggerState": "Gibt an, ob Unterschiede in Bezug auf den Status (aktiviert bzw. deaktiviert) von DDL-Triggern (Data Definition Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreDefaultSchema": "Gibt an, ob Unterschiede im Standardschema beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreDmlTriggerOrder": "Gibt an, ob Unterschiede in der Reihenfolge von DML-Triggern (Data Manipulation Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreDmlTriggerState": "Gibt an, ob Unterschiede in Bezug auf den Status (aktiviert bzw. deaktiviert) von DML-Triggern (Data Manipulation Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreExtendedProperties": "Gibt an, ob erweiterte Eigenschaften ignoriert werden sollen.",
			"SchemaCompare.Description.IgnoreFileAndLogFilePath": "Gibt an, ob Unterschiede in den Pfaden für Dateien und Protokolldateien beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreFileSize": "Gibt an, ob Unterschiede in der Dateigröße beim Veröffentlichen in einer Datenbank ignoriert werden sollen oder ob eine Warnung ausgegeben werden soll.",
			"SchemaCompare.Description.IgnoreFilegroupPlacement": "Gibt an, ob Unterschiede bei der Platzierung von Objekten in FILEGROUPs beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreFillFactor": "Gibt an, ob Unterschiede beim Füllfaktor für den Indexspeicher beim Veröffentlichen in einer Datenbank ignoriert werden sollen oder ob eine Warnung ausgegeben werden soll.",
			"SchemaCompare.Description.IgnoreFullTextCatalogFilePath": "Gibt an, ob Unterschiede beim Dateipfad für den Volltextkatalog beim Veröffentlichen in einer Datenbank ignoriert werden sollen oder ob eine Warnung ausgegeben werden soll.",
			"SchemaCompare.Description.IgnoreIdentitySeed": "Gibt an, ob Unterschiede im Startwert für eine Identitätsspalte beim Veröffentlichen von Updates für eine Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreIncrement": "Gibt an, ob Unterschiede im Inkrement für eine Identitätsspalte beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreIndexOptions": "Gibt an, ob Unterschiede in den Indexoptionen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreIndexPadding": "Gibt an, ob Unterschiede in der Indexauffüllung beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreKeywordCasing": "Gibt an, ob Unterschiede in der Groß-/Kleinschreibung von Schlüsselwörtern beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreLockHintsOnIndexes": "Gibt an, ob Unterschiede in den Sperrhinweisen für Indizes beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreLoginSids": "Gibt an, ob Unterschiede in der Sicherheits-ID (SID) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreNotForReplication": "Gibt an, ob die Einstellungen für \"Nicht zur Replikation\" beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreObjectPlacementOnPartitionScheme": "Gibt an, ob die Platzierung eines Objekts in einem Partitionsschema beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden soll.",
			"SchemaCompare.Description.IgnorePartitionSchemes": "Gibt an, ob Unterschiede in den Partitionsschemas und -funktionen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnorePermissions": "Gibt an, ob Berechtigungen ignoriert werden sollen.",
			"SchemaCompare.Description.IgnoreQuotedIdentifiers": "Gibt an, ob Unterschiede in der Einstellung für Bezeichner in Anführungszeichen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreRoleMembership": "Gibt an, ob Unterschiede in den Rollenmitgliedschaften von Anmeldungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreRouteLifetime": "Gibt an, ob Unterschiede bei dem Zeitraum, über den SQL Server die Route in der Routingtabelle beibehält, beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreSemicolonBetweenStatements": "Gibt an, ob Unterschiede in den Semikolons zwischen T-SQL-Anweisungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreTableOptions": "Gibt an, ob Unterschiede in den Tabellenoptionen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreUserSettingsObjects": "Gibt an, ob Unterschiede in den Benutzereinstellungsobjekten beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreWhitespace": "Gibt an, ob Unterschiede in den Leerstellen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreWithNocheckOnCheckConstraints": "Gibt an, ob Unterschiede im Wert der WITH NOCHECK-Klausel für CHECK-Einschränkungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IgnoreWithNocheckOnForeignKeys": "Gibt an, ob Unterschiede im Wert der WITH NOCHECK-Klausel für Fremdschlüssel beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.IncludeCompositeObjects": "Hiermit werden alle zusammengesetzten Elemente als Teil eines einzigen Veröffentlichungsvorgangs eingeschlossen.",
			"SchemaCompare.Description.IncludeTransactionalScripts": "Gibt an, ob beim Veröffentlichen in einer Datenbank nach Möglichkeit Transaktionsanweisungen verwendet werden sollen.",
			"SchemaCompare.Description.NoAlterStatementsToChangeClrTypes": "Gibt an, dass bei der Veröffentlichung eine abweichende Assembly immer gelöscht und neu erstellt wird, anstatt eine ALTER ASSEMBLY-Anweisung auszugeben.",
			"SchemaCompare.Description.PopulateFilesOnFileGroups": "Gibt an, ob beim Erstellen einer neuen FileGroup in der Zieldatenbank ebenfalls eine neue Datei erstellt wird.",
			"SchemaCompare.Description.RegisterDataTierApplication": "Gibt an, ob das Schema beim Datenbankserver registriert wird.",
			"SchemaCompare.Description.RunDeploymentPlanExecutors": "Gibt an, ob DeploymentPlanExecutor-Mitwirkende beim Ausführen anderer Vorgänge ausgeführt werden sollen.",
			"SchemaCompare.Description.ScriptDatabaseCollation": "Gibt an, ob Unterschiede in der Datenbanksortierung beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.ScriptDatabaseCompatibility": "Gibt an, ob Unterschiede in der Datenbankkompatibilität beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.",
			"SchemaCompare.Description.ScriptDatabaseOptions": "Gibt an, ob die Eigenschaften der Zieldatenbank als Teil des Veröffentlichungsvorgangs festgelegt oder aktualisiert werden sollen.",
			"SchemaCompare.Description.ScriptDeployStateChecks": "Gibt an, ob Anweisungen im Veröffentlichungsskript generiert werden, um zu überprüfen, ob der Datenbankname und der Servername mit den im Datenbankprojekt angegebenen Namen übereinstimmen.",
			"SchemaCompare.Description.ScriptFileSize": "Hiermit wird gesteuert, ob beim Hinzufügen einer Datei zu einer Dateigruppe die Größe angegeben wird.",
			"SchemaCompare.Description.ScriptNewConstraintValidation": "Hiermit werden am Ende der Veröffentlichung alle Einschränkungen gemeinsam überprüft, um Datenfehler durch eine CHECK- oder Fremdschlüsseleinschränkung während der Veröffentlichung zu vermeiden. Bei Festlegung auf FALSE werden die Einschränkungen veröffentlicht, ohne dass die zugehörigen Daten überprüft werden.",
			"SchemaCompare.Description.ScriptRefreshModule": "Hiermit werden Aktualisierungsanweisungen am Ende des Veröffentlichungsskripts eingeschlossen.",
			"SchemaCompare.Description.TreatVerificationErrorsAsWarnings": "Gibt an, ob während der Veröffentlichungsüberprüfung ermittelte Fehler als Warnungen behandelt werden sollen. Die Überprüfung wird anhand des generierten Bereitstellungsplans durchgeführt, bevor der Plan für die Zieldatenbank ausgeführt wird. Bei der Planüberprüfung werden Probleme wie der Verlust von nur in der Zieldatenbank vorkommenden Objekten (z. B. Indizes) ermittelt, die gelöscht werden müssen, damit eine Änderung vorgenommen werden kann. Bei der Überprüfung werden auch Situationen ermittelt, in denen Abhängigkeiten (z. B. eine Tabelle oder Sicht) aufgrund eines Verweises auf ein zusammengesetztes Projekt vorhanden sind, die jedoch nicht in der Zieldatenbank vorhanden sind. Sie können diese Option verwenden, um eine vollständige Liste aller Probleme abzurufen, und dadurch erreichen, dass der Veröffentlichungsvorgang nicht beim ersten Fehler beendet wird.",
			"SchemaCompare.Description.UnmodifiableObjectWarnings": "Gibt an, ob Warnungen generiert werden sollen, wenn nicht änderbare Unterschiede in Objekten gefunden werden, z. B. wenn die Dateigröße oder die Dateipfade für eine Datei unterschiedlich sind.",
			"SchemaCompare.Description.VerifyCollationCompatibility": "Gibt an, ob die Sortierungskompatibilität überprüft wird.",
			"SchemaCompare.Description.VerifyDeployment": "Gibt an, ob vor der Veröffentlichung Überprüfungen ausgeführt werden sollen, um eine Beendigung des Veröffentlichungsvorgangs durch vorhandene Fehler zu verhindern. Der Veröffentlichungsvorgang wird möglicherweise beendet, wenn in der Zieldatenbank Fremdschlüssel vorhanden sind, die im Datenbankprojekt nicht enthalten sind und bei der Veröffentlichung zu Fehlern führen.",
			"SchemaCompare.DisableAndReenableDdlTriggers": "DDL-Trigger deaktivieren und erneut aktivieren",
			"SchemaCompare.DoNotAlterChangeDataCaptureObjects": "Change Data Capture-Objekte nicht ändern",
			"SchemaCompare.DoNotAlterReplicatedObjects": "Replizierte Objekte nicht ändern",
			"SchemaCompare.DropConstraintsNotInSource": "Nicht in der Quelle enthaltene Einschränkungen löschen",
			"SchemaCompare.DropDmlTriggersNotInSource": "Nicht in der Quelle enthaltene DML-Trigger löschen",
			"SchemaCompare.DropExtendedPropertiesNotInSource": "Nicht in der Quelle enthaltene erweiterte Eigenschaften löschen",
			"SchemaCompare.DropIndexesNotInSource": "Nicht in der Quelle enthaltene Indizes löschen",
			"SchemaCompare.DropObjectsNotInSource": "Nicht in der Quelle enthaltene Objekte löschen",
			"SchemaCompare.DropPermissionsNotInSource": "Nicht in der Quelle enthaltene Berechtigungen löschen",
			"SchemaCompare.DropRoleMembersNotInSource": "Nicht in der Quelle enthaltene Rollenmitglieder löschen",
			"SchemaCompare.DropStatisticsNotInSource": "Nicht in der Quelle enthaltene Statistiken löschen",
			"SchemaCompare.Endpoints": "Endpunkte",
			"SchemaCompare.ErrorMessages": "Fehlermeldungen",
			"SchemaCompare.EventNotifications": "Ereignisbenachrichtigungen",
			"SchemaCompare.EventSessions": "Ereignissitzungen",
			"SchemaCompare.ExtendedProperties": "Erweiterte Eigenschaften",
			"SchemaCompare.ExternalDataSources": "Externe Datenquellen",
			"SchemaCompare.ExternalFileFormats": "Externe Dateiformate",
			"SchemaCompare.ExternalStreamingJobs": "Externe Streamingaufträge",
			"SchemaCompare.ExternalStreams": "Externe Streams",
			"SchemaCompare.ExternalTables": "Externe Tabellen",
			"SchemaCompare.FileTables": "Dateitabellen",
			"SchemaCompare.Filegroups": "Dateigruppen",
			"SchemaCompare.Files": "Dateien",
			"SchemaCompare.FullTextCatalogs": "Volltextkataloge",
			"SchemaCompare.FullTextStoplists": "Volltextstopplisten",
			"SchemaCompare.GeneralOptionsLabel": "Allgemeine Optionen",
			"SchemaCompare.GenerateSmartDefaults": "Intelligente Standardwerte generieren",
			"SchemaCompare.IgnoreAnsiNulls": "ANSI NULLS-Einstellung ignorieren",
			"SchemaCompare.IgnoreAuthorizer": "Autorisierer ignorieren",
			"SchemaCompare.IgnoreColumnCollation": "Spaltensortierung ignorieren",
			"SchemaCompare.IgnoreColumnOrder": "Spaltenreihenfolge ignorieren",
			"SchemaCompare.IgnoreComments": "Kommentare ignorieren",
			"SchemaCompare.IgnoreCryptographicProviderFilePath": "Dateipfad für Kryptografieanbieter ignorieren",
			"SchemaCompare.IgnoreDdlTriggerOrder": "DDL-Triggerreihenfolge ignorieren",
			"SchemaCompare.IgnoreDdlTriggerState": "DDL-Triggerstatus ignorieren",
			"SchemaCompare.IgnoreDefaultSchema": "Standardschema ignorieren",
			"SchemaCompare.IgnoreDmlTriggerOrder": "DML-Triggerreihenfolge ignorieren",
			"SchemaCompare.IgnoreDmlTriggerState": "DML-Triggerstatus ignorieren",
			"SchemaCompare.IgnoreExtendedProperties": "Erweiterte Eigenschaften ignorieren",
			"SchemaCompare.IgnoreFileAndLogFilePath": "Datei- und Protokolldateipfad ignorieren",
			"SchemaCompare.IgnoreFileSize": "Dateigröße ignorieren",
			"SchemaCompare.IgnoreFilegroupPlacement": "Dateigruppenplatzierung ignorieren",
			"SchemaCompare.IgnoreFillFactor": "Füllfaktor ignorieren",
			"SchemaCompare.IgnoreFullTextCatalogFilePath": "FilePath für Volltextkatalog ignorieren",
			"SchemaCompare.IgnoreIdentitySeed": "ID-Startwert ignorieren",
			"SchemaCompare.IgnoreIncrement": "Inkrement ignorieren",
			"SchemaCompare.IgnoreIndexOptions": "Indexoptionen ignorieren",
			"SchemaCompare.IgnoreIndexPadding": "Indexauffüllung ignorieren",
			"SchemaCompare.IgnoreKeywordCasing": "Groß-/Kleinschreibung bei Schlüsselwort ignorieren",
			"SchemaCompare.IgnoreLockHintsOnIndexes": "Sperrhinweise für Indizes ignorieren",
			"SchemaCompare.IgnoreLoginSids": "Anmelde-SIDs ignorieren",
			"SchemaCompare.IgnoreNotForReplication": "\"Nicht zur Replikation\" ignorieren",
			"SchemaCompare.IgnoreObjectPlacementOnPartitionScheme": "Objektplatzierung im Partitionsschema ignorieren",
			"SchemaCompare.IgnorePartitionSchemes": "Partitionsschemas ignorieren",
			"SchemaCompare.IgnorePermissions": "Berechtigungen ignorieren",
			"SchemaCompare.IgnoreQuotedIdentifiers": "Bezeichner in Anführungszeichen ignorieren",
			"SchemaCompare.IgnoreRoleMembership": "Rollenmitgliedschaft ignorieren",
			"SchemaCompare.IgnoreRouteLifetime": "Gültigkeitsdauer von Routen ignorieren",
			"SchemaCompare.IgnoreSemicolonBetweenStatements": "Semikolon zwischen Anweisungen ignorieren",
			"SchemaCompare.IgnoreTableOptions": "Tabellenoptionen ignorieren",
			"SchemaCompare.IgnoreUserSettingsObjects": "Benutzereinstellungsobjekte ignorieren",
			"SchemaCompare.IgnoreWhitespace": "Leerraum ignorieren",
			"SchemaCompare.IgnoreWithNocheckOnCheckConstraints": "WITH NOCHECK bei CHECK CONSTRAINT ignorieren",
			"SchemaCompare.IgnoreWithNocheckOnForeignKeys": "WITH NOCHECK bei ForeignKeys ignorieren",
			"SchemaCompare.IncludeCompositeObjects": "Zusammengesetzte Objekte einschließen",
			"SchemaCompare.IncludeTransactionalScripts": "Transaktionsskripts einschließen",
			"SchemaCompare.LinkedServerLogins": "Anmeldungen für Verbindungsserver",
			"SchemaCompare.LinkedServers": "Verbindungsserver",
			"SchemaCompare.Logins": "Anmeldungen",
			"SchemaCompare.MasterKeys": "Hauptschlüssel",
			"SchemaCompare.MessageTypes": "Nachrichtentypen",
			"SchemaCompare.NoAlterStatementsToChangeClrTypes": "Keine ALTER-Anweisungen zum Ändern von CLR-Typen",
			"SchemaCompare.ObjectTypesOptionsLabel": "Objekttypen einschließen",
			"SchemaCompare.PartitionFunctions": "Partitionsfunktionen",
			"SchemaCompare.PartitionSchemes": "Partitionsschemas",
			"SchemaCompare.Permissions": "Berechtigungen",
			"SchemaCompare.PopulateFilesOnFileGroups": "Dateien in Dateigruppen auffüllen",
			"SchemaCompare.Queues": "Warteschlangen",
			"SchemaCompare.RegisterDataTierApplication": "Datenschichtanwendung registrieren",
			"SchemaCompare.RemoteServiceBindings": "Remotedienstbindungen",
			"SchemaCompare.RoleMembership": "Rollenmitgliedschaft",
			"SchemaCompare.Routes": "Routen",
			"SchemaCompare.Rules": "Regeln",
			"SchemaCompare.RunDeploymentPlanExecutors": "Bereitstellungsplan-Executors ausführen",
			"SchemaCompare.ScalarValuedFunctions": "Skalarwertfunktionen",
			"SchemaCompare.SchemaCompareOptionsDialogLabel": "Optionen für Schemavergleich",
			"SchemaCompare.ScriptDatabaseCollation": "Skriptdatenbanksortierung",
			"SchemaCompare.ScriptDatabaseCompatibility": "Skriptdatenbankkompatibilität",
			"SchemaCompare.ScriptDatabaseOptions": "Skriptdatenbankoptionen",
			"SchemaCompare.ScriptDeployStateChecks": "StateChecks per Skript bereitstellen",
			"SchemaCompare.ScriptFileSize": "Skriptdateigröße",
			"SchemaCompare.ScriptNewConstraintValidation": "Überprüfung neuer Einschränkungen per Skript",
			"SchemaCompare.ScriptRefreshModule": "Skriptaktualisierungsmodul",
			"SchemaCompare.SearchPropertyLists": "Sucheigenschaftenlisten",
			"SchemaCompare.SecurityPolicies": "Sicherheitsrichtlinien",
			"SchemaCompare.Sequences": "Sequenzen",
			"SchemaCompare.ServerAuditSpecifications": "Spezifikationen für Serverüberwachungen",
			"SchemaCompare.ServerRoleMembership": "Serverrollenmitgliedschaft",
			"SchemaCompare.ServerRoles": "Serverrollen",
			"SchemaCompare.ServerTriggers": "Servertrigger",
			"SchemaCompare.Services": "Dienste",
			"SchemaCompare.Signatures": "Signaturen",
			"SchemaCompare.StoredProcedures": "Gespeicherte Prozeduren",
			"SchemaCompare.SymmetricKeys": "Symmetrische Schlüssel",
			"SchemaCompare.Synonyms": "Synonyme",
			"SchemaCompare.TableValuedFunctions": "Tabellenwertfunktionen",
			"SchemaCompare.Tables": "Tabellen",
			"SchemaCompare.TreatVerificationErrorsAsWarnings": "Überprüfungsfehler als Warnungen behandeln",
			"SchemaCompare.UnmodifiableObjectWarnings": "Unveränderliche Objektwarnungen",
			"SchemaCompare.UserDefinedDataTypes": "Benutzerdefinierte Datentypen",
			"SchemaCompare.UserDefinedTableTypes": "Benutzerdefinierte Tabellentypen",
			"SchemaCompare.Users": "Benutzer",
			"SchemaCompare.VerifyCollationCompatibility": "Sortierungskompatibilität überprüfen",
			"SchemaCompare.VerifyDeployment": "Bereitstellung überprüfen",
			"SchemaCompare.Views": "Sichten",
			"SchemaCompare.XmlSchemaCollections": "XML-Schemaauflistungen",
			"SchemaCompareOptionsDialog.Reset": "Zurücksetzen",
			"schemaCompare.ApplyConfirmation": "Möchten Sie das Ziel aktualisieren?",
			"schemaCompare.CompareDetailsTitle": "Details vergleichen",
			"schemaCompare.GetConnectionString": "Möchten Sie eine Verbindung mit \"{0}\" herstellen?",
			"schemaCompare.RecompareToRefresh": "Klicken Sie auf \"Vergleichen\", um den Vergleich zu aktualisieren.",
			"schemaCompare.actionColumn": "Aktion",
			"schemaCompare.addAction": "Hinzufügen",
			"schemaCompare.applyButtonDisabledTitle": "\"Anwenden\" ist aktiviert, wenn das Ziel eine Datenbank ist.",
			"schemaCompare.applyButtonEnabledTitle": "Änderungen auf das Ziel anwenden",
			"schemaCompare.applyNoChanges": "Keine Änderungen zur Anwendung vorhanden.",
			"schemaCompare.cancelCompareButton": "Beenden",
			"schemaCompare.cancelErrorMessage": "Fehler beim Abbrechen des Schemavergleichs: {0}",
			"schemaCompare.cannotExcludeMessage": "\"{0}\" kann nicht ausgeschlossen werden. Eingeschlossene abhängige Elemente vorhanden.",
			"schemaCompare.cannotExcludeMessageWithDependent": "\"{0}\" kann nicht ausgeschlossen werden. Eingeschlossene abhängige Elemente vorhanden: {1}",
			"schemaCompare.cannotIncludeMessage": "\"{0}\" kann nicht eingeschlossen werden. Ausgeschlossene abhängige Elemente vorhanden.",
			"schemaCompare.cannotIncludeMessageWithDependent": "\"{0}\" kann nicht eingeschlossen werden. Ausgeschlossene abhängige Elemente vorhanden: {1}",
			"schemaCompare.changeAction": "Ändern",
			"schemaCompare.compareButton": "Vergleichen",
			"schemaCompare.compareErrorMessage": "Fehler beim Schemavergleich: {0}",
			"schemaCompare.dacpacRadioButtonLabel": "Datei der Datenschichtanwendung (DACPAC)",
			"schemaCompare.databaseButtonLabel": "Datenbank",
			"schemaCompare.deleteAction": "Löschen",
			"schemaCompare.dialogTitle": "Schemavergleich",
			"schemaCompare.differencesTableTitle": "Vergleich zwischen Quelle und Ziel",
			"schemaCompare.generateScriptButton": "Skript generieren",
			"schemaCompare.generateScriptButtonDisabledTitle": "\"Skript generieren\" ist aktiviert, wenn das Ziel eine Datenbank ist.",
			"schemaCompare.generateScriptEnabledButton": "Skript zum Bereitstellen von Änderungen am Ziel generieren",
			"schemaCompare.generateScriptErrorMessage": "Fehler beim Generieren des Skripts: {0}",
			"schemaCompare.generateScriptNoChanges": "Keine Änderungen am Skript",
			"schemaCompare.includeColumnName": "Einschließen",
			"schemaCompare.includeExcludeInfoMessage": "Beachten Sie, dass Vorgänge zum Einschließen/Ausschließen einen Moment dauern können, während betroffene Abhängigkeiten berechnet werden.",
			"schemaCompare.noDifferences": "Es wurden keine Schemaunterschiede gefunden.",
			"schemaCompare.openFile": "Öffnen",
			"schemaCompare.openScmpButton": "SCMP-Datei öffnen",
			"schemaCompare.openScmpButtonTitle": "Quelle und Ziel sowie die in einer SCMP-Datei gespeicherten Optionen laden",
			"schemaCompare.openScmpErrorMessage": "Fehler beim Öffnen der SCMP-Datei: {0}",
			"schemaCompare.optionsButton": "Optionen",
			"schemaCompare.radioButtonsLabel": "Typ",
			"schemaCompare.saveFile": "Speichern",
			"schemaCompare.saveScmpButton": "SCMP-Datei speichern",
			"schemaCompare.saveScmpButtonTitle": "Quelle und Ziel, Optionen und ausgeschlossene Elemente speichern",
			"schemaCompare.saveScmpErrorMessage": "Fehler beim Speichern der SCMP-Datei: {0}",
			"schemaCompare.selectConnection": "Verbindung auswählen",
			"schemaCompare.selectSourceFile": "Quelldatei auswählen",
			"schemaCompare.selectTargetFile": "Zieldatei auswählen",
			"schemaCompare.sourceButtonTitle": "Quelle auswählen",
			"schemaCompare.sourceNameColumn": "Quellname",
			"schemaCompare.startText": "Um zwei Schemas zu vergleichen, wählen Sie zunächst ein Quellschema und ein Zielschema aus. Klicken Sie anschließend auf \"Vergleichen\".",
			"schemaCompare.switchButtonTitle": "Quelle und Ziel wechseln",
			"schemaCompare.switchDirectionButton": "Richtung wechseln",
			"schemaCompare.targetButtonTitle": "Ziel auswählen",
			"schemaCompare.targetNameColumn": "Zielname",
			"schemaCompare.typeColumn": "Typ",
			"schemaCompare.updateButton": "Anwenden",
			"schemaCompare.updateErrorMessage": "Fehler beim Anwenden des Schemavergleichs: {0}",
			"schemaCompare.waitText": "Der Vergleich wird gestartet. Dies kann einen Moment dauern.",
			"schemaCompareDialog.No": "Nein",
			"schemaCompareDialog.SourceTitle": "Quelle",
			"schemaCompareDialog.TargetTitle": "Ziel",
			"schemaCompareDialog.Yes": "Ja",
			"schemaCompareDialog.cancel": "Abbrechen",
			"schemaCompareDialog.databaseDropdownTitle": "Datenbank",
			"schemaCompareDialog.defaultUser": "Standardeinstellung",
			"schemaCompareDialog.differentSourceMessage": "Es wurde ein anderes Quellschema ausgewählt. Möchten Sie einen Vergleich durchführen?",
			"schemaCompareDialog.differentSourceTargetMessage": "Es wurden verschiedene Quell- und Zielschemas ausgewählt. Möchten Sie einen Vergleich durchführen?",
			"schemaCompareDialog.differentTargetMessage": "Es wurde ein anderes Zielschema ausgewählt. Möchten Sie einen Vergleich durchführen?",
			"schemaCompareDialog.fileTextBoxLabel": "Datei",
			"schemaCompareDialog.ok": "OK",
			"schemaCompareDialog.serverDropdownTitle": "Server",
			"schemaCompareDialog.sourceDatabaseDropdown": "Quelldatenbank",
			"schemaCompareDialog.sourceServerDropdown": "Quellserver",
			"schemaCompareDialog.sourceTextBox": "Quelldatei",
			"schemaCompareDialog.targetDatabaseDropdown": "Zieldatenbank",
			"schemaCompareDialog.targetServerDropdown": "Zielserver",
			"schemaCompareDialog.targetTextBox": "Zieldatei",
			"schemaCompareOptions.RecompareMessage": "Die Optionen wurden geändert. Möchten Sie den Vergleich wiederholen und neu anzeigen?"
		},
		"package": {
			"description": "Der SQL Server-Schemavergleich für Azure Data Studio unterstützt den Vergleich der Schemas von Datenbanken und DACPAC-Dateien.",
			"displayName": "SQL Server-Schemavergleich",
			"schemaCompare.start": "Schemavergleich"
		}
	}
}