{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"extension.description": "Node.js-Debuggingunterstützung",
			"node.label": "Node.js v6.3 und höher über Inspector Protocol",
			"node.sourceMaps.description": "Hiermit werden JavaScript-Quellzuordnungsdateien verwendet (sofern vorhanden).",
			"outDir.deprecationMessage": "Das Attribut \"outDir\" ist veraltet, verwenden Sie stattdessen \"outFiles\".",
			"node.outFiles.description": "Wenn Quellzuordnungsdateien aktiviert sind, geben diese Globmuster die generierten JavaScript-Dateien an. Wenn ein Muster mit \"!\" beginnt, werden die Dateien ausgeschlossen. Sofern nicht angegeben, wird der generierte Code im selben Verzeichnis wie die zugehörige Quelle erwartet.",
			"node.stopOnEntry.description": "Hiermit wird das Programm nach dem Start automatisch beendet.",
			"node.port.description": "Debugport für das Anfügen. Der Standardwert ist 9229.",
			"node.address.description": "TCP/IP-Adresse des Debugports. Der Standardwert ist \"localhost\".",
			"node.timeout.description": "Gibt den Zeitraum in Millisekunden an, nach dem erneut versucht wird, eine Verbindung mit Node.js herzustellen. Der Standardwert ist 10000 ms.",
			"node.smartStep.description": "Hiermit wird automatisch der generierte Code durchlaufen, der nicht der ursprünglichen Quelle zugeordnet werden kann.",
			"node.enableSourceMapCaching.description": "Hiermit werden aus einer URL heruntergeladene Sourcemaps auf dem Datenträger zwischengespeichert.",
			"node.diagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter eigene Diagnoseinformationen in der Konsole.",
			"node.diagnosticLogging.deprecationMessage": "\"diagnosticLogging\" ist veraltet. Verwenden Sie stattdessen \"trace\".",
			"node.verboseDiagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter den gesamten Datenverkehr mit Client und Ziel (sowie die über \"diagnosticLogging\" erfassten Informationen).",
			"node.verboseDiagnosticLogging.deprecationMessage": "\"verboseDiagnosticLogging\" ist veraltet. Verwenden Sie stattdessen \"trace\".",
			"node.trace.description": "Bei Festlegung auf TRUE protokolliert der Debugger Ablaufverfolgungsinformationen in einer Datei. Bei Festlegung auf \"verbose\" werden auch Protokolle in der Konsole angezeigt.",
			"node.sourceMapPathOverrides.description": "Eine Reihe von Zuordnungen zum Umschreiben der Speicherorte von Quelldateien gemäß Sourcemap in die Speicherorte auf dem Datenträger. Ausführliche Informationen finden Sie in der README-Datei.",
			"node.skipFiles.description": "Ein Array aus Datei- oder Ordnernamen oder Globmustern, die beim Debuggen übersprungen werden sollen.",
			"node.restart.description": "Hiermit wird die Sitzung neu gestartet, nachdem Node.js beendet wurde.",
			"node.showAsyncStacks.description": "Hiermit werden die asynchronen Aufrufe angezeigt, die zur aktuellen Aufrufliste geführt haben.",
			"node.disableOptimisticBPs.description": "Hiermit werden Haltepunkte in einer beliebigen Datei erst festgelegt, wenn eine Sourcemap für diese Datei geladen wurde.",
			"node.launch.program.description": "Absoluter Pfad zum Programm.",
			"node.launch.console.description": "Hiermit wird angegeben, wo das Debugziel gestartet werden soll: interne Konsole, integriertes Terminal oder externes Terminal.",
			"node.launch.args.description": "Befehlszeilenargumente, die an das Programm übergeben werden.",
			"node.launch.cwd.description": "Absoluter Pfad zum Arbeitsverzeichnis des Programms, für das ein Debugging durchgeführt werden soll.",
			"node.launch.runtimeExecutable.description": "Die zu verwendende Runtime. Dies ist entweder ein absoluter Pfad oder der Name einer Runtime, die in PATH verfügbar ist. Sofern nicht angegeben, wird \"node\" angenommen.",
			"node.launch.runtimeArgs.description": "Optionale Argumente, die an die ausführbare Datei der Runtime übergeben werden.",
			"node.launch.env.description": "Umgebungsvariablen, die an das Programm übergeben werden. Durch den Wert NULL wird die Variable aus der Umgebung entfernt.",
			"node.launch.envFile.description": "Absoluter Pfad zu einer Datei mit Umgebungsvariablendefinitionen.",
			"node.launch.outputCapture.description": "Hiermit wird angegeben, wo Ausgabemeldungen erfasst werden: Debug-API oder stdout/stderr-Streams.",
			"node.launch.config.name": "Starten",
			"node.attach.processId.description": "Die ID des Prozesses für das Anfügen.",
			"node.attach.localRoot.description": "Der lokale Quellstamm, der \"remoteRoot\" entspricht.",
			"node.attach.remoteRoot.description": "Der Quellstamm des Remotehosts.",
			"node.attach.config.name": "Anfügen",
			"node.processattach.config.name": "An den Prozess anhängen",
			"toggle.skipping.this.file": "Überspringen dieser Datei aktivieren/deaktivieren",
			"extensionHost.label": "VS Code-Erweiterungsentwicklung",
			"extensionHost.launch.runtimeExecutable.description": "Absoluter Pfad zu VS Code.",
			"extensionHost.launch.stopOnEntry.description": "Hiermit wird der Erweiterungshost nach dem Start automatisch beendet.",
			"extensionHost.launch.env.description": "Umgebungsvariablen, die an den Erweiterungshost übergeben werden.",
			"extensionHost.snippet.launch.label": "VS Code-Erweiterungsentwicklung",
			"extensionHost.snippet.launch.description": "VS Code-Erweiterung im Debugmodus starten",
			"extensionHost.launch.config.name": "Erweiterung starten"
		},
		"out/src/errors": {
			"VSND2001": "Die Runtime \"{0}\" wurde nicht in PATH gefunden. Ist \"{0}\" installiert?",
			"VSND2011": "Das Debugziel im Terminal kann nicht gestartet werden ({0}).",
			"VSND2017": "Das Debugziel kann nicht gestartet werden ({0}).",
			"VSND2035": "Debuggen der Erweiterung nicht möglich ({0}).",
			"VSND2028": "Unbekannter Konsolentyp \"{0}\".",
			"VSND2002": "Das Programm \"{0}\" kann nicht gestartet werden. Möglicherweise kann das Problem durch Konfigurieren von Quellzuordnungsdateien behoben werden.",
			"VSND2003": "Das Programm \"{0}\" kann nicht gestartet werden. Möglicherweise kann das Problem durch Festlegen des Attributs \"{1}\" behoben werden.",
			"VSND2009": "Das Programm \"{0}\" kann nicht gestartet werden, weil das zugehörige JavaScript nicht gefunden wurde.",
			"VSND2029": "Umgebungsvariablen können nicht aus Datei geladen werden ({0})."
		},
		"out/src/nodeDebugAdapter": {
			"attribute.wsl.not.exist": "Das Windows-Subsystem für die Linux-Installation wurde nicht gefunden.",
			"program.path.case.mismatch.warning": "Der Programmpfad verwendet eine andere Groß-/Kleinschreibung als die Datei auf dem Datenträger. Dies kann dazu führen, dass Haltepunkte nicht wirksam sind.",
			"node.console.title": "Node-Debugkonsole",
			"attribute.path.not.exist": "Das Attribut \"{0}\" ist nicht vorhanden ({1}).",
			"attribute.path.not.absolute": "Das Attribut \"{0}\" ist nicht absolut ({1}). Erwägen Sie das Hinzufügen von \"{2}\" als Präfix, um ein absolutes Attribut zu erhalten.",
			"VSND2001": "Die Runtime \"{0}\" wurde nicht in PATH gefunden. Stellen Sie sicher, dass \"{0}\" installiert ist.",
			"more.information": "Weitere Informationen",
			"origin.from.node": "Schreibgeschützter Inhalt aus Node.js",
			"origin.core.module": "Schreibgeschütztes Kernmodul"
		}
	}
}