{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"msgInstallPkgProgress": "L'installazione delle dipendenze di Notebook è in corso",
	"msgPythonDownloadComplete": "Il download di Python è stato completato",
	"msgPythonDownloadError": "Si è verificato un errore durante il download della configurazione di Python",
	"msgPythonDownloadPending": "Download del pacchetto Python",
	"msgPythonUnpackPending": "Decompressione del pacchetto Python",
	"msgPythonDirectoryError": "Si è verificato un errore durante la creazione della directory di installazione di Python",
	"msgPythonUnpackError": "Si è verificato un errore durante la decompressione del bundle di Python",
	"msgTaskName": "Installazione delle dipendenze di Notebook",
	"msgInstallPkgStart": "Installazione delle dipendenze di Notebook. Per altre informazioni, vedere la visualizzazione attività",
	"msgInstallPkgFinish": "L'installazione delle dipendenze di Notebook è stata completata",
	"msgPythonRunningError": "Non è possibile sovrascrivere un'installazione esistente di Python mentre Python è in esecuzione. Chiudere gli eventuali notebook attivi prima di procedere.",
	"msgSkipPythonInstall": "Python esiste già nel percorso specificato. L'installazione verrà ignorata.",
	"msgWaitingForInstall": "È già in corso un'altra installazione di Python. Attendere che venga completata.",
	"msgDependenciesInstallationFailed": "L'installazione delle dipendenze di Notebook non è riuscita. Errore: {0}",
	"msgDownloadPython": "Download della versione locale di Python per la piattaforma {0} in {1}",
	"confirmPackageUpgrade": "Alcuni pacchetti Python installati devono essere aggiornati. Aggiornarli ora?",
	"upgradePackages.pipInstall": "Installazione di {0}",
	"msgInstallStart": "Installazione dei pacchetti obbligatori per l'esecuzione di Notebooks...",
	"msgJupyterInstallDone": "... Installazione di Jupyter completata."
}