{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"azdata.displayName": "CLI de Azure Data",
			"azdata.description": "Compatibilidad con la CLI Azure Data.",
			"azdata.config.title": "Configuración de la CLI Azure Data",
			"azdata.config.debug": "Registrar información de depuración en el canal de salida para todos los comandos azdata ejecutados",
			"command.category": "CLI de Azure Data",
			"azdata.acceptEula.command.name": "Aceptar CLUF",
			"azdata.install.command.name": "Instalar",
			"azdata.update.command.name": "Buscar actualización",
			"azdata.category": "CLI de Azure Data",
			"azdata.acceptEula.description": "Elija cómo se lleva a cabo la aceptación del CLUF de la CLI de Azure Data.",
			"azdata.acceptEula.prompt.description": "Se solicitará al usuario que acepte el CLUF para la CLI de Azure Data.",
			"azdata.acceptEula.dontPrompt.description": "No se solicitará al usuario que acepte el CLUF para la CLI de Azure Data.",
			"azdata.install.description": "Elija cómo se realizará la instalación de la CLI de Azure Data",
			"azdata.install.prompt.description": "Se solicitará al usuario que instale la CLI de Azure Data",
			"azdata.install.dontPrompt.description": "No se solicitará al usuario que instale la CLI de Azure Data",
			"azdata.update.description": "Elija si desea que se le pregunte cuando haya una actualización de la CLI de Azure Data disponible.",
			"azdata.requiredUpdate.description": "Elija si desea que se le pregunte cuando esté disponible una actualización necesaria de la CLI de Azure Data.",
			"azdata.update.prompt.description": "Se solicitará al usuario que actualice la CLI de Azure Data.",
			"azdata.update.dontPrompt.description": "No se preguntará al usuario si desea actualizar la CLI de Azure Data."
		},
		"dist/localizedConstants": {
			"azdata.azdata": "CLI de Azure Data",
			"azdata.searchingForAzdata": "Buscando la instalación existente de la CLI de Azure Data...",
			"azdata.foundExistingAzdata": "Se encontró una instalación existente de la versión (v{0}) de la CLI de Azure Data en la ruta de acceso:{1}",
			"azdata.downloadingProgressMb": "Descargando ({0} / {1} MB)",
			"azdata.downloadFinished": "Descarga finalizada",
			"azdata.installingAzdata": "Se está instalando la CLI de Azure Data",
			"azdata.updatingAzdata": "Actualizando la CLI de Azure Data...",
			"azdata.azdataInstalled": "La CLI de Azure Data se instaló correctamente. Es necesario reiniciar Azure Data Studio para completar la configuración: las características no se activarán hasta que se haya realizado esta operación.",
			"azdata.azdataUpdated": "La CLI de Azure Data se actualizó correctamente a la versión: {0}.",
			"azdata.yes": "Sí",
			"azdata.no": "No",
			"azdata.accept": "Aceptar",
			"azdata.decline": "Rechazar",
			"azdata.doNotAskAgain": "No volver a preguntar",
			"azdata.askLater": "Preguntar más tarde",
			"azdata.downloadingTo": "Descargando {0} de {1} a {2}",
			"azdata.executingCommand": "Ejecutando el comando: “{0} {1}”",
			"azdata.stdoutOutput": "stdout: {0}",
			"azdata.stderrOutput": "stderr: {0}",
			"azdata.checkingLatestAzdataVersion": "Buscando la última versión disponible de la CLI de Azure Data",
			"azdata.gettingTextContentsOfUrl": "Obteniendo el contenido de texto del recurso en la dirección URL {0}",
			"azdata.versionForUpdate": "Versión encontrada: {0} en la que se puede actualizar la CLI de Azure Data a partir de la versión actual: {1}.",
			"azdata.latestAzdataVersionAvailable": "Última versión disponible de CLI de Azure Data: {0}.",
			"azdata.couldNotFindAzdata": "No se pudo encontrar la CLI de Azure Data. Error: {0}",
			"azdata.currentlyInstalledVersionIsLatest": "Versión de la CLI de Azure Data instalada actualmente: {0} es igual o más reciente que cualquier otra versión disponible",
			"azdata.promptLog": "Se pide al usuario que acepte lo siguiente: {0}",
			"azdata.couldNotFindAzdataWithPrompt": "No se pudo encontrar la CLI de Azure Data, ¿desea instalarla ahora? De lo contrario, algunas características no podrán funcionar.",
			"azdata.promptForAzdataUpdate": "Hay disponible una nueva versión de CLI de Azure Data ({0}), ¿desea actualizarla ahora?",
			"azdata.promptForRequiredAzdataUpdate": "Esta extensión requiere que la CLI de Azure Data sea >= {0} para instalarse, ¿desea actualizar a la última versión ({1}) ahora? Si no es así, es posible que algunas funcionalidades no funcionen.",
			"azdata.requiredVersionNotAvailable": "Esta extensión requiere que la CLI de Azure Data sea >= {0} para instalarse, pero la versión actual disponible solo es {1}. Instale la versión correcta manualmente desde [aquí] (https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata) y, a continuación, reinicie Azure Data Studio.",
			"azdata.missingRequiredVersion": "Se requiere que la CLI de Azure Data sea >= {0} para esta característica. Ejecute el comando “CLI de Azure Data: buscar actualización” para instalarla y vuelva a intentarlo.",
			"azdata.downloadError": "Error durante la descarga",
			"azdata.installError": "Error al instalar la CLI de Azure Data: {0}",
			"azdata.updateError": "Error al actualizar CLI de Azure Data: {0}",
			"azdata.platformUnsupported": "La plataforma \"{0}\" no se admite actualmente",
			"azdata.unexpectedCommandError": "Error inesperado al ejecutar el comando: {0}",
			"azdata.unexpectedExitCode": "Código de salida inesperado desde el comando: {1} ({0})",
			"azdata.noAzdata": "No hay disponible ninguna instancia de CLI de Azure Data, ejecute el comando “CLI de Azure Data: instalar” para habilitar las características que lo requieren.",
			"azdata.noAzdataWithLink": "No hay disponible ninguna instancia de CLI de Azure Data, [instalar la CLI de Azure Data](command:azdata.install) para habilitar las características que lo requieren.",
			"azdata.skipInstall": "Se va a omitir la instalación de CLI de Azure Data, ya que el usuario no solicitó la operación y la opción de configuración: {0}.{1} es {2}",
			"azdata.skipUpdate": "Se omitirá la actualización de la CLI de Azure Data, ya que la operación no la solicitó el usuario y la opción de configuración: {0}.{1} es {2}",
			"azdata.skipRequiredUpdate": "Se omitirá la actualización necesaria de la CLI de Azure Data, ya que la operación no la solicitó el usuario y la opción de configuración: {0}.{1} es {2}",
			"azdata.noReleaseVersion": "No hay ninguna versión de lanzamiento disponible para la plataforma “{0}”\r\nInformación de la versión: ${1}",
			"azdata.noDownloadLink": "No hay ningún vínculo de descarga disponible para la plataforma “{0}\"\r\nInformación de la versión: ${1}",
			"azdata.failedToParseReleaseInfo": "No se pudo analizar el JSON del contenido en: {0}.\r\nContenido del archivo:\r\n{1}\r\nError: {2}",
			"azdata.azdataUserSettingReadLog": "Configuración de usuario de la CLI de Azure Data: {0}.{1} lectura, valor: {2}",
			"azdata.azdataUserSettingUpdatedLog": "Configuración de usuario de CLI de Azure Data: {0}.{1} actualizado, newValue: {2}",
			"azdata.userResponseInstall": "Respuesta del usuario al mensaje para instalar la CLI de Azure Data: {0}",
			"azdata.userResponseUpdate": "Respuesta del usuario en el mensaje de actualización de la CLI de Azure Data: {0}",
			"azdata.userRequestedInstall": "El usuario solicitó instalar la CLI de Azure Data a través del comando “CLI de Azure: instalar”",
			"azdata.userRequestedUpdate": "El usuario solicitó la actualización de CLI de Azure Data con el comando “CLI de Azure Data: buscar actualizaciones”",
			"azdata.acceptEula": "El usuario solicitó que se le pregunte al aceptar el CLUF invocando el comando \"CLI de Azure Data: aceptar CLUF\"",
			"azdata.updateCheckSkipped": "No se encontró ninguna comprobación de la disponibilidad de la nueva versión de la CLI de Azure Data que se ha realizado como CLI de Azure Data para instalarse",
			"azdata.eulaNotAccepted": "No se han aceptado la declaración de privacidad de Microsoft ni los términos de licencia de la CLI de Azure Data. Ejecutar el comando: [CLI de Azure Data: aceptar CLUF] (comando: azdata.acceptEula) para aceptar el CLUF con el fin de habilitar las características que requieren la CLI de Azure Data.",
			"azdata.promptForEula": "Es necesario aceptar la [Declaración de privacidad de Microsoft] ({0}) y los [Términos de licencia de la CLI de Azure Data] ({1}) para usar esta extensión. Si esto se rechaza, algunas características no funcionarán.",
			"azdata.promptForEulaResponse": "Respuesta del usuario a la solicitud de CLUF: {0}",
			"azdata.eulaAcceptedStateOnStartup": "Estado \"CLUF aceptado\" en el inicio: {0}",
			"azdata.endpointOrNamespaceRequired": "Se debe especificar un punto de conexión o un espacio de nombres"
		}
	}
}