{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"displayName": "Características del lenguaje JSON",
			"description": "Proporciona un potente soporte de lenguaje para archivos JSON.",
			"json.schemas.desc": "Asociar esquemas a archivos JSON en el proyecto actual",
			"json.schemas.url.desc": "Una dirección URL a un esquema o una ruta de acceso relativa a un esquema en el directorio actual",
			"json.schemas.fileMatch.desc": "Una matriz de patrones de archivo con los que buscar correspondencia al resolver archivos JSON en esquemas. \"*\" se puede usar como comodín. Los patrones de exclusión también se pueden definir y comenzar con \"!\". Un archivo coincide cuando hay al menos un patrón coincidente y el último patrón coincidente no es un patrón de exclusión.",
			"json.schemas.fileMatch.item.desc": "Un patrón de archivo que puede contener \"*\" con el cual coincidir cuando los archivos JSON se resuelvan en esquemas.",
			"json.schemas.schema.desc": "La definición de esquema de la dirección URL determinada. Solo se necesita proporcionar el esquema para evitar los accesos a la dirección URL del esquema.",
			"json.format.enable.desc": "Habilitar o deshabilitar el formateador JSON predeterminado",
			"json.tracing.desc": "Realiza el seguimiento de la comunicación entre VS Code y el servidor de lenguaje JSON.",
			"json.colorDecorators.enable.desc": "Habilita o deshabilita decoradores de color",
			"json.colorDecorators.enable.deprecationMessage": "El valor \"json.colorDecorators.enable\" está en desuso en favor de \"editor.colorDecorators\".",
			"json.schemaResolutionErrorMessage": "No se puede resolver el esquema.",
			"json.clickToRetry": "Haga clic para volver a intentarlo.",
			"json.maxItemsComputed.desc": "El número máximo de símbolos del esquema y regiones de plegado calculados (limitado por motivos de rendimiento).",
			"json.maxItemsExceededInformation.desc": "Muestra una notificación cuando se supera el número máximo de símbolos de esquema y de regiones plegables.",
			"json.enableSchemaDownload.desc": "Cuando está habilitado, los esquemas JSON se pueden capturar desde ubicaciones http y https."
		},
		"client\\dist\\node/jsonClient": {
			"json.resolveError": "JSON: Error de resolución de esquemas",
			"jsonserver.name": "Servidor de lenguaje JSON",
			"untitled.schema": "No se puede cargar {0}",
			"schemaDownloadDisabled": "La descarga de esquemas está deshabilitada mediante el valor \"{0}\"",
			"ok": "Aceptar",
			"goToSetting": "Abrir configuración",
			"yes never again": "No volver a mostrar",
			"configureLimit": "Use el valor \"{0}\" para configurar el límite.",
			"json.schemaResolutionErrorMessage": "No se puede resolver el esquema. Haga clic para volver a intentarlo.",
			"json.schemaResolutionDisabledMessage": "La descarga de esquemas está deshabilitada. Haga clic para configurar."
		}
	}
}