{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"dist/localizedConstants": {
			"az.promptForAzUpdate": "Una nueva versión de la CLI de Azure ( {0} ) está disponible, ¿desea actualizarla ahora?",
			"az.accept": "Aceptar",
			"az.parseVersionError": "Se ha producido un error al analizar la salida de la versión --az.",
			"az.azOutputParseErrorCaught": "Se ha producido un error al analizar la salida del comando az: {0}. La salida no es JSON.",
			"az.askLater": "Preguntar más tarde",
			"az.az": "CLI de Azure",
			"az.missingRequiredVersion": "LA CLI de Azure >= {0} es necesaria para esta función. Ejecute el comando \\\"CLI de Azure: buscar actualizaciones\\\" para instalarlo e inténtelo de nuevo.",
			"az.azUserSettingReadLog": "Configuración del usuario de la CLI de Azure: {0}.{1}valor leído: {2}",
			"az.azUserSettingUpdatedLog": "Configuración del usuario de la CLI de Azure: {0}.{1}actualizado, newValue: {2}",
			"az.azInstalled": "La CLI de Azure se ha instalado correctamente. Es necesario reiniciar Azure Studio para completar la configuración; las funciones no se activarán hasta que se realice esta acción.",
			"az.checkingLatestAzVersion": "Comprobación de la última versión disponible de la CLI de Azure",
			"az.couldNotFindAzWithPrompt": "No pudo encontrar la CLI de Azure, ¿desea instalarla ahora? Si no es así, algunas características podrían no funcionar.",
			"az.couldNotFindAz": "No se pudo encontrar la CLI de Azure CLI. Error: {0}",
			"az.couldNotFindArcdataWithPrompt": "No se ha podido encontrar la extensión arcdata de la CLI de Azure, instálela ahora. Si no es así, algunas funciones podrían no funcionar.",
			"az.couldNotFindAzArc": "No se ha podido encontrar la extensión arcdata dela CLI de Azure. Error: {0}",
			"az.currentlyInstalledVersionIsLatest": "La versión actualmente instalada de la CLI de Azure: {0} es igual o más nueva que cualquier otra versión disponible",
			"az.decline": "Rechazar",
			"az.doNotAskAgain": "No volver a preguntar",
			"az.downloadFinished": "Descarga finalizada",
			"az.downloadingProgressMb": "Descargando ({0} / {1} MB)",
			"az.downloadingTo": "Descargando {0} de {1} a {2}",
			"az.endpointOrNamespaceRequired": "Se debe especificar un punto de conexión o un espacio de nombres",
			"az.installError": "Error al instalar la CLI de Azure y la extensión arcdata: {0}",
			"az.updateError": "Error al actualizar la CLI de Azure: {0}",
			"az.downloadError": "Error al descargar",
			"az.executingCommand": "Ejecutando el comando: “{0} {1}”",
			"az.failedToParseReleaseInfo": "No se pudo analizar el JSON del contenido en: {0}.\r\nContenido del archivo:\r\n{1}\r\nError: {2}",
			"az.foundExistingAz": "Se encontró la instalación existente de la CLI de Azure de la versión (v{0}) en la ruta:{1} con la versión arcdata: {2}.",
			"az.versionForUpdate": "Versión encontrada: {0} a la que se puede actualizar la CLI de Azure desde la versión actual: {1}.",
			"az.gettingTextContentsOfUrl": "Obteniendo el contenido de texto del recurso en la dirección URL {0}",
			"az.installingAz": "Instalando la CLI de Azure...",
			"az.installingArcdata": "Instalación de la extensión arcdata de la CLI de Azure...",
			"az.latestAzVersionAvailable": "Última versión disponible de la CLI de Azure: {0}.",
			"az.no": "No",
			"az.noAzArc": "No está disponible la extensión arcdata de la CLI de Azure.",
			"az.noAzWithLink": "No está disponible la CLI de Azure, [instale la CLI de Azure](command:az.install) para habilitar las funciones que la requieren.",
			"az.noAz": "Si no está disponible la CLI de Azure, ejecute el comando \\\"CLI de Azure: instalar\\\" para habilitar las funciones que lo requieren.",
			"az.noAzureCLI": "No está disponible la CLI de Azure. Instale la última versión manualmente desde [aquí](https://docs.microsoft.com/cli/azure/install-azure-cli) y luego reinicie Azure Studio.",
			"az.updateCheckSkipped": "No se ha comprobado la disponibilidad de la nueva versión de la CLI de Azure porque no se encuentra instalada.",
			"az.noDownloadLink": "No hay ningún vínculo de descarga disponible para la plataforma “{0}\"\r\nInformación de la versión: ${1}",
			"az.noReleaseVersion": "No hay ninguna versión disponible para la plataforma\"{0}\"\r\nInformación de versión: ${1}",
			"az.platformUnsupported": "La plataforma \\\"{0}\\\" no es compatible actualmente",
			"az.promptLog": "Se pide al usuario que acepte lo siguiente: {0}",
			"arc.releaseDateNotParsed": "No se pudo analizar la fecha de lanzamiento.",
			"az.searchingForAz": "Buscando la instalación existente de la CLI de Azure...",
			"az.skipInstall": "Omitiendo la instalación de la CLI de Azure y la extensión arcdata, ya que la operación no fue solicitada por el usuario y la opción config: {0}.{1} es {2}",
			"az.arcdataInstalled": "La extensión arcdata de la CLI de Azure se ha instalado correctamente. Es necesario reiniciar Azure Studio para completar la configuración; las funciones no se activarán hasta que se realice esta acción.",
			"az.promptForRequiredAzUpdate": "Esta extensión requiere que la CLI de Azure >= {0} esté instalada, ¿desea actualizar a la última versión ({1}) ahora? Si no lo hace, es posible que alguna funcionalidad no funcione.",
			"az.arcdataExtensionNotInstalled": "Esta extensión requiere la instalación de la extensión \\\"arcdata\\\" de la CLI de Azure. Instale la última versión siguiendo las instrucciones de [aquí](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.requiredVersionNotAvailable": "Esta extensión requiere que la extensión de la CLI de Azure \\\"arcdata\\\" versión >= {0}sea instalada, pero la versión actual disponible es sólo {1}. Instale la versión correcta usando las instrucciones de [aquí](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.unexpectedCommandError": "Error inesperado al ejecutar el comando: {0}",
			"az.unexpectedExitCode": "Código de salida inesperado desde el comando: {1} ({0})",
			"az.updatingAz": "Actualizando la CLI de Azure...",
			"az.userResponseInstall": "Respuesta del usuario a la solicitud de instalación de la CLI de Azure: {0}",
			"az.userResponseUpdate": "Respuesta del usuario a la solicitud de actualización de la CLI de Azure:: {0}",
			"az.userRequestedInstall": "El usuario solicitó instalar la CLI de Azure y la extensión arcdata usando el comando \\\"CLI de Azure: instalar\\\"",
			"az.yes": "Sí",
			"az.unsupportedArcDataVersion": "Su versión descargada de la extensión {1} de la CLI de Azure \\\"arcdata\\\" aún no es compatible. La última versión es {0}. Instale la versión correcta siguiendo las instrucciones de [aquí](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).",
			"az.stderrOutput": "stderr: {0}",
			"az.stdoutOutput": "stdout: {0}"
		},
		"package": {
			"azcli.arc.category": "CLI de Azure",
			"command.category": "CLI de Azure",
			"azcli.arc.displayName": "CLI de Azure",
			"azcli.arc.config.title": "Configuración de la CLI de Azure",
			"azcli.arc.azArcdataInstallKey.description": "Elija si se le pedirá que descargue la extensión arcdata de la CLI de Azure.",
			"azcli.azCliInstallKey.description": "Elija si se le pedirá que instale la CLI de Azure.",
			"azcli.arc.azArcdataUpdateKey.description": "Elija si se le solcita cuando esté disponible una actualización de la extensión arcdata de la CLI de Azure.",
			"azcli.arc.config.debug": "Registrar información de depuración en el canal de salida para todos los comandos az ejecutados",
			"azcli.arc.description": "Compatibilidad con la CLI de Azure.",
			"azcli.arc.update.prompt.description": "Se pedirá al usuario que actualice la extensión arcdata de la CLI de Azure",
			"azcli.install.prompt.description": "Se le pedirá al usuario que instale la CLI de Azure",
			"azcli.arc.install.prompt.description": "Se pedirá al usuario que instale la extensión arcdata de la CLI de Azure",
			"azcli.arc.update.dontPrompt.description": "Al usuario no se le pedirá que actualice la extensión arcdata de la CLI de Azure",
			"azcli.install.dontPrompt.description": "Al usuario no se le pedirá que instale la CLI de Azure",
			"azcli.arc.install.dontPrompt.description": "El usuario no tendrá que instalar la extensión arcdata de la CLI de Azure"
		}
	}
}