{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.browser.breakpoint": "Agregar punto de interrupción del explorador",
			"attach.node.process": "Conectarse con el proceso de Node",
			"base.cascadeTerminateToConfigurations.label": "Lista de sesiones de depuración que también se detendrán cuando se termine esta sesión de depuración.",
			"browser.address.description": "La dirección IP o el nombre de host donde escucha el explorador depurado.",
			"browser.attach.port.description": "Puerto para usar con la depuración remota del explorador, indicado como \"--remote-debugging-port\" al iniciar el explorador.",
			"browser.baseUrl.description": "Dirección URL base para resolver rutas de acceso baseUrl. baseURL se recorta al asignar direcciones URL a los archivos del disco. El valor predeterminado es el dominio de la dirección URL de inicio.",
			"browser.browserAttachLocation.description": "Fuerza que el explorador se asocie en una ubicación. En un área de trabajo remota (por ejemplo, a través de SSH o WSL) se puede usar para asociarse a un explorador en la máquina remota, en lugar de localmente.",
			"browser.browserLaunchLocation.description": "Fuerza que el explorador se inicie en una ubicación. En un área de trabajo remota (por ejemplo, a través de SSH o WSL), se puede usar para abrir el explorador en la máquina remota en lugar de localmente.",
			"browser.cleanUp.description": "Limpieza que debe hacerse después de finalizar la sesión de depuración. Se puede cerrar solo la pestaña que se está depurando o bien cerrar todo el explorador.",
			"browser.cwd.description": "Directorio de trabajo opcional para el archivo ejecutable del entorno de ejecución.",
			"browser.disableNetworkCache.description": "Controla si se omite la memoria caché de red para cada solicitud.",
			"browser.env.description": "Diccionario opcional de pares clave/valor de entorno para el explorador.",
			"browser.file.description": "Archivo HTML local para abrirlo en el explorador",
			"browser.includeDefaultArgs.description": "Si los argumentos predeterminados de inicio del explorador (para deshabilitar las características que pueden dificultar la depuración) se incluirán en el lanzamiento.",
			"browser.inspectUri.description": "Formato que se va a usar para reescribir el valor inspectUri: es una cadena de plantilla que interpola las claves en ''{curlyBraces}\". Las claves disponibles son:\r\n - \"url.*\" es la dirección analizada de la aplicación en ejecución. Por ejemplo, ''{url.port}\", \"{url.hostname}''.\r\n - \"port\" es el puerto de depuración en el que Chrome está escuchando.\r\n - \"browserInspectUri\" es el URI del inspector en el explorador iniciado.\r\n - \"browserInspectUriPath\" es la parte de la ruta de acceso del URI del inspector en el explorador iniciado (por ejemplo, \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2\").\r\n - \"wsProtocol\" es el protocolo websocket sugerido. Se establece en \"wss\" si la dirección URL original es \"https\"o en \"ws\" en caso contrario.\r\n",
			"browser.launch.port.description": "Puerto en que escucha el explorador. Se establece de manera predeterminada en \"0\", lo que provoca que el explorador se depure mediante canalizaciones. Esto suele ser más seguro y debe elegirse a menos que tenga que adjuntar el explorador desde otra herramienta.",
			"browser.pathMapping.description": "Asignación de direcciones URL/rutas a carpetas locales, para resolver scripts en el navegador a scripts en disco",
			"browser.perScriptSourcemaps.description": "Especifica si los scripts se cargan de forma individual con mapas de origen únicos que contengan el nombre base del archivo de código fuente. Puede establecerse para optimizar el tratamiento de los mapas de origen cuando se trabaja con un gran volumen de scripts pequeños. Si se establece en \"Automático\", se detectarán casos conocidos en los que esta operación sea adecuada.",
			"browser.profileStartup.description": "Si es true, la generación de perfiles comenzará tan pronto como se inicie el proceso",
			"browser.restart": "Si se debe reconectar si está cerrada la conexión del explorador",
			"browser.revealPage": "Pestaña de enfoque",
			"browser.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
			"browser.runtimeExecutable.description": "\"canary\", \"stable\", \"custom\" o ruta al ejecutable del explorador. Si se elige \"custom\", puede ser un encapsulador ajustable, una compilación ajustable o una variable de entorno CHROME_PATH.",
			"browser.runtimeExecutable.edge.description": "Puede ser un \"valor controlado\", \"estable\", desarrollo, \"personalizado\" o una ruta de acceso al ejecutable del explorador. El valor \"personalizado\" significa un contenedor personalizado, una compilación personalizada o una variable de entorno EDGE_PATH.",
			"browser.server.description": "Configura un servidor web para que se inicie. Toma la misma configuración que la tarea de lanzamiento \"node\".",
			"browser.skipFiles.description": "Matriz de nombres de archivo o carpeta, o patrones globales de ruta de acceso, que deben omitirse durante la depuración.",
			"browser.smartStep.description": "Ejecuta paso a paso líneas no asignadas de archivos sin mapa de origen de forma automática. Por ejemplo, código que TypeScript produce automáticamente durante la compilación de async/await u otras características.",
			"browser.sourceMapPathOverrides.description": "Conjunto de asignaciones para reescribir las ubicaciones de los archivos de origen en sus ubicaciones en el disco, a partir de lo que indica el mapa de origen. Consulte el archivo LÉAME para obtener más detalles.",
			"browser.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
			"browser.targetSelection": "Indica si se debe adjuntar a todos los destinos que coinciden con el filtro de dirección URL (\"automático\") o se le pide que seleccione uno (\"seleccionar\").",
			"browser.timeout.description": "Vuelva a intentar este número de milisegundos para conectarse al explorador. El valor predeterminado es 10000 ms.",
			"browser.url.description": "Buscará una pestaña con esta URL exacta y la adjuntará, si se encuentra",
			"browser.urlFilter.description": "Buscará una página con esta dirección URL y, si la encuentra, asociará la depuración a ella. Puede tener caracteres comodín (*).",
			"browser.userDataDir.description": "De forma predeterminada, el explorador se inicia con un perfil de usuario independiente en una carpeta temporal. Utilice esta opción para invalidarlo. Establézcalo en false para iniciar con su perfil de usuario predeterminado.",
			"browser.vueComponentPaths": "Lista de patrones globales de archivos para buscar componentes \"*.vue\". De forma predeterminada, busca en el área de trabajo al completo. Esto debe especificarse, debido a las búsquedas adicionales que los mapas de origen de Vue requieren en la CLI de Vue 4. Para deshabilitar este tratamiento especial, establézcalo en una matriz vacía.",
			"browser.webRoot.description": "Especifica la ruta de acceso absoluta del área de trabajo a la raíz del servidor web. Se usa para resolver rutas de acceso del tipo \"/app.js\" a archivos del disco. Forma abreviada para la asignación de rutas de acceso con \"/\".",
			"chrome.attach.description": "Adjuntar a una instancia de Chrome ya en modo de depuración",
			"chrome.attach.label": "Chrome: Asociar",
			"chrome.label": "Chrome",
			"chrome.launch.description": "Inicie Chrome para depurar una URL",
			"chrome.launch.label": "Chrome: Inicio",
			"configuration.autoAttachMode": "Configura los procesos que se van a asociar y a depurar automáticamente cuando \"#debug.node.autoAttach#\" esté activado. Un proceso de Node iniciado con la marca \"--inspect\" se asociará siempre, independientemente de esta configuración.",
			"configuration.autoAttachMode.always": "Asocia automáticamente a todos los procesos de Node.js iniciados en el terminal.",
			"configuration.autoAttachMode.disabled": "Conexión automática está desactivada y no se muestra en la barra de estado.",
			"configuration.autoAttachMode.explicit": "Solo se puede asociar automáticamente cuando se proporciona la marca \"--inspect\".",
			"configuration.autoAttachMode.smart": "Asocia automáticamente cuando se ejecutan scripts que no están en una carpeta node_modules.",
			"configuration.autoAttachSmartPatterns": "Configura patrones globales para determinar cuándo asociar en modo \"smart\" \"#debug.javascript.autoAttachFilter#\". \"$KNOWN _TOOLS $\" se reemplaza por una lista de nombres de ejecutores de pruebas y código comunes. [Más información en la documentación de VS Code] (https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
			"configuration.autoExpandGetters": "Configura si los captadores de propiedad se expandirán automáticamente. Si es false, el captador aparecerá como \"get propertyName\" y solo se evaluará al hacer clic en él.",
			"configuration.automaticallyTunnelRemoteServer": "Al depurar una aplicación web remota, se establece si se debe hacer un túnel automático del servidor remoto al equipo local.",
			"configuration.breakOnConditionalError": "Indica si debe detenerse cuando los puntos de interrupción condicionales producen un error. Nota: El elemento \"type\" de launch.json debe tener el prefijo \"pwa-\" para usarlo, por ejemplo, \"pwa-node\".",
			"configuration.debugByLinkOptions": "Opciones utilizadas al depurar vínculos abiertos en los que se ha hecho clic desde dentro del terminal de depuración. Se puede establecer en \"false\" para deshabilitar este comportamiento.",
			"configuration.defaultRuntimeExecutables": "Valor predeterminado de \"runtimeExecutable\" que se usa para las configuraciones de inicio, si no se especifica un valor. Se puede usar para configurar rutas de acceso personalizadas a Node.js o a las instalaciones del explorador.",
			"configuration.npmScriptLensLocation": "Lugar en que se debe mostrar una lente de código \"Ejecutar\" y \"Depurar\" en los scripts npm. Puede estar en todos, en scripts, sobre la sección del script o bien no mostrarse nunca.",
			"configuration.pickAndAttachOptions": "Opciones predeterminadas que se usan al depurar un proceso mediante el comando \"Debug: Attach to Node.js Process\"",
			"configuration.resourceRequestOptions": "Opciones de solicitud que se van a usar al cargar los recursos (como los mapas de origen) en el depurador. Puede ser necesario configurarlo si los mapas de origen requieren autenticación o el uso de un certificado autofirmado, por ejemplo. Las opciones se usan para crear una solicitud con la biblioteca [\"got\"](https://github.com/sindresorhus/got).\r\n\r\nUn caso habitual para deshabilitar la comprobación de certificados puede realizarse si se pasa \"{ \"https\": { \"rejectUnauthorized\": false } }\".",
			"configuration.suggestPrettyPrinting": "Si se sugiere bastante imprimir código JavaScript que se ve minimizado cuando se entra en él.",
			"configuration.terminalOptions": "Opciones de inicio predeterminadas para el terminal de depuración de JavaScript y los scripts npm.",
			"configuration.unmapMissingSources": "Configura si el archivo sin mapa de origen donde no se puede leer el archivo original se desasignará automáticamente. Si es false (predeterminado), se muestra un mensaje.",
			"configuration.usePreview": "Utilice el nuevo depurador de JavaScript en versión preliminar para Node.js y Chrome.",
			"createDiagnostics.label": "Crear información de diagnóstico para la sesión actual",
			"customDescriptionGenerator.description": "Personaliza la descripción de texto que el depurador muestra para los objetos (variables locales, etc...). Ejemplos:\r\n      1. this.toString() // Llama a toString para imprimir todos los objetos.\r\n      2. this.customDescription ? this.customDescription() : defaultValue // Usa el método customDescription si está disponible, si no devuelve defaultValue.\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Usa el método customDescription si está disponible, si no devuelve defaultValue.\r\n      ",
			"customPropertiesGenerator.description": "Personalice las propiedades que se muestran para un objeto en el depurador (variables locales, etc.). Ejemplos:\r\n    1. { ...this, extraProperty: '12345' } // Agregue una propiedad extraproperty 12345 a todos los objetos.\r\n    2. this.customProperties ? this.customProperties() : this // Use el método customProperties, si está disponible; en caso contrario, use las propiedades de este (las propiedades predeterminadas).\r\n    3. function () { return this.customProperties ? this.customProperties() : this } // Use el método customDescription, si está disponible; en caso contrario, se devuelven las propiedades predeterminadas.\r\n\r\n    En desuso: esta es una implementación temporal de esta característica hasta que tengamos tiempo para implementarla de la forma aquí descrita: https://github.com/microsoft/vscode/issues/102181",
			"debug.npm.edit": "Editar package.json",
			"debug.npm.noScripts": "No se han encontrado scripts npm en su package.json",
			"debug.npm.noWorkspaceFolder": "Debe abrir una carpeta de área de trabajo para depurar scripts npm.",
			"debug.npm.parseError": "No se pudo leer {0}: {1}",
			"debug.npm.script": "Debug npm Script",
			"debug.terminal.attach": "Asociar al proceso del terminal Node.js",
			"debug.terminal.label": "Crear terminal de depuración de JavaScript",
			"debug.terminal.program.description": "Comando para ejecutar en el terminal iniciado. Si no se proporciona, el terminal se abrirá sin iniciar un programa.",
			"debug.terminal.snippet.label": "Ejecute \"npm start\" en un terminal de depuración",
			"debug.terminal.toggleAuto": "Alternar la asociación automática de Node.js del terminal",
			"debug.terminal.welcome": "[Terminal de depuración de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nPuede usar el terminal de depuración de JavaScript para depurar los procesos de Node.js que se ejecutan en la línea de comandos.",
			"debug.terminal.welcomeWithLink": "[Terminal de depuración de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nPuede usar el terminal de depuración de JavaScript para depurar los procesos de Node.js que se ejecutan en la línea de comandos.\r\n\r\n[Dirección URL de depuración](command:extension.js-debug.debugLink)",
			"debugLink.label": "Abrir vínculo",
			"edge.address.description": "Al depurar vistas web, la dirección IP o el nombre de host en que está escuchando la vista web. Se detectará automáticamente si no se establece.",
			"edge.attach.description": "Adjuntar a una instancia de Microsoft Edge ya en modo de depuración",
			"edge.attach.label": "Edge: Asociar",
			"edge.label": "Edge",
			"edge.launch.description": "Iniciar Microsoft Edge para depurar una dirección URL",
			"edge.launch.label": "Edge: Iniciar",
			"edge.port.description": "Al depurar vistas web, el puerto en que escucha el depurador de la vista web. Se detectará automáticamente si no se establece.",
			"edge.useWebView.description": "(Solo Microsoft Edge [Chromium]) Cuando es \"true\", el depurador tratará el ejecutable del entorno de ejecución como una aplicación host que contiene un elemento WebView que le permite depurar el contenido del script WebView.",
			"enableContentValidation.description": "Alterna si se comprueba si el contenido de los archivos en el disco coincide con lo que se ha cargado en el entorno de ejecución. Resulta útil en diversos escenarios y es necesario en otros, pero puede causar problemas si, por ejemplo, se aplica la transformación de scripts del lado servidor.",
			"errors.timeout": "{0}: tiempo de espera después de {1} ms",
			"extension.description": "Extensión para depurar programas Node.js y Chrome.",
			"extensionHost.label": "Desarrollo de extensiones de VS Code",
			"extensionHost.launch.config.name": "Iniciar extensión",
			"extensionHost.launch.debugWebWorkerHost": "Configura si debe intentarse la conexión con el host de extensiones de trabajo web.",
			"extensionHost.launch.debugWebviews": "Configura si se debe intentar la asociación a las vistas web en la instancia de VS Code iniciada. **Nota:** En este momento, se requiere que la configuración \"webview.experimental.useExternalEndpoint\" sea true para que funcione correctamente y solo funcionará en VS Code para escritorio.",
			"extensionHost.launch.env.description": "Variables de entorno pasadas al host de extensiones.",
			"extensionHost.launch.rendererDebugOptions": "Opciones de inicio de Chrome que se usan al asociarse al proceso de representador, con \"debugWebviews\" o \"debugWebWorkerHost\".",
			"extensionHost.launch.runtimeExecutable.description": "Ruta de acceso absoluta a VS Code.",
			"extensionHost.launch.stopOnEntry.description": "El host de extensiones se detiene automáticamente tras el inicio.",
			"extensionHost.snippet.launch.description": "Iniciar una extensión de VS Code en modo de depuración",
			"extensionHost.snippet.launch.label": "Desarrollo de extensiones de VS Code",
			"longPredictionWarning.disable": "No volver a mostrar",
			"longPredictionWarning.message": "Los puntos de interrupción están tardando en configurarse. Puede acelerarlo actualizando \"outFiles\" en su archivo launch.json.",
			"longPredictionWarning.noFolder": "No hay ninguna carpeta del área de trabajo abierta.",
			"longPredictionWarning.open": "Abrir launch.json",
			"node.address.description": "Dirección TCP/IP del proceso que se va a depurar. El valor predeterminado es \"localhost\".",
			"node.attach.attachExistingChildren.description": "Si se intenta adjuntar a procesos secundarios ya generados.",
			"node.attach.attachSpawnedProcesses.description": "Si se deben establecer variables de entorno en el proceso adjunto para realizar un seguimiento de los elementos secundarios generados.",
			"node.attach.config.name": "Asociar",
			"node.attach.continueOnAttach": "Si es true, reanudaremos automáticamente los programas iniciados y esperando en \"--inspect-brk\"",
			"node.attach.processId.description": "Identificador del proceso al que se va a asociar.",
			"node.attach.restart.description": "Intente volver a conectarse al programa si se pierde la conexión. Si se establece en \"true\", se intentará una vez por segundo, para siempre. En su lugar, puede personalizar el intervalo y el número máximo de intentos mediante la especificación de los valores \"delay\" y \"maxAttempts\" en un objeto.",
			"node.attachSimplePort.description": "Si se establece, se asocia al proceso a través del puerto especificado. Esto generalmente ya no es necesario en programas de Node.js y pierde la capacidad de depurar los procesos secundarios. Sin embargo, puede ser útil en escenarios más esotéricos, como en los lanzamientos de Deno y Docker. Si se establece en 0, se elegirá un puerto aleatorio y se agregará --inspect-brk a los argumentos de inicio de forma automática.",
			"node.console.title": "Consola de depuración de Node",
			"node.disableOptimisticBPs.description": "No establezca puntos de interrupción en ningún archivo hasta que se haya cargado un mapa de origen para el archivo.",
			"node.killBehavior.description": "Configura el modo en que se termina el proceso de depuración al detener la sesión. Puede ser:\r\n\r\n- forceful (predeterminado): anula de manera forzosa el árbol de procesos. Envía SIGKILL en posix o \"taskkill.exe /F\" en Windows.\r\n- polite: anula correctamente el árbol de procesos. Es posible que los procesos con un comportamiento erróneo se sigan ejecutando después de apagar de esta forma. Envía SIGTERM en posix o \"taskkill.exe\" sin la marca \"/F\" (forzar) en Windows.\r\n- none: no se producirá ninguna terminación.",
			"node.label": "Node.js",
			"node.launch.args.description": "Argumentos de la línea de comandos que se pasan al programa.",
			"node.launch.autoAttachChildProcesses.description": "Asociar automáticamente el depurador a los procesos secundarios nuevos.",
			"node.launch.config.name": "Iniciar",
			"node.launch.console.description": "Lugar donde debe iniciarse el destino de depuración.",
			"node.launch.console.externalTerminal.description": "Terminal externo que puede configurarse desde Configuración del usuario.",
			"node.launch.console.integratedTerminal.description": "Terminal integrado de VS Code",
			"node.launch.console.internalConsole.description": "Consola de depuración de VS Code (que no admite la lectura de entradas de un programa)",
			"node.launch.cwd.description": "Ruta de acceso absoluta al directorio de trabajo del programa que se está depurando. Si ha establecido localRoot, cwd coincidirá con ese valor; de lo contrario, se revertirá a su workspaceFolder.",
			"node.launch.env.description": "Variables de entorno pasadas al programa. El valor \"null\" elimina la variable del entorno.",
			"node.launch.envFile.description": "Ruta de acceso absoluta a un archivo que contiene definiciones de variables de entorno.",
			"node.launch.logging": "Configuración de registro",
			"node.launch.logging.cdp": "Ruta al archivo de registro para los mensajes del protocolo DevTools de Chrome",
			"node.launch.logging.dap": "Ruta de acceso al archivo de registro para los mensajes del Protocolo de adaptador de depuración",
			"node.launch.outputCapture.description": "Ubicación desde donde se van a capturar los mensajes de salida: la API de depuración predeterminada si se establece en \"console\" o las secuencias stdout/stderr si se establece en \"std\".",
			"node.launch.program.description": "Ruta de acceso absoluta al programa. El valor generado se infiere de package.json y de los archivos abiertos. Edite este atributo.",
			"node.launch.restart.description": "Pruebe a reiniciar el programa si se cierra un código de salida distinto de cero.",
			"node.launch.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
			"node.launch.runtimeExecutable.description": "Entorno de ejecución que debe usarse. Puede ser una ruta de acceso absoluta o el nombre de un entorno de ejecución disponible en PATH. Si se omite, se utiliza \"node\".",
			"node.launch.runtimeSourcemapPausePatterns": "Lista de patrones en los que se insertan manualmente puntos de interrupción de punto de entrada. Puede ser útil para proporcionar al depurador una oportunidad para establecer puntos de interrupción al usar mapas origen que no existen o que no se pueden detectar antes de iniciar, como [con Serverless Framework] (https://github.com/microsoft/vscode-js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Versión del entorno de ejecución de \"Node\" que debe usarse. Requiere \"NVM\".",
			"node.launch.useWSL.deprecation": "\"useWSL\" está en desuso y se eliminará el soporte correspondiente. Utilice la extensión \"Remote - WSL\" en su lugar.",
			"node.launch.useWSL.description": "Utilice el subsistema de Windows para Linux.",
			"node.localRoot.description": "Ruta de acceso al directorio local que contiene el programa.",
			"node.pauseForSourceMap.description": "Si desea esperar a que se carguen los mapas de origen para cada script entrante. Esto tiene una sobrecarga de rendimiento y puede deshabilitarse de forma segura cuando se queda sin disco, siempre y cuando \"rootPath\" no esté deshabilitado.",
			"node.port.description": "Puerto de depuración al que se va a conectar. El valor predeterminado es 5858.",
			"node.processattach.config.name": "Asociar al proceso",
			"node.profileStartup.description": "Si es true, la generación de perfiles comenzará tan pronto como se inicie el proceso",
			"node.remoteRoot.description": "Ruta de acceso absoluta al directorio remoto que contiene el programa.",
			"node.resolveSourceMapLocations.description": "Lista de patrones de minimatch para ubicaciones (carpetas y direcciones URL) en las que se pueden utilizar mapas de origen para resolver archivos locales. Se puede utilizar para evitar la interrupción incorrecta en el código asignado de origen externo. Los patrones se pueden prefijar con \"!\" para excluirlos. Se puede establecer en una matriz vacía o nula para evitar restricciones.",
			"node.showAsyncStacks.description": "Muestra las llamadas asincrónicas que llevan a la pila de llamadas actual.",
			"node.snippet.attach.description": "Adjuntar a un nodo en ejecución",
			"node.snippet.attach.label": "Node.js: Asociar",
			"node.snippet.attachProcess.description": "Abrir el selector de procesos para elegir el proceso de Node para conectarse",
			"node.snippet.attachProcess.label": "Node.js: adjuntar a proceso",
			"node.snippet.electron.description": "Depurar el proceso principal de Electron",
			"node.snippet.electron.label": "Node.js: proceso principal de Electron",
			"node.snippet.gulp.description": "Depurar tarea de Gulp (asegúrese de tener Gulp instalado localmente en el proyecto)",
			"node.snippet.gulp.label": "Node.js: tarea de Gulp",
			"node.snippet.launch.description": "Iniciar un programa de nodo en modo de depuración",
			"node.snippet.launch.label": "Node.js: iniciar programa",
			"node.snippet.mocha.description": "Depurar pruebas de Mocha",
			"node.snippet.mocha.label": "Node.js: pruebas de Mocha",
			"node.snippet.nodemon.description": "Use nodemon para reiniciar una sesión de depuración en los cambios de origen",
			"node.snippet.nodemon.label": "Node.js: configuración de Nodemon",
			"node.snippet.npm.description": "Inicia un programa de Node con un script \"debug\" de npm.",
			"node.snippet.npm.label": "Node.js: Launch via npm",
			"node.snippet.remoteattach.description": "Adjuntar al puerto de depuración de un programa de nodo remoto",
			"node.snippet.remoteattach.label": "Node.js: adjuntar a programa remoto",
			"node.snippet.yo.description": "Depurar generador de Yeoman (se instala ejecutando \"npm link\" en la carpeta del proyecto).",
			"node.snippet.yo.label": "Node.js: generador de Yeoman",
			"node.sourceMapPathOverrides.description": "Un conjunto de mapeos para reescribir las localizaciones de los ficheros fuente con lo que los mapas fuente indican, a sus ubicaciones en disco.",
			"node.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
			"node.stopOnEntry.description": "El programa se detiene automáticamente tras el inicio.",
			"node.timeout.description": "Vuelva a probar con este número de milisegundos para conectarse a Node.js. El valor predeterminado es 10000 ms.",
			"node.versionHint.description": "Permite especificar explícitamente la versión del nodo que se está ejecutando, que se puede usar para deshabilitar o habilitar determinados comportamientos en los casos en los que la detección automática de versiones no funciona.",
			"node.websocket.address.description": "Dirección de WebSocket exacta a la que se va a asociar. Si no se especifica, se detectará a partir de la dirección y el puerto.",
			"outFiles.description": "Si los mapas de origen están habilitados, estos patrones globales especifican los archivos JavaScript generados. Si un patrón comienza con '!' los archivos se excluyen. Si no se especifica, el código generado se espera en el mismo directorio que su origen.",
			"pretty.print.script": "Bastante impresión para depuración",
			"profile.start": "Tomar el perfil de rendimiento",
			"profile.stop": "Detener el perfil de rendimiento",
			"remove.browser.breakpoint": "Eliminar punto de interrupción del explorador",
			"remove.browser.breakpoint.all": "Eliminar todos los puntos de interrupción del navegador",
			"skipFiles.description": "Una matriz de patrones globales para que los archivos omitan al depurar. El patrón \"<node_internals>/**\" coincide con todos los módulos internos de Node.js.",
			"smartStep.description": "Explore automáticamente el código generado que no se puede volver a asignar al código fuente original.",
			"start.with.stop.on.entry": "Iniciar depuración y detenerla tras el inicio",
			"timeouts.generalDescription": "Tiempos de espera de varias operaciones del depurador",
			"timeouts.generalDescription.markdown": "Tiempos de espera de varias operaciones del depurador",
			"timeouts.sourceMaps.description": "Tiempos de espera relacionados con las operaciones de mapas de origen",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Tiempo extra en milisegundos permitido por cada sesión para esperar a que se procesen las asignaciones de origen, después de que se agote el tiempo mínimo (sourceMapMinPause)",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Tiempo mínimo en milisegundos dedicado a esperar a que cada asignación de origen se procese cuando se está analizando un script",
			"toggle.skipping.this.file": "Cambiar y omitir este archivo",
			"trace.boolean.description": "El seguimiento se puede establecer en \"true\" para escribir registros de diagnóstico en el disco.",
			"trace.console.description": "Configura si los registros también se devuelven a la consola de depuración.",
			"trace.description": "Configura qué salida de diagnóstico se produce.",
			"trace.level.description": "Configura el nivel de registros registrados.",
			"trace.logFile.description": "Configura dónde se escriben los registros de disco.",
			"trace.stdio.description": "Si desea devolver datos de seguimiento desde la aplicación o el explorador iniciados.",
			"trace.tags.description": "Configura qué tipos de registros se registran."
		},
		"/src/binder": {
			"breakpoint.provisionalBreakpoint": "Punto de interrupción sin enlazar"
		},
		"/src/debugServer": {
			"breakpoint.provisionalBreakpoint": "Punto de interrupción sin enlazar"
		},
		"/src/vsDebugServer": {
			"session.rootSessionName": "Adaptador de depuración de JavaScript"
		},
		"/src/adapter/customBreakpoints": {
			"breakpoint.webglErrorNamed": "Error de WebGL \"{0}\"",
			"breakpoint.webglErrorNamedDetails": "En pausa por un punto de interrupción de instrumentación de error de WebGL, error \"{0}\"",
			"breakpoint.cspViolationNamed": "Infracción de CSP \"{0}\"",
			"breakpoint.cspViolationNamedDetails": "En pausa por un punto de interrupción de instrumentación de infracción de la directiva de seguridad de contenido, directiva \"{0}\"",
			"breakpoint.instrumentationNamed": "En pausa por un punto de interrupción de instrumentación \"{0}\"",
			"breakpoint.eventListenerNamed": "En pausa por un punto de interrupción de escucha de eventos \"{0}\", desencadenado en \"{1}\"",
			"breakpoint.requestAnimationFrame": "Solicitar fotograma de animación",
			"breakpoint.cancelAnimationFrame": "Cancelar el fotograma de animación",
			"breakpoint.animationFrameFired": "Fotograma de animación activado",
			"breakpoint.createCanvasContext": "Crear contexto del lienzo",
			"breakpoint.webglErrorFired": "Error de WebGL desencadenado",
			"breakpoint.webglWarningFired": "Advertencia de WebGL desencadenada",
			"breakpoint.scriptFirstStatement": "Primera instrucción del script",
			"breakpoint.cspViolation": "Script bloqueado por la directiva de seguridad de contenido",
			"breakpoint.setInnerHtml": "Establecer innerHTML",
			"breakpoint.setTimeoutFired": "setTimeout activado",
			"breakpoint.setIntervalFired": "setInterval activado",
			"breakpoint.createAudioContext": "Crear AudioContext",
			"breakpoint.closeAudioContext": "Cerrar AudioContext",
			"breakpoint.resumeAudioContext": "Reanudar AudioContext",
			"breakpoint.suspendAudioContext": "Suspender AudioContext"
		},
		"/src/adapter/debugAdapter": {
			"breakpoint.caughtExceptions": "Excepciones detectadas",
			"breakpoint.caughtExceptions.description": "Breaks on all throw errors, even if they're caught later.",
			"breakpoint.uncaughtExceptions": "Excepciones no detectadas",
			"error.sourceNotFound": "No se encontró el código fuente",
			"error.sourceContentDidFail": "No se puede recuperar el contenido de origen",
			"error.variableNotFound": "No se encontró la variable",
			"error.threadNotFound": "No se encontró el subproceso",
			"error.cannotPrettyPrint": "No se pueden imprimir con sangría"
		},
		"/src/adapter/sources": {
			"source.skipFiles": "Omitido por skipFiles"
		},
		"/src/adapter/stackTrace": {
			"scope.global": "Global",
			"scope.local": "Local",
			"scope.with": "Bloque With",
			"scope.closure": "Clausura",
			"scope.catch": "Bloque catch",
			"scope.block": "Bloquear",
			"scope.script": "Script",
			"scope.eval": "Eval",
			"scope.module": "Módulo",
			"scope.closureNamed": "Clausura ({0})",
			"smartStepSkipLabel": "Omitido por smartStep",
			"scope.returnValue": "Valor devuelto"
		},
		"/src/adapter/threads": {
			"error.resumeDidFail": "No se puede reanudar",
			"error.pauseDidFail": "No se puede pausar",
			"error.stepOverDidFail": "No se puede realizar el paso siguiente",
			"error.stepInDidFail": "No se puede entrar",
			"error.stepOutDidFail": "No se puede salir",
			"error.stackFrameNotFound": "No se encontró el marco de pila",
			"error.evaluateOnAsyncStackFrame": "No se puede evaluar en un marco de pila asincrónica",
			"error.restartFrameAsync": "No se puede reiniciar un fotograma asincrónico",
			"reason.description.restart": "En pausa por una entrada de marco",
			"error.threadNotPaused": "El subproceso no está en pausa",
			"error.threadNotPausedOnException": "El subproceso no está en pausa por la excepción",
			"error.evaluateDidFail": "No se puede evaluar",
			"pause.breakpoint": "En pausa por un punto de interrupción",
			"pause.default": "En pausa",
			"pause.assert": "En pausa por una aserción",
			"pause.debugCommand": "En pausa por una llamada a debug()",
			"pause.DomBreakpoint": "En pausa por un punto de interrupción de DOM",
			"pause.exception": "En pausa por una excepción",
			"pause.promiseRejection": "En pausa por rechazo de una promesa",
			"pause.instrumentation": "En pausa por un punto de interrupción de instrumentación",
			"pause.xhr": "En pausa por XMLHttpRequest o \"fetch\"",
			"pause.oom": "En pausa antes de la excepción de memoria insuficiente",
			"pause.eventListener": "En pausa por una escucha de eventos",
			"warnings.handleSourceMapPause.didNotWait": "ADVERTENCIA: El procesamiento de mapas de origen de {0} tardó más de {1} ms, por lo que se siguió ejecutando sin esperar a que se establecieran todos los puntos de interrupción del script."
		},
		"/src/adapter/variables": {
			"error.variableNotFound": "No se encontró la variable",
			"error.emptyExpression": "No se puede establecer un valor vacío",
			"error.invalidExpression": "Expresión no válida",
			"error.setVariableDidFail": "No se puede establecer el valor de la variable",
			"error.unknown": "Error desconocido",
			"error.failedToCustomizeObjectProperties": "Error de personalización de las propiedades",
			"error.customValueDescriptionGeneratorFailed": "{0} (no se puede describir: {1})"
		},
		"/src/dap/errors": {
			"NVS_HOME.not.found.message": "El atributo \"runtimeVersion\" requiere que se instale el administrador de versiones de Node.js \"nvs\" o \"nvm\".",
			"NVM_HOME.not.found.message": "El atributo \"runtimeVersion\" requiere el administrador de versiones \"nvm-windows\" o \"nvs\" de Node.js.",
			"runtime.version.not.found.message": "La versión de Node.js \"{0}\" no se instaló con el administrador de versiones {1}.",
			"VSND2011": "No se puede iniciar el destino de depuración en el terminal ({0}).",
			"VSND2029": "No se pueden cargar las variables de entorno del archivo ({0}).",
			"runtime.node.notfound": "No se encuentra el binario de Node.js \"{0}\": {1}. Asegúrese de que Node.js esté instalado y en PATH, o bien establezca \"runtimeExecutable\" en launch.json.",
			"runtime.node.outdated": "La versión de Node en \"{0}\" está obsoleta (versión {1}); se requiere Node 8. x como mínimo.",
			"invalidHitCondition": "La condición de acierto \"{0}\" no es válida. Se esperaba una expresión como \"> 42\" o \"== 2\".",
			"profile.error.generic": "Error al tomar un perfil del destino.",
			"profile.error.concurrent": "Detenga el perfil en ejecución antes de iniciar uno nuevo.",
			"noBrowserInstallFound": "No se encuentra ninguna instalación de {0} en el sistema. Pruebe a instalarlo o proporcione una ruta de acceso absoluta al explorador en \"runtimeExecutable\", en el archivo launch.json.",
			"browserVersionNotFound": "No se encuentra {0} versión {1}. Las versiones detectadas automáticamente disponibles son: {2}. Puede establecer \"runtimeExecutable\" en launch.json en una de ellas o proporcionar una ruta de acceso absoluta al ejecutable del explorador.",
			"error.browserLaunchError": "No se puede iniciar el explorador: \"{0}\"",
			"error.browserAttachError": "No se puede asociar al explorador",
			"error.threadNotFound": "No se encontró la página de destino. Puede que tenga que actualizar el valor de \"urlFilter\" para que coincida con el de la página que quiere depurar.",
			"asyncScopesNotAvailable": "Variables no disponibles en las pilas asincrónicas",
			"breakpointSyntaxError": "Error de sintaxis al establecer el punto de interrupción con la condición {0} en la línea {1}: {2}",
			"sourcemapParseError": "No se pudo leer el mapa de origen de {0}: {1}"
		},
		"/src/ui/autoAttach": {
			"details": "Detalles"
		},
		"/src/ui/companionBrowserLaunch": {
			"cannotDebugInBrowser": "No se puede iniciar ningún explorador en modo de depuración desde aquí. Abra el área de trabajo en VS Code en el escritorio para habilitar la depuración."
		},
		"/src/ui/debugLinkUI": {
			"debugLink.invalidUrl": "La dirección URL proporcionada no es válida.",
			"yes": "Sí",
			"never": "Nunca",
			"debugLink.savePrompt": "¿Desea guardar una configuración en el archivo launch.json para un acceso fácil más adelante?",
			"no": "No"
		},
		"/src/ui/debugNpmScript": {
			"debug.npm.noWorkspaceFolder": "Debe abrir una carpeta de área de trabajo para depurar scripts npm.",
			"debug.npm.parseError": "No se pudo leer {0}: {1}",
			"debug.npm.noScripts": "No se han encontrado scripts npm en su package.json",
			"debug.npm.notFound.open": "Editar package.json"
		},
		"/src/ui/debugTerminalUI": {
			"terminal.cwdpick": "Seleccione el directorio de trabajo actual para el nuevo terminal"
		},
		"/src/ui/disableSourceMapUI": {
			"always": "Siempre",
			"yes": "Sí",
			"disableSourceMapUi.msg": "Esta es una ruta de acceso de archivo ausente a la que hace referencia una mapa de origen. ¿Quiere depurar la versión compilada en su lugar?",
			"no": "No"
		},
		"/src/ui/experimentEnlist": {
			"experimentEnlist": "Puede desactivar el nuevo depurador con el valor \"debug.javascript.usePreview\". Infórmenos si tiene cualquier problema. Gracias por probar."
		},
		"/src/ui/longPredictionUI": {
			"longPredictionWarning.message": "Los puntos de interrupción están tardando en configurarse. Puede acelerarlo actualizando \"outFiles\" en su archivo launch.json.",
			"longPredictionWarning.open": "Abrir launch.json",
			"longPredictionWarning.disable": "No volver a mostrar",
			"longPredictionWarning.noFolder": "No hay ninguna carpeta del área de trabajo abierta."
		},
		"/src/ui/prettyPrint": {
			"yes": "Sí",
			"no": "No",
			"never": "Nunca"
		},
		"/src/ui/processPicker": {
			"process.id.error": "Asociar al proceso: '{0}' no parece un id de proceso.",
			"process.picker.error": "Falló el selector de proceso ({0})",
			"pickNodeProcess": "Seleccione el proceso node. js para adjuntarlo a",
			"process.id.port.signal": "Id. del proceso: {0}, puerto de depuración: {1} ({2})",
			"process.id.signal": "Id. del proceso: {0} ({1})",
			"cannot.enable.debug.mode.error": "Asociar al proceso: no se puede habilitar el modo de depuración para el proceso '{0}' ({1})."
		},
		"/src/ui/terminalLinkHandler": {
			"terminalLinkHover.debug": "Depurar dirección URL",
			"cantOpenChromeOnWeb": "No se puede iniciar ningún explorador en modo de depuración desde aquí. Si quiere depurar esta página web, abra el área de trabajo desde VS Code en el escritorio."
		},
		"/src/adapter/breakpoints/userDefinedBreakpoint": {
			"breakpoint.provisionalBreakpoint": "Punto de interrupción sin enlazar"
		},
		"/src/adapter/console/queryObjectsMessage": {
			"queryObject.invalidObject": "Solo se pueden consultar objetos",
			"queryObject.couldNotQuery": "No se pudo consultar el objeto proporcionado.",
			"queryObject.errorPreview": "Se ha podido generar la vista previa: {0}"
		},
		"/src/adapter/console/textualMessage": {
			"console.assert": "Error de aserción"
		},
		"/src/adapter/profiling/basicCpuProfiler": {
			"profile.cpu.label": "Perfil de CPU",
			"profile.cpu.description": "Genera un archivo .cpuprofile que se puede abrir en Chrome DevTools"
		},
		"/src/targets/browser/browserAttacher": {
			"chrome.targets.placeholder": "Seleccionar una pestaña",
			"attach.cannotConnect": "No se puede conectar con el destino en {0}: {1}"
		},
		"/src/targets/node/nodeAttacher": {
			"node.attach.restart.message": "Se perdió la conexión con el elemento que se va a depurar; se volverá a conectar en {0} ms\r\n"
		},
		"/src/targets/node/nodeBinaryProvider": {
			"yes": "Sí",
			"outOfDate": "{0} ¿Quiere probar a depurar de todas formas?",
			"runtime.node.notfound.enoent": "la ruta de acceso no existe",
			"runtime.node.notfound.spawnErr": "error al obtener la versión: {0}"
		},
		"/src/targets/node/terminalProgramLauncher": {
			"node.console.title": "Consola de depuración de Node"
		},
		"/src/ui/configuration/chromiumDebugConfigurationProvider": {
			"existingBrowser.debugAnyway": "Depurar de todos modos",
			"existingBrowser.alert": "Parece que ya se está ejecutando un explorador desde {0}. Ciérrelo antes de intentar la depuración; de lo contrario, es posible que VS Code posible no pueda conectarse a él.",
			"existingBrowser.location.default": "una sesión de depuración antigua",
			"existingBrowser.location.userDataDir": "el valor userDataDir configurado",
			"cancel": "Cancelar",
			"chrome.launch.name": "Iniciar Chrome para localhost"
		},
		"/src/ui/configuration/nodeDebugConfigurationProvider": {
			"debug.terminal.label": "Crear terminal de depuración de JavaScript",
			"node.launch.script": "Ejecutar el script: {0}",
			"node.launch.currentFile": "Ejecutar el archivo actual"
		},
		"/src/ui/configuration/nodeDebugConfigurationResolver": {
			"program.not.found.message": "No se encuentra ningún programa para depurar.",
			"node.launch.config.name": "Iniciar el programa",
			"mern.starter.explanation": "La configuración de inicio del proyecto '{0}' fue creada. ",
			"program.guessed.from.package.json.explanation": "La configuración de inicio fue creada basada en \"package.json\".",
			"outFiles.explanation": "Ajusta modelos globales en los atributos ‘outFiles’ para cubrir el código JavaScript generado."
		},
		"/src/ui/profiling/breakpointTerminationCondition": {
			"profile.termination.breakpoint.label": "Seleccionar un punto de interrupción",
			"profile.termination.breakpoint.description": "Ejecutar hasta que se alcance un punto de interrupción específico",
			"breakpointTerminationWarnSlow": "La generación de perfiles con los puntos de interrupción habilitados puede cambiar el rendimiento del código. Puede resultar útil validar los resultados con las condiciones de terminación \"duración\" o \"manual\".",
			"breakpointTerminationWarnConfirm": "¡Entendido!"
		},
		"/src/ui/profiling/durationTerminationCondition": {
			"profile.termination.duration.label": "Duración",
			"profile.termination.duration.description": "Ejecutar durante un período de tiempo específico",
			"profile.termination.duration.inputTitle": "Duración del perfil",
			"profile.termination.duration.placeholder": "Duración del perfil en segundos; por ejemplo, \"5\"",
			"profile.termination.duration.invalidFormat": "Escriba un número.",
			"profile.termination.duration.invalidLength": "Especifique un número mayor que 1."
		},
		"/src/ui/profiling/manualTerminationCondition": {
			"profile.termination.duration.label": "Manual",
			"profile.termination.duration.description": "Ejecutar hasta que se detenga manualmente"
		},
		"/src/ui/profiling/uiProfileManager": {
			"profile.sessionState": "Generación de perfiles",
			"profile.status.single": "$(loading) Hacer clic para detener la generación de perfiles ({0})",
			"profile.status.default": "$(loading) Hacer clic para detener la generación de perfiles",
			"profile.status.multiSession": "$(loading) Hacer clic para detener la generación de perfiles ({0} sesiones)",
			"yes": "Sí",
			"no": "No",
			"profile.alreadyRunning": "Ya se está ejecutando una sesión de generación de perfiles. ¿Quiere detenerla e iniciar una sesión nueva?",
			"profile.type.title": "Tipo de perfil:",
			"profile.termination.title": "Tiempo que se va a ejecutar el perfil:"
		},
		"/src/ui/profiling/uiProfileSession": {
			"profile.saving": "Guardando"
		}
	}
}