{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"displayName": "Características del lenguaje JavaScript y TypeScript",
			"description": "Proporciona soporte de lenguaje enriquecido para JavaScript y TypeScript.",
			"reloadProjects.title": "Volver a cargar el proyecto",
			"configuration.typescript": "TypeScript",
			"configuration.suggest.completeFunctionCalls": "Complete las funciones con la signatura de parámetro.",
			"configuration.suggest.includeAutomaticOptionalChainCompletions": "Habilite/deshabilite la visualización de terminaciones en valores potencialmente indefinidos que insertan una llamada en cadena opcional. Requiere TS 3.7+ y que las comprobaciones estrictas de elementos nulos.estén habilitadas.",
			"typescript.tsdk.desc": "Especifica la ruta de acceso de la carpeta a los archivos tsserver y lib*.d.ts en una instalación de TypeScript que se usará para IntelliSense, por ejemplo: \"./node_modules/typescript/lib\".\r\n\r\n- Cuando se especifica como una configuración de usuario, la versión TypeScript de \"typescript.tsdk\" reemplaza automáticamente la versión integrada de TypeScript.\r\n- Cuando se especifica como una configuración de área de trabajo, \"typescript.tsd\" le permite cambiar para usar esa versión del área de trabajo de TypeScript para IntelliSense con el comando \"TypeScript: Select TypeScript version\".\r\n\r\nConsulte la [documentación de TypeScript](https://code.visualstudio.com/docs/typescript/typescript-compiling#_using-newer-typescript-versions) para obtener más detalles sobre la administración de versiones de TypeScript.",
			"typescript.disableAutomaticTypeAcquisition": "Deshabilita la adquisición automática de tipos, que busca paquetes \"@types\" de npm con el fin de mejorar IntelliSense para las bibliotecas externas.",
			"typescript.enablePromptUseWorkspaceTsdk": "Permite solicitar a los usuarios el uso de la versión de TypeScript configurada en el área de trabajo para IntelliSense.",
			"typescript.tsserver.enableTracing": "Habilita el seguimiento del rendimiento del servidor TS en un directorio. Estos archivos de seguimiento se pueden usar para diagnosticar problemas de rendimiento del servidor TS. El registro puede contener rutas de acceso, código fuente e información potencialmente confidencial acerca del proyecto.",
			"typescript.tsserver.log": "Habilita los registros del servidor TS a un archivo. Este registro se puede utilizar para diagnosticar problemas en el servidor TS. Este registro puede contener rutas de acceso, código fuente y posiblemente otra información sensitiva acerca del proyecto.",
			"typescript.tsserver.pluginPaths": "Rutas de acceso adicionales para detectar complementos del servicio de lenguaje TypeScript.",
			"typescript.tsserver.pluginPaths.item": "Ruta relativa o absoluta. La ruta de acceso relativa se resolverá contra las carpetas del área de trabajo.",
			"typescript.tsserver.trace": "Habilita el seguimiento de mensajes al servidor TS. Este seguimiento se puede utilizar para diagnosticar problemas en el servidor TS. Este seguimiento puede contener rutas de acceso, código fuente y posiblemente otra información sensitiva acerca del proyecto.",
			"typescript.validate.enable": "Habilita o deshabilita la validación de TypeScript.",
			"typescript.format.enable": "Habilita o deshabilita el formateador predeterminado de TypeScript.",
			"javascript.format.enable": "Habilita o deshabilita el formateador predeterminado de JavaScript.",
			"format.insertSpaceAfterCommaDelimiter": "Define el tratamiento del espacio después de un delimitador de coma.",
			"format.insertSpaceAfterConstructor": "Define el tratamiento de los espacios después de la palabra clave de constructor.",
			"format.insertSpaceAfterSemicolonInForStatements": "Define el tratamiento del espacio después de punto y coma en una instrucción for.",
			"format.insertSpaceBeforeAndAfterBinaryOperators": "Define el tratamiento del espacio después de un operador binario.",
			"format.insertSpaceAfterKeywordsInControlFlowStatements": "Define el tratamiento del espacio después de las palabras clave en una instrucción de flujo de control.",
			"format.insertSpaceAfterFunctionKeywordForAnonymousFunctions": "Define el tratamiento del espacio después de la palabra clave function para las funciones anónimas.",
			"format.insertSpaceBeforeFunctionParenthesis": "Define el tratamiento del espacio antes de los paréntesis de argumentos de función.",
			"format.insertSpaceAfterOpeningAndBeforeClosingNonemptyParenthesis": "Define el manejo del espacio después de abrir y antes de cerrar paréntesis no vacíos.",
			"format.insertSpaceAfterOpeningAndBeforeClosingNonemptyBrackets": "Define el manejo del espacio después de abrir y antes de cerrar los soportes no vacíos.",
			"format.insertSpaceAfterOpeningAndBeforeClosingNonemptyBraces": "Define el tratamiento de los espacios después de la llave de apertura y antes de la llave de cierre en instrucciones que no están vacías.",
			"format.insertSpaceAfterOpeningAndBeforeClosingEmptyBraces": "Define el tratamiento de los espacios después de una llave de apertura y antes de una llave de cierre vacías.",
			"format.insertSpaceAfterOpeningAndBeforeClosingTemplateStringBraces": "Define el tratamiento del espacio después de la llave de apertura y antes de la llave de cierre de cadenas de plantilla.",
			"format.insertSpaceAfterOpeningAndBeforeClosingJsxExpressionBraces": "Define el tratamiento del espacio después de la llave de apertura y antes de la llave de cierre de expresiones JSX.",
			"format.insertSpaceAfterTypeAssertion": "Define el tratamiento de los espacios después de las aserciones de tipos en TypeScript.",
			"format.placeOpenBraceOnNewLineForFunctions": "Define si una llave de apertura se incluye en una nueva línea para las funciones o no.",
			"format.placeOpenBraceOnNewLineForControlBlocks": "Define si una llave de apertura se incluye en una nueva línea para los bloques de control o no.",
			"format.semicolons": "Define el control de punto y coma opcional. Requiere el uso de TypeScript 3.7 o posterior en el área de trabajo.",
			"format.semicolons.ignore": "No inserte ni quite los puntos y comas.",
			"format.semicolons.insert": "Inserte punto y coma en los extremos de la instrucción.",
			"format.semicolons.remove": "Elimine los puntos y comas innecesarios.",
			"javascript.validate.enable": "Habilita o deshabilita la validación de JavaScript.",
			"goToProjectConfig.title": "Ir a configuración del proyecto",
			"javascript.referencesCodeLens.enabled": "Habilitar/deshabilitar las referencias de CodeLens en los archivos de JavaScript.",
			"javascript.referencesCodeLens.showOnAllFunctions": "Habilitar o deshabilitar CodeLens de referencias en todas las funciones de los archivos de JavaScript.",
			"typescript.referencesCodeLens.enabled": "Habilita o deshabilita CodeLens de referencias en archivos de TypeScript.",
			"typescript.referencesCodeLens.showOnAllFunctions": "Habilitar/deshabilitar referencias CodeLens en todas las funciones en archivos TypeScript.",
			"typescript.implementationsCodeLens.enabled": "Habilite o deshabilite las implementaciones de CodeLens. Esta instancia de CodeLens muestra los implementadores de una interfaz.",
			"typescript.openTsServerLog.title": "Abrir registro del servidor de TS",
			"typescript.restartTsServer": "Reiniciar servidor TS",
			"typescript.selectTypeScriptVersion.title": "Seleccione la versión de TypeScript...",
			"typescript.reportStyleChecksAsWarnings": "Notifique las comprobaciones de estilo como advertencias.",
			"typescript.npm": "Especifica la ruta de acceso al archivo ejecutable de npm que se usa para la adquisición de tipos automática.",
			"typescript.check.npmIsInstalled": "Compruebe si NPM está instalado para la adquisición automática de tipos.",
			"configuration.suggest.names": "Habilite/deshabilite la inclusión de nombres únicos del archivo en las sugerencias de JavaScript. Tenga en cuenta que las sugerencias de nombre siempre están deshabilitadas en el código JavaScript que se comprueba semánticamente mediante \"@ts-check\" o \"checkJs\".",
			"typescript.tsc.autoDetect": "Controla la detección automática de las tareas TSC.",
			"typescript.tsc.autoDetect.off": "Deshabilite esta característica.",
			"typescript.tsc.autoDetect.on": "Cree tanto tareas de compilación como de inspección.",
			"typescript.tsc.autoDetect.build": "Cree únicamente tareas de compilación de una sola ejecución.",
			"typescript.tsc.autoDetect.watch": "Cree únicamente tareas de compilación y de inspección.",
			"typescript.problemMatchers.tsc.label": "Problemas de TypeScript",
			"typescript.problemMatchers.tscWatch.label": "Problemas de TypeScript (modo de inspección)",
			"configuration.suggest.paths": "Habilite/deshabilite las sugerencias para rutas de acceso en instrucciones de importación y requiera llamadas.",
			"configuration.tsserver.useSeparateSyntaxServer": "Habilite o deshabilite la generación de un servidor TypeScript independiente que pueda responder más rápidamente a las operaciones relacionadas con la sintaxis, como el cálculo de los símbolos de documento de plegado o de proceso. Requiere el uso de TypeScript 3.4.0 o posterior en el área de trabajo.",
			"configuration.tsserver.maxTsServerMemory": "Establezca la cantidad máxima de memoria (en MB) que se asignará al proceso del servidor TypeScript",
			"configuration.tsserver.experimental.enableProjectDiagnostics": "(Experimental) Habilita los informes de errores de todo el proyecto.",
			"typescript.locale": "Establece la configuración regional que se usa para notificar errores de JavaScript y TypeScript. Con el valor predeterminado \"null\", se usa la configuración regional de VS Code.",
			"configuration.implicitProjectConfig.checkJs": "Habilita o deshabilita la comprobación semántica de los archivos de JavaScript. Los archivos \"jsconfig.json\" o \"tsconfig.json\" existentes invalidan esta opción.",
			"configuration.javascript.checkJs.checkJs.deprecation": "Esta configuración está en desuso en favor de \"js/ts.implicitProjectConfig.checkJs\".",
			"configuration.implicitProjectConfig.experimentalDecorators": "Habilite o deshabilite \"experimentalDecorators\" en los archivos de JavaScript que no forman parte de un proyecto. Los archivos \"jsconfig.json\" o \"tsconfig.json\" existentes invalidan esta opción.",
			"configuration.javascript.checkJs.experimentalDecorators.deprecation": "Esta configuración está en desuso en favor de \"js/ts.implicitProjectConfig.experimentalDecorators\".",
			"configuration.implicitProjectConfig.strictNullChecks": "Habilita o deshabilita [las comprobaciones estrictas de elementos nulos.] (https://www.typescriptlang.org/tsconfig#strictNullChecks) en los archivos de JavaScript y TypeScript que no forman parte de un proyecto. Los archivos \"jsconfig.json\" o \"tsconfig.json\" existentes invalidan esta configuración.",
			"configuration.implicitProjectConfig.strictFunctionTypes": "Habilite o deshabilite [los tipos de función estrictos] (https://www.typescriptlang.org/tsconfig#strictFunctionTypes) en los archivos de JavaScript y TypeScript que no forman parte de un proyecto. Los archivos \"jsconfig.json\" o \"tsconfig.json\" existentes invalidan esta configuración.",
			"configuration.suggest.jsdoc.generateReturns": "Habilita o deshabilita la generación de anotaciones \"@return\" para las plantillas de JSDoc. Requiere el uso de TypeScript 4.2 y versiones posteriores en el área de trabajo.",
			"configuration.suggest.autoImports": "Habilita o deshabilita las sugerencias de importación automática.",
			"taskDefinition.tsconfig.description": "Archivo tsconfig que define la compilación de TS.",
			"javascript.suggestionActions.enabled": "Habilita o deshabilita el diagnóstico de sugerencias para los archivos de JavaScript en el editor.",
			"typescript.suggestionActions.enabled": "Habilita o deshabilita el diagnóstico de sugerencias para los archivos de TypeScript en el editor.",
			"typescript.preferences.quoteStyle": "Estilo de comillas preferido para correcciones rápidas: \"single\" (comillas sencillas), \"double\" (comillas dobles) o \"auto\" (inferir automáticamente el tipo de comillas a partir de las importaciones actuales).",
			"typescript.preferences.importModuleSpecifier": "Estilo de ruta de acceso preferido para las importaciones automáticas.",
			"typescript.preferences.importModuleSpecifier.shortest": "Prefiere una importación no relativa solo si hay alguna disponible que tenga menos segmentos de trazado que una importación relativa.",
			"typescript.preferences.importModuleSpecifier.relative": "Prefiere una ruta de acceso relativa a la ubicación del archivo importado.",
			"typescript.preferences.importModuleSpecifier.nonRelative": "Prefiere una importación no relativa basada en los elementos \"baseUrl\" o \"paths\" configurados en \"jsconfig.json\" o \"tsconfig.json\".",
			"typescript.preferences.importModuleSpecifier.projectRelative": "Prefiere una importación no relativa solo si la ruta de acceso de importación relativa dejara el directorio del proyecto o paquete. Requiere el uso de TypeScript 4.2+ en el área de trabajo.",
			"typescript.preferences.importModuleSpecifierEnding": "Finalización de ruta preferida para las importaciones automáticas.",
			"typescript.preferences.importModuleSpecifierEnding.auto": "Utilice la configuración del proyecto para seleccionar un valor predeterminado.",
			"typescript.preferences.importModuleSpecifierEnding.minimal": "Acorte \"./component/index.js\" a \"./component\".",
			"typescript.preferences.importModuleSpecifierEnding.index": "Acorte \"./component/index.js\" a \"./component/index\".",
			"typescript.preferences.importModuleSpecifierEnding.js": "No acorte los finales de ruta; incluyen la extensión \".js\".",
			"typescript.preferences.includePackageJsonAutoImports": "Habilite o deshabilite la búsqueda de dependencias \"package.json\" para las importaciones automáticas disponibles.",
			"typescript.preferences.includePackageJsonAutoImports.auto": "Busque las dependencias en función del impacto estimado en el rendimiento.",
			"typescript.preferences.includePackageJsonAutoImports.on": "Busque siempre las dependencias.",
			"typescript.preferences.includePackageJsonAutoImports.off": "No busque nunca las dependencias.",
			"typescript.updateImportsOnFileMove.enabled": "Habilita o deshabilita la actualización automática de las rutas de acceso de importación al mover un archivo o cambiarle el nombre en VS Code.",
			"typescript.updateImportsOnFileMove.enabled.prompt": "Preguntar cada vez que se cambie de nombre.",
			"typescript.updateImportsOnFileMove.enabled.always": "Actualizar siempre las rutas de acceso automáticamente.",
			"typescript.updateImportsOnFileMove.enabled.never": "No cambiar nunca el nombre de las rutas de acceso y no preguntar.",
			"typescript.autoClosingTags": "Habilita o deshabilita el cierre automático de las etiquetas JSX.",
			"typescript.suggest.enabled": "Sugerencias de Autocomplete habilitadas/deshabilitadas.",
			"configuration.surveys.enabled": "Habilitar/deshabilitar las encuestas ocasionales que nos ayudan a mejorar la compatibilidad de JavaScript y TypeScript en VS Code.",
			"configuration.suggest.completeJSDocs": "Habilitar/deshabilitar sugerencia para completar comentarios JSDoc.",
			"configuration.tsserver.watchOptions": "Configure qué estrategias de observación se deben utilizar para realizar un seguimiento de los archivos y directorios. Requiere el uso de TypeScript 3.8+ en el área de trabajo.",
			"configuration.tsserver.watchOptions.watchFile": "Estrategia de cómo se ven los archivos individuales.",
			"configuration.tsserver.watchOptions.watchFile.fixedPollingInterval": "Compruebe cada archivo en busca de cambios varias veces por segundo en un intervalo fijo.",
			"configuration.tsserver.watchOptions.watchFile.priorityPollingInterval": "Compruebe cada archivo en busca de cambios varias veces por segundo, pero utilice la heurística para comprobar ciertos tipos de archivos con menos frecuencia que otros.",
			"configuration.tsserver.watchOptions.watchFile.dynamicPriorityPolling": "Utilice una cola dinámica en la que los archivos modificados con menos frecuencia se comprueben con menos frecuencia.",
			"configuration.tsserver.watchOptions.watchFile.useFsEvents": "Intente utilizar los eventos nativos del sistema operativo/sistema de archivos para los cambios de archivo.",
			"configuration.tsserver.watchOptions.watchFile.useFsEventsOnParentDirectory": "Intente utilizar los eventos nativos del sistema operativo/sistema de archivos para escuchar los cambios en los directorios que contienen un archivo. Puede utilizar menos observadores de archivos, pero puede ser menos preciso.",
			"configuration.tsserver.watchOptions.watchDirectory": "Estrategia de cómo se observan árboles de directorios completos en sistemas que carecen de funcionalidad recursiva de observación de archivos.",
			"configuration.tsserver.watchOptions.watchDirectory.fixedPollingInterval": "Compruebe cada directorio en busca de cambios varias veces por segundo en un intervalo fijo.",
			"configuration.tsserver.watchOptions.watchDirectory.dynamicPriorityPolling": "Utilice una cola dinámica en la que los directorios modificados con menos frecuencia se comprueben con menos frecuencia.",
			"configuration.tsserver.watchOptions.watchDirectory.useFsEvents": "Intente utilizar los eventos nativos del sistema operativo/sistema de archivos para los cambios de directorio.",
			"configuration.tsserver.watchOptions.fallbackPolling": "Cuando se utilizan eventos del sistema de archivos, esta opción especifica la estrategia de sondeo que se utiliza cuando el sistema se queda sin monitores de archivos nativos o no admite monitores de archivos nativos.",
			"configuration.tsserver.watchOptions.fallbackPolling.fixedPollingInterval": "Compruebe cada archivo en busca de cambios varias veces por segundo en un intervalo fijo.",
			"configuration.tsserver.watchOptions.fallbackPolling.priorityPollingInterval": "Compruebe cada archivo en busca de cambios varias veces por segundo, pero utilice la heurística para comprobar ciertos tipos de archivos con menos frecuencia que otros.",
			"configuration.tsserver.watchOptions.fallbackPolling.dynamicPriorityPolling ": "Utilice una cola dinámica en la que los archivos modificados con menos frecuencia se comprueben con menos frecuencia.",
			"configuration.tsserver.watchOptions.synchronousWatchDirectory": "Deshabilite la observación diferida en directorios. La observación diferida es útil cuando pueden producirse muchos cambios en los archivos a la vez (por ejemplo, un cambio en node_modules de ejecutar npm install), pero es posible que desee deshabilitarla con esta marca para algunas configuraciones menos comunes.",
			"typescript.preferences.renameShorthandProperties.deprecationMessage": "El valor \"typescript.preferences.renameShorthandProperties\" ha quedado en desuso en favor de \"typescript.preferences.useAliasesForRenames\"",
			"typescript.preferences.useAliasesForRenames": "Habilite o deshabilite la introducción de alias para propiedades abreviadas de objetos durante los cambios de nombre. Requiere el uso de TypeScript 3.4 o una versión más reciente en el área de trabajo.",
			"typescript.workspaceSymbols.scope": "Controla los archivos que busca [ir al símbolo en el área de trabajo](https://code.visualstudio.com/docs/editor/editingevolved#_open-symbol-by-name).",
			"typescript.workspaceSymbols.scope.allOpenProjects": "Busque los símbolos en todos los proyectos abiertos de JavaScript o TypeScript. Requiere el uso de TypeScript 3.9 o una versión más reciente en el área de trabajo.",
			"typescript.workspaceSymbols.scope.currentProject": "Busque solo símbolos en el proyecto de JavaScript o TypeScript actual.",
			"codeActions.refactor.extract.constant.title": "Extraer constante",
			"codeActions.refactor.extract.constant.description": "Extraiga la expresión en constante.",
			"codeActions.refactor.extract.function.title": "Extraer función",
			"codeActions.refactor.extract.function.description": "Extraiga la expresión al método o a la función.",
			"codeActions.refactor.extract.type.title": "Extraer tipo",
			"codeActions.refactor.extract.type.description": "Extraer tipo en un alias de tipo.",
			"codeActions.refactor.extract.interface.title": "Extraer interfaz",
			"codeActions.refactor.extract.interface.description": "Extraer el tipo a una interfaz.",
			"codeActions.refactor.rewrite.import.title": "Convertir importación",
			"codeActions.refactor.rewrite.import.description": "Convertir entre importaciones con nombre e importaciones del espacio de nombres.",
			"codeActions.refactor.rewrite.export.title": "Convertir exportación",
			"codeActions.refactor.rewrite.export.description": "Convierta entre la exportación predeterminada y la exportación con nombre.",
			"codeActions.refactor.move.newFile.title": "Mover a un nuevo archivo",
			"codeActions.refactor.move.newFile.description": "Mover la expresión a un nuevo archivo.",
			"codeActions.refactor.rewrite.arrow.braces.title": "Reescribir llaves de flecha",
			"codeActions.refactor.rewrite.arrow.braces.description": "Agregar o quitar llaves en una función de flecha.",
			"codeActions.refactor.rewrite.parameters.toDestructured.title": "Convertir los parámetros en un objeto desestructurado",
			"codeActions.refactor.rewrite.property.generateAccessors.title": "Generar descriptores de acceso",
			"codeActions.refactor.rewrite.property.generateAccessors.description": "Generar los descriptores de acceso \"get\" y \"set\"",
			"codeActions.source.organizeImports.title": "Organizar Importaciones",
			"typescript.findAllFileReferences": "Buscar referencias de archivo"
		},
		"dist/utils/api": {
			"invalidVersion": "versión inválida"
		},
		"dist/utils/tsconfig": {
			"typescript.configureTsconfigQuickPick": "Configurar tsconfig.json",
			"typescript.configureJsconfigQuickPick": "Configurar jsconfig.json",
			"typescript.noTypeScriptProjectConfig": "El archivo no forma parte de un proyecto de TypeScript. Haga clic [aquí]({0}) para obtener más información.",
			"typescript.noJavaScriptProjectConfig": "El archivo no forma parte de un proyecto de JavaScript. Haga clic [aquí]({0}) para obtener más información.",
			"typescript.projectConfigNoWorkspace": "Abra una carpeta en VS Code para usar un proyecto de TypeScript o JavaScript",
			"typescript.projectConfigUnsupportedFile": "No se pudo determinar el proyecto de TypeScript o JavaScript. Tipo de archivo no compatible",
			"typescript.projectConfigCouldNotGetInfo": "No se pudo determinar el proyecto de TypeScript o JavaScript"
		},
		"dist/languageFeatures/codeLens/baseCodeLensProvider": {
			"referenceErrorLabel": "No se pudieron determinar las referencias"
		},
		"dist/languageFeatures/codeLens/implementationsCodeLens": {
			"oneImplementationLabel": "1 implementación",
			"manyImplementationLabel": "{0} implementaciones"
		},
		"dist/languageFeatures/codeLens/referencesCodeLens": {
			"oneReferenceLabel": "1 referencia",
			"manyReferenceLabel": "{0} referencias"
		},
		"dist/languageFeatures/completions": {
			"autoImportLabel": "Importar automáticamente desde {0}",
			"selectCodeAction": "Seleccione acción de código para aplicar",
			"acquiringTypingsLabel": "Adquiriendo typings...",
			"acquiringTypingsDetail": "Adquiriendo definiciones de typings para IntelliSense."
		},
		"dist/languageFeatures/directiveCommentCompletions": {
			"ts-check": "Habilita la verificación semántica en un archivo de JavaScript. Debe estar al principio del archivo.",
			"ts-nocheck": "Deshabilita la verificación semántica en un archivo de JavaScript. Debe estar al principio del archivo.",
			"ts-ignore": "Suprime los errores @ts-check en la siguiente línea de un archivo. ",
			"ts-expect-error": "Suprime los errores de @ts-check en la siguiente línea de un archivo, esperando que al menos exista uno."
		},
		"dist/languageFeatures/fileReferences": {
			"error.unsupportedVersion": "Error al buscar referencias de archivo. Se requiere TypeScript 4.2 o versiones posteriores.",
			"error.noResource": "Error al buscar referencias de archivo. No se ha proporcionado ningún recurso.",
			"error.unsupportedLanguage": "Error al buscar referencias de archivo. Tipo de archivo no compatible.",
			"error.unknownFile": "Error al buscar referencias de archivo. Tipo de archivo desconocido.",
			"progress.title": "Buscando referencias de archivo"
		},
		"dist/languageFeatures/fixAll": {
			"autoFix.label": "Corregir todo",
			"autoFix.unused.label": "Quitar todo el código sin utilizar",
			"autoFix.missingImports.label": "Agregar todas las importaciones que faltan"
		},
		"dist/languageFeatures/jsDocCompletions": {
			"typescript.jsDocCompletionItem.documentation": "Comentario de JSDoc"
		},
		"dist/languageFeatures/organizeImports": {
			"organizeImportsAction.title": "Organizar Importaciones"
		},
		"dist/languageFeatures/quickFix": {
			"fixAllInFileLabel": "{0} (Corregir todo en el archivo)"
		},
		"dist/languageFeatures/refactor": {
			"refactoringFailed": "No se pudo aplicar la refactorización",
			"extractConstant.disabled.title": "Extraer a una constante",
			"extractConstant.disabled.reason": "No se puede extraer la selección actual",
			"extractFunction.disabled.title": "Extraer a una función",
			"extractFunction.disabled.reason": "No se puede extraer la selección actual",
			"refactor.documentation.title": "Más información sobre las refactorizaciones JS/TS"
		},
		"dist/languageFeatures/rename": {
			"fileRenameFail": "Error al cambiar el nombre del archivo"
		},
		"dist/tsServer/versionStatus": {
			"projectQuickPick.placeholder": "Información del proyecto de TypeScript",
			"projectQuickPick.version.label": "Seleccione la versión de TypeScript...",
			"projectQuickPick.version.description": "[actual = {0}]",
			"projectQuickPick.project.create": "Crear tsconfig",
			"projectQuickPick.project.create.description": "Este archivo no forma parte actualmente de un proyecto tsconfig/jsconfig",
			"projectQuickPick.version.goProjectConfig": "Abrir tsconfig",
			"projectQuickPick.help": "Ayuda de TypeScript",
			"projectInfo.name": "TypeScript: Información del proyecto"
		},
		"dist/typescriptServiceClient": {
			"noServerFound": "La ruta de acceso {0} no apunta a una instalación válida de tsserver. Se usará la versión de TypeScript del paquete.",
			"serverExitedWithError": "El servidor de lenguaje TypeScript terminó con error. Mensaje de error: {0}",
			"typescript.openTsServerLog.loggingNotEnabled": "Los registros del servidor TS están desconectados. Establezca \"typescript.tsserver.log\" y reinicie el servidor TS para activar los registros.",
			"typescript.openTsServerLog.enableAndReloadOption": "Habilite el registro y reinicie el servidor TS",
			"typescript.openTsServerLog.noLogFile": "El servidor de TS no ha iniciado el registro.",
			"openTsServerLog.openFileFailedFailed": "No se puede abrir el archivo de registro del servidor de TS",
			"serverDiedReportIssue": "Notificar problema",
			"serverDiedAfterStart": "El servicio de lenguaje TypeScript finalizó de forma inesperada cinco veces después de haberse iniciado y no se reiniciará.",
			"serverDied": "El servicio de lenguaje Typescript finalizó de forma inesperada cinco veces en los últimos cinco minutos.",
			"serverDiedOnce": "El servicio de lenguaje TypeScript se cerró inesperadamente.",
			"serverLoading.progress": "Inicialización de características del lenguaje JS/TS"
		},
		"dist/tsServer/versionManager": {
			"selectTsVersion": "Seleccionar la versión de TypeScript usada para las características del lenguaje de JavaScript y TypeScript",
			"useVSCodeVersionOption": "Utilizar la versión de VS Code",
			"useWorkspaceVersionOption": "Usar versión del área de trabajo",
			"allow": "Permitir",
			"dismiss": "Descartar",
			"suppress prompt": "Nunca en esta área de trabajo",
			"promptUseWorkspaceTsdk": "Esta área de trabajo contiene una versión de TypeScript. ¿Quiere usar la versión de TypeScript del área de trabajo para las características de lenguaje TypeScript y JavaScript?",
			"learnMore": "Más información sobre cómo administrar versiones de TypeScript"
		},
		"dist/utils/logger": {
			"channelName": "TypeScript"
		},
		"dist/utils/typingsStatus": {
			"installingPackages": "Recuperando cambios en los datos para un mejor rendimiento de TypeScript IntelliSense",
			"typesInstallerInitializationFailed.doNotCheckAgain": "No mostrar de nuevo",
			"typesInstallerInitializationFailed.title": "No se pudieron instalar archivos de términos para las características de lenguaje de JavaScript. Asegúrese de que NPM está instalado o configure \"typescript.npm\" en la configuración de usuario. Haga clic [aquí]({0}) para obtener más información."
		},
		"dist/utils/largeProjectStatus": {
			"statusExclude": "TypeScript: configurar Excludes",
			"hintExclude": "Para habilitar las características de lenguaje de JavaScript/TypeScript en todo el proyecto, excluya las carpetas con muchos archivos, como: {0}",
			"hintExclude.generic": "Para habilitar las características de idioma de JavaScript/TypeScript IntelliSense en todo el proyecto, excluya las carpetas de tamaño grande con archivos de origen en los que no trabaje.",
			"large.label": "Configurar exclusiones",
			"hintExclude.tooltip": "Para habilitar las características de idioma de JavaScript/TypeScript IntelliSense en todo el proyecto, excluya las carpetas de tamaño grande con archivos de origen en los que no trabaje."
		},
		"dist/languageFeatures/updatePathsOnRename": {
			"renameProgress.title": "Comprobación de actualización de importaciones de JS/TS",
			"prompt": "¿Actualizar las importaciones para \"{0}\"?",
			"promptMoreThanOne": "¿Actualizar importaciones para los siguientes {0} archivos?",
			"reject.title": "No",
			"accept.title": "Sí",
			"always.title": "Actualizar siempre las importaciones automáticamente",
			"never.title": "No actualizar nunca las importaciones automáticamente",
			"moreFile": "...1 archivo más que no se muestra",
			"moreFiles": "...{0} archivos más que no se muestran"
		},
		"dist/tsServer/serverProcess.electron": {
			"noServerFound": "La ruta de acceso {0} no apunta a una instalación válida de tsserver. Se usará la versión de TypeScript del paquete."
		},
		"dist/task/taskProvider": {
			"badTsConfig": "La tarea Typescript en tasks.json contiene \"\\\\\". Las tareas de Typescript tsconfig deben usar \"/\"",
			"buildTscLabel": "compilación: {0}",
			"buildAndWatchTscLabel": "inspección: {0}"
		}
	}
}