{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Continue to GitHub": "Continuar en GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Continuar con GitHub para crear un token de acceso personal (PAT)",
			"Copy & Continue to GitHub": "Copiar y continuar en GitHub",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "El URI del servidor de GitHub Enterprise no es un URI válido: {0}",
			"Having trouble logging in? Would you like to try a different way? ({0})": "¿Tiene problemas para iniciar sesión? ¿Desea probar de otra forma? ({0})",
			"No": "No",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Abra [{0}]({0}) en una pestaña nueva y pegue el código de un solo uso: {1}",
			"Sign in failed: {0}": "Error de inicio de sesión: {0}",
			"Sign out failed: {0}": "Error al cerrar sesión: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Iniciando sesión en {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Para finalizar la autenticación, vaya a GitHub y pegue el código de un solo uso anterior.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Para finalizar la autenticación, vaya a GitHub para crear un PAT y pegue el PAT en el cuadro de entrada.",
			"Yes": "Sí",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Aún no ha terminado de autorizar esta extensión para usar GitHub. ¿Desea probar de otra forma? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Su código: {0}",
			"device code": "código del dispositivo",
			"local server": "servidor local",
			"personal access token": "token de acceso personal",
			"url handler": "Controlador de URL"
		},
		"package": {
			"description": "Proveedor de autenticación de GitHub",
			"displayName": "Autenticación de GitHub"
		}
	}
}