{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"(Current Change)": "(Cambio actual)",
			"(Incoming Change)": "(Cambio entrante)",
			"Accept Both Changes": "Aceptar ambos cambios",
			"Accept Current Change": "Aceptar cambio actual",
			"Accept Incoming Change": "Aceptar cambio entrante",
			"Compare Changes": "Comparar cambios",
			"Editor cursor is not within a merge conflict": "El cursor de edición no se encuentra en un conflicto de fusión",
			"Editor cursor is within the common ancestors block, please move it to either the \"current\" or \"incoming\" block": "El cursor del editor está dentro del bloque de ancestros comunes, por favor muévalo al bloque \"actual\" o al \"entrante\"",
			"Editor cursor is within the merge conflict splitter, please move it to either the \"current\" or \"incoming\" block": "El cursor del editor está dentro del separador de conflictos de fusión, muévalo al bloque \"actual\" o al \"entrante\" ",
			"No merge conflicts found in this file": "No se encontraron conflictos en este archivo",
			"No other merge conflicts within this file": "No hay más conflictos en este archivo",
			"{0}: Current Changes ↔ Incoming Changes": "{0}: Cambios actuales ↔ Cambios entrantes"
		},
		"package": {
			"command.accept.all-both": "Aceptar ambos",
			"command.accept.all-current": "Aceptar todo actual",
			"command.accept.all-incoming": "Aceptar todos los entrantes",
			"command.accept.both": "Aceptar ambos",
			"command.accept.current": "Aceptar actuales",
			"command.accept.incoming": "Aceptar entrantes",
			"command.accept.selection": "Aceptar selección",
			"command.category": "Fusionar conflicto",
			"command.compare": "Comparar conflicto actual",
			"command.next": "Siguiente conflicto",
			"command.previous": "Conflicto anterior",
			"config.autoNavigateNextConflictEnabled": "Indica si, después de resolver un conflicto de fusión mediante combinación, se va automáticamente al siguiente conflicto de este tipo.",
			"config.codeLensEnabled": "Cree CodeLens para los bloques de conflictos de fusión mediante combinación en el editor.",
			"config.decoratorsEnabled": "Cree elementos Decorator para los bloques de conflictos de fusión mediante combinación en el editor.",
			"config.diffViewPosition": "Controla dónde se debe abrir la vista de diferencias al comparar los cambios en los conflictos de combinación.",
			"config.diffViewPosition.below": "Abra la vista de diferencias debajo del grupo de editor actual.",
			"config.diffViewPosition.beside": "Abra la vista de diferencias junto al grupo de editor actual.",
			"config.diffViewPosition.current": "Abra la vista de diferencias en el grupo de editor actual.",
			"config.title": "Fusionar conflicto",
			"description": "Resaltado y comandos para conflictos de fusión insertada.",
			"displayName": "Fusionar conflicto"
		}
	}
}