{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"sql.messagesDefaultOpen": "True pour ouvrir le volet de messages par défaut; false pour le fermer",
	"sql.saveAsCsv.includeHeaders": "[Facultatif] Lorsque la valeur est true, les en-têtes de colonnes sont inclus lors de l’enregistrement des résultats en CSV",
	"sql.saveAsCsv.delimiter": "[Facultatif] Délimiteur personnalisé à utiliser entre les valeurs durant l'enregistrement au format CSV",
	"sql.saveAsCsv.lineSeperator": "[Facultatif] Caractère(s) utilisé(s) pour séparer les lignes durant l’enregistrement des résultats au format CSV",
	"sql.saveAsCsv.textIdentifier": "[Facultatif] Caractère utilisé pour entourer les champs de texte durant l'enregistrement des résultats au format CSV",
	"sql.saveAsCsv.encoding": "[Facultatif] Encodage de fichier utilisé durant l'enregistrement des résultats au format CSV",
	"sql.results.streaming": "Activer le streaming des résultats, contient quelques problèmes visuels mineurs",
	"sql.saveAsXml.formatted": "[Facultatif] Quand la valeur est true, la sortie XML est mise en forme pendant l'enregistrement des résultats au format XML",
	"sql.saveAsXml.encoding": "[Facultatif] Encodage de fichier utilisé lors de l'enregistrement des résultats au format XML",
	"sql.copyIncludeHeaders": "[Facultatif] Options de configuration pour la copie des résultats à partir de la Vue Résultats",
	"sql.copyRemoveNewLine": "[Facultatif] Options de configuration pour la copie de résultats multi-lignes depuis la vue Résultats",
	"sql.showBatchTime": "[Facultatif] Le temps d’exécution doit-il être indiqué pour chaque lot",
	"defaultChartType": "[Optionnel] le type de graphique par défaut à utiliser lors de l’ouverture de la visionneuse graphique à partir d’un résultat de requête",
	"tabColorMode.off": "La coloration des onglets sera désactivée",
	"tabColorMode.border": "La bordure supérieure de chaque onglet Éditeur sera colorée pour correspondre au groupe concerné",
	"tabColorMode.fill": "La couleur de fond de chaque onglet d'édition correspondra au groupe de serveurs concerné",
	"tabColorMode": "Contrôle comment coloriser les onglets en fonction du groupe de serveurs de leur connexion active",
	"showConnectionInfoInTitle": "Contrôle s'il faut montrer les informations de connexion d'un onglet dans le titre.",
	"sql.promptToSaveGeneratedFiles": "Inviter à enregistrer les fichiers SQL générés",
	"mssql.intelliSense.enableIntelliSense": "L'IntelliSense doit-il être activé",
	"mssql.intelliSense.enableErrorChecking": "La vérification des erreurs à travers IntelliSense doit-elle être activée",
	"mssql.intelliSense.enableSuggestions": "Spécifie si les suggestions IntelliSense doivent être activées",
	"mssql.intelliSense.enableQuickInfo": "Spécifie si les infos rapides IntelliSense doivent être activées",
	"mssql.intelliSense.lowerCaseSuggestions": "Spécifie si les suggestions IntelliSense doivent être en minuscules",
	"queryShortcutDescription": "Défini le raccourci clavier workbench.action.query.shortcut{0} pour exécuter le texte de raccourci comme un appel de procédure. Tout texte sélectionné dans l’éditeur de requête sera passé en paramètre"
}