{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"sql.messagesDefaultOpen": "\"Ja\", um den Nachrichtenbereich standardmäßig zu öffnen; \"nein\" wenn nicht",
	"sql.saveAsCsv.includeHeaders": "[Optional] Bei \"Ja\" werden die Spaltenüberschriften beim Speichern der Ergebnisse als CSV mit ausgegeben",
	"sql.saveAsCsv.delimiter": "[Optional] Das zu verwendende benutzerdefinierte Trennzeichen zwischen Werten beim Speichern als CSV",
	"sql.saveAsCsv.lineSeperator": "[Optional] Zeichen, die zur Trennung der Zeilen verwendet werden, wenn die Ergebnisse im CSV-Format gespeichert werden",
	"sql.saveAsCsv.textIdentifier": "[Optional] Zeichen, das für das Umschließen von Textfeldern verwendet wird, wenn die Ergebnisse im CSV-Format gespeichert werden.",
	"sql.saveAsCsv.encoding": "[Optional] Verwendete Codierung, wenn die Ergebnisse als CSV-Datei gespeichert werden",
	"sql.results.streaming": "Streamen der Ergebnisse aktivieren; weist einige geringfügige Darstellungsprobleme auf",
	"sql.saveAsXml.formatted": "[Optional] Wenn \"true\", wird die XML-Ausgabe formatiert, wenn die Ergebnisse im XML-Format gespeichert werden.",
	"sql.saveAsXml.encoding": "[Optional] Verwendete Dateicodierung, wenn Ergebnisse im XML-Format gespeichert werden",
	"sql.copyIncludeHeaders": "[Optional] Konfigurations-Optionen für das Kopieren von Ergebnissen aus der Ergebnisansicht",
	"sql.copyRemoveNewLine": "[Optional] Konfigurationsoptionen zum Kopieren mehrzeiliger Ergebnisse aus der Ergebnisansicht.",
	"sql.showBatchTime": "[Optional] Soll die Ausführungszeit für einzelne Aufrufe angezeigt werden",
	"defaultChartType": "[Optional] Standard-Diagrammtyp, wenn Chart Viewer für ein Abfrageergebnis geöffnet wird",
	"tabColorMode.off": "Einfärbung der Registerkarten wird deaktiviert",
	"tabColorMode.border": "Der obere Rand jedes Registerkarten Editor Reiters wird entsprechend der jeweiligen Server-Gruppe eingefärbt.",
	"tabColorMode.fill": "Die Hintergrundfarbe der Editor-Registerkarten entspricht der jeweiligen Servergruppe.",
	"tabColorMode": "Steuert die Farbe von Registerkarten anhand der Servergruppe der aktiven Verbindung",
	"showConnectionInfoInTitle": "Legt fest, ob die Verbindungsinformationen für eine Registerkarte im Titel angezeigt werden.",
	"sql.promptToSaveGeneratedFiles": "Aufforderung zum Speichern generierter SQL-Dateien",
	"mssql.intelliSense.enableIntelliSense": "Soll IntelliSense aktiviert werden",
	"mssql.intelliSense.enableErrorChecking": "Soll IntelliSense Fehlerüberprüfung aktiviert werden",
	"mssql.intelliSense.enableSuggestions": "Sollen IntelliSense Vorschläge aktiviert werden",
	"mssql.intelliSense.enableQuickInfo": "Soll IntelliSense Schnell-Info aktiviert werden",
	"mssql.intelliSense.lowerCaseSuggestions": "Sollen IntelliSense Vorschläge in Kleinbuchstaben sein",
	"queryShortcutDescription": "Tastenkürzel workbench.action.query.shortcut{0} festlegen, um den Verknüpfungstext als Prozeduraufruf auszuführen. Beliebiger ausgewählter Text im Abfrage-Editor wird als Parameter übergeben."
}