{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"sql.messagesDefaultOpen": "Verdadeiro para o painel de mensagens ser aberto por padrão; false para fechado",
	"sql.saveAsCsv.includeHeaders": "[Opcional] Quando verdadeiro, os cabeçalhos de coluna são incluídos ao salvar os resultados como CSV",
	"sql.saveAsCsv.delimiter": "[Opcional] Delimitador personalizado para ser usado entre valores ao ser salvo como CSV",
	"sql.saveAsCsv.lineSeperator": "[Opcional] Caractere (s) usado para separar linhas ao salvar os resultados como CSV",
	"sql.saveAsCsv.textIdentifier": "[Opcional] Caractere usado para delimitador de campos de texto ao salvar os resultados como CSV",
	"sql.saveAsCsv.encoding": "[Opcional] Arquivo de codificação usado ao salvar os resultados como CSV",
	"sql.results.streaming": "Habilitar streaming de resultados; contém alguns problemas visuais menores",
	"sql.saveAsXml.formatted": "[Opcional] Quando verdadeiro, a saída XML será formatada ao salvar resultados como XML",
	"sql.saveAsXml.encoding": "[Opcional] Arquivo de codificação usado ao salvar os resultados como XML",
	"sql.copyIncludeHeaders": "[Opcional] Opções de configuração para copiar os resultados da exibição de resultados",
	"sql.copyRemoveNewLine": "[Opcional] Opções de configuração para copiar os resultados de várias linhas do modo de exibição de resultados",
	"sql.showBatchTime": "[Opcional] Tempo de execução deve ser mostrado para lotes individuais",
	"defaultChartType": "[Opcional] o tipo de gráfico padrão para usar ao abrir o visualizador gráfico dos resultados da consulta",
	"tabColorMode.off": "Coloração de guia será desativada",
	"tabColorMode.border": "Borda superior de cada guia editor irá ser colorida para combinar com o grupo de servidor relevantes",
	"tabColorMode.fill": "Cor de fundo de cada editor do guia irá corresponder o grupo relevante no servidor",
	"tabColorMode": "Controla como colorir as abas com base no grupo de servidores de sua conexão ativa",
	"showConnectionInfoInTitle": "Controla se deseja mostrar a informação de conexão para uma guia no título.",
	"sql.promptToSaveGeneratedFiles": "Pedir para salvar arquivos SQL gerados",
	"mssql.intelliSense.enableIntelliSense": "O IntelliSense deve ser habilitado",
	"mssql.intelliSense.enableErrorChecking": "Verificação de erros de IntelliSense devem ser habilitados?",
	"mssql.intelliSense.enableSuggestions": "Sugestões de IntelliSense devem ser habilitados?",
	"mssql.intelliSense.enableQuickInfo": "Devem ser habilitada para IntelliSense informações rápidas",
	"mssql.intelliSense.lowerCaseSuggestions": "IntelliSense sugestões devem ser em letras minúsculas",
	"queryShortcutDescription": "Defina keybinding workbench.action.query.shortcut {0} para executar o texto do atalho como uma chamada de procedimento. Qualquer texto selecionado no editor de consultas será passado como um parâmetro"
}