Repository: microsoft/azuredatastudio
Catalog: resources/xlf/vscode-extensions/agent.*.xlf
Languages: fr, pt_br, ru, zh_hans

# scheduleDialog.newSchedule
source: New Schedule
fr: Nouvelle planification
pt_br: Novo horário
ru: Создание расписания
zh_hans: 新计划

# scheduleDialog.ok
source: OK
ru: ОК
zh_hans: 确定

# scheduleDialog.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# scheduleDialog.scheduleName
source: Schedule Name
fr: Nom de la planification
pt_br: Nome de agenda
ru: Имя расписания
zh_hans: 计划名称

# scheduleDialog.schedules
source: Schedules
fr: Planifications
pt_br: Horários
ru: Расписания
zh_hans: 计划

# createProxy.createProxy
source: Create Proxy
fr: Créer un Proxy
pt_br: Criar proxy
zh_hans: 创建代理服务器

# createProxy.editProxy
source: Edit Proxy
pt_br: Editar proxy
zh_hans: 编辑代理服务器

# createProxy.General
source: General
fr: Général
pt_br: Geral
ru: Общее
zh_hans: 常规

# createProxy.ProxyName
source: Proxy name
pt_br: Nome de proxy
zh_hans: 代理服务器名称

# createProxy.CredentialName
source: Credential name
fr: Nom d'identification
pt_br: Nome da credencial
ru: Имя учетных данных
zh_hans: 凭据名称

# createProxy.Description
source: Description
pt_br: Descrição
ru: Описание
zh_hans: 说明

# createProxy.SubsystemName
source: Subsystem
fr: Sous-système
pt_br: Subsistema
ru: Подсистема
zh_hans: 子系统

# createProxy.OperatingSystem
source: Operating system (CmdExec)
fr: Système d'exploitation (CmdExec)
pt_br: Sistema operacional (CmdExec)
ru: Операционная система (CmdExec)
zh_hans: 操作系统 (CmdExec)

# createProxy.ReplicationSnapshot
source: Replication Snapshot
fr: Instantané de réplication
pt_br: Snapshot de replicação
ru: Репликация: моментальный снимок
zh_hans: 复制快照

# createProxy.ReplicationTransactionLog
source: Replication Transaction-Log Reader
fr: Lecteur du journal des transactions de réplication
pt_br: Leitor de Log de transações de replicação
ru: Репликация: средство чтения журнала транзакций
zh_hans: 复制事务日志读取器

# createProxy.ReplicationDistributor
source: Replication Distributor
fr: Serveur de distribution de réplication
pt_br: Distribuidor de replicação
ru: Репликация: распространитель
zh_hans: 复制分发服务器

# createProxy.ReplicationMerge
source: Replication Merge
fr: Fusion de réplication
pt_br: Replicação de mesclagem
ru: Репликация: слияние
zh_hans: 复制合并

# createProxy.ReplicationQueueReader
source: Replication Queue Reader
fr: Agent de lecture de file d'attente de réplication
pt_br: Leitor de fila de replicação
ru: Репликация: средство просмотра очередей
zh_hans: 复制队列读取器

# createProxy.SSASQueryLabel
source: SQL Server Analysis Services Query
fr: Requête SQL Server Analysis Services
pt_br: Consulta do SQL Server Analysis Services
ru: Запрос служб SQL Server Analysis Services
zh_hans: SQL server 分析服务查询

# createProxy.SSASCommandLabel
source: SQL Server Analysis Services Command
fr: Commande SQL Server Analysis Services
pt_br: Comando do SQL Server Analysis Services
ru: Команда служб SQL Server Analysis Services
zh_hans: SQL server 分析服务命令

# createProxy.SSISPackage
source: SQL Server Integration Services Package
fr: Package SQL Server Integration Services
pt_br: Pacote do SQL Server Integration Services
ru: Пакет служб SQL Server Integration Services
zh_hans: SQL Server 集成服务包

# createProxy.subSystemHeading
source: Active to the following subsytems
pt_br: Ativo para os seguintes subsistemas
zh_hans: 对以下子系统有效

# pickSchedule.jobSchedules
source: Job Schedules
fr: Planifications de travail
pt_br: Planos de trabalho
ru: Расписания заданий
zh_hans: 作业计划

# pickSchedule.ok
source: OK
ru: ОК
zh_hans: 确定

# pickSchedule.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# pickSchedule.scheduleName
source: Schedule Name
fr: Nom de la planification
pt_br: Nome de agenda
ru: Имя расписания
zh_hans: 计划名称

# pickSchedule.schedules
source: Schedules
fr: Planifications
pt_br: Horários
ru: Расписания
zh_hans: 计划

# createOperator.createOperator
source: Create Operator
fr: Créer un opérateur
pt_br: Criar operador
zh_hans: 创建操作符

# createOperator.editOperator
source: Edit Operator
pt_br: Editar o operador
zh_hans: 编辑操作员

# createOperator.General
source: General
fr: Général
pt_br: Geral
ru: Общее
zh_hans: 常规

# createOperator.Notifications
source: Notifications
pt_br: Notificações
ru: Уведомления
zh_hans: 通知

# createOperator.Name
source: Name
fr: Nom
pt_br: Nome
ru: Имя
zh_hans: 名称

# createOperator.Enabled
source: Enabled
fr: Activé
pt_br: Habilitado
ru: Включено
zh_hans: 已启用

# createOperator.EmailName
source: E-mail Name
pt_br: Nome do e-mail
zh_hans: 电子邮件名称

# createOperator.PagerEmailName
source: Pager E-mail Name
fr: Nom d'e-mail du récepteur de radiomessagerie
pt_br: Nome de email do pager
zh_hans: 寻呼机电子邮件名称

# createOperator.PagerMondayCheckBox
source: Monday
fr: Lundi
pt_br: Segunda-feira
ru: понедельник
zh_hans: 星期一

# createOperator.PagerTuesdayCheckBox
source: Tuesday
fr: Mardi
pt_br: Terça-feira
ru: вторник
zh_hans: 星期二

# createOperator.PagerWednesdayCheckBox
source: Wednesday
fr: Mercredi
pt_br: Quarta-feira
ru: среда
zh_hans: 星期三

# createOperator.PagerThursdayCheckBox
source: Thursday
fr: Jeudi
pt_br: Quinta-feira
ru: четверг
zh_hans: 星期四

# createOperator.PagerFridayCheckBox
source: Friday
pt_br: Sexta-feira
zh_hans: 星期五

# createOperator.PagerSaturdayCheckBox
source: Saturday
fr: Samedi
pt_br: Sábado
ru: суббота
zh_hans: 星期六

# createOperator.PagerSundayCheckBox
source: Sunday
fr: Dimanche
pt_br: Domingo
ru: воскресенье
zh_hans: 星期天

# createOperator.workdayBegin
source: Workday begin
fr: Début de journée
pt_br: Começar a jornada de trabalho
ru: Начало рабочего дня
zh_hans: 工作日开始

# createOperator.workdayEnd
source: Workday end
fr: Fin de journée
pt_br: Final do dia útil
ru: Конец рабочего дня
zh_hans: 工作日结束

# createOperator.PagerDutySchedule
source: Pager on duty schdule
pt_br: Pager no horário de trabalho
zh_hans: 值班 schdule 的寻呼机

# createOperator.AlertListHeading
source: Alert list
pt_br: Lista de alerta
zh_hans: 警报列表

# createOperator.AlertNameColumnLabel
source: Alert name
fr: Nom de l'alerte
pt_br: Nome do alerta
ru: Имя предупреждения
zh_hans: 警报名称

# createOperator.AlertEmailColumnLabel
source: E-mail
fr: Messagerie électronique
ru: Электронная почта
zh_hans: 电子邮件

# createOperator.AlertPagerColumnLabel
source: Pager
fr: Radiomessagerie
ru: Пейджер
zh_hans: 分页

# jobStepDialog.newJobStep
source: New Job Step
fr: Nouvelle étape du travail
pt_br: Nova etapa de trabalho
ru: Создание шага задания
zh_hans: 新建作业步骤

# jobStepDialog.fileBrowserTitle
source: Locate Database Files -
fr: Localiser les fichiers de base de données -
pt_br: Localizar arquivos de banco de dados -
zh_hans: 定位数据库文件-

# jobStepDialog.ok
source: OK
ru: ОК
zh_hans: 确定

# jobStepDialog.cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# jobStepDialog.general
source: General
fr: Général
pt_br: Geral
ru: Общее
zh_hans: 常规

# jobStepDialog.advanced
source: Advanced
fr: Avancé
pt_br: Avançado
ru: Дополнительный
zh_hans: 高级

# jobStepDialog.open
source: Open...
fr: Ouvrir...
pt_br: Abrir...
zh_hans: 打开...

# jobStepDialog.parse
source: Parse
fr: Analyser
pt_br: Analisar
ru: Синтаксический анализ
zh_hans: 分析

# jobStepDialog.next
source: Next
fr: Suivant
pt_br: Próximo
ru: Далее
zh_hans: 下一个

# jobStepDialog.previous
source: Previous
fr: Précédent
pt_br: Anterior
ru: Назад
zh_hans: 上一个

# jobStepDialog.successParse
source: The command was successfully parsed.
fr: La commande a été analysée correctement.
pt_br: Comando analisado com sucesso.
ru: Синтаксический анализ команды успешно завершен.
zh_hans: 该命令已成功解析。

# jobStepDialog.failParse
source: The command failed.
fr: La commande a échoué.
pt_br: Comando falhou.
zh_hans: 命令失败。

# jobStepDialog.blankStepName
source: The step name cannot be left blank
fr: Le nom de l’étape ne peut être vide
pt_br: O nome do passo não pode ser deixado em branco
zh_hans: 步骤名称不能留空

# jobStepDialog.stepNameLabel
source: Step Name
fr: Nom de l'étape
pt_br: Nome da etapa
ru: Имя шага
zh_hans: 步骤名称

# jobStepDialog.typeLabel
source: Type
pt_br: Tipo
ru: Тип
zh_hans: 类型

# jobStepDialog.runAsLabel
source: Run as
fr: Exécuter en tant que
pt_br: Executar como
zh_hans: 运行为

# jobStepDialog.databaseLabel
source: Database
fr: Base de données
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库

# jobStepDialog.commandLabel
source: Command
fr: Commande
pt_br: Comando
ru: Команда
zh_hans: 命令

# jobStepDialog.successAction
source: On success action
pt_br: Ação em caso de sucesso
zh_hans: 关于成功行动

# jobStepDialog.failureAction
source: On failure action
fr: Action en cas d’échec
pt_br: Falha na ação
zh_hans: 失败操作时

# jobStepDialog.runAsUser
source: Run as user
fr: Exécuter en tant qu’utilisateur
pt_br: Executar como usuário
zh_hans: 使用用户身份执行

# jobStepDialog.retryAttempts
source: Retry Attempts
fr: Nouvelles tentatives
pt_br: Tentativas de repetição
zh_hans: 重试尝试

# jobStepDialog.retryInterval
source: Retry Interval (minutes)
fr: Intervalle avant nouvelle tentative (minutes)
pt_br: Intervalo (em minutos) de repetição
zh_hans: 重试间隔 (分钟)

# jobStepDialog.logToTable
source: Log to table
pt_br: A tabela de log
zh_hans: 记录到表

# jobStepDialog.appendExistingTableEntry
source: Append output to exisiting entry in table
fr: Ajouter la sortie à l’entrée existante dans la table
pt_br: Acrescentar a saída para entrada existente na tabela
zh_hans: 将输出附加到表中的现有条目

# jobStepDialog.includeStepOutputHistory
source: Include step output in history
pt_br: Incluir a saída da etapa no histórico
zh_hans: 在历史记录中包括步骤输出

# jobStepDialog.outputFile
source: Output File
fr: Fichier de sortie
pt_br: Arquivo de Saída
ru: Выходной файл
zh_hans: 输出文件

# jobStepDialog.appendOutputToFile
source: Append output to existing file
pt_br: Acrescentar a saída em um arquivo existente
zh_hans: 将输出追加到现有文件中

# jobStepDialog.selectedPath
source: Selected path
fr: Chemin sélectionné
pt_br: Caminho selecionado
zh_hans: 选定的路径

# jobStepDialog.filesOfType
source: Files of type
fr: Fichiers de type
pt_br: Tipo de Arquivos
ru: Файлы данного типа
zh_hans: 文件类型

# jobStepDialog.fileName
source: File name
fr: Nom de fichier
pt_br: Nome do Arquivo
ru: Имя файла
zh_hans: 文件名

# jobStepDialog.allFiles
source: All Files (*)
fr: Tous les fichiers (*)
pt_br: Todos os arquivos (*)
zh_hans: 所有文件 (*)

# jobStepDialog.TSQL
source: Transact-SQL script (T-SQL)
fr: Script Transact-SQL (T-SQL)
pt_br: Script Transact-SQL (T-SQL)
ru: Скрипт Transact-SQL (T-SQL)
zh_hans: Transact-SQL 脚本 (T-SQL)

# jobStepDialog.agentServiceAccount
source: SQL Server Agent Service Account
fr: Compte de service SQL Server Agent
pt_br: Conta de Serviço SQL Server Agent
ru: Учетная запись службы агент SQL Server""""
zh_hans: SQL server 代理服务帐户

# jobStepDialog.nextStep
source: Go to the next step
fr: Passer à l'étape suivante
pt_br: Avançar para o próximo passo
ru: Перейти к следующему шагу
zh_hans: 转到下一步骤

# jobStepDialog.quitJobSuccess
source: Quit the job reporting success
fr: Quitter le travail signalant la réussite
pt_br: Encerrar o trabalho reportando sucesso
ru: Завершить задание с успехом
zh_hans: 退出工作报告成功

# jobStepDialog.quitJobFailure
source: Quit the job reporting failure
fr: Quitter le travail signalant l'échec
pt_br: Deixar o trabalho relatando a falha
ru: Завершить задание с ошибкой
zh_hans: 离开作业调度报告时发生错误。

# jobDialog.general
source: General
fr: Général
pt_br: Geral
ru: Общее
zh_hans: 常规

# jobDialog.steps
source: Steps
fr: Étapes
pt_br: Passos
ru: Шаги
zh_hans: 步骤

# jobDialog.schedules
source: Schedules
fr: Planifications
pt_br: Horários
ru: Расписания
zh_hans: 计划

# jobDialog.alerts
source: Alerts
fr: Alertes
pt_br: Alertas
ru: Предупреждения
zh_hans: 警报

# jobDialog.notifications
source: Notifications
pt_br: Notificações
ru: Уведомления
zh_hans: 通知

# jobDialog.blankJobNameError
source: The name of the job cannot be blank.
fr: Le nom du travail ne peut pas être vide.
pt_br: O nome do trabalho não pode ser em branco.
ru: Имя задания не может быть пустым.
zh_hans: 作业名称不能为空。

# jobDialog.name
source: Name
fr: Nom
pt_br: Nome
ru: Имя
zh_hans: 名称

# jobDialog.owner
source: Owner
fr: Propriétaire
pt_br: Proprietário
ru: Владелец
zh_hans: 所有者

# jobDialog.category
source: Category
fr: Catégorie
pt_br: Categoria
ru: Категория
zh_hans: 类别

# jobDialog.description
source: Description
pt_br: Descrição
ru: Описание
zh_hans: 说明

# jobDialog.enabled
source: Enabled
fr: Activé
pt_br: Habilitado
ru: Включено
zh_hans: 已启用

# jobDialog.jobStepList
source: Job step list
fr: Liste des étapes du travail
pt_br: Lista de passos do job
zh_hans: 作业步骤列表

# jobDialog.step
source: Step
fr: Étape
pt_br: Etapa
ru: Шаг
zh_hans: 步骤

# jobDialog.type
source: Type
pt_br: Tipo
ru: Тип
zh_hans: 类型

# jobDialog.onSuccess
source: On Success
fr: En cas de succès
pt_br: No sucesso
ru: При успешном завершении
zh_hans: 在成功时

# jobDialog.onFailure
source: On Failure
fr: En cas d'échec
pt_br: Em caso de falha
ru: При сбое
zh_hans: 失败时

# jobDialog.new
source: New...
fr: Nouveau...
pt_br: Novo...
ru: Новые функции...
zh_hans: 新建...

# jobDialog.edit
source: Edit
fr: Modifier
pt_br: Editar
ru: Изменить
zh_hans: 编辑

# jobDialog.delete
source: Delete
fr: supprimer
pt_br: Excluir
ru: Удалить
zh_hans: 删除

# jobDialog.moveUp
source: Move Step Up
pt_br: Mover o passo acima
zh_hans: 向上移动

# jobDialog.moveDown
source: Move Step Up
pt_br: Mover o passo acima
zh_hans: 向上移动

# jobDialog.notificationsTabTop
source: Actions to perform when the job completes
pt_br: Ações a executar quando o trabalho for concluído
zh_hans: 作业完成时要执行的操作

# jobDialog.email
source: Email
zh_hans: 电子邮件

# jobDialog.page
source: Page
pt_br: Página
zh_hans: 页

# jobDialog.eventLogCheckBoxLabel
source: Write to the Windows Application event log
pt_br: Escrever no log de eventos de aplicações do Windows
zh_hans: 写入 Windows 应用程序事件日志

# jobDialog.deleteJobLabel
source: Automatically delete job
pt_br: Excluir automaticamente o job.
zh_hans: 自动删除作业

# jobDialog.schedulesaLabel
source: Schedules list
pt_br: Lista de Schedules
zh_hans: 计划列表

# jobDialog.pickSchedule
source: Pick Schedule
fr: Choisir une planification
pt_br: Escolha o horário
ru: Выбор расписания
zh_hans: 挑选时间表

# jobDialog.scheduleNameLabel
source: Schedule Name
fr: Nom de la planification
pt_br: Nome de agenda
ru: Имя расписания
zh_hans: 计划名称

# jobDialog.alertsList
source: Alerts list
fr: Liste des alertes
pt_br: Lista de alertas
zh_hans: 通知列表

# jobDialog.newAlert
source: New Alert
fr: Nouvelle alerte
pt_br: Novo alerta
ru: Создание предупреждения
zh_hans: 新警报

# jobDialog.alertNameLabel
source: Alert Name
fr: Nom de l'alerte
pt_br: Nome do alerta
ru: Имя предупреждения
zh_hans: 警报名称

# jobDialog.newJob
source: New Job
fr: Nouveau travail
pt_br: Novo job
ru: Создание задания
zh_hans: 新作业

# jobDialog.editJob
source: Edit Job
pt_br: Editar job
zh_hans: 编辑作业

# alertDialog.createAlert
source: Create Alert
fr: Créer une alerte
pt_br: Criar alerta
zh_hans: 创建警报

# alertDialog.editAlert
source: Edit Alert
pt_br: Editar alerta
zh_hans: 编辑警报

# alertDialog.General
source: General
fr: Général
pt_br: Geral
ru: Общее
zh_hans: 常规

# alertDialog.Response
source: Response
fr: Réponse
pt_br: Resposta
ru: Ответ
zh_hans: 响应

# alertDialog.Options
source: Options
pt_br: Opções
ru: Параметры
zh_hans: 选项

# alertDialog.eventAlert
source: Event alert definition
fr: Définition d'une alerte d'événement
pt_br: Definição de alerta de eventos
ru: Определение предупреждения о событии
zh_hans: 事件警报定义

# alertDialog.Name
source: Name
fr: Nom
pt_br: Nome
ru: Имя
zh_hans: 名称

# alertDialog.Type
source: Type
pt_br: Tipo
ru: Тип
zh_hans: 类型

# alertDialog.Enabled
source: Enabled
fr: Activé
pt_br: Habilitado
ru: Включено
zh_hans: 已启用

# alertDialog.DatabaseName
source: Database name
fr: Nom de la base de données
pt_br: Nome do banco de dados
ru: Имя базы данных
zh_hans: 数据库名称

# alertDialog.ErrorNumber
source: Error number
fr: Numéro d'erreur
pt_br: Número do erro
ru: Номер ошибки
zh_hans: 错误号

# alertDialog.Severity
source: Severity
fr: Gravité
pt_br: Gravidade
ru: Серьезность
zh_hans: 严重性

# alertDialog.RaiseAlertContains
source: Raise alert when message contains
pt_br: Gerar alerta quando a mensagem contém
zh_hans: 消息包含时引发警报

# alertDialog.MessageText
source: Message text
pt_br: Mensagem de texto
zh_hans: 消息文本

# alertDialog.Severity001
source: 001 - Miscellaneous System Information
fr: 001 - Informations système diverses
pt_br: 001 - Informações Diversas do Sistema
ru: 001 - Различные системные сведения
zh_hans: 001 - 其他系统信息

# alertDialog.Severity002
source: 002 - Reserved
fr: 002 - Réservée
pt_br: 002 - Reservado
ru: 002 - Зарезервировано
zh_hans: 002-预留

# alertDialog.Severity003
source: 003 - Reserved
fr: 003 - Réservée
pt_br: 003 - Reservado
ru: 003 - Зарезервировано
zh_hans: 003-预留

# alertDialog.Severity004
source: 004 - Reserved
fr: 004 - Réservée
pt_br: 004 - Reservado
ru: 004 - Зарезервировано
zh_hans: 004-预留

# alertDialog.Severity005
source: 005 - Reserved
fr: 005 - Réservée
pt_br: 005 - Reservados
ru: 005 - Зарезервировано
zh_hans: 005-预留

# alertDialog.Severity006
source: 006 - Reserved
fr: 006 - Réservée
pt_br: 006 – Reservado
ru: 006 - Зарезервировано
zh_hans: 006-预留

# alertDialog.Severity007
source: 007 - Notification: Status Information
fr: 007 - Notification : information d'état
pt_br: 007 - Notificação: Informações de Status
ru: 007 - Уведомление: сведения о состоянии
zh_hans: 007-通知: 状态信息

# alertDialog.Severity008
source: 008 - Notification: User Intervention Required
fr: 008 - Notification : intervention util. requise
pt_br: 008 - notificação: Necessidade de intervenção de usuário
ru: 008 - Уведомление: требуется вмешательство пользователя
zh_hans: 008-通知: 需要用户干预

# alertDialog.Severity009
source: 009 - User Defined
fr: 009 - Définie par l'utilisateur
pt_br: 009 - Definidos pelo Usuário
ru: 009 - Определяемый пользователем
zh_hans: 009-用户定义的

# alertDialog.Severity010
source: 010 - Information
fr: 010 - Informations
pt_br: 010 - informações
ru: 010 - Сведения
zh_hans: 010-信息

# alertDialog.Severity011
source: 011 - Specified Database Object Not Found
fr: 011 - Objet de BdD spécifié introuvable
pt_br: 011 - objeto de banco de dados especificado não encontrado
ru: 011 - Указанный объект базы данных не найден
zh_hans: 011-未找到指定的数据库对象

# alertDialog.Severity012
source: 012 - Unused
fr: 012 - Inutilisée
pt_br: 012 – Não usado
ru: 012 - Не используется
zh_hans: 012-未使用

# alertDialog.Severity013
source: 013 - User Transaction Syntax Error
fr: 013 - Err. de syntaxe de la transaction util.
pt_br: 013 - Erro de sintaxe de transação do usuário
ru: 013 - Синтаксическая ошибка пользовательской транзакции
zh_hans: 013-用户事务语法错误

# alertDialog.Severity014
source: 014 - Insufficient Permission
fr: 014 - Autorisation insuffisante
pt_br: 014 - Permissão insuficiente
ru: 014 - Недостаточно разрешений
zh_hans: 014-权限不足

# alertDialog.Severity015
source: 015 - Syntax Error in SQL Statements
fr: 015 - Erreur de syntaxe dans des instructions SQL
pt_br: 015 - Erro de sintaxe em instruções SQL
ru: 015 - Синтаксическая ошибка в инструкциях SQL
zh_hans: 015-SQL 语句中的语法错误

# alertDialog.Severity016
source: 016 - Miscellaneous User Error
fr: 016 - Erreur de l'utilisateur
pt_br: 016 - Diversos erros de usuário
ru: 016 - Другая пользовательская ошибка
zh_hans: 016-杂项用户错误

# alertDialog.Severity017
source: 017 - Insufficient Resources
fr: 017 - Ressources insuffisantes
pt_br: 017 - Recursos insuficientes
ru: 017 - Недостаточно ресурсов
zh_hans: 017-资源不足

# alertDialog.Severity018
source: 018 - Nonfatal Internal Error
fr: 018 - Erreur interne récupérable
pt_br: 018 - Erro Interno Não fatal
ru: 018 - Некритичная внутренняя ошибка
zh_hans: 018 - 非致命内部错误

# alertDialog.Severity019
source: 019 - Fatal Error in Resource
fr: 019 - Erreur irrécupérable de ressource
pt_br: 019 - Erro Fatal no Recurso
ru: 019 - Неустранимая ошибка в ресурсе
zh_hans: 019 -资源致命错误

# alertDialog.Severity020
source: 020 - Fatal Error in Current Process
fr: 020 - Erreur irrécupérable du traitement en cours
pt_br: 020 - Erro fatal no processo atual
ru: 020 - Неустранимая ошибка в текущем процессе
zh_hans: 020-当前过程中的致命错误

# alertDialog.Severity021
source: 021 - Fatal Error in Database Processes
fr: 021 - Erreur irrécupérable dans les traitements de base de données
pt_br: 021 - Erro Fatal no banco de dados de processos
ru: 021 - Неустранимая ошибка в процессах базы данных
zh_hans: 021-数据库进程中的致命错误

# alertDialog.Severity022
source: 022 - Fatal Error: Table Integrity Suspect
fr: 022 - Err. fatale : intégrité douteuse de la table
pt_br: 022 - Erro Fatal: Integridade da Tabela Suspeita
ru: 022 - Неустранимая ошибка: возможно повреждение целостности таблицы
zh_hans: 022-致命错误: 表完整性可疑

# alertDialog.Severity023
source: 023 - Fatal Error: Database Integrity Suspect
fr: 023 - Err. fatale : intégrité douteuse de la BdD
pt_br: 023 - Erro Fatal: Integridade do Banco de Dados Suspeita
ru: 023 - Неустранимая ошибка: возможно повреждение целостности базы данных
zh_hans: 023-致命错误: 数据库完整性不可靠

# alertDialog.Severity024
source: 024 - Fatal Error: Hardware Error
fr: 024 - Erreur fatale : erreur matérielle
pt_br: 024 - Erro Fatal: Erro de Hardware
ru: 024 - Неустранимая ошибка: аппаратная ошибка
zh_hans: 024-致命错误: 硬件错误

# alertDialog.Severity025
source: 025 - Fatal Error
fr: 025 - Erreur fatale
pt_br: 025 - Erro Fatal
ru: 025 - Неустранимая ошибка
zh_hans: 025-致命错误

# alertDialog.AllDatabases
source: <all databases>
zh_hans: ＆lt;所有数据库＆gt;

# alertDialog.ExecuteJob
source: Execute Job
fr: Exécuter le travail
pt_br: Executar o Job
zh_hans: 执行作业

# alertDialog.ExecuteJobName
source: Job Name
fr: Nom du travail
pt_br: Nome da Tarefa
ru: Имя задания
zh_hans: 作业名称

# alertDialog.NotifyOperators
source: Notify Operators
pt_br: Notificar operadores
zh_hans: 通知操作员

# alertDialog.NewJob
source: New Job
fr: Nouveau travail
pt_br: Novo job
ru: Создание задания
zh_hans: 新作业

# alertDialog.OperatorList
source: Operator List
fr: Liste des opérateurs
pt_br: Lista de operador
zh_hans: 操作员列表

# alertDialog.OperatorName
source: Operator
fr: Opérateur
pt_br: Operador
ru: Оператор
zh_hans: 运算符

# alertDialog.OperatorEmail
source: E-mail
fr: Messagerie électronique
ru: Электронная почта
zh_hans: 电子邮件

# alertDialog.OperatorPager
source: Pager
fr: Radiomessagerie
ru: Пейджер
zh_hans: 分页

# alertDialog.NewOperator
source: New Operator
fr: Nouvel opérateur
pt_br: Novo operador
ru: Создание оператора
zh_hans: 新建操作符

# alertDialog.IncludeErrorInEmail
source: Include alert error text in e-mail
pt_br: Incluir texto de erro do alerta no e-mail
zh_hans: 在电子邮件中包含警告错误文本

# alertDialog.IncludeErrorInPager
source: Include alert error text in pager
pt_br: Incluir o texto de alerta de erro no pager
zh_hans: 在寻呼机中包含警报错误文本

# alertDialog.AdditionalNotification
source: Additional notification message to send
pt_br: Mensagem de notificação adicional para enviar
zh_hans: 要发送的其他通知消息

# alertDialog.DelayBetweenResponse
source: Delay between responses
pt_br: Atraso entre respostas
zh_hans: 响应之间的延迟

# alertDialog.DelayMinutes
source: Delay Minutes
fr: Minutes de retard
pt_br: Minutos de atraso
zh_hans: 延迟分钟数

# alertDialog.DelaySeconds
source: Delay Seconds
fr: Secondes de retard
pt_br: Segundos de atraso
zh_hans: 延迟秒数

# agentDialog.OK
source: OK
ru: ОК
zh_hans: 确定

# agentDialog.Cancel
source: Cancel
fr: Annuler
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# jobData.whenJobCompletes
source: When the job completes
fr: Lorsque le travail est terminé
pt_br: Quando o job estiver concluído
ru: При завершении задания
zh_hans: 当作业完成时

# jobData.whenJobFails
source: When the job fails
fr: Lors de l'échec du travail
pt_br: Quando o job falhar.
ru: При ошибке задания
zh_hans: 当作业失败时

# jobData.whenJobSucceeds
source: When the job succeeds
fr: Lors de la réussite du travail
pt_br: Quando o job for bem sucedido
ru: При успешном завершении задания
zh_hans: 当作业成功时

# jobData.jobNameRequired
source: Job name must be provided
fr: Le nom du travail doit être fourni
pt_br: O nome do job deve ser fornecido
zh_hans: 必须提供作业名称
