Repository: microsoft/azuredatastudio
Catalog: resources/xlf/vscode-extensions/agent.*.xlf
Languages: fr, pt_br, ru, zh_hans

# jobData.saveErrorMessage
source: Job update failed '{0}'
pt_br: Falha de atualização do job '{0}'
zh_hans: 作业更新失败 "{0}"

# alertData.saveErrorMessage
source: Alert update failed '{0}'
pt_br: Falha na atualização alerta '{0}'
zh_hans: 警报更新失败 "{0}"

# alertData.DefaultAlertTypString
source: SQL Server event alert
fr: Alerte d'événement SQL Server
pt_br: Alerta de evento do SQL Server
ru: Предупреждение о событии SQL Server
zh_hans: SQL server 事件警报

# alertDialog.PerformanceCondition
source: SQL Server performance condition alert
fr: Alerte de condition de performances SQL Server
pt_br: Alerta de condição de desempenho do SQL Server
ru: Предупреждение о производительности SQL Server
zh_hans: SQL Server 性能状况警报

# alertDialog.WmiEvent
source: WMI event alert
fr: Alerte d'événement WMI
pt_br: Alerta de evento WMI
ru: Предупреждение о событии WMI
zh_hans: WMI 事件警报

# mainController.notImplemented
source: This feature is under development. Check-out the latest insiders build if you'd like to try out the most recent changes!
fr: Cette fonctionnalité est en cours de développement. Testez les dernières builds Insiders si vous souhaitez essayer les changements les plus récents !
pt_br: Este recurso está em desenvolvimento. Verifique se você gostaria de experimentar as últimas alterações liberadas!
zh_hans: 此功能正在开发中。 如果你想尝试最新的改进请签出最新的内部构建体验。
