Repository: microsoft/azuredatastudio
Catalog: resources/xlf/vscode-extensions/big-data-cluster.*.xlf
Languages: it, ko, zh_hans, zh_hant

# bdc-create.summaryPageTitle
source: Summary
it: Riepilogo
ko: 요약
zh_hans: 摘要
zh_hant: 摘要

# bdc-create.TargetClusterTypeText
source: Cluster type
it: Tipo di cluster
ko: 클러스터 유형
zh_hans: 群集类型
zh_hant: 叢集類型

# bdc-create.ClusterContextText
source: Cluster context
it: Contesto del cluster
ko: 클러스터 컨텍스트
zh_hans: 群集上下文
zh_hant: 叢集內容

# bdc-create.ClusterNameText
source: Cluster name
it: Nome del cluster
ko: 클러스터 이름
zh_hans: 群集名称
zh_hant: 叢集名稱

# bdc-create.ClusterAdminUsernameText
source: Cluster Admin username
it: Nome utente dell'amministratore del cluster
ko: 클러스터 관리자 사용자 이름
zh_hans: 群集管理员用户名
zh_hant: 叢集系統管理員使用者名稱

# bdc-create.AcceptEulaText
source: Accept license agreement
it: Accetta il contratto di licenza
ko: 사용권 계약에 동의
zh_hans: 接受许可协议
zh_hant: 接受授權合約

# bdc-create.DeploymentProfileText
source: Deployment profile
it: Profilo di distribuzione
ko: 배포 프로필
zh_hans: 部署配置文件
zh_hant: 部署設定檔

# bdc-create.SqlServerMasterScaleText
source: SQL Server master scale
it: Ridimensionamento master SQL Server
ko: SQL Server 마스터 크기
zh_hans: SQL Server 主服务器规模
zh_hant: SQL Server 主機調整

# bdc-create.ComputePoolScaleText
source: Compute pool scale
it: Ridimensionamento pool di calcolo
ko: 풀 크기 컴퓨팅
zh_hans: 计算池规模
zh_hant: 計算集區調整

# bdc-create.DataPoolScaleText
source: Data pool scale
it: Ridimensionamento pool di dati
ko: 데이터 풀 크기
zh_hans: 数据池规模
zh_hant: 資料集區調整

# bdc-create.StoragePoolScaleText
source: Storage pool scale
it: Ridimensionamento pool di archiviazione
ko: 스토리지 풀 크기
zh_hans: 存储池规模
zh_hant: 儲存體集區調整

# bdc-create.SparkPoolScaleText
source: Spark pool scale
it: Ridimensionamento pool Spark
ko: Spark 풀 크기
zh_hans: Spark 池规模
zh_hant: Spark 集區調整

# bdc-create.TargetClusterGroupTitle
source: TARGET CLUSTER
it: CLUSTER DI DESTINAZIONE
ko: 대상 클러스터
zh_hans: 目标集群
zh_hant: 目標叢集

# bdc-create.BigDataClusterGroupTitle
source: SQL SERVER BIG DATA CLUSTER
it: CLUSTER BIG DATA DI SQL SERVER
ko: SQL Server 빅 데이터 클러스터
zh_hans: SQL SERVER 大数据群集
zh_hant: SQL SERVER 巨量資料叢集

# bdc-create.YesText
source: Yes
it: Sì
ko: 예
zh_hans: 是
zh_hant: 是

# bdc-create.RestoreDefaultValuesText
source: Restore Default Values
it: Ripristina valori predefiniti
ko: 기본값 복원
zh_hans: 恢复默认值
zh_hant: 還原預設值

# bdc-create.settingsPageTitle
source: Settings
it: Impostazioni
ko: 설정
zh_hans: 设置
zh_hant: 設定

# bdc-create.settingsPageDescription
source: Configure the settings required for deploying SQL Server big data cluster
it: Consente di configurare le impostazioni necessarie per la distribuzione del cluster Big Data di SQL Server
ko: SQL Server 빅 데이터 클러스터를 배포하는 데 필요한 설정을 구성합니다.
zh_hans: 配置部署 SQL Server 大数据群集所需的设置
zh_hant: 進行部署 SQL Server 巨量資料叢集所需的設定

# bdc-create.EulaNotAccepted
source: You need to accept the terms of services and privacy policy in order to proceed
it: Per procedere, è necessario accettare le condizioni d'uso e l'informativa sulla privacy
ko: 계속하려면 서비스 약관과 개인정보처리방침에 동의해야 합니다.
zh_hans: 你需要接受服务条款和隐私政策才能继续
zh_hant: 您需要接受服務條款和隱私權原則才能繼續

# bdc-create.ClusterName
source: Cluster name
it: Nome del cluster
ko: 클러스터 이름
zh_hans: 群集名称
zh_hant: 叢集名稱

# bdc-create.AdminUsernameText
source: Admin username
it: Nome utente amministratore
ko: 관리자 사용자 이름
zh_hans: 管理员用户名
zh_hant: 系統管理員使用者名稱

# bdc-create.AdminUserPasswordText
source: Password
ko: 암호
zh_hans: 密码
zh_hant: 密碼

# bdc-create.SQLPortText
source: SQL Server master
it: Master SQL Server
ko: SQL Server 마스터
zh_hans: SQL Server 主服务器
zh_hant: SQL 伺服器主機

# bdc-create.ControllerPortText
source: Controller
ko: 컨트롤러
zh_hans: 控制器
zh_hant: 控制器

# bdc-create.ProxyPortText
source: Proxy
ko: 프록시
zh_hans: 代理

# bdc-create.GrafanaPortText
source: Grafana dashboard
it: Dashboard Grafana
ko: Grafana 대시보드
zh_hans: Grafana 仪表板
zh_hant: Grafana 儀表板

# bdc-create.KibanaPortText
source: Kibana dashboard
it: Dashboard Kibana
ko: Kibana 대시보드
zh_hans: Kibana 仪表板
zh_hant: Kibana 儀表板

# bdc-create.RegistryUserNamePasswordHintText
source: only required for private registries
it: obbligatoria solo per i registri privati
ko: 개인 레지스트리에만 필요
zh_hans: 仅限专用注册表
zh_hant: 只有私人登錄需要

# bdc-create.RegistryText
source: Registry
it: Registro
ko: 레지스트리
zh_hans: 注册表
zh_hant: 登錄

# bdc-create.RepositoryText
source: Repository
ko: 저장소
zh_hans: 存储库
zh_hant: 儲存庫

# bdc-create.ImageTagText
source: Image tag
it: Tag dell'immagine
ko: 이미지 태그
zh_hans: 图像标签
zh_hant: 映像標籤

# bdc-create.RegistryUserNameText
source: Username
it: Nome utente
ko: 사용자 이름
zh_hans: 用户名
zh_hant: 使用者名稱

# bdc-create.RegistryPasswordText
source: Password
ko: 암호
zh_hans: 密码
zh_hant: 密碼

# bdc-create.BasicSettingsText
source: Basic Settings
it: Impostazioni di base
ko: 기본 설정
zh_hans: 基本设置
zh_hant: 基本設定

# bdc-create.ContainerRegistrySettings
source: Container Registry Settings
it: Impostazioni del registro contenitori
ko: 컨테이너 레지스트리 설정
zh_hans: 容器注册表设置
zh_hant: 容器登錄設定

# bdc-create.PortSettings
source: Port Settings (Optional)
it: Impostazioni porta (facoltative)
ko: 포트 설정(선택 사항)
zh_hans: 端口设置(可选)
zh_hant: 連接埠設定 (選用)

# bdc-create.LicenseTerms
source: license terms
it: condizioni di licenza
ko: 사용 조건
zh_hans: 许可条款
zh_hant: 授權條款

# bdc-create.PrivacyPolicyText
source: privacy policy
it: Informativa sulla privacy
ko: 개인 정보 처리 방침
zh_hans: 隐私策略
zh_hant: 隱私權原則

# bdc-create.AcceptTermsText
source: I accept the {0} and {1}.
it: Accetto le {0} e l'{1}.
ko: {0} 및 {1}에 동의합니다.
zh_hans: 我接受{0}和{1}。
zh_hant: 我接受 {0} 和 {1}。

# bdc-create.InstallToolsText
source: Install Tools
it: Installa strumenti
ko: 도구 설치
zh_hans: 安装工具
zh_hant: 安裝工具

# bdc-create.InstallingButtonText
source: Installing...
it: Installazione...
ko: 설치 중...
zh_hans: 正在安装...
zh_hant: 正在安裝...

# bdc-create.selectTargetClusterTypePageTitle
source: What is your target cluster environment?
it: Qual è l'ambiente cluster di destinazione?
ko: 대상 클러스터 환경은 무엇입니까?
zh_hans: 你的目标集群环境是什么?
zh_hant: 您的目標叢集環境為何?

# bdc-create.selectTargetClusterTypePageDescription
source: Choose the target environment and then install the required tools for it.
it: Consente di scegliere l'ambiente di destinazione e quindi installare gli strumenti obbligatori.
ko: 대상 환경을 선택한 다음, 필요한 도구를 설치합니다.
zh_hans: 选择目标环境，然后为其安装所需的工具。
zh_hant: 選擇目標環境，然後為其安裝所需的工具。

# bdc-create.RefreshToolsButtonText
source: Refresh Status
it: Aggiorna stato
ko: 상태 새로 고침
zh_hans: 刷新状态
zh_hant: 重新整理狀態

# bdc-create.toolNameColumnHeader
source: Tool
it: Strumento
ko: 도구
zh_hans: 工具
zh_hant: 工具

# bdc-create.toolDescriptionColumnHeader
source: Description
it: Descrizione
ko: 설명
zh_hans: 说明
zh_hant: 描述

# bdc-create.toolVersionColumnHeader
source: Version
it: Versione
ko: 버전
zh_hans: 版本
zh_hant: 版本

# bdc-create.toolStatusColumnHeader
source: Status
it: Stato
ko: 상태
zh_hans: 状态
zh_hant: 狀態

# bdc-create.PickTargetEnvironmentText
source: Pick target environment
it: Selezionare l'ambiente di destinazione
ko: 대상 환경 선택
zh_hans: 选择目标环境
zh_hant: 挑選目標環境

# bdc-create.ToolsRefreshingText
source: Please wait while the required tools status is being refreshed.
it: Attendere l'aggiornamento dello stato degli strumenti obbligatori.
ko: 필요한 도구 상태가 새로 고쳐지는 동안 기다려 주세요.
zh_hans: 正在刷新所需工具的状态，请稍候。
zh_hant: 請稍候，正在重新整理所需的工具狀態。

# bdc-create.TargetClusterTypeNotSelectedText
source: Please select a target cluster type.
it: Selezionare un tipo di cluster di destinazione.
ko: 대상 클러스터 유형을 선택하세요.
zh_hans: 请选择目标群集类型。
zh_hant: 請選取目標叢集類型。

# bdc-create.MissingToolsText
source: Please install the required tools.
it: Installare gli strumenti obbligatori.
ko: 필요한 도구를 설치하세요.
zh_hans: 请安装所需的工具。
zh_hant: 請安裝所需的工具。

# bdc-create.ComingSoonText
source: (Coming Soon)
it: (presto disponibile)
ko: (출시 예정)
zh_hans: (即将推出)
zh_hant: (即將推出)

# bdc-create.RequiredToolsText
source: Required tools
it: Strumenti obbligatori
ko: 필요한 도구
zh_hans: 所需工具
zh_hant: 所需工具

# bdc-create.InstalledText
source: Installed
it: Installato
ko: 설치
zh_hans: 已安装
zh_hant: 已安裝

# bdc-create.NotInstalledText
source: Not Installed
it: Non installato
ko: 설치 안 됨
zh_hans: 未安装
zh_hant: 未安裝

# bdc-create.InstallingText
source: Installing...
it: Installazione...
ko: 설치 중...
zh_hans: 正在安装...
zh_hant: 正在安裝...

# bdc-create.FailedToInstallText
source: Install Failed
it: Installazione non riuscita
ko: 설치 실패
zh_hans: 安装失败
zh_hant: 安裝失敗

# bdc-create.selectTargetClusterPageTitle
source: Where do you want to deploy this SQL Server big data cluster?
it: Dove si vuole distribuire questo cluster Big Data di SQL Server?
ko: 이 SQL Server 빅 데이터 클러스터를 어디에 배포하시겠습니까?
zh_hans: 要在何处部署此 SQL Server 大数据群集?
zh_hant: 要在哪裡部署此 SQL Server 巨量資料叢集?

# bdc-create.selectTargetClusterPageDescription
source: Select the kubeconfig file and then select a cluster context from the list
it: Consente di selezionare il file kubeconfig e quindi selezionare un contesto del cluster dall'elenco
ko: kubeconfig 파일을 선택하고 목록에서 클러스터 컨텍스트를 선택합니다.
zh_hans: 选择 kubeconfig 文件，然后从列表中选择群集上下文
zh_hant: 選取 kubeconfig 檔案，然後從清單選取叢集內容

# bdc-create.ClusterContextNotSelectedMessage
source: Please select a cluster context.
it: Selezionare un contesto del cluster.
ko: 클러스터 컨텍스트를 선택하세요.
zh_hans: 请选择群集上下文。
zh_hant: 請選取叢集內容。

# bdc-create.kubeConfigFileLabelText
source: Kube config file path
it: Percorso del file di configurazione kube
ko: Kube 구성 파일 경로
zh_hans: Kube 配置文件路径
zh_hant: Kube 設定檔路徑

# bdc-browseText
source: Browse
it: Sfoglia
ko: 찾아보기
zh_hans: 浏览
zh_hant: 瀏覽

# bdc-clusterContextsLabelText
source: Cluster Contexts
it: Contesti del cluster
ko: 클러스터 컨텍스트
zh_hans: 群集上下文
zh_hant: 叢集內容

# bdc-errorLoadingClustersText
source: No cluster information is found in the config file or an error ocurred while loading the config file
it: Non sono state trovate informazioni sul cluster nel file di configurazione oppure si è verificato un errore durante il caricamento del file di configurazione
ko: 구성 파일에서 클러스터 정보를 찾지 못했거나 구성 파일을 로드하는 동안 오류가 발생했습니다.
zh_hans: 配置文件中找不到群集信息，或者加载配置文件时出错
zh_hant: 在設定檔中找不到叢集資訊，或載入設定檔時發生錯誤

# bdc-selectKubeConfigFileText
source: Select
it: Seleziona
ko: 선택
zh_hans: 选择
zh_hant: 選擇

# bdc-create.clusterProfilePageTitle
source: Select a cluster profile
it: Seleziona un profilo cluster
ko: 클러스터 프로필 선택
zh_hans: 选择群集配置文件
zh_hant: 選取叢集設定檔

# bdc-create.clusterProfilePageDescription
source: Select your requirement and we will provide you a pre-defined default scaling. You can later go to cluster configuration and customize it.
it: Selezionare il requisito per visualizzare il ridimensionamento predefinito. In seguito è possibile passare alla configurazione del cluster e personalizzarla.
ko: 요구 사항을 선택하면 미리 정의된 기본 크기가 제공됩니다. 나중에 클러스터 구성으로 이동하여 사용자 지정할 수 있습니다.
zh_hans: 请选择你的要求，我们将为你提供预定义的默认缩放。你稍后可转到群集配置进行自定义。
zh_hant: 選取您的需求，我們將會為您提供預先定義的預設規模調整。您稍後可前往叢集設定予以自訂。

# bdc-create.TargetClusterOverview
source: Target cluster scale overview
it: Panoramica sul ridimensionamento dei cluster di destinazione
ko: 대상 클러스터 크기 개요
zh_hans: 目标群集规模概述
zh_hant: 目標叢集調整概觀

# bdc-create.clusterProfileLabel
source: Deployment profile
it: Profilo di distribuzione
ko: 배포 프로필
zh_hans: 部署配置文件
zh_hant: 部署設定檔

# bdc-create.HardwareProfileText
source: Hardware profile
it: Profilo hardware
ko: 하드웨어 프로필
zh_hans: 硬件配置文件
zh_hant: 硬體設定檔

# bdc-create.HardwareLabelColumnName
source: Label
it: Etichetta
ko: 레이블
zh_hans: 标签
zh_hant: 標籤

# bdc-create.TotalNodesColumnName
source: Nodes
it: Nodi
ko: 노드
zh_hans: 节点
zh_hant: 節點

# bdc-create.TotalCoresColumnName
source: Cores
it: Core
ko: 코어
zh_hans: 核心
zh_hant: 核心

# bdc-create.TotalMemoryColumnName
source: Memory
it: Memoria
ko: 메모리
zh_hans: 内存
zh_hant: 記憶體

# bdc-create.TotalDisksColumnName
source: Disks
it: Dischi
ko: 디스크
zh_hans: 磁盘
zh_hant: 磁碟

# bdc-create.ScaleLabel
source: Scale
it: Scala
ko: 배율
zh_hans: 缩放
zh_hant: 小數位數

# bdc-create.HardwareProfileLabel
source: Hardware profile label
it: Etichetta del profilo hardware
ko: 하드웨어 프로필 레이블
zh_hans: 硬件配置文件标签
zh_hant: 硬體設定檔標籤

# bdc-create.FeatureSetLabel
source: Feature set
it: Set di funzionalità
ko: 기능 집합
zh_hans: 功能集
zh_hant: 功能集

# bdc-create.EngineOnlyText
source: Engine only
it: Solo motore
ko: 엔진만
zh_hans: 仅限引擎
zh_hant: 僅限引擎

# bdc-create.EngineWithFeaturesText
source: Engine with optional features
it: Motore con funzionalità facoltative
ko: 선택적 기능이 포함된 엔진
zh_hans: 具有可选特性的引擎
zh_hant: 具有選用功能的引擎

# bdc-create.SQLServerMasterDisplayName
source: SQL Server master
it: Master SQL Server
ko: SQL Server 마스터
zh_hans: SQL Server 主服务器
zh_hant: SQL Server 主機

# bdc-create.ComputePoolDisplayName
source: Compute pool
it: Pool di calcolo
ko: 풀 컴퓨팅
zh_hans: 计算池
zh_hant: 計算集區

# bdc-create.DataPoolDisplayName
source: Data pool
it: Pool di dati
ko: 데이터 풀
zh_hans: 数据池
zh_hant: 資料集區

# bdc-create.StoragePoolDisplayName
source: Storage pool
it: Pool di archiviazione
ko: 스토리지 풀
zh_hans: 存储池
zh_hant: 儲存體集區

# bdc-create.SparkPoolDisplayName
source: Spark pool
it: Pool Spark
ko: Spark 풀
zh_hans: Spark 池
zh_hant: Spark 集區

# bdc-create.SQLServerMasterDescription
source: The SQL Server instance provides an externally accessible TDS endpoint for the cluster
it: L'istanza di SQL Server fornisce un endpoint TDS accessibile dall'esterno per il cluster
ko: SQL Server 인스턴스는 클러스터에 대해 외부에서 액세스할 수 있는 TDS 엔드포인트를 제공합니다.
zh_hans: SQL Server 实例为群集提供了一个外部可访问的 TDS 终结点
zh_hant: SQL Server 執行個體為叢集提供了外部可存取的 TDS 端點

# bdc-create.ComputePoolDescription
source: TODO: Add description
it: TODO: Aggiungere la descrizione
ko: TODO: 설명 추가
zh_hans: TODO: 添加说明
zh_hant: TODO: 新增描述

# bdc-create.DataPoolDescription
source: TODO: Add description
it: TODO: Aggiungere la descrizione
ko: TODO: 설명 추가
zh_hans: TODO: 添加说明
zh_hant: TODO: 新增描述

# bdc-create.StoragePoolDescription
source: TODO: Add description
it: TODO: Aggiungere la descrizione
ko: TODO: 설명 추가
zh_hans: TODO: 添加说明
zh_hant: TODO: 新增描述

# bdc-create.SparkPoolDescription
source: TODO: Add description
it: TODO: Aggiungere la descrizione
ko: TODO: 설명 추가
zh_hans: TODO: 添加说明
zh_hant: TODO: 新增描述

# bdc-create.wizardTitle
source: Create a big data cluster
it: Crea un cluster Big Data
ko: 빅 데이터 클러스터 만들기
zh_hans: 创建大数据群集
zh_hant: 建立巨量資料叢集

# bdc-create.generateScriptsButtonText
source: Generate Scripts
it: Genera script
ko: 스크립트 생성
zh_hans: 生成脚本
zh_hant: 產生指令碼

# bdc-create.createClusterButtonText
source: Create
it: Crea
ko: 만들기
zh_hans: 创建
zh_hant: 建立

# bdc-create.AKSClusterCardText
source: New AKS Cluster
it: Nuovo cluster del servizio Azure Kubernetes
ko: 새 AKS 클러스터
zh_hans: 新的 AKS 集群
zh_hant: 新 AKS 叢集

# bdc-create.AKSClusterFullName
source: New Azure Kubernetes Service cluster
it: Nuovo cluster del servizio Azure Kubernetes
ko: 새 Azure Kubernetes Service 클러스터
zh_hans: 新的 Azure Kubernetes 服务群集
zh_hant: 新 Azure Kubernetes Service 叢集

# bdc-create.AKSClusterDescription
source: This option configures new Azure Kubernetes Service (AKS) for SQL Server big data cluster deployments. AKS makes it simple to create, configure and manage a cluster of virutal machines that are preconfigured with a Kubernetes cluster to run containerized applications.
it: Questa opzione consente di configurare il nuovo servizio Azure Kubernetes per le distribuzioni di cluster Big Data di SQL Server. Il servizio Azure Kubernetes consente di creare, configurare e gestire facilmente un cluster di macchine virtuali preconfigurate con un cluster Kubernetes per eseguire applicazioni aggiunte a contenitori.
ko: 이 옵션은 SQL Server 빅 데이터 클러스터 배포에 대한 새 AKS(Azure Kubernetes Service)를 구성합니다. AKS는 컨테이너화된 애플리케이션을 실행하기 위해 Kubernetes 클러스터로 미리 구성된 가상 머신의 클러스터를 간단히 만들고 구성하고 관리할 수 있도록 합니다.
zh_hans: 此选项为 SQL Server 大数据群集部署配置新的 Azure Kubernetes 服务(AKS)。借助 AKS，可轻松创建、配置和管理一组虚拟机，它们预配置有 Kubernetes 群集来运行容器化的应用程序。
zh_hant: 此選項會針對 SQL Server 巨量資料叢集部署設定新的 Azure Kubernetes Service (AKS)。AKS 讓已預先設定 Kubernetes 叢集來執行容器化應用程式的虛擬機器叢集，變得易於建立、設定和管理。

# bdc-create.ExistingClusterCardText
source: Existing Cluster
it: Cluster esistente
ko: 기존 클러스터
zh_hans: 现有群集
zh_hant: 現有的叢集

# bdc-create.ExistingClusterFullName
source: Existing Kubernetes cluster
it: Cluster Kubernetes esistente
ko: 기존 Kubernetes 클러스터
zh_hans: 现有的 Kubernetes 群集
zh_hant: 現有的 Kubernetes 叢集

# bdc-create.ExistingClusterDescription
source: This option assumes you already have a Kubernetes cluster installed, Once a prerequisite check is done, ensure the correct cluster context is selected.
it: Questa opzione presuppone che sia già stato installato un cluster Kubernetes. Dopo aver eseguito un controllo dei prerequisiti, assicurarsi che sia selezionato il contesto del cluster corretto.
ko: 이 옵션은 사용자가 이미 Kubernetes 클러스터를 설치했다고 가정합니다. 필수 조건을 확인한 후 올바른 클러스터 컨텍스트가 선택되었는지 확인하세요.
zh_hans: 此选项假定你已安装 Kubernetes 群集。完成先决条件检查后，请确保选择了正确的群集上下文。
zh_hant: 此選項假設您已安裝 Kubernetes 叢集，必要條件檢查完成後，請確認已選取正確的叢集內容。

# bigDataClusterOutputChannel
source: SQL Server big data cluster
it: Cluster big data di SQL Server
ko: SQL Server 빅 데이터 클러스터
zh_hans: SQL Server 大数据群集
zh_hant: SQL Server 巨量資料叢集

# runKubectlFailed
source: Unable to run kubectl
it: Non è possibile eseguire kubectl
ko: kubectl을 실행할 수 없습니다.
zh_hans: 无法运行 kubectl
zh_hant: 無法執行 kubectl

# setClusterFailed
source: Failed to set '{0}' as current cluster: {1}
it: Non è stato possibile impostare '{0}' come cluster corrente: {1}
ko: '{0}'을(를) 현재 클러스터 {1}(으)로 설정하지 못했습니다.
zh_hans: 未能将“{0}”设置为当前群集: {1}
zh_hant: 無法將 ‘{0}’ 設定為目前的叢集: {1}

# binaryNotFound
source: Could not find {0} binary. {1}
it: Non è stato possibile trovare il file binario {0}. {1}
ko: {0} 바이너리를 찾을 수 없습니다. {1}
zh_hans: 找不到 {0} 二进制文件。{1}
zh_hant: 找不到 {0} 二進位檔。{1}

# binaryNotInstalled
source: {0} is not installed. {1}
it: {0} non è installato. {1}
ko: {0}이(가) 설치되지 않았습니다. {1}
zh_hans: 未安装 {0}。{1}
zh_hant: 未安裝 {0}。{1}

# kubernetesRequired
source: SQL Server Big data cluster requires kubernetes.
it: Con il cluster Big Data di SQL Server è richiesto Kubernetes.
ko: SQL Server 빅 데이터 클러스터는 kubernetes가 필요합니다.
zh_hans: SQL Server 大数据群集需使用 kubernetes。
zh_hant: SQL Server 巨量資料叢集需要 kubernetes。

# cannotExecuteCmd
source: Cannot execute command.
it: Non è possibile eseguire il comando.
ko: 명령을 실행할 수 없습니다.
zh_hans: 无法执行命令。
zh_hant: 無法執行命令。

# kubectlVersionIncompatible
source: kubectl version ${0} may be incompatible with cluster Kubernetes version {1}
it: La versione ${0} di kubectl potrebbe essere incompatibile con la versione {1} di Kubernetes del cluster
ko: kubectl 버전 ${0}이(가) 클러스터 Kubernetes 버전 {1}과(와) 호환되지 않을 수 있습니다.
zh_hans: kubectl 版本 ${0} 可能与群集 Kubectl 版本 {1} 不兼容
zh_hant: kubectl 版本 ${0} 可能與叢集 Kubernetes 版本 {1} 不相容

# cannotRunCommand
source: Unable to run command ({0})
it: Non è possibile eseguire il comando ({0})
ko: 명령을 실행할 수 없습니다({0}).
zh_hans: 无法运行命令({0})
zh_hant: 無法執行命令 ({0})

# installDependenciesAction
source: Install dependencies
it: Installa dipendenze
ko: 종속성 설치
zh_hans: 安装依赖项
zh_hant: 安裝相依性

# learnMoreAction
source: Learn more
it: Altre informazioni
ko: 자세한 정보
zh_hans: 了解详细信息
zh_hant: 深入了解

# moreInfoMsg
source: Add {0} directory to path, or set "mssql-bdc.{0}-path" config to {0} binary.
it: Aggiungere la directory {0} al percorso oppure impostare la configurazione di "mssql-bdc.{0}-path" sul file binario {0}.
ko: {0} 디렉터리를 경로에 추가하거나 "mssql-bdc.{0}-path" 구성을 {0} 바이너리에 설정합니다.
zh_hans: 将 {0} 目录添加到路径，或者将 "mssql-bdc.{0}-path" 配置设为 {0} 二进制文件。
zh_hant: 將 {0} 目錄新增至路徑，或將 "mssql-bdc.{0}-path” 設定設為 {0} 二進位檔。

# downloadKubectlFailed
source: Failed to download kubectl: {0}
it: Non è stato possibile scaricare kubectl: {0}
ko: kubectl 다운로드 실패: {0}
zh_hans: 未能下载 kubectl: {0}
zh_hant: 無法下載 kubectl: {0}

# kubectlVersionCheckFailed
source: Failed to establish kubectl stable version: {0}
it: Non è stato possibile stabilire la versione stabile di kubectl: {0}
ko: kubectl 안정적인 버전({0})을 설정하지 못했습니다.
zh_hans: 未能创建 kubectl 稳定版本: {0}
zh_hant: 無法建立 kubectl 穩定版本: {0}

source: Done
it: Operazione completata
ko: 완료
zh_hans: 已完成
zh_hant: 完成

# dependencyInstalled
source: {0} already installed...
it: {0} già installato...
ko: {0}이(가) 이미 설치됨...
zh_hans: {0} 已安装...
zh_hant: 已安裝 {0}...

# installingDependency
source: Installing {0}...
it: Installazione di {0}...
ko: {0}을(를) 설치하는 중...
zh_hans: 正在安装 {0}...
zh_hant: 正在安裝 {0}...

# installingDependencyFailed
source: Unable to install {0}: {1}
it: Non è possibile installare {0}: {1}
ko: {0}을(를) 설치할 수 없음: {1}
zh_hans: 无法安装 {0}: {1}
zh_hant: 無法安裝 {0}: {1}
