{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"azdata.extension.contributes.dashboard.tab.id": "Eindeutiger Bezeichner für diese Registerkarte. Wird für alle Anfragen an die Erweiterung übergeben werden.",
	"azdata.extension.contributes.dashboard.tab.title": "Titel der Registerkarte, die dem Benutzer angezeigt wird.",
	"azdata.extension.contributes.dashboard.tab.description": "Beschreibung dieser Registerkarte, die dem Benutzer angezeigt werden.",
	"azdata.extension.contributes.tab.when": "Eine Bedingung, die TRUE sein muss, damit dieses Element angezeigt wird.",
	"azdata.extension.contributes.tab.provider": "Definiert die Verbindungstypen, mit denen diese Registerkarte kompatibel ist. Wenn diese nicht festgelegt werden, ist der Standardwert \"MSSQL\".",
	"azdata.extension.contributes.dashboard.tab.container": "Der Container, der auf dieser Registerkarte angezeigt wird.",
	"azdata.extension.contributes.dashboard.tab.alwaysShow": "Legt fest, ob diese Registerkarte immer angezeigt werden soll oder nur, wenn der Benutzer sie hinzufügt.",
	"azdata.extension.contributes.dashboard.tab.isHomeTab": "Legt fest, ob diese Registerkarte als Startseite für einen Verbindungstyp verwendet werden soll.",
	"azdata.extension.contributes.tabs": "Trägt eine oder mehrere Registerkarten bei, die Benutzer ihren Dashboards hinzufügen können.",
	"dashboardTab.contribution.noTitleError": "Für die Erweiterung wurde kein Titel angegeben.",
	"dashboardTab.contribution.noDescriptionWarning": "Keine Beschreibung vorhanden.",
	"dashboardTab.contribution.noContainerError": "Für die Erweiterung wurde kein Container angegeben.",
	"dashboardTab.contribution.moreThanOneDashboardContainersError": "Pro Umgebung muss genau 1 Dashboard Container definiert werden"
}