Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/extensions/agent.*.xlf
Languages: de

# scheduleDialog.newSchedule
source: New Schedule
de: Neuer Zeitplan

# scheduleDialog.cancel
source: Cancel
de: Abbrechen

# scheduleDialog.scheduleName
source: Schedule Name
de: Zeitplanname

# scheduleDialog.schedules
source: Schedules
de: Zeitpläne

# createProxy.createProxy
source: Create Proxy
de: Proxy erstellen

# createProxy.editProxy
source: Edit Proxy
de: Proxy bearbeiten

# createProxy.General
source: General
de: Allgemein

# createProxy.CredentialName
source: Credential name
de: Name der Anmeldeinformationen

# createProxy.Description
source: Description
de: Beschreibung

# createProxy.OperatingSystem
source: Operating system (CmdExec)
de: Betriebssystem (CmdExec)

# createProxy.ReplicationSnapshot
source: Replication Snapshot
de: Replikationsmomentaufnahme

# createProxy.ReplicationTransactionLog
source: Replication Transaction-Log Reader
de: Replikationstransaktionsprotokoll-Leser

# createProxy.ReplicationDistributor
source: Replication Distributor
de: Replikationsverteiler

# createProxy.ReplicationMerge
source: Replication Merge
de: Replikationsmerge

# createProxy.ReplicationQueueReader
source: Replication Queue Reader
de: Replikations-Warteschlangenleser

# createProxy.SSASQueryLabel
source: SQL Server Analysis Services Query
de: SQL Server Analysis Services-Abfrage

# createProxy.SSASCommandLabel
source: SQL Server Analysis Services Command
de: SQL Server Analysis Services-Befehl

# createProxy.SSISPackage
source: SQL Server Integration Services Package
de: SQL Server Integration Services-Paket

# createProxy.subSystemHeading
source: Active to the following subsytems
de: Folgenden Subsystemen gegenüber aktiv

# pickSchedule.jobSchedules
source: Job Schedules
de: Auftragszeitpläne

# pickSchedule.cancel
source: Cancel
de: Abbrechen

# pickSchedule.availableSchedules
source: Available Schedules:
de: Verfügbare Zeitpläne:

# pickSchedule.description
source: Description
de: Beschreibung

# createOperator.createOperator
source: Create Operator
de: Operator erstellen

# createOperator.editOperator
source: Edit Operator
de: Operator bearbeiten

# createOperator.General
source: General
de: Allgemein

# createOperator.Notifications
source: Notifications
de: Benachrichtigungen

# createOperator.Enabled
source: Enabled
de: Aktiviert

# createOperator.PagerEmailName
source: Pager E-mail Name
de: E-Mail-Name für Pager

# createOperator.PagerMondayCheckBox
source: Monday
de: Montag

# createOperator.PagerTuesdayCheckBox
source: Tuesday
de: Dienstag

# createOperator.PagerWednesdayCheckBox
source: Wednesday
de: Mittwoch

# createOperator.PagerThursdayCheckBox
source: Thursday
de: Donnerstag

# createOperator.PagerFridayCheckBox
source: Friday
de: Freitag

# createOperator.PagerSaturdayCheckBox
source: Saturday
de: Samstag

# createOperator.PagerSundayCheckBox
source: Sunday
de: Sonntag

# createOperator.workdayBegin
source: Workday begin
de: Beginn des Arbeitstags

# createOperator.workdayEnd
source: Workday end
de: Ende des Arbeitstags

# createOperator.PagerDutySchedule
source: Pager on duty schedule
de: Pager empfangsbereit am

# createOperator.AlertListHeading
source: Alert list
de: Liste der Warnungen

# createOperator.AlertNameColumnLabel
source: Alert name
de: Warnungsname

# jobStepDialog.fileBrowserTitle
source: Locate Database Files -
de: Datenbankdateien finden:

# jobStepDialog.cancel
source: Cancel
de: Abbrechen

# jobStepDialog.general
source: General
de: Allgemein

# jobStepDialog.advanced
source: Advanced
de: Erweitert

# jobStepDialog.open
source: Open...
de: Öffnen...

# jobStepDialog.parse
source: Parse
de: Analysieren

# jobStepDialog.successParse
source: The command was successfully parsed.
de: Der Befehl wurde erfolgreich analysiert.

# jobStepDialog.failParse
source: The command failed.
de: Fehler bei Befehl.

# jobStepDialog.blankStepName
source: The step name cannot be left blank
de: Der Schrittname darf nicht leer sein.

# jobStepDialog.processExitCode
source: Process exit code of a successful command:
de: Prozessexitcode eines erfolgreichen Befehls:

# jobStepDialog.stepNameLabel
source: Step Name
de: Schrittname

# jobStepDialog.typeLabel
source: Type
de: Typ

# jobStepDialog.runAsLabel
source: Run as
de: Ausführen als

# jobStepDialog.databaseLabel
source: Database
de: Datenbank

# jobStepDialog.commandLabel
source: Command
de: Befehl

# jobStepDialog.successAction
source: On success action
de: Aktion bei Erfolg

# jobStepDialog.failureAction
source: On failure action
de: Aktion bei Fehler

# jobStepDialog.runAsUser
source: Run as user
de: Als Benutzer ausführen

# jobStepDialog.retryAttempts
source: Retry Attempts
de: Wiederholungsversuche

# jobStepDialog.retryInterval
source: Retry Interval (minutes)
de: Wiederholungsintervall (Minuten)

# jobStepDialog.logToTable
source: Log to table
de: In Tabelle protokollieren

# jobStepDialog.appendExistingTableEntry
source: Append output to exisiting entry in table
de: Ausgabe an vorhandenen Eintrag in Tabelle anfügen

# jobStepDialog.includeStepOutputHistory
source: Include step output in history
de: Schrittausgabe in Verlauf einschließen

# jobStepDialog.outputFile
source: Output File
de: Ausgabedatei

# jobStepDialog.appendOutputToFile
source: Append output to existing file
de: Ausgabe an vorhandene Datei anfügen

# jobStepDialog.selectedPath
source: Selected path
de: Ausgewählter Pfad

# jobStepDialog.filesOfType
source: Files of type
de: Dateien vom Typ

# jobStepDialog.fileName
source: File name
de: Dateiname

# jobStepDialog.allFiles
source: All Files (*)
de: Alle Dateien (*)

# jobStepDialog.newJobStep
source: New Job Step
de: Neuer Auftragsschritt

# jobStepDialog.editJobStep
source: Edit Job Step
de: Auftragsschritt bearbeiten

# jobStepDialog.TSQL
source: Transact-SQL script (T-SQL)
de: Transact-SQL-Skript (T-SQL)

# jobStepDialog.CmdExec
source: Operating system (CmdExec)
de: Betriebssystem (CmdExec)

# jobStepDialog.replicationDistribution
source: Replication Distributor
de: Replikationsverteiler

# jobStepDialog.replicationMerge
source: Replication Merge
de: Replikationsmerge

# jobStepDialog.replicationQueueReader
source: Replication Queue Reader
de: Replikations-Warteschlangenleser

# jobStepDialog.replicationSnapshot
source: Replication Snapshot
de: Replikationsmomentaufnahme

# jobStepDialog.replicationTransactionLogReader
source: Replication Transaction-Log Reader
de: Replikationstransaktionsprotokoll-Leser

# jobStepDialog.analysisCommand
source: SQL Server Analysis Services Command
de: SQL Server Analysis Services-Befehl

# jobStepDialog.analysisQuery
source: SQL Server Analysis Services Query
de: SQL Server Analysis Services-Abfrage

# jobStepDialog.servicesPackage
source: SQL Server Integration Service Package
de: SQL Server Integration Services-Paket

# jobStepDialog.agentServiceAccount
source: SQL Server Agent Service Account
de: Konto des SQL Server-Agent-Diensts

# jobStepDialog.nextStep
source: Go to the next step
de: Zum nächsten Schritt wechseln

# jobStepDialog.quitJobSuccess
source: Quit the job reporting success
de: Beenden des Auftrags mit Erfolgsmeldung

# jobStepDialog.quitJobFailure
source: Quit the job reporting failure
de: Beenden des Auftrags mit Fehlermeldung

# jobDialog.general
source: General
de: Allgemein

# jobDialog.steps
source: Steps
de: Schritte

# jobDialog.schedules
source: Schedules
de: Zeitpläne

# jobDialog.alerts
source: Alerts
de: Warnungen

# jobDialog.notifications
source: Notifications
de: Benachrichtigungen

# jobDialog.blankJobNameError
source: The name of the job cannot be blank.
de: Der Auftragsname darf nicht leer sein.

# jobDialog.owner
source: Owner
de: Besitzer

# jobDialog.category
source: Category
de: Kategorie

# jobDialog.description
source: Description
de: Beschreibung

# jobDialog.enabled
source: Enabled
de: Aktiviert

# jobDialog.jobStepList
source: Job step list
de: Liste der Auftragsschritte

# jobDialog.step
source: Step
de: Schritt

# jobDialog.type
source: Type
de: Typ

# jobDialog.onSuccess
source: On Success
de: Bei Erfolg

# jobDialog.onFailure
source: On Failure
de: Bei Fehler

# jobDialog.new
source: New Step
de: Neuer Schritt

# jobDialog.edit
source: Edit Step
de: Schritt bearbeiten

# jobDialog.delete
source: Delete Step
de: Schritt löschen

# jobDialog.moveUp
source: Move Step Up
de: Schritt nach oben verschieben

# jobDialog.moveDown
source: Move Step Down
de: Schritt nach unten verschieben

# jobDialog.startStepAt
source: Start step
de: Schritt starten

# jobDialog.notificationsTabTop
source: Actions to perform when the job completes
de: Aktionen, die nach Abschluss des Auftrags ausgeführt werden sollen

# jobDialog.page
source: Page
de: Seite

# jobDialog.eventLogCheckBoxLabel
source: Write to the Windows Application event log
de: In Ereignisprotokoll für Windows-Anwendungen schreiben

# jobDialog.deleteJobLabel
source: Automatically delete job
de: Auftrag automatisch löschen

# jobDialog.schedulesaLabel
source: Schedules list
de: Zeitplanliste

# jobDialog.pickSchedule
source: Pick Schedule
de: Zeitplan auswählen

# jobDialog.scheduleNameLabel
source: Schedule Name
de: Zeitplanname

# jobDialog.alertsList
source: Alerts list
de: Liste der Warnungen

# jobDialog.newAlert
source: New Alert
de: Neue Warnung

# jobDialog.alertNameLabel
source: Alert Name
de: Warnungsname

# jobDialog.alertEnabledLabel
source: Enabled
de: Aktiviert

# jobDialog.alertTypeLabel
source: Type
de: Typ

# jobDialog.newJob
source: New Job
de: Neuer Auftrag

# jobDialog.editJob
source: Edit Job
de: Auftrag bearbeiten

# alertDialog.createAlert
source: Create Alert
de: Warnung erstellen

# alertDialog.editAlert
source: Edit Alert
de: Warnung bearbeiten

# alertDialog.General
source: General
de: Allgemein

# alertDialog.Response
source: Response
de: Antwort

# alertDialog.Options
source: Options
de: Optionen

# alertDialog.eventAlert
source: Event alert definition
de: Ereigniswarnungsdefinition

# alertDialog.Type
source: Type
de: Typ

# alertDialog.Enabled
source: Enabled
de: Aktiviert

# alertDialog.DatabaseName
source: Database name
de: Datenbankname

# alertDialog.ErrorNumber
source: Error number
de: Fehlernummer

# alertDialog.Severity
source: Severity
de: Schweregrad

# alertDialog.RaiseAlertContains
source: Raise alert when message contains
de: Warnung auslösen, wenn die Meldung Folgendes enthält

# alertDialog.MessageText
source: Message text
de: Meldungstext

# alertDialog.Severity001
source: 001 - Miscellaneous System Information
de: 001: Verschiedene Systemangaben

# alertDialog.Severity002
source: 002 - Reserved
de: 002: Reserviert

# alertDialog.Severity003
source: 003 - Reserved
de: 003: Reserviert

# alertDialog.Severity004
source: 004 - Reserved
de: 004: Reserviert

# alertDialog.Severity005
source: 005 - Reserved
de: 005: Reserviert

# alertDialog.Severity006
source: 006 - Reserved
de: 006: Reserviert

# alertDialog.Severity007
source: 007 - Notification: Status Information
de: 007: Benachrichtigung: Statusangaben

# alertDialog.Severity008
source: 008 - Notification: User Intervention Required
de: 008: Benachrichtigung: Benutzereingriff erforderlich

# alertDialog.Severity009
source: 009 - User Defined
de: 009: Benutzerdefiniert

# alertDialog.Severity010
source: 010 - Information
de: 010: Angaben

# alertDialog.Severity011
source: 011 - Specified Database Object Not Found
de: 011: Angegebenes Datenbankobjekt nicht gefunden

# alertDialog.Severity012
source: 012 - Unused
de: 012: Nicht verwendet

# alertDialog.Severity013
source: 013 - User Transaction Syntax Error
de: 013: Syntaxfehler in Benutzertransaktion

# alertDialog.Severity014
source: 014 - Insufficient Permission
de: 014: Unzureichende Berechtigung

# alertDialog.Severity015
source: 015 - Syntax Error in SQL Statements
de: 015: Syntaxfehler in SQL-Anweisungen

# alertDialog.Severity016
source: 016 - Miscellaneous User Error
de: 016: Sonstiger Benutzerfehler

# alertDialog.Severity017
source: 017 - Insufficient Resources
de: 017: Unzureichende Ressourcen

# alertDialog.Severity018
source: 018 - Nonfatal Internal Error
de: 018: Mittelschwerer interner Fehler

# alertDialog.Severity019
source: 019 - Fatal Error in Resource
de: 019: Schwerwiegender Fehler bei Ressource

# alertDialog.Severity020
source: 020 - Fatal Error in Current Process
de: 020: Schwerwiegender Fehler im aktuellen Prozess

# alertDialog.Severity021
source: 021 - Fatal Error in Database Processes
de: 021: Schwerwiegender Fehler in Datenbankprozessen

# alertDialog.Severity022
source: 022 - Fatal Error: Table Integrity Suspect
de: 022: Schwerwiegender Fehler: Tabellenintegrität zweifelhaft

# alertDialog.Severity023
source: 023 - Fatal Error: Database Integrity Suspect
de: 023: Schwerwiegender Fehler: Datenbankintegrität zweifelhaft

# alertDialog.Severity024
source: 024 - Fatal Error: Hardware Error
de: 024: Schwerwiegender Fehler: Hardwarefehler

# alertDialog.Severity025
source: 025 - Fatal Error
de: 025: Schwerwiegender Fehler

# alertDialog.AllDatabases
source: <all databases>
de: <Alle Datenbanken>

# alertDialog.ExecuteJob
source: Execute Job
de: Auftrag ausführen

# alertDialog.ExecuteJobName
source: Job Name
de: Auftragsname

# alertDialog.NotifyOperators
source: Notify Operators
de: Operator benachrichtigen

# alertDialog.NewJob
source: New Job
de: Neuer Auftrag

# alertDialog.OperatorList
source: Operator List
de: Operatorliste

# alertDialog.NewOperator
source: New Operator
de: Neuer Operator

# alertDialog.IncludeErrorInEmail
source: Include alert error text in e-mail
de: Fehlertext der Warnung in E-Mail einschließen

# alertDialog.IncludeErrorInPager
source: Include alert error text in pager
de: Fehlertext der Warnung in Pager einfügen

# alertDialog.AdditionalNotification
source: Additional notification message to send
de: Zusätzlich zu sendende Benachrichtigung

# alertDialog.DelayBetweenResponse
source: Delay between responses
de: Verzögerung zwischen Antworten

# alertDialog.DelayMinutes
source: Delay Minutes
de: Verzögerung (Minuten)

# alertDialog.DelaySeconds
source: Delay Seconds
de: Verzögerung (Sekunden)

# agentDialog.Cancel
source: Cancel
de: Abbrechen

# proxyData.saveErrorMessage
source: Proxy update failed '{0}'
de: Fehler bei Proxyaktualisierung: "{0}"

# proxyData.saveSucessMessage
source: Proxy '{0}' updated successfully
de: Der Proxy "{0}" wurde erfolgreich aktualisiert.

# proxyData.newJobSuccessMessage
source: Proxy '{0}' created successfully
de: Der Proxy "{0}" wurde erfolgreich erstellt.

# jobStepData.saveErrorMessage
source: Step update failed '{0}'
de: Fehler beim Aktualisieren des Schritts: "{0}"

# stepData.jobNameRequired
source: Job name must be provided
de: Es muss ein Auftragsname angegeben werden.

# stepData.stepNameRequired
source: Step name must be provided
de: Es muss ein Schrittname angegeben werden.

# jobData.whenJobCompletes
source: When the job completes
de: Bei Abschluss des Auftrags

# jobData.whenJobFails
source: When the job fails
de: Bei Auftragsfehler

# jobData.whenJobSucceeds
source: When the job succeeds
de: Bei erfolgreicher Auftragsausführung

# jobData.jobNameRequired
source: Job name must be provided
de: Es muss ein Auftragsname angegeben werden.

# jobData.saveErrorMessage
source: Job update failed '{0}'
de: Fehler beim Aktualisieren des Auftrags: "{0}"

# jobData.newJobErrorMessage
source: Job creation failed '{0}'
de: Fehler beim Erstellen des Auftrags: "{0}"

# jobData.saveSucessMessage
source: Job '{0}' updated successfully
de: Der Auftrag "{0}" wurde erfolgreich aktualisiert.

# jobData.newJobSuccessMessage
source: Job '{0}' created successfully
de: Der Auftrag "{0}" wurde erfolgreich erstellt.

# alertData.saveErrorMessage
source: Alert update failed '{0}'
de: Fehler bei Warnungsaktualisierung: "{0}"

# alertData.DefaultAlertTypString
source: SQL Server event alert
de: SQL Server-Ereigniswarnung

# alertDialog.PerformanceCondition
source: SQL Server performance condition alert
de: SQL Server-Leistungsstatuswarnung

# alertDialog.WmiEvent
source: WMI event alert
de: WMI-Ereigniswarnung

# mainController.notImplemented
source: This feature is under development. Check-out the latest insiders build if you'd like to try out the most recent changes!
de: Dieses Feature befindet sich noch in der Entwicklungsphase. Verwenden Sie den neuesten Insider-Build, wenn Sie die Neuerungen testen möchten.
