Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/extensions/import.*.xlf
Languages: es, it

# flatFileImport.importInformation
source: Import information
es: Información de la importación
it: Informazioni sull'importazione

# flatFileImport.importStatus
source: Import status
es: Estado de la importación
it: Stato dell'importazione

# flatFileImport.serverName
source: Server name
es: Nombre del servidor
it: Nome del server

# flatFileImport.databaseName
source: Database name
es: Nombre de la base de datos
it: Nome del database

# flatFileImport.tableName
source: Table name
es: Nombre de la tabla
it: Nome della tabella

# flatFileImport.tableSchema
source: Table schema
es: Esquema de tabla
it: Schema della tabella

# flatFileImport.fileImport
source: File to be imported
es: Archivo para importar
it: File da importare

# flatFileImport.success.norows
source: ✔ You have successfully inserted the data into a table.
es: ✔ Ha insertado correctamente los datos en una tabla.
it: ✔ I dati sono stati inseriti in una tabella.

# flatFileImport.prosePreviewMessage
source: This operation analyzed the input file structure to generate the preview below for up to the first 50 rows.
es: Esta operación analizó la estructura del archivo de entrada para generar la vista previa siguiente para las primeras 50 filas.
it: Questa operazione ha analizzato la struttura del file di input per generare l'anteprima seguente per le prime 50 righe.

# flatFileImport.prosePreviewMessageFail
source: This operation was unsuccessful. Please try a different input file.
es: Esta operación no se completó correctamente. Pruebe con un archivo de entrada diferente.
it: Questa operazione non è riuscita. Provare con un file di input diverso.

# flatFileImport.refresh
source: Refresh
es: Actualizar
it: Aggiorna

# flatFileImport.importData
source: Import Data
es: Importar datos
it: Importa dati

# flatFileImport.next
source: Next
es: Siguiente
it: Avanti

# flatFileImport.columnName
source: Column Name
es: Nombre de columna
it: Nome colonna

# flatFileImport.dataType
source: Data Type
es: Tipo de datos
it: Tipo di dati

# flatFileImport.primaryKey
source: Primary Key
es: Clave principal
it: Chiave primaria

# flatFileImport.allowNulls
source: Allow Nulls
es: Permitir valores NULL
it: Consenti valori Null

# flatFileImport.serverDropdownTitle
source: Server the database is in
es: El servidor de la base de datos está en
it: Server in cui si trova il database

# flatFileImport.databaseDropdownTitle
source: Database the table is created in
es: Base de datos en la que se crea la tabla
it: Database in cui viene creata la tabella

# flatFileImport.browseFiles
source: Browse
es: Examinar
it: Sfoglia

# flatFileImport.openFile
source: Open
es: Abrir
it: Apri

# flatFileImport.fileTextboxTitle
source: Location of the file to be imported
es: Ubicación del archivo para importar
it: Percorso del file da importare

# flatFileImport.tableTextboxTitle
source: New table name
es: Nuevo nombre de la tabla
it: Nuovo nome della tabella

# flatFileImport.schemaTextboxTitle
source: Table schema
es: Esquema de tabla
it: Schema della tabella

# import.needConnection
source: Please connect to a server before using this wizard.
es: Por favor, conéctese a un servidor antes de utilizar a este asistente.
it: Connettersi a un server prima di usare questa procedura guidata.

# flatFileImport.wizardName
source: Import flat file wizard
es: Asistente de importación de archivo plano
it: Importazione guidata file flat

# flatFileImport.page1Name
source: Specify Input File
es: Especificar el archivo de entrada
it: Specifica il file di input

# flatFileImport.page2Name
source: Preview Data
es: Vista previa de datos
it: Anteprima dati

# flatFileImport.page3Name
source: Modify Columns
es: Modificar columnas
it: Modifica colonne

# flatFileImport.page4Name
source: Summary
es: Resumen
it: Riepilogo

# flatFileImport.importNewFile
source: Import new file
es: Importar nuevo archivo
it: Importa nuovo file

# import.serviceCrashButton
source: Give Feedback
es: Ofrecer comentarios
it: Feedback

# serviceCrashMessage
source: service component could not start
es: el componente de servicio no se pudo iniciar
it: non è stato possibile avviare il componente del servizio

source: Service Started
es: Servicio iniciado
it: Servizio avviato

# serviceStarting
source: Starting service
es: Iniciando servicio
it: Avvio del servizio

# flatFileImport.serviceStartFailed
source: Failed to start Import service{0}
es: No se pudo iniciar el servicio de importación {0}
it: Non è stato possibile avviare il servizio di importazione {0}

# installingServiceDetailed
source: Installing {0} service to {1}
es: Instalando servicio {0} en {1}
it: Installazione del servizio {0} in {1}

source: Installing Service
es: Instalando servicio
it: Installazione del servizio

# serviceInstalled
source: Installed
es: Instalado
it: Installato

# downloadingService
source: Downloading {0}
es: Descargando {0}
it: Download di {0}

# downloadingServiceStatus
source: Downloading Service
es: Descargando servicio
it: Download del servizio

# downloadingServiceComplete
source: Done!
es: ¡Listo!
it: Operazione completata.
