Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/extensions/schema-compare.*.xlf
Languages: fr

# SchemaCompare.Description.TreatVerificationErrorsAsWarnings
source: Specifies whether errors encountered during publish verification should be treated as warnings. The check is performed against the generated deployment plan before the plan is executed against your target database. Plan verification detects problems such as the loss of target-only objects (such as indexes) that must be dropped to make a change. Verification will also detect situations where dependencies (such as a table or view) exist because of a reference to a composite project, but do not exist in the target database. You might choose to do this to get a complete list of all issues, instead of having the publish action stop on the first error.
fr: Spécifie si les erreurs rencontrées au cours de la vérification de publication doivent être considérées comme des avertissements. La vérification est effectuée sur le plan de déploiement généré, avant qu'il ne soit exécuté sur la base de données cible. La vérification du plan détecte des problèmes comme la perte d'objets cibles uniquement (par ex., des index) qui doivent être supprimés pour effectuer un changement. La vérification détecte également des situations où des dépendances (table ou vue par exemple) existent en raison d'une référence à un projet composite, mais n'existent pas dans la base de données cible. Vous pouvez choisir d'effectuer cette opération pour obtenir la liste complète de tous les problèmes, au lieu de définir l'action de publication pour qu'elle s'arrête à la première erreur.

# SchemaCompare.Description.ScriptRefreshModule
source: Include refresh statements at the end of the publish script.
fr: Inclure des instructions d'actualisation à la fin du script de publication.

# SchemaCompare.Description.ScriptNewConstraintValidation
source: At the end of publish all of the constraints will be verified as one set, avoiding data errors caused by a check or foreign key constraint in the middle of publish. If set to False, your constraints will be published without checking the corresponding data.
fr: À la fin de la publication, toutes les contraintes sont vérifiées comme un ensemble, ce qui permet d'éviter les erreurs de données provoquées par une contrainte de validation ou de clé étrangère pendant la publication. Si la valeur est False, vos contraintes sont publiées sans vérification des données correspondantes.

# SchemaCompare.Description.ScriptFileSize
source: Controls whether size is specified when adding a file to a filegroup.
fr: Détermine si la taille est spécifiée pendant l'ajout d'un fichier à un groupe de fichiers.

# SchemaCompare.Description.ScriptDeployStateChecks
source: Specifies whether statements are generated in the publish script to verify that the database name and server name match the names specified in the database project.
fr: Spécifie si des instructions sont générées dans le script de publication pour vérifier que le nom de base de données et le nom de serveur correspondent aux noms spécifiés dans le projet de base de données.

# SchemaCompare.Description.ScriptDatabaseOptions
source: Specifies whether target database properties should be set or updated as part of the publish action.
fr: Spécifie si les propriétés de la base de données cible doivent être définies ou mises à jour dans le cadre de l'action de publication.

# SchemaCompare.Description.ScriptDatabaseCompatibility
source: Specifies whether differences in the database compatibility should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de compatibilité de base de données doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.ScriptDatabaseCollation
source: Specifies whether differences in the database collation should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de classement de base de données doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.RunDeploymentPlanExecutors
source: Specifies whether DeploymentPlanExecutor contributors should be run when other operations are executed.
fr: Spécifie si les contributeurs DeploymentPlanExecutor doivent être exécutés quand d'autres opérations sont exécutées.

# SchemaCompare.Description.RegisterDataTierApplication
source: Specifies whether the schema is registered with the database server.
fr: Indique si le schéma est inscrit dans le serveur de base de données.

# SchemaCompare.Description.PopulateFilesOnFileGroups
source: Specifies whether a new file is also created when a new FileGroup is created in the target database.
fr: Spécifie si un fichier est créé en même temps qu'un groupe de fichiers dans la base de données cible.

# SchemaCompare.Description.NoAlterStatementsToChangeClrTypes
source: Specifies that publish should always drop and re-create an assembly if there is a difference instead of issuing an ALTER ASSEMBLY statement
fr: Spécifie que la publication doit toujours supprimer et recréer un assembly en cas de différence, au lieu d'envoyer une instruction ALTER ASSEMBLY

# SchemaCompare.Description.IncludeTransactionalScripts
source: Specifies whether transactional statements should be used where possible when you publish to a database.
fr: Spécifie s'il faut utiliser des instructions transactionnelles quand cela est possible quand vous publiez dans une base de données.

# SchemaCompare.Description.IncludeCompositeObjects
source: Include all composite elements as part of a single publish operation.
fr: Incluez tous les éléments composites dans une seule et même opération de publication.

# SchemaCompare.Description.AllowUnsafeRowLevelSecurityDataMovement
source: Do not block data motion on a table which has Row Level Security if this property is set to true. Default is false.
fr: Ne bloquez pas le déplacement des données sur une table avec sécurité au niveau des lignes si cette propriété est définie sur true. La valeur par défaut est false.

# SchemaCompare.Description.IgnoreWithNocheckOnCheckConstraints
source: Specifies whether differences in the value of the WITH NOCHECK clause for check constraints will be ignored or updated when you publish to a database.
fr: Spécifie si les différences de valeur de la clause WITH NOCHECK pour les contraintes de validation sont ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreFillFactor
source: Specifies whether differences in the fill factor for index storage should be ignored or whether a warning should be issued when you publish to a database.
fr: Spécifie si les différences de facteur de remplissage du stockage d'index doivent être ignorées ou si un avertissement doit être envoyé quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreFileSize
source: Specifies whether differences in the file sizes should be ignored or whether a warning should be issued when you publish to a database.
fr: Spécifie si les différences de taille de fichier doivent être ignorées ou si un avertissement doit être envoyé quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreFilegroupPlacement
source: Specifies whether differences in the placement of objects in FILEGROUPs should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de placement des objets dans des groupes de fichiers doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.DoNotAlterReplicatedObjects
source: Specifies whether objects that are replicated are identified during verification.
fr: Indique si les objets répliqués sont identifiés pendant la vérification.

# SchemaCompare.Description.DoNotAlterChangeDataCaptureObjects
source: If true, Change Data Capture objects are not altered.
fr: Si la valeur est true, les objets de capture des changements de données ne sont pas modifiés.

# SchemaCompare.Description.DisableAndReenableDdlTriggers
source: Specifies whether Data Definition Language (DDL) triggers are disabled at the beginning of the publish process and re-enabled at the end of the publish action.
fr: Spécifie si les déclencheurs de langage de description de données (DDL) sont désactivés au début du processus de publication et réactivés à la fin de l'action de publication.

# SchemaCompare.Description.DeployDatabaseInSingleUserMode
source: If true, the database is set to Single User Mode before deploying.
fr: Si la valeur est true, la base de données est définie sur le mode mono-utilisateur avant le déploiement.

# SchemaCompare.Description.CreateNewDatabase
source: Specifies whether the target database should be updated or whether it should be dropped and re-created when you publish to a database.
fr: Spécifie si la base de données cible doit être mise à jour, ou si elle doit être supprimée et recréée quand vous publiez dans une base de données.

# SchemaCompare.Description.CompareUsingTargetCollation
source: This setting dictates how the database's collation is handled during deployment; by default the target database's collation will be updated if it does not match the collation specified by the source. When this option is set, the target database's (or server's) collation should be used.
fr: Ce paramètre définit la façon dont le classement de la base de données est géré pendant le déploiement. Par défaut, le classement de la base de données cible est mis à jour s'il ne correspond pas au classement spécifié par la source. Quand cette option est définie, le classement de la base de données (ou du serveur) cible doit être utilisé.

# SchemaCompare.Description.CommentOutSetVarDeclarations
source: Specifies whether the declaration of SETVAR variables should be commented out in the generated publish script. You might choose to do this if you plan to specify the values on the command line when you publish by using a tool such as SQLCMD.EXE.
fr: Spécifie si la déclaration de variables SETVAR doit être commentée dans le script de publication généré. Vous pouvez choisir cette option si vous prévoyez de spécifier des valeurs sur la ligne de commande quand vous effectuez la publication à l'aide d'un outil, comme SQLCMD.EXE.

# SchemaCompare.Description.BlockWhenDriftDetected
source: Specifies whether to block updating a database whose schema no longer matches its registration or is unregistered.
fr: Spécifie s'il faut bloquer la mise à jour d'une base de données dont le schéma ne correspond plus à son inscription ou n'est pas inscrit.

# SchemaCompare.Description.BlockOnPossibleDataLoss
source: Specifies that the publish episode should be terminated if there is a possibility of data loss resulting from the publish operation.
fr: Spécifie que l'épisode de publication doit être arrêté en cas de risque de perte de données suite à l'opération de publication.

# SchemaCompare.Description.BackupDatabaseBeforeChanges
source: Backups the database before deploying any changes.
fr: Sauvegarde la base de données avant le déploiement de changements.

# SchemaCompare.Description.AllowIncompatiblePlatform
source: Specifies whether to attempt the action despite incompatible SQL Server platforms.
fr: Spécifie s'il faut tenter l'action en dépit de plateformes SQL Server incompatibles.

# SchemaCompare.Description.AllowDropBlockingAssemblies
source: This property is used by SqlClr deployment to cause any blocking assemblies to be dropped as part of the deployment plan. By default, any blocking/referencing assemblies will block an assembly update if the referencing assembly needs to be dropped.
fr: Cette propriété est utilisée par le déploiement SqlClr pour permettre la suppression de tout assembly bloquant dans le cadre du plan de déploiement. Par défaut, un assembly bloquant ou de référence bloque une mise à jour d'assembly s'il faut supprimer l'assembly de référence.

# SchemaCompare.Description.DropConstraintsNotInSource
source: Specifies whether constraints that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
fr: Spécifie si des contraintes qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez dans une base de données.

# SchemaCompare.Description.DropDmlTriggersNotInSource
source: Specifies whether DML triggers that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
fr: Spécifie si les déclencheurs DML qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimés de la base de données cible quand vous publiez dans une base de données.

# SchemaCompare.Description.DropExtendedPropertiesNotInSource
source: Specifies whether extended properties that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
fr: Spécifie si les propriétés étendues qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez dans une base de données.

# SchemaCompare.Description.DropIndexesNotInSource
source: Specifies whether indexes that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
fr: Spécifie si des index qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimés de la base de données cible quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreFileAndLogFilePath
source: Specifies whether differences in the paths for files and log files should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de chemin de fichier et fichier journal doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreExtendedProperties
source: Specifies whether extended properties should be ignored.
fr: Spécifie si les propriétés étendues doivent être ignorées.

# SchemaCompare.Description.IgnoreDmlTriggerState
source: Specifies whether differences in the enabled or disabled state of DML triggers should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'état activé ou désactivé des déclencheurs DML doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreDmlTriggerOrder
source: Specifies whether differences in the order of Data Manipulation Language (DML) triggers should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'ordre des déclencheurs de langage de manipulation de données (DML) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreDefaultSchema
source: Specifies whether differences in the default schema should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de schéma par défaut doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreDdlTriggerState
source: Specifies whether differences in the enabled or disabled state of Data Definition Language (DDL) triggers should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'état activé ou désactivé des déclencheurs de langage de description de données (DDL) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreDdlTriggerOrder
source: Specifies whether differences in the order of Data Definition Language (DDL) triggers should be ignored or updated when you publish to a database or server.
fr: Spécifie si les différences d'ordre des déclencheurs de langage de description de données (DDL) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreCryptographicProviderFilePath
source: Specifies whether differences in the file path for the cryptographic provider should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de chemin de fichier du fournisseur de chiffrement doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.VerifyDeployment
source: Specifies whether checks should be performed before publishing that will stop the publish action if issues are present that might block successful publishing. For example, your publish action might stop if you have foreign keys on the target database that do not exist in the database project, and that will cause errors when you publish.
fr: Spécifie s'il faut effectuer avant la publication des vérifications qui arrêtent l'action de publication quand des problèmes risquant de bloquer la publication sont détectés. Par exemple, l'action de publication peut s'arrêter si vous avez des clés étrangères sur la base de données cible qui n'existent pas dans le projet de base de données, ce qui entraîne des erreurs pendant la publication.

# SchemaCompare.Description.IgnoreComments
source: Specifies whether differences in the comments should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de commentaire doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreColumnCollation
source: Specifies whether differences in the column collations should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de classement de colonnes doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreAuthorizer
source: Specifies whether differences in the Authorizer should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de l'agent d'autorisation doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreAnsiNulls
source: Specifies whether differences in the ANSI NULLS setting should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de paramètre ANSI NULLS doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.GenerateSmartDefaults
source: Automatically provides a default value when updating a table that contains data with a column that does not allow null values.
fr: Fournit automatiquement une valeur par défaut pendant la mise à jour d'une table dont les données comprennent une colonne qui n'autorise pas les valeurs Null.

# SchemaCompare.Description.DropStatisticsNotInSource
source: Specifies whether statistics that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
fr: Spécifie si les statistiques qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez dans une base de données.

# SchemaCompare.Description.DropRoleMembersNotInSource
source: Specifies whether role members that are not defined in the database snapshot (.dacpac) file will be dropped from the target database when you publish updates to a database.</
fr: Spécifie si les membres de rôle qui ne sont pas définis dans le fichier d'instantané de base de données (.dacpac) sont supprimés de la base de données cible quand vous publiez des mises à jour sur une base de données.</

# SchemaCompare.Description.DropPermissionsNotInSource
source: Specifies whether permissions that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish updates to a database.
fr: Spécifie si les autorisations qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimées de la base de données cible quand vous publiez des mises à jour sur une base de données.

# SchemaCompare.Description.DropObjectsNotInSource
source: Specifies whether objects that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database. This value takes precedence over DropExtendedProperties.
fr: Spécifie si les objets qui n'existent pas dans le fichier d'instantané de base de données (.dacpac) doivent être supprimés de la base de données cible quand vous publiez dans une base de données. Cette valeur est prioritaire sur DropExtendedProperties.

# SchemaCompare.Description.IgnoreColumnOrder
source: Specifies whether differences in table column order should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'ordre des colonnes de table doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# schemaCompareDialog.cancel
source: Cancel
fr: Annuler

# schemaCompareDialog.TargetTitle
source: Target
fr: Cible

# schemaCompareDialog.fileTextBoxLabel
source: File
fr: Fichier

# schemaCompare.dacpacRadioButtonLabel
source: Data-tier Application File (.dacpac)
fr: Fichier d'application de la couche Données (.dacpac)

# schemaCompare.databaseButtonLabel
source: Database
fr: Base de données

# schemaCompareDialog.serverDropdownTitle
source: Server
fr: Serveur

# schemaCompareDialog.databaseDropdownTitle
source: Database
fr: Base de données

# schemaCompare.noActiveConnectionsText
source: No active connections
fr: Aucune connexion active

# schemaCompare.dialogTitle
source: Schema Compare
fr: Comparaison de schémas

# schemaCompareDialog.differentSourceMessage
source: A different source schema has been selected. Compare to see the comparison?
fr: Un autre schéma source a été sélectionné. Comparer pour voir les différences ?

# schemaCompareDialog.differentTargetMessage
source: A different target schema has been selected. Compare to see the comparison?
fr: Un autre schéma cible a été sélectionné. Comparer pour voir les différences ?

# schemaCompareDialog.differentSourceTargetMessage
source: Different source and target schemas have been selected. Compare to see the comparison?
fr: Vous avez sélectionné des schémas cible et source différents. Comparer pour voir les différences ?

# schemaCompareDialog.Yes
source: Yes
fr: Oui

# schemaCompareDialog.No
source: No
fr: Non

# schemaCompare.openFile
source: Open
fr: Ouvrir

# schemaCompareDialog.defaultUser
source: default
fr: par défaut

# schemaCompare.CompareDetailsTitle
source: Compare Details
fr: Comparer les détails

# schemaCompare.ApplyConfirmation
source: Are you sure you want to update the target?
fr: Voulez-vous vraiment mettre à jour la cible ?

# schemaCompare.RecompareToRefresh
source: Press Compare to refresh the comparison.
fr: Appuyez sur Comparer pour actualiser la comparaison.

# schemaCompare.generateScriptEnabledButton
source: Generate script to deploy changes to target
fr: Générer un script pour déployer les changements sur la cible

# schemaCompare.generateScriptNoChanges
source: No changes to script
fr: Aucun changement de script

# schemaCompare.applyButtonEnabledTitle
source: Apply changes to target
fr: Appliquer les changements à la cible

# schemaCompare.applyNoChanges
source: No changes to apply
fr: Aucun changement à appliquer

# schemaCompare.deleteAction
source: Delete
fr: Supprimer

# schemaCompare.changeAction
source: Change
fr: Changer

# schemaCompare.addAction
source: Add
fr: Ajouter

# schemaCompare.Title
source: Schema Compare
fr: Comparaison de schémas

# schemaCompare.targetLabel
source: Target
fr: Cible
