Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/extensions/schema-compare.*.xlf
Languages: fr

# schemaCompare.waitText
source: Initializing Comparison. This might take a moment.
fr: Initialisation de la comparaison. Cette opération peut durer un certain temps.

# schemaCompare.startText
source: To compare two schemas, first select a source schema and target schema, then press Compare.
fr: Pour comparer deux schémas, sélectionnez d'abord un schéma source et un schéma cible, puis appuyez sur Comparer.

# schemaCompare.noDifferences
source: No schema differences were found.
fr: Aucune différence de schéma.

# schemaCompare.compareErrorMessage
source: Schema Compare failed: {0}
fr: La comparaison de schémas a échoué : {0}

# schemaCompare.sourceNameColumn
source: Source Name
fr: Nom de la source

# schemaCompare.includeColumnName
source: Include
fr: Inclure

# schemaCompare.targetNameColumn
source: Target Name
fr: Nom de la cible

# schemaCompare.generateScriptButtonDisabledTitle
source: Generate script is enabled when the target is a database
fr: La génération de script est activée quand la cible est une base de données

# schemaCompare.applyButtonDisabledTitle
source: Apply is enabled when the target is a database
fr: L'option Appliquer est activée quand la cible est une base de données

# schemaCompare.compareButton
source: Compare
fr: Comparer

# schemaCompare.compareButtonTitle
source: Compare
fr: Comparer

# schemaCompare.cancelCompareButton
source: Stop
fr: Arrêter

# schemaCompare.cancelCompareButtonTitle
source: Stop
fr: Arrêter

# schemaCompare.cancelErrorMessage
source: Cancel schema compare failed: '{0}'
fr: L'annulation de la comparaison de schémas a échoué : '{0}'

# schemaCompare.generateScriptButton
source: Generate script
fr: Générer le script

# schemaCompare.generateScriptErrorMessage
source: Generate script failed: '{0}'
fr: La génération de script a échoué : '{0}'

# schemaCompare.updateButton
source: Apply
fr: Appliquer

# schemaCompare.ApplyYes
source: Yes
fr: Oui

# schemaCompare.updateErrorMessage
source: Schema Compare Apply failed '{0}'
fr: L'application de la comparaison de schémas a échoué '{0}'

# schemaCompare.switchDirectionButton
source: Switch direction
fr: Changer de sens

# schemaCompare.switchButtonTitle
source: Switch source and target
fr: Basculer entre la source et la cible

# schemaCompare.sourceButtonTitle
source: Select Source
fr: Sélectionner la source

# schemaCompare.targetButtonTitle
source: Select Target
fr: Sélectionner la cible

# schemaCompare.openScmpButton
source: Open .scmp file
fr: Ouvrir le fichier .scmp

# schemaCompare.openScmpButtonTitle
source: Load source, target, and options saved in an .scmp file
fr: Charger la source, la cible et les options enregistrées dans un fichier .scmp

# schemaCompare.openScmpErrorMessage
source: Open scmp failed: '{0}'
fr: L'ouverture de scmp a échoué : '{0}'

# schemaCompare.saveScmpButton
source: Save .scmp file
fr: Enregistrer le fichier .scmp

# schemaCompare.saveScmpButtonTitle
source: Save source and target, options, and excluded elements
fr: Enregistrer la source et la cible, les options et les éléments exclus

# schemaCompare.saveFile
source: Save
fr: Enregistrer

# schemaCompare.saveScmpErrorMessage
source: Save scmp failed: '{0}'
fr: L'enregistrement de scmp a échoué : '{0}'
