Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/extensions/schema-compare.*.xlf
Languages: fr

# displayName
source: SQL Server Schema Compare
fr: Comparaison de schémas SQL Server

# description
source: SQL Server Schema Compare for Azure Data Studio supports comparing the schemas of databases and dacpacs.
fr: La comparaison de schémas SQL Server pour Azure Data Studio prend en charge la comparaison des schémas de bases de données et de fichiers dacpac.

# schemaCompare.start
source: Schema Compare
fr: Comparaison de schémas

# SchemaCompareOptionsDialog.Cancel
source: Cancel
fr: Annuler

# SchemaCompareOptionsDialog.Reset
source: Reset
fr: Réinitialiser

# SchemaCompareOptionsDialog.Yes
source: Yes
fr: Oui

# SchemaCompareOptionsDialog.No
source: No
fr: Non

# schemaCompareOptions.RecompareMessage
source: Options have changed. Recompare to see the comparison?
fr: Les options ont changé. Relancer la comparaison pour voir les différences ?

# SchemaCompare.SchemaCompareOptionsDialogLabel
source: Schema Compare Options
fr: Options de comparaison de schémas

# SchemaCompare.GeneralOptionsLabel
source: General Options
fr: Options générales

# SchemaCompare.ObjectTypesOptionsLabel
source: Include Object Types
fr: Inclure les types d'objet

# SchemaCompare.IgnoreTableOptions
source: Ignore Table Options
fr: Ignorer les options de table

# SchemaCompare.IgnoreSemicolonBetweenStatements
source: Ignore Semicolon Between Statements
fr: Ignorer le point-virgule entre les instructions

# SchemaCompare.IgnoreRouteLifetime
source: Ignore Route Lifetime
fr: Ignorer la durée de vie de la route

# SchemaCompare.IgnoreRoleMembership
source: Ignore Role Membership
fr: Ignorer l'appartenance à un rôle

# SchemaCompare.IgnoreQuotedIdentifiers
source: Ignore Quoted Identifiers
fr: Ignorer les identificateurs entre guillemets

# SchemaCompare.IgnorePermissions
source: Ignore Permissions
fr: Ignorer les autorisations

# SchemaCompare.IgnorePartitionSchemes
source: Ignore Partition Schemes
fr: Ignorer les schémas de partition

# SchemaCompare.IgnoreObjectPlacementOnPartitionScheme
source: Ignore Object Placement On Partition Scheme
fr: Ignorer le placement d'objet sur le schéma de partition

# SchemaCompare.IgnoreNotForReplication
source: Ignore Not For Replication
fr: Ignorer l'option Pas pour la réplication

# SchemaCompare.IgnoreLoginSids
source: Ignore Login Sids
fr: Ignorer les SID de connexion

# SchemaCompare.IgnoreLockHintsOnIndexes
source: Ignore Lock Hints On Indexes
fr: Ignorer les indicateurs de verrou sur les index

# SchemaCompare.IgnoreKeywordCasing
source: Ignore Keyword Casing
fr: Ignorer la casse des mots clés

# SchemaCompare.IgnoreIndexPadding
source: Ignore Index Padding
fr: Ignorer le remplissage d'index

# SchemaCompare.IgnoreIndexOptions
source: Ignore Index Options
fr: Ignorer les options d'index

# SchemaCompare.IgnoreIncrement
source: Ignore Increment
fr: Ignorer l'incrément

# SchemaCompare.IgnoreIdentitySeed
source: Ignore Identity Seed
fr: Ignorer le seed d'identité

# SchemaCompare.IgnoreUserSettingsObjects
source: Ignore User Settings Objects
fr: Ignorer les objets des paramètres utilisateur

# SchemaCompare.IgnoreFullTextCatalogFilePath
source: Ignore Full Text Catalog FilePath
fr: Ignorer le chemin de fichier du catalogue de texte intégral

# SchemaCompare.IgnoreWhitespace
source: Ignore Whitespace
fr: Ignorer les espaces blancs

# SchemaCompare.IgnoreWithNocheckOnForeignKeys
source: Ignore With Nocheck On ForeignKeys
fr: Ignorer WITH NOCHECK sur les clés étrangères

# SchemaCompare.VerifyCollationCompatibility
source: Verify Collation Compatibility
fr: Vérifier la compatibilité du classement

# SchemaCompare.UnmodifiableObjectWarnings
source: Unmodifiable Object Warnings
fr: Avertissements d'objet non modifiable

# SchemaCompare.TreatVerificationErrorsAsWarnings
source: Treat Verification Errors As Warnings
fr: Traiter les erreurs de vérification comme des avertissements

# SchemaCompare.ScriptRefreshModule
source: Script Refresh Module
fr: Module d'actualisation de script

# SchemaCompare.ScriptNewConstraintValidation
source: Script New Constraint Validation
fr: Validation de la nouvelle contrainte de script

# SchemaCompare.ScriptFileSize
source: Script File Size
fr: Taille du fichier de script

# SchemaCompare.ScriptDeployStateChecks
source: Script Deploy StateChecks
fr: StateChecks du déploiement de script

# SchemaCompare.ScriptDatabaseOptions
source: Script Database Options
fr: Options de base de données de script

# SchemaCompare.ScriptDatabaseCompatibility
source: Script Database Compatibility
fr: Compatibilité de base de données de script

# SchemaCompare.ScriptDatabaseCollation
source: Script Database Collation
fr: Classement de base de données de script

# SchemaCompare.RunDeploymentPlanExecutors
source: Run Deployment Plan Executors
fr: Exécuter des exécuteurs de plan de déploiement

# SchemaCompare.RegisterDataTierApplication
source: Register DataTier Application
fr: Inscrire l'application de la couche Données

# SchemaCompare.PopulateFilesOnFileGroups
source: Populate Files On File Groups
fr: Remplir les fichiers dans des groupes de fichiers

# SchemaCompare.NoAlterStatementsToChangeClrTypes
source: No Alter Statements To Change Clr Types
fr: Aucune instruction ALTER pour changer les types CLR

# SchemaCompare.IncludeTransactionalScripts
source: Include Transactional Scripts
fr: Inclure des scripts transactionnels

# SchemaCompare.IncludeCompositeObjects
source: Include Composite Objects
fr: Inclure des objets composites

# SchemaCompare.AllowUnsafeRowLevelSecurityDataMovement
source: Allow Unsafe Row Level Security Data Movement
fr: Autoriser le déplacement non sécurisé des données de sécurité au niveau des lignes

# SchemaCompare.IgnoreWithNocheckOnCheckConstraints
source: Ignore With No check On Check Constraints
fr: Ignorer WITH NO CHECK sur les contraintes de validation

# SchemaCompare.IgnoreFillFactor
source: Ignore Fill Factor
fr: Ignorer le facteur de remplissage

# SchemaCompare.IgnoreFileSize
source: Ignore File Size
fr: Ignorer la taille de fichier

# SchemaCompare.IgnoreFilegroupPlacement
source: Ignore Filegroup Placement
fr: Ignorer le placement de groupe de fichiers

# SchemaCompare.DoNotAlterReplicatedObjects
source: Do Not Alter Replicated Objects
fr: Ne pas modifier les objets répliqués

# SchemaCompare.DoNotAlterChangeDataCaptureObjects
source: Do Not Alter Change Data Capture Objects
fr: Ne pas modifier les objets de capture des changements de données

# SchemaCompare.DisableAndReenableDdlTriggers
source: Disable And Reenable Ddl Triggers
fr: Désactiver et réactiver les déclencheurs DDL

# SchemaCompare.DeployDatabaseInSingleUserMode
source: Deploy Database In Single User Mode
fr: Déployer la base de données en mode mono-utilisateur

# SchemaCompare.CreateNewDatabase
source: Create New Database
fr: Créer une base de données

# SchemaCompare.CompareUsingTargetCollation
source: Compare Using Target Collation
fr: Comparer à l'aide du classement cible

# SchemaCompare.CommentOutSetVarDeclarations
source: Comment Out Set Var Declarations
fr: Annuler les marques de commentaire des déclarations de variable définies

# SchemaCompare.BlockWhenDriftDetected
source: Block When Drift Detected
fr: Bloquer en cas de dérive détectée

# SchemaCompare.BlockOnPossibleDataLoss
source: Block On Possible Data Loss
fr: Bloquer en cas de perte de données possible

# SchemaCompare.BackupDatabaseBeforeChanges
source: Backup Database Before Changes
fr: Sauvegarder la base de données avant les changements

# SchemaCompare.AllowIncompatiblePlatform
source: Allow Incompatible Platform
fr: Autoriser une plateforme incompatible

# SchemaCompare.AllowDropBlockingAssemblies
source: Allow Drop Blocking Assemblies
fr: Autoriser la suppression des assemblys bloquants

# SchemaCompare.DropConstraintsNotInSource
source: Drop Constraints Not In Source
fr: Supprimer les contraintes qui ne sont pas dans la source

# SchemaCompare.DropDmlTriggersNotInSource
source: Drop Dml Triggers Not In Source
fr: Supprimer les déclencheurs DML qui ne sont pas dans la source

# SchemaCompare.DropExtendedPropertiesNotInSource
source: Drop Extended Properties Not In Source
fr: Supprimer les propriétés étendues qui ne sont pas dans la source

# SchemaCompare.DropIndexesNotInSource
source: Drop Indexes Not In Source
fr: Supprimer les index qui ne sont pas dans la source

# SchemaCompare.IgnoreFileAndLogFilePath
source: Ignore File And Log File Path
fr: Ignorer le chemin de fichier et de fichier journal

# SchemaCompare.IgnoreExtendedProperties
source: Ignore Extended Properties
fr: Ignorer les propriétés étendues

# SchemaCompare.IgnoreDmlTriggerState
source: Ignore Dml Trigger State
fr: Ignorer l'état des déclencheurs DML

# SchemaCompare.IgnoreDmlTriggerOrder
source: Ignore Dml Trigger Order
fr: Ignorer l'ordre des déclencheurs DML

# SchemaCompare.IgnoreDefaultSchema
source: Ignore Default Schema
fr: Ignorer le schéma par défaut

# SchemaCompare.IgnoreDdlTriggerState
source: Ignore Ddl Trigger State
fr: Ignorer l'état des déclencheurs DDL

# SchemaCompare.IgnoreDdlTriggerOrder
source: Ignore Ddl Trigger Order
fr: Ignorer l'ordre des déclencheurs DDL

# SchemaCompare.IgnoreCryptographicProviderFilePath
source: Ignore Cryptographic Provider FilePath
fr: Ignorer le chemin de fichier du fournisseur de chiffrement

# SchemaCompare.VerifyDeployment
source: Verify Deployment
fr: Vérifier le déploiement

# SchemaCompare.IgnoreComments
source: Ignore Comments
fr: Ignorer les commentaires

# SchemaCompare.IgnoreColumnCollation
source: Ignore Column Collation
fr: Ignorer le classement de colonne

# SchemaCompare.IgnoreAuthorizer
source: Ignore Authorizer
fr: Ignorer l'agent d'autorisation

# SchemaCompare.IgnoreAnsiNulls
source: Ignore AnsiNulls
fr: Ignorer AnsiNulls

# SchemaCompare.GenerateSmartDefaults
source: Generate SmartDefaults
fr: Générer des SmartDefaults

# SchemaCompare.DropStatisticsNotInSource
source: Drop Statistics Not In Source
fr: Supprimer les statistiques qui ne sont pas dans la source

# SchemaCompare.DropRoleMembersNotInSource
source: Drop Role Members Not In Source
fr: Supprimer les membres de rôle qui ne sont pas dans la source

# SchemaCompare.DropPermissionsNotInSource
source: Drop Permissions Not In Source
fr: Supprimer les autorisations qui ne sont pas dans la source

# SchemaCompare.DropObjectsNotInSource
source: Drop Objects Not In Source
fr: Supprimer les objets qui ne sont pas dans la source

# SchemaCompare.IgnoreColumnOrder
source: Ignore Column Order
fr: Ignorer l'ordre des colonnes

# SchemaCompare.Aggregates
source: Aggregates
fr: Agrégats

# SchemaCompare.ApplicationRoles
source: Application Roles
fr: Rôles d'application

# SchemaCompare.Assemblies
source: Assemblies
fr: Assemblys

# SchemaCompare.AssemblyFiles
source: Assembly Files
fr: Fichiers d'assembly

# SchemaCompare.AsymmetricKeys
source: Asymmetric Keys
fr: Clés asymétriques

# SchemaCompare.BrokerPriorities
source: Broker Priorities
fr: Priorités de Service Broker

# SchemaCompare.Certificates
source: Certificates
fr: Certificats

# SchemaCompare.ColumnEncryptionKeys
source: Column Encryption Keys
fr: Clés de chiffrement de colonne

# SchemaCompare.ColumnMasterKeys
source: Column Master Keys
fr: Clés principales de colonne

# SchemaCompare.Contracts
source: Contracts
fr: Contrats

# SchemaCompare.DatabaseOptions
source: Database Options
fr: Options de base de données

# SchemaCompare.DatabaseRoles
source: Database Roles
fr: Rôles de base de données

# SchemaCompare.Defaults
source: Defaults
fr: Valeurs par défaut

# SchemaCompare.ExtendedProperties
source: Extended Properties
fr: Propriétés étendues

# SchemaCompare.ExternalDataSources
source: External Data Sources
fr: Sources de données externes

# SchemaCompare.ExternalFileFormats
source: External File Formats
fr: Formats de fichier externe

# SchemaCompare.ExternalTables
source: External Tables
fr: Tables externes

# SchemaCompare.Filegroups
source: Filegroups
fr: Groupes de fichiers

# SchemaCompare.FileTables
source: File Tables
fr: Tables de fichiers

# SchemaCompare.FullTextCatalogs
source: Full Text Catalogs
fr: Catalogues de texte intégral

# SchemaCompare.FullTextStoplists
source: Full Text Stoplists
fr: Listes de mots vides de texte intégral

# SchemaCompare.MessageTypes
source: Message Types
fr: Types de messages

# SchemaCompare.PartitionFunctions
source: Partition Functions
fr: Fonctions de partition

# SchemaCompare.PartitionSchemes
source: Partition Schemes
fr: Schémas de partition

# SchemaCompare.Permissions
source: Permissions
fr: Autorisations

# SchemaCompare.Queues
source: Queues
fr: Files d'attente

# SchemaCompare.RemoteServiceBindings
source: Remote Service Bindings
fr: Liaisons de service distant

# SchemaCompare.RoleMembership
source: Role Membership
fr: Appartenance au rôle

# SchemaCompare.Rules
source: Rules
fr: Règles

# SchemaCompare.ScalarValuedFunctions
source: Scalar Valued Functions
fr: Fonctions scalaires

# SchemaCompare.SearchPropertyLists
source: Search Property Lists
fr: Listes de propriétés de recherche

# SchemaCompare.SecurityPolicies
source: Security Policies
fr: Stratégies de sécurité

# SchemaCompare.Sequences
source: Sequences
fr: Séquences

# SchemaCompare.Synonyms
source: Synonyms
fr: Synonymes

# SchemaCompare.TableValuedFunctions
source: Table Valued Functions
fr: Fonctions table

# SchemaCompare.UserDefinedDataTypes
source: User Defined Data Types
fr: Types de données définis par l'utilisateur

# SchemaCompare.UserDefinedTableTypes
source: User Defined Table Types
fr: Types de table définis par l'utilisateur

# SchemaCompare.ClrUserDefinedTypes
source: Clr User Defined Types
fr: Types CLR définis par l'utilisateur

# SchemaCompare.Users
source: Users
fr: Utilisateurs

# SchemaCompare.Views
source: Views
fr: Vues

# SchemaCompare.XmlSchemaCollections
source: Xml Schema Collections
fr: Collections de schémas XML

# SchemaCompare.Credentials
source: Credentials
fr: Informations d'identification

# SchemaCompare.CryptographicProviders
source: Cryptographic Providers
fr: Fournisseurs de chiffrement

# SchemaCompare.DatabaseAuditSpecifications
source: Database Audit Specifications
fr: Spécifications de l'audit de base de données

# SchemaCompare.DatabaseEncryptionKeys
source: Database Encryption Keys
fr: Clés de chiffrement de base de données

# SchemaCompare.DatabaseScopedCredentials
source: Database Scoped Credentials
fr: Informations d'identification limitées à la base de données

# SchemaCompare.Endpoints
source: Endpoints
fr: Points de terminaison

# SchemaCompare.ErrorMessages
source: Error Messages
fr: Messages d'erreur

# SchemaCompare.EventNotifications
source: Event Notifications
fr: Notifications d'événements

# SchemaCompare.EventSessions
source: Event Sessions
fr: Sessions d'événements

# SchemaCompare.LinkedServerLogins
source: Linked Server Logins
fr: Connexions de serveur lié

# SchemaCompare.LinkedServers
source: Linked Servers
fr: Serveurs liés

# SchemaCompare.Logins
source: Logins
fr: Connexions

# SchemaCompare.MasterKeys
source: Master Keys
fr: Clés principales

# SchemaCompare.ServerAuditSpecifications
source: Server Audit Specifications
fr: Spécifications de l'audit de serveur

# SchemaCompare.ServerRoleMembership
source: Server Role Membership
fr: Appartenance au rôle serveur

# SchemaCompare.ServerRoles
source: Server Roles
fr: Rôles serveur

# SchemaCompare.ServerTriggers
source: Server Triggers
fr: Déclencheurs de serveur

# SchemaCompare.Description.IgnoreTableOptions
source: Specifies whether differences in the table options will be ignored or updated when you publish to a database.
fr: Spécifie si les différences des options de table sont ignorées ou mises à jour pour la publication dans une base de données.

# SchemaCompare.Description.IgnoreSemicolonBetweenStatements
source: Specifies whether differences in the semi-colons between T-SQL statements will be ignored or updated when you publish to a database.
fr: Spécifie si les différences de point-virgule des instructions T-SQL sont ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreRouteLifetime
source: Specifies whether differences in the amount of time that SQL Server retains the route in the routing table should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de durée de conservation de la route dans la table de route par SQL Server doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreRoleMembership
source: Specifies whether differences in the role membership of logins should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'appartenance au rôle des connexions doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreQuotedIdentifiers
source: Specifies whether differences in the quoted identifiers setting should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de paramètre des identificateurs entre guillemets doivent être ignorées ou mises à jour en case de publication dans une base de données.

# SchemaCompare.Description.IgnorePermissions
source: Specifies whether permissions should be ignored.
fr: Spécifie si les autorisations doivent être ignorées.

# SchemaCompare.Description.IgnorePartitionSchemes
source: Specifies whether differences in partition schemes and functions should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de schéma et fonction de partition doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreObjectPlacementOnPartitionScheme
source: Specifies whether an object's placement on a partition scheme should be ignored or updated when you publish to a database.
fr: Spécifie si le placement d'un objet dans un schéma de partition doit être ignoré ou mis à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreNotForReplication
source: Specifies whether the not for replication settings should be ignored or updated when you publish to a database.
fr: Spécifie si le paramètre Pas pour la réplication doit être ignoré ou mis à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreLoginSids
source: Specifies whether differences in the security identification number (SID) should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de numéro d'identification de sécurité (SID) doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreLockHintsOnIndexes
source: Specifies whether differences in the lock hints on indexes should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'indicateur de verrou sur les index doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreKeywordCasing
source: Specifies whether differences in the casing of keywords should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de casse des mots clés doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreIndexPadding
source: Specifies whether differences in the index padding should be ignored or updated when you publish to a database.
fr: Spécifie si les différences de remplissage d'index doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreIndexOptions
source: Specifies whether differences in the index options should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'option d'index doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreIncrement
source: Specifies whether differences in the increment for an identity column should be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'incrément d'une colonne d'identité doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreIdentitySeed
source: Specifies whether differences in the seed for an identity column should be ignored or updated when you publish updates to a database.
fr: Spécifie si les différences de seed d'une colonne d'identité doivent être ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreUserSettingsObjects
source: Specifies whether differences in the user settings objects will be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'objet de paramètres utilisateur sont ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreFullTextCatalogFilePath
source: Specifies whether differences in the file path for the full-text catalog should be ignored or whether a warning should be issued when you publish to a database.
fr: Spécifie si les différences de chemin du catalogue de texte intégral doivent être ignorées ou si un avertissement doit être émis quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreWhitespace
source: Specifies whether differences in white space will be ignored or updated when you publish to a database.
fr: Spécifie si les différences d'espace blanc sont ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.IgnoreWithNocheckOnForeignKeys
source: Specifies whether differences in the value of the WITH NOCHECK clause for foreign keys will be ignored or updated when you publish to a database.
fr: Spécifie si les différences de valeur de la clause WITH NOCHECK pour les clés étrangères sont ignorées ou mises à jour quand vous publiez dans une base de données.

# SchemaCompare.Description.VerifyCollationCompatibility
source: Specifies whether collation compatibility is verified.
fr: Spécifie si la compatibilité du classement est vérifiée.

# SchemaCompare.Description.UnmodifiableObjectWarnings
source: Specifies whether warnings should be generated when differences are found in objects that cannot be modified, for example, if the file size or file paths were different for a file.
fr: Spécifie si des avertissements doivent être générés en cas de différences détectées dans des objets non modifiables, par exemple, si la taille de fichier ou les chemins de fichier sont différents pour un fichier.
