Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/*-mssql.sql-bindings-vscode.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# enterPasswordPrompt
source: (Optional) Enter connection password to save in local.settings.json
de: (Optional) Geben Sie das Verbindungskennwort ein, das in "local.settings.json" gespeichert werden soll.
es: (Opcional) Escriba la contraseña de conexión para guardar en local.settings.json
fr: (Facultatif) Entrez le mot de passe de connexion à enregistrer dans local.settings.json
it: (Facoltativo) Immettere la password di connessione da salvare in local.settings.json
ja: (省略可能) local.settings.json に保存する接続パスワードを入力する
ko: (선택 사항) local.settings.json에 저장할 연결 암호 입력
pt_br: (Opcional) Insira a senha de conexão para salvar em local.settings.json
ru: (Необязательно) Введите пароль подключения для сохранения в local.settings.json
zh_hans: (可选) 输入连接密码以保存在 local.settings.json 中
zh_hant: (選擇性) 輸入要儲存在 local.settings.json 中的連線密碼

# azureFunctionsProjectMustBeOpened
source: A C# Azure Functions project must be present in order to create a new Azure Function with SQL binding.
de: Zum Erstellen einer neuen Azure-Funktion mit SQL-Bindung muss ein C#-Azure Functions-Projekt vorhanden sein.
es: Debe haber un proyecto de Azure Functions de C# para crear una nueva función de Azure con enlace SQL.
fr: Un projet Azure Functions C# doit être présent pour créer une fonction Azure avec liaison SQL.
it: Per creare una nuova funzione di Azure con associazione SQL, deve essere presente un progetto di Funzioni di Azure C#.
ja: SQL バインドに新しい Azure 関数を作成するには、C# Azure Functions プロジェクトが存在する必要があります。
ko: SQL 바인딩을 사용하여 새 Azure 함수를 만들려면 C# Azure Functions 프로젝트가 있어야 합니다.
pt_br: Um projeto do Azure Functions C# deve estar presente para criar uma nova Função do Azure com associação SQL.
ru: Для создания новой Функции Azure с привязкой SQL должен присутствовать проект C# Функций Azure.
zh_hans: 必须存在 C# Azure Functions 项目才能使用创建包含 SQL 绑定的新的 Azure 函数。
zh_hant: 必須要有 C# Azure Functions 專案，才能以 SQL 繫結建立新的 Azure 函數。

source: Add Package
de: Paket hinzufügen
es: Agregar paquete
fr: Ajouter un package
it: Aggiungi pacchetto
ja: パッケージの追加
ko: 패키지 추가
pt_br: Adicionar Pacote
ru: Добавить пакет
zh_hans: 添加包
zh_hant: 新增套件

# addSqlBinding
source: Adding SQL Binding to function "{0}"...
de: SQL-Bindung wird der Funktion "{0}" hinzugefügt...
es: Agregando enlace SQL a la función "{0}"...
fr: Ajout de la liaison SQL à la fonction {0}...
it: Aggiunta dell'associazione SQL alla funzione "{0}"...
ja: 関数 "{0}" に SQL バインドを追加しています...
ko: 함수 "{0}"에 SQL 바인딩을 추가하는 중...
pt_br: Adicionando Associação SQL à função "{0}"...
ru: Добавление привязки SQL к функции "{0}"...
zh_hans: 正在将 SQL 绑定添加到函数“{0}”...
zh_hant: 正在將 SQL 繫結新增至函數 "{0}"...

# dotnetResult
source: Adding SQL nuget package: {0}
de: SQL-NuGet-Paket wird hinzugefügt: {0}
es: Agregando paquete nuget de SQL: {0}
fr: Ajout du package NuGet SQL : {0}
it: Aggiunta del pacchetto NuGet SQL: {0}
ja: SQL NuGet パッケージを追加しています: {0}
ko: SQL 너겟 패키지 추가: {0}
pt_br: Adicionando o pacote nuget do SQL: {0}
ru: Добавление пакета NuGet SQL: {0}
zh_hans: 正在添加 SQL nuget 包: {0}
zh_hant: 正在新增 SQL Nuget 套件: {0}

# failedToGetConnectionString
source: An error occurred generating the connection string for the selected connection
de: Beim Generieren der Verbindungszeichenfolge für die ausgewählte Verbindung ist ein Fehler aufgetreten.
es: Se ha producido un error al generar la cadena de conexión para la conexión seleccionada
fr: Une erreur s’est produite lors de la génération de la chaîne de connexion pour la connexion sélectionnée.
it: Errore durante la generazione della stringa di connessione per la connessione selezionata
ja: 選択した接続の接続文字列の生成でエラーが発生しました
ko: 선택한 연결에 대한 연결 문자열을 생성하는 동안 오류가 발생했습니다.
pt_br: Erro ao gerar a cadeia de conexão para a conexão selecionada
ru: Произошла ошибка при создании строки подключения для выбранного подключения
zh_hans: 生成所选连接的连接字符串时出错
zh_hant: 為選取的連線產生連接字串時發生錯誤

# azureFunctionsExtensionNotInstalled
source: Azure Functions extension must be installed in order to use this feature.
de: Azure Functions-Erweiterung muss installiert sein, um dieses Feature verwenden zu können.
es: La extensión de Azure Functions debe estar instalada para poder usar esta característica.
fr: Azure Functions extension doit être installée pour pouvoir utiliser cette fonctionnalité.
it: L'estensione Funzioni di Azure deve essere installata per poter usare questa funzione.
ja: この機能を使用するには、Azure Functions 拡張機能をインストールする必要があります。
ko: 이 기능을 사용하려면 Azure Functions 확장을 설치해야 합니다.
pt_br: A extensão Azure Functions deve ser instalada para usar este recurso.
ru: Для использования этого компонента необходимо установить расширение \"Функции Azure\".
zh_hans: 必须安装 Azure Functions 扩展才能使用此功能。
zh_hant: 必須安裝 Azure Functions 延伸模組，才能使用此功能。

# browseEllipsis
source: Browse...
de: Durchsuchen...
es: Examinar...
fr: Parcourir...
it: Sfoglia...
ja: 参照...
ko: 찾아보기...
pt_br: Procurar...
ru: Обзор...
zh_hans: 浏览...
zh_hant: 瀏覽...

# closeButton
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# connectionStringSetting
source: Connection string setting name
de: Name der Verbindungszeichenfolge-Einstellung
es: Nombre de configuración de la cadena de conexión
fr: Nom du paramètre de la chaîne de connexion
it: Nome dell'impostazione della stringa di connessione
ja: 接続文字列の設定名
ko: 연결 문자열 설정 이름
pt_br: Nome da configuração da cadeia de conexão
ru: Имя параметра строки подключения
zh_hans: 连接字符串设置名称
zh_hant: 連接字串設定名稱

# connectionStringSettingPlaceholder
source: Connection string setting specified in "local.settings.json"
de: In "local.settings.json" angegebene Verbindungszeichenfolgeneinstellung
es: La configuración de cadena de conexión está especificada en "local.settings.json"
fr: Paramètre de chaîne de connexion spécifié dans « local.settings.json »
it: Impostazione della stringa di connessione specificata in "local.settings.jsin"
ja: "local.settings.json" で指定された接続文字列の設定
ko: "local.settings.json"에 지정된 연결 문자열 설정
pt_br: Configuração da cadeia de conexão especificada em "local.settings.json"
ru: Параметр строки подключения указан в "local.settings.js".
zh_hans: "local.settings.json" 中指定的连接字符串设置
zh_hant: 在 "local.settings.json" 中指定的連接字串設定

# createProject
source: Create Azure Function Project
de: Erstellen eines Azure-Funktionsprojekts
es: Crear proyecto de Azure Function
fr: Créer un projet Azure Function
it: Creare un progetto di funzione di Azure
ja: Azure 関数プロジェクトの作成
ko: Azure 함수 프로젝트 만들기
pt_br: Criar projeto de função do Azure
ru: Создание проекта Функции Azure
zh_hans: 创建 Azure 函数项目
zh_hant: 建立 Azure 函數專案

source: Create new local app setting
de: Neue lokale App-Einstellung erstellen
es: Crear nueva configuración de aplicación local
fr: Créer un paramètre d’application locale
it: Creare nuova impostazione dell'app locale
ja: 新しいローカル アプリ設定を作成する
ko: 새 로컬 앱 설정 만들기
pt_br: Criar nova configuração de aplicativo local
ru: Создать новый параметр локального приложения
zh_hans: 创建新的本地应用设置
zh_hant: 建立新的本機應用程式設定

source: Do not install
de: Nicht installieren
es: No instalar
fr: Ne pas installer
it: Non installare
ja: インストールしない
ko: 설치하지 마세요
pt_br: Não instalar
ru: Не устанавливать
zh_hans: 不安装
zh_hant: 不要安裝

# includePassword
source: Do you want to include the password from this connection in your local.settings.json file?
de: Möchten Sie das Kennwort aus dieser Verbindung in Ihre local.settings.json-Datei aufnehmen?
es: ¿Quiere incluir la contraseña de esta conexión en el archivo local.settings.json?
fr: Voulez-vous inclure le mot de passe de cette connexion dans votre fichier local.settings.json ?
it: Includere la password di questa connessione nel file local.settings.json?
ja: local.settings.json ファイルに、この接続からのパスワードを含めますか?
ko: 이 연결의 암호를 local.settings.json 파일에 포함하시겠어요?
pt_br: Deseja incluir a senha desta conexão em seu arquivo local.settings.json?
ru: Вы хотите добавить пароль этого подключения в файл local.settings.json?
zh_hans: 是否要将此连接中的密码包含在 local.settings.json 文件中?
zh_hant: 是否要在 local.settings.json 檔案中包含來自此連線的密碼?

# enterTableName
source: Enter SQL table to query
de: SQL-Tabelle für Abfrage eingeben
es: Escriba la tabla SQL que desea consultar
fr: Entrer la table SQL à interroger
it: Immettere la tabella SQL per eseguire una query
ja: SQL テーブルをクエリに入力する
ko: 쿼리할 SQL 테이블 입력
pt_br: Insira a tabela SQL a ser consultada
ru: Введите таблицу SQL для запроса
zh_hans: 输入要查询的 SQL 表
zh_hant: 輸入要查詢的 SQL 資料表

# enterTableNameToUpsert
source: Enter SQL table to upsert into
de: SQL-Tabelle für Upsert eingeben
es: Escriba la tabla SQL en la que se va a realizar la actualización
fr: Entrez la table SQL dans laquelle effectuer l’upsert
it: Immettere la tabella SQL in cui eseguire l'upsert
ja: アップサート先の SQL テーブルを入力する
ko: Upsert할 SQL 테이블 입력
pt_br: Insira a tabela SQL na qual executar upsert
ru: Введите таблицу SQL для вставки
zh_hans: 输入要更新插入到的 SQL 表
zh_hant: 輸入 SQL 資料表以 upsert

# enterViewName
source: Enter SQL view to query
de: SQL-Sicht für Abfrage eingeben
es: Escriba la vista SQL que desea consultar
fr: Entrer la vue SQL à interroger
it: Immettere la visualizzazione SQL per eseguire una query
ja: SQL ビューをクエリに入力する
ko: 쿼리할 SQL 보기 입력
pt_br: Inserir a exibição SQL para consultar
ru: Введите режим SQL для запроса
zh_hans: 输入要查询的 SQL 视图
zh_hant: 輸入要查詢的 SQL 檢視

# userConnectionString
source: Enter connection string
de: Verbindungszeichenfolge eingeben
es: Escriba la cadena de conexión.
fr: Entrer une chaîne de connexion
it: Immettere la stringa di connessione
ja: 接続文字列を入力してください
ko: 연결 문자열 입력
pt_br: Inserir cadeia de conexão
ru: Введите строку подключения
zh_hans: 输入连接字符串
zh_hant: 輸入連接字串

source: Enter connection string
de: Verbindungszeichenfolge eingeben
es: Escriba la cadena de conexión.
fr: Entrer une chaîne de connexion
it: Immettere la stringa di connessione
ja: 接続文字列を入力してください
ko: 연결 문자열 입력
pt_br: Inserir cadeia de conexão
ru: Введите строку подключения
zh_hans: 输入连接字符串
zh_hant: 輸入連接字串

source: Enter connection string setting name
de: Name der Verbindungszeichenfolge-Einstellung eingeben
es: Escriba el nombre de la configuración de la cadena de conexión
fr: Entrer le nom du paramètre de la chaîne de connexion
it: Immettere il nome dell'impostazione della stringa di connessione
ja: 接続文字列の設定名を入力してください
ko: 연결 문자열 설정 이름 입력
pt_br: Insira o nome da configuração da cadeia de conexão
ru: Введите имя параметра строки подключения
zh_hans: 输入连接字符串设置名称
zh_hant: 輸入連接字串設定名稱

# errorNewAzureFunction
source: Error creating new Azure Function: {0}
de: Fehler beim Erstellen einer neuen Azure-Funktion: {0}
es: Error al crear la nueva función de Azure: {0}
fr: Erreur lors de la création d’une fonction Azure : {0}
it: Errore durante la creazione della nuova funzione di Azure: {0}
ja: 新しい Azure 関数の作成中のエラー: {0}
ko: 새 Azure 함수를 만드는 동안 오류가 발생했습니다. {0}
pt_br: Erro ao criar uma nova Função do Azure: {0}
ru: Ошибка при создании новой функции Azure: {0}
zh_hans: 创建新的 Azure 函数时出错: {0}
zh_hant: 建立新的 Azure 函式時發生錯誤: {0}

# failedToParse
source: Failed to parse "{0}": {1}.
de: Fehler beim Analysieren von "{0}": {1}.
es: No se pudo analizar "{0}": {1}.
fr: Échec de l'analyse de "{0}" : {1}.
it: Non è stato possibile analizzare "{0}": {1}.
ja: "{0}" を解析できませんでした: {1}。
ko: {0}을(를) 구문 분석하지 못했습니다. {1}.
pt_br: Falha ao analisar "{0}": {1}.
ru: Не удалось проанализировать "{0}": {1}.
zh_hans: 未能解析“{0}”: {1}。
zh_hant: 無法剖析 "{0}": {1}。

# unableToSetConnectionString
source: Failed to set connection string app setting
de: Fehler beim Festlegen der App-Einstellung für die Verbindungszeichenfolge
es: No se ha podido establecer la configuración de la aplicación de cadena de conexión
fr: Échec du paramétrage de l'application de la chaîne de connexion
it: Impossibile impostare la stringa di connessione dell'app
ja: 接続文字列アプリの設定を設定できませんでした
ko: 연결 문자열 앱 설정을 설정하지 못했습니다.
pt_br: Falha ao definir a configuração do aplicativo da cadeia de conexão
ru: Не удалось настроить параметр приложения строки подключения
zh_hans: 无法设置连接字符串应用设置
zh_hant: 無法設定連接字串應用程式設定

# failedToSetSetting
source: Failed to set connection string app setting: {0}
de: Fehler beim Festlegen der App-Einstellung für die Verbindungszeichenfolge: {0}
es: No se ha podido establecer la configuración de la aplicación de cadena de conexión: {0}
fr: Échec du paramétrage de l'application de la chaîne de connexion : {0}
it: Impossibile impostare la stringa di connessione dell'app: {0}
ja: 接続文字列アプリの設定を設定できませんでした: {0}
ko: 연결 문자열 앱 설정을 설정하지 못했습니다. {0}
pt_br: Falha ao definir a configuração do aplicativo da cadeia de conexão: {0}
ru: Не удалось настроить параметр приложения строки подключения: {0}
zh_hans: 无法设置连接字符串应用设置: {0}
zh_hant: 無法設定連接字串應用程式設定: {0}

# tableListProgressTitle
source: Fetching tables for selected database...
de: Tabellen für die ausgewählte Datenbank werden abgerufen...
es: Capturando tablas para la base de datos seleccionada...
fr: Récupération des tables pour la base de données sélectionnée...
it: Recupero delle tabelle per il database selezionato in corso...
ja: 選択したデータベースのテーブルをフェッチしています...
ko: 선택한 데이터베이스의 테이블을 가져오는 중...
pt_br: Buscando tabelas para o banco de dados selecionado...
ru: Получение таблиц для выбранной базы данных...
zh_hans: 正在提取所选数据库的表...
zh_hant: 正在擷取所選資料庫的資料表...

# viewListProgressTitle
source: Fetching views for selected database...
de: Sichten für ausgewählte Datenbank werden abgerufen...
es: Capturando vistas para la base de datos seleccionada...
fr: Récupération des vues pour la base de données sélectionnée...
it: Recupero delle visualizzazioni per il database selezionato in corso...
ja: 選択したデータベースのビューをフェッチしています...
ko: 선택한 데이터베이스의 뷰를 가져오는 중...
pt_br: Buscando exibições para o banco de dados selecionado...
ru: Получение представлений для выбранной базы данных...
zh_hans: 正在提取所选数据库的视图...
zh_hant: 正在擷取所選資料庫的檢視...

# functionNameTitle
source: Function Name
de: Funktionsname
es: Nombre de la función
fr: Nom de la fonction
it: Nome funzione
ja: 関数名
ko: 기능 이름
pt_br: Nome da Função
ru: Имя функции
zh_hans: 函数名称
zh_hant: 函式名稱

# userPasswordLater
source: In order to user the SQL connection string later you will need to manually enter the password in your local.settings.json file.
de: Um die SQL-Verbindungszeichenfolge später zu verwenden, müssen Sie das Kennwort manuell in Ihre local.settings.json-Datei eingeben.
es: Para poder usar la cadena de conexión SQL más tarde, deberá escribir manualmente la contraseña en el archivo local.settings.json.
fr: Pour pouvoir utiliser la chaîne de connexion SQL ultérieurement, vous devez entrer manuellement le mot de passe dans votre fichier local.settings.json.
it: Per usare la stringa di connessione SQL in seguito, è necessario immettere manualmente la password nel file local.settings.json.
ja: 後で SQL 接続文字列を使用するには、local.settings.json ファイルにパスワードを手動で入力する必要があります。
ko: 나중에 SQL 연결 문자열을 사용하려면 local.settings.json 파일에 암호를 수동으로 입력해야 합니다.
pt_br: Para usar a cadeia de conexão SQL posteriormente, você precisará inserir manualmente a senha em seu arquivo local.settings.json.
ru: Чтобы позже использовать строку подключения SQL, необходимо вручную ввести пароль в файле local.settings.json.
zh_hans: 若要在以后使用 SQL 连接字符串，需要在 local.settings.json 文件中手动输入密码。
zh_hant: 為了稍後使用 SQL 連接字串，您必須在 local.settings.json 檔案中手動輸入密碼。

source: Input
de: Eingabe
es: Entrada
fr: Entrée
ja: 入力
ko: 입력
pt_br: Entrada
ru: Входные данные
zh_hans: 输入
zh_hant: 輸入

source: Install
de: Installieren
es: Instalar
fr: Installer
it: Installa
ja: インストール
ko: 설치
pt_br: Instalar
ru: Установить
zh_hans: 安装
zh_hant: 安裝

source: Learn more
de: Weitere Informationen
es: Obtener más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세히 알아보기
pt_br: Saiba mais
ru: Дополнительные сведения
zh_hans: 了解详细信息
zh_hant: 深入了解

# SettingAlreadyExists
source: Local app setting '{0}' already exists. Overwrite?
de: Die lokale App-Einstellung "{0}" ist bereits vorhanden. Überschreiben?
es: La configuración de la aplicación local "{0}" ya existe. Sobrescribir?
fr: Le paramètre d’application local « {0} » existe déjà. Voulez-vous le remplacer?
it: L'impostazione dell'app locale '{0}' esiste già. Sovrascrivere?
ja: ローカル アプリケーション設定 '{0}' は既に存在します。上書きしますか?
ko: 로컬 앱 설정 '{0}'이(가) 이미 존재합니다. 덮어쓰시겠습니까?
pt_br: A configuração do aplicativo local '{0}' já existe. Substituir?
ru: Параметр локального приложения "{0}" уже существует. Перезаписать его?
zh_hans: 本地应用设置“{0}”已存在。是否覆盖?
zh_hant: 本機應用程式設定 '{0}' 已經存在。要覆寫嗎?

source: More Information
de: Weitere Informationen
es: Más información
fr: Complément d’information
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Mais Informações
ru: Дополнительные сведения
zh_hans: 更多信息
zh_hant: 詳細資訊

source: Name must not be empty
de: Der Name darf nicht leer sein.
es: El nombre no puede estar en blanco
fr: Le nom ne doit pas être vide
it: Il nome non deve essere vuoto
ja: 名前を空にすることはできません
ko: 이름은 비워 둘 수 없습니다.
pt_br: O nome não deve estar vazio
ru: Поле имени не может быть пустым.
zh_hans: 名称不得为空
zh_hant: 名稱不得為空白

# hasSpecialCharacters
source: Name must not include special characters
de: Der Name darf keine Sonderzeichen enthalten.
es: El nombre no debe incluir caracteres especiales
fr: Le nom ne doit pas contenir de caractères spéciaux
it: Il nome non deve includere caratteri speciali
ja: 名前に特殊文字を含めることはできません
ko: 이름에는 특수 문자가 포함되지 않아야 합니다.
pt_br: O nome não deve incluir caracteres especiais
ru: Имя не должно содержать специальные символы
zh_hans: 名称不得包含特殊字符
zh_hant: 名稱不能包含特殊字元

# noString
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# noAzureFunctionsInFile
source: No Azure functions in the current active file
de: Keine Azure-Funktionen in der aktuellen aktiven Datei
es: No hay funciones Azure en el archivo activo actual
fr: Aucune fonction Azure dans le fichier actif actuel
it: Nessuna funzione di Azure nel file attivo corrente
ja: 現在のアクティブなファイルには Azure 関数がありません
ko: 현재 활성 파일에 Azure 함수가 없음
pt_br: Nenhuma função do Azure no arquivo ativo atual
ru: Нет функций Azure в текущем активном файле
zh_hans: 当前活动文件中没有 Azure 函数
zh_hant: 目前的作用中檔案中沒有任何 Azure 函式

# noAzureFunctionsProjectsInWorkspace
source: No Azure functions projects found in the workspace
de: Im Arbeitsbereich wurden keine Azure Functions-Projekte gefunden.
es: No se encontró ningún proyecto de Azure Functions en el área de trabajo
fr: Aucun projet Azure Functions trouvé dans l’espace de travail
it: Non sono stati trovati progetti di funzioni di Azure nell'area di lavoro
ja: ワークスペースに Azure 機能プロジェクトが見つかりませんでした
ko: 작업 영역에서 Azure 함수 프로젝트를 찾을 수 없음
pt_br: Nenhum projeto do Azure Functions encontrado no espaço de trabalho
ru: В рабочей области не найдены проекты функций Azure
zh_hans: 在工作区中找不到 Azure Functions 项目
zh_hant: 在工作區中找不到任何 Azure 函式專案

source: Open File
de: Datei öffnen
es: Abrir archivo
fr: Ouvrir un fichier
it: Apri file
ja: ファイルを開く
ko: 파일 열기
pt_br: Abrir Arquivo
ru: Открыть файл
zh_hans: 打开文件
zh_hant: 開啟檔案

source: Output
de: Ausgabe
es: Salida
fr: Sortie
ja: 出力
ko: 출력
pt_br: Saída
ru: Выходные данные
zh_hans: 输出
zh_hant: 輸出

# inputDescription
source: Retrieves data from a database
de: Ruft Daten aus einer Datenbank ab.
es: Recupere datos de una base de datos
fr: Récupère les données d’une base de données
it: Recupera i dati da un database
ja: データベースからデータを取得します
ko: 데이터베이스에서 데이터 검색
pt_br: Recupera dados de um banco de dados
ru: Извлекает данные из базы данных
zh_hans: 从数据库中检索数据
zh_hant: 從資料庫擷取資料

source: SQL object to query
de: Abzufragende SQL-Objekte
es: Objeto SQL para consultar
fr: Objet SQL à interroger
it: Oggetto SQL su cui eseguire la query
ja: クエリ対象の SQL オブジェクト
ko: 쿼리할 SQL 개체
pt_br: Objeto SQL a ser consultado
ru: Объект SQL для запроса
zh_hans: 要查询的 SQL 对象
zh_hant: 要查詢的 SQL 物件

# sqlTableToUpsert
source: SQL table to upsert into
de: SQL-Tabelle zum Upsertieren
es: Tabla SQL para actualizar/insertar (upsert)
fr: Table SQL dans laquelle upsert
it: Tabella SQL in cui eseguire l'operazione di upsert
ja: Upsert 先の SQL テーブル
ko: upsert할 SQL 테이블
pt_br: Tabela SQL para upsert into
ru: Таблица SQL для Upsert
zh_hans: 要更新插入到的 SQL 表
zh_hant: 要 upsert 的目標 SQL 資料表

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ja: 保存
ko: 저장
pt_br: Salvar
ru: Сохранить
zh_hans: 保存
zh_hant: 儲存

# outputDescription
source: Save data to a database
de: Daten in einer Datenbank speichern
es: Guardar datos en una base de datos
fr: Enregistrer les données dans une base de données
it: Salva dati in un database
ja: データベースにデータを保存する
ko: 데이터를 데이터베이스에 저장
pt_br: Salvar dados em um banco de dados
ru: Сохранение данных в базе данных
zh_hans: 将数据保存到数据库
zh_hant: 將資料儲存至資料庫

# selectButton
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

source: Select Database
de: Datenbank auswählen
es: Seleccionar la base de datos
fr: Sélectionner une base de données
it: Seleziona database
ja: データベースの選択
ko: 데이터베이스 선택
pt_br: Selecionar banco de dados
ru: Выберите базу данных
zh_hans: 选择数据库
zh_hant: 選擇資料庫

# selectConnectionString
source: Select SQL connection string method
de: Methode für die SQL-Verbindungszeichenfolge auswählen
es: Seleccionar método de cadena de conexión SQL
fr: Sélectionner la méthode de chaîne de connexion SQL
it: Selezionare il metodo della stringa di connessione SQL
ja: SQL 接続文字列メソッドの選択
ko: SQL 연결 문자열 메서드 선택
pt_br: Selecionar método de cadeia de conexão SQL
ru: Выберите метод строки подключения SQL
zh_hans: 选择 SQL 连接字符串方法
zh_hant: 選取 SQL 連接字串方法

# selectSetting
source: Select SQL connection string setting from local.settings.json
de: SQL-Verbindungszeichenfolgeeinstellung aus local.settings.json auswählen
es: Seleccione la configuración de la cadena de conexión SQL de local.settings.jsen
fr: Sélectionnez le paramètre de chaîne de connexion SQL dans local.settings.json
it: Selezionare l'impostazione della stringa di connessione SQL da local.settings.json
ja: local.settings.json から SQL 接続文字列設定を選択します
ko: local.settings.js에서 SQL 연결 문자열 설정 선택
pt_br: Selecione a configuração da cadeia de conexão SQL em local.settings.jsem
ru: Выберите параметр строки подключения SQL из local.settings.json.
zh_hans: 从 local.settings.json 中选择 SQL 连接字符串设置
zh_hant: 從 local.settings.json 選取 SQL 連接字串設定

# connectionProfile
source: Select a connection profile
de: Verbindungsprofil auswählen
es: Seleccionar un perfil de conexión
fr: Sélectionnez une connexion pour le profile.
it: Selezionare una connessione
ja: 接続プロファイルを選択する
ko: 연결 프로필 선택
pt_br: Selecionar um perfil de conexão
ru: Выберите профиль подключения
zh_hans: 选择连接配置文件
zh_hant: 選取連接設定檔

# selectAzureFunction
source: Select an Azure function in the current file to add SQL binding to
de: Azure-Funktion in der aktuellen Datei auswählen, der die SQL-Bindung hinzugefügt werden soll
es: Seleccione una función de Azure en el archivo actual a la que agregar el enlace de SQL.
fr: Sélectionnez une fonction Azure dans le fichier actif auquel ajouter une liaison SQL
it: Selezionare una funzione di Azure nel file corrente in cui aggiungere l'associazione SQL
ja: SQL バインドを追加する Azure 関数を現在のファイル内から選択します
ko: 현재 파일에서 SQL 바인딩을 추가할 Azure 함수 선택
pt_br: Selecione uma função do Azure no arquivo atual para adicionar associação SQL para
ru: Выберите функцию Azure в текущем файле, чтобы добавить привязку SQL
zh_hans: 在当前文件中选择要将 SQL 绑定添加到的 Azure 函数
zh_hant: 在目前檔案中選取要新增 SQL 繫結的 Azure 函式

# selectAzureFunctionProjFolder
source: Select folder for the Azure Function project
de: Ordner für das Azure Function-Projekt auswählen
es: Seleccionar carpeta para el proyecto de Azure Function
fr: Sélectionner un dossier pour le projet de fonction Azure
it: Selezionare la cartella per il progetto funzione di Azure
ja: Azure Function プロジェクトのフォルダーを選択する
ko: Azure 함수 프로젝트에 대한 폴더 선택
pt_br: Selecionar pasta para o projeto do Azure Function
ru: Выбор папки для проекта Функции Azure
zh_hans: 选择 Azure 函数项目的文件夹
zh_hant: 選取 Azure 函數專案的資料夾
