Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/*-mssql.sql-bindings-vscode.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# selectSqlTableOrViewPrompt
source: Select object type to insert or upsert into
de: Objekttyp für Einfügung oder Upsert auswählen
es: Seleccione el tipo de objeto en el que se va a insertar o upsert
fr: Sélectionner le type d’objet dans l’insertion ou l’upsert
it: Selezionare il tipo di oggetto in cui inserire o eseguire l'upsert
ja: 挿入またはアップサートするオブジェクトの種類を選択します
ko: 삽입하거나 upsert할 개체 유형 선택
pt_br: Selecione o tipo de objeto no qual inserir ou fazer um upsert
ru: Выберите тип объекта для вставки или операции upsert
zh_hans: 选择要插入或更新插入的对象类型
zh_hant: 選取要插入或向上插入的物件類型

# selectTable
source: Select table to use
de: Zu verwendende Tabelle auswählen
es: Seleccionar la tabla que se va a usar
fr: Sélectionner la table à utiliser
it: Selezionare la tabella da usare
ja: 使用するテーブルを選択する
ko: 사용할 테이블 선택
pt_br: Selecionar tabela a ser usada
ru: Выберите таблицу для использования
zh_hans: 选择要使用的表
zh_hant: 選取要使用的資料表

# selectProject
source: Select the Azure Function project for the SQL Binding
de: Azure Functions-Projekt für die SQL-Bindung auswählen
es: Seleccione el proyecto de Azure Function para el enlace SQL.
fr: Sélectionner le projet de fonction Azure pour la liaison SQL
it: Selezionare il progetto di funzione di Azure per l'associazione SQL
ja: SQL バインドのAzure Functions プロジェクトを選択します
ko: SQL 바인딩에 대한 Azure 함수 프로젝트 선택
pt_br: Selecione o projeto de Função do Azure para a Associação SQL
ru: Выберите проект Функций Azure для привязки SQL
zh_hans: 为 SQL 绑定选择 Azure 函数项目
zh_hant: 選取 SQL 繫結的 Azure 函數專案

# selectBindingType
source: Select type of binding
de: Wählen Sie den Bindungstyp aus
es: Seleccione el tipo de enlace
fr: Sélectionner le type de liaison
it: Seleziona tipo di associazione
ja: バインドするタイプを選択します
ko: 바인딩 유형 선택
pt_br: Selecione o tipo de associação
ru: Выберите тип привязки
zh_hans: 选择绑定类型
zh_hant: 選取繫結類型

# selectBindingTypeToSpecifiedFunction
source: Select type of binding for the function '{0}'
de: Bindungstyp für Funktion '{0}' auswählen
es: Seleccione el tipo de enlace para la función ''{0}''
fr: Sélectionner le type de liaison pour la fonction '{0}'
it: Selezionare il tipo di associazione per la funzione '{0}'
ja: 関数 '{0}' のバインドの種類を選択する
ko: 함수 '{0}'에 대한 바인딩 유형 선택
pt_br: Selecione o tipo de associação para a função ''{0}''
ru: Выберите тип привязки для функции "{0}"
zh_hans: 选择函数“{0}”的绑定类型
zh_hant: 選取函數 '{0}' 的繫結類型

# selectView
source: Select view to use
de: Zu verwendende Sicht auswählen
es: Seleccionar vista para usar
fr: Sélectionner l’affichage à utiliser
it: Selezionare la visualizzazione da usare
ja: 使用するビューの選択
ko: 사용할 보기 선택
pt_br: Selecionar modo de exibição a ser usado
ru: Выберите представление для использования
zh_hans: 选择要使用的视图
zh_hant: 選取要使用的檢視

source: Table
de: Tabelle
es: Tabla
it: Tabella
ja: テーブル
ko: 테이블
pt_br: Tabela
ru: Таблицы
zh_hans: 表
zh_hant: 資料表

# azureFunctionsExtensionNotFound
source: The Azure Functions extension is required to create a new Azure Function with SQL binding but is not installed, install it now?
de: Die Azure Functions-Erweiterung ist erforderlich, um eine neue Azure-Funktion mit SQL-Bindung zu erstellen, ist aber nicht installiert. Jetzt installieren?
es: La extensión Azure Functions es necesaria para crear una nueva función de Azure con enlace SQL, pero no está instalada, ¿quiere instalarla ahora?
fr: L’extension Azure Functions est nécessaire pour créer une fonction Azure avec liaison SQL, mais elle n’est pas installée. Voulez-vous l’installer maintenant ?
it: L'estensione Funzioni di Azure è richiesta per la creazione di una nuova funzione di Azure con l'associazione SQL, ma non è installata. Installarla ora?
ja: SQL バインドを含む新しい Azure 関数を作成するには、Azure Functions 拡張機能が必要ですが、インストールされていません。今すぐインストールしますか?
ko: SQL 바인딩을 사용하여 새 Azure 함수를 만드는 데 Azure Functions 확장이 필요하나 현재 설치되어 있지 않습니다. 지금 설치할까요?
pt_br: A extensão Azure Functions é necessária para criar uma nova Função do Azure com associação SQL, mas não está instalada, instalá-la agora?
ru: Для создания новой функции Azure с привязкой SQL требуется расширение \"Функции Azure\", но оно не установлено. Установить сейчас?
zh_hans: 需要 Azure Functions 扩展才能使用 SQL 绑定创建新的 Azure 函数，但未安装，是否立即安装?
zh_hant: 需要 Azure Functions 延伸模組才能建立具有 SQL 繫結的新 Azure 函數，但它尚未安裝，要立即安裝嗎?

# saveChangesInFile
source: There are unsaved changes in the current file. Save now?
de: In der aktuellen Datei sind ungespeicherte Änderungen vorhanden. Jetzt speichern?
es: Hay cambios no guardados en el archivo actual. ¿Quiere guardar ahora?
fr: Il y a des modifications non enregistrées dans le fichier actif. Voulez-vous enregistrer maintenant?
it: Nel file corrente sono presenti modifiche non salvate. Salvare ora?
ja: 現在のファイルに保存されていない変更があります。今すぐ保存しますか?
ko: 현재 파일에 저장되지 않은 변경 사항이 있습니다. 지금 저장하시겠습니까?
pt_br: Há alterações não salvas no arquivo atual. Salvar agora?
ru: В текущем файле есть несохраненные изменения. Сохранить сейчас?
zh_hans: 当前文件中存在未保存的更改。立即保存?
zh_hant: 目前的檔案中有未儲存的變更。要立即儲存嗎?

# timeoutAzureFunctionFileError
source: Timed out waiting for Azure Function file to be created
de: Timeout beim Warten auf die Erstellung der Azure-Funktionsdatei
es: Se agotó el tiempo de espera para crear el archivo de Azure Function
fr: Expiration du délai d’attente pour la création du fichier Azure Function
it: Timeout durante l'attesa della creazione del file di funzioni di Azure
ja: Azure 関数ファイルの作成の待機中にタイムアウトしました
ko: Azure 함수 파일이 만들지길 기다리는 동안 시간이 초과되었습니다.
pt_br: Tempo limite atingido ao aguardar a criação do arquivo de Funções do Azure
ru: Истекло время ожидания создания файла функции Azure
zh_hans: 等待创建 Azure 函数文件时超时
zh_hant: 等候 Azure 函數檔案建立時逾時

# timeoutExtensionError
source: Timed out waiting for extension to install
de: Timeout beim Warten auf die Installation der Erweiterung
es: Se agotó el tiempo de espera para la instalación de la extensión
fr: Expiration du délai d’attente pour l’installation de l’extension
it: Timeout durante l'attesa dell'installazione dell'estensione
ja: 拡張機能のインストールの待機中にタイムアウトしました
ko: 확장이 설치되길 기다리는 동안 시간이 초과되었습니다.
pt_br: Tempo limite atingido ao aguardar a instalação da extensão
ru: Истекло время ожидания установки расширения
zh_hans: 等待安装扩展时超时
zh_hant: 等候安裝延伸模組時逾時

source: Value must not be empty
de: Der Wert darf nicht leer sein.
es: El valor no debe estar vacío.
fr: La valeur ne doit pas être vide
it: Il valore non deve essere vuoto
ja: 値を空にすることはできません
ko: 값은 비워 둘 수 없습니다.
pt_br: O valor não pode ser vazio
ru: Значение не может быть пустым
zh_hans: 值不能为空
zh_hant: 值不得為空白

source: View
de: Anzeigen
es: Ver
fr: Voir
it: Visualizzare
ja: 表示
ko: 보기
pt_br: Exibir
ru: Представление
zh_hans: 查看
zh_hant: 檢視

# yesString
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# sqlBindings.addSqlBinding
source: Add SQL Binding (preview)
de: SQL-Bindung hinzufügen (Vorschau)
es: Agregar enlace de SQL (versión preliminar)
fr: Ajouter une liaison SQL (préversion)
it: Aggiungi binding SQL (anteprima)
ja: SQL バインドの追加 (プレビュー)
ko: SQL 바인딩 추가(미리 보기)
pt_br: Adicionar Associação SQL (versão prévia)
ru: Добавить привязку SQL (предварительная версия)
zh_hans: 添加 SQL 绑定(预览)
zh_hant: 新增 SQL 繫結 (預覽)

# sqlBindings.createAzureFunction
source: Create Azure Function with SQL binding (preview)
de: Azure-Funktion mit SQL-Bindung erstellen (Vorschau)
es: Crear Azure Function con enlace SQL(versión preliminar)
fr: Créer une fonction Azure avec liaison SQL (préversion)
it: Creare una funzione di Azure con l'associazione SQL (anteprima)
ja: SQL バインドを使用して Azure 関数を作成する (プレビュー)
ko: SQL 바인딩을 사용하여 Azure 함수 만들기(미리 보기)
pt_br: Criar Função do Azure com associação SQL (versão prévia)
ru: Создание Функций Azure с привязкой SQL (предварительная версия)
zh_hans: 创建包含 SQL 绑定的 Azure 函数 (预览版)
zh_hant: 使用 SQL 繫結建立 Azure 函數 (預覽)

# description
source: Enables users to develop and publish Azure Functions with Azure SQL bindings
de: Ermöglicht Benutzer*innen das Entwickeln und Veröffentlichen von Azure-Funktionen mit Azure SQL-Bindungen.
es: Permite a los usuarios desarrollar y publicar Azure Functions con enlaces Azure SQL.
fr: Permet aux utilisateurs de développer et de publier des Azure Functions avec des liaisons Azure SQL
it: Consente agli utenti di sviluppare e pubblicare Funzioni di Azure con associazioni Azure SQL
ja: ユーザーが Azure SQL バインドを使用して Azure Functions を開発および発行できるようにする
ko: 사용자가 Azure SQL 바인딩을 사용하여 Azure Functions를 개발하고 게시할 수 있습니다.
pt_br: Permitir que os usuários desenvolvam e publiquem o Azure Functions com associações SQL do Azure
ru: Позволяет пользователям разрабатывать и публиковать Функции Azure с привязками Azure SQL
zh_hans: 使用户能够开发和发布包含 Azure SQL 绑定的 Azure Functions
zh_hant: 讓使用者使用 Azure SQL 繫結來開發及發佈 Azure Functions

# displayName
source: SQL Bindings
de: SQL-Bindungen
es: Enlaces DE SQL
fr: Liaisons SQL
it: Associazioni SQL
ja: SQL バインド
ko: SQL 바인딩
pt_br: Associações SQL
ru: SQL-привязки
zh_hans: SQL 绑定
zh_hant: SSL 繫結
