Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/admin-tool-ext-win.*.xlf
Languages: de, es, ja, pt_br, ru, zh_hant

# adminToolExtWin.displayName
source: Database Administration Tool Extensions for Windows
de: Erweiterungen für Datenbankverwaltungstools für Windows
es: Extensiones de herramienta de administración de bases de datos para Windows
ja: Windows 用データベース管理ツール拡張機能
pt_br: Extensões da Ferramenta de Administração de Banco de Dados para Windows
ru: Расширения средства администрирования баз данных для Windows
zh_hant: 適用於 Windows 的資料庫系統管理工具延伸模組

# adminToolExtWin.description
source: Adds additional Windows-specific functionality to Azure Data Studio
de: Hiermit werden Azure Data Studio zusätzliche Windows-spezifische Funktionen hinzugefügt.
es: Agrega funcionalidad adicional específica de Windows a Azure Data Studio
ja: Azure Data Studio に Windows 特有の他の機能を追加します
pt_br: Adiciona funcionalidade adicional específica do Windows ao Azure Data Studio
ru: Добавляет в Azure Data Studio дополнительные возможности для Windows
zh_hant: 將額外的 Windows 特定功能新增至 Azure Data Studio

# adminToolExtWin.propertiesMenuItem
source: Properties
de: Eigenschaften
es: Propiedades
ja: プロパティ
pt_br: Propriedades
ru: Свойства
zh_hant: 屬性

# adminToolExtWin.launchGswMenuItem
source: Generate Scripts...
de: Skripts generieren...
es: Generar scripts...
ja: スクリプトの生成...
pt_br: Gerar scripts...
ru: Создание сценариев…
zh_hant: 產生指令碼...

# adminToolExtWin.noConnectionContextForProp
source: No ConnectionContext provided for handleLaunchSsmsMinPropertiesDialogCommand
de: Für "handleLaunchSsmsMinPropertiesDialogCommand" wurde kein ConnectionContext angegeben.
es: No se proporciona ConnectionContext para handleLaunchSsmsMinPropertiesDialogCommand
ja: handleLaunchSsmsMinPropertiesDialogCommand に提供された ConnectionContext はありません
pt_br: Não foi fornecido nenhum ConnectionContext para handleLaunchSsmsMinPropertiesDialogCommand
ru: Не указан ConnectionContext для handleLaunchSsmsMinPropertiesDialogCommand
zh_hant: 未為 handleLaunchSsmsMinPropertiesDialogCommand 提供任何 ConnectionContext

# adminToolExtWin.noOENode
source: Could not determine Object Explorer node from connectionContext : {0}
de: Der Objekt-Explorer-Knoten konnte nicht aus dem connectionContext ermittelt werden: {0}
es: No se ha podido determinar el nodo del Explorador de objetos desde connectionContext: {0}
ja: connectionContext からオブジェクト エクスプローラー ノードを判別できませんでした: {0}
pt_br: Não foi possível determinar o nó do Pesquisador de Objetos de connectionContext: {0}
ru: Не удалось определить узел обозревателя объектов из connectionContext: {0}
zh_hant: 無法判斷來自 connectionContext 的物件總管節點 : {0}

# adminToolExtWin.noConnectionContextForGsw
source: No ConnectionContext provided for handleLaunchSsmsMinPropertiesDialogCommand
de: Für "handleLaunchSsmsMinPropertiesDialogCommand" wurde kein ConnectionContext angegeben.
es: No se proporciona ConnectionContext para handleLaunchSsmsMinPropertiesDialogCommand
ja: handleLaunchSsmsMinPropertiesDialogCommand に提供された ConnectionContext はありません
pt_br: Não foi fornecido nenhum ConnectionContext para handleLaunchSsmsMinPropertiesDialogCommand
ru: Не указан ConnectionContext для handleLaunchSsmsMinPropertiesDialogCommand
zh_hant: 未為 handleLaunchSsmsMinPropertiesDialogCommand 提供任何 ConnectionContext

# adminToolExtWin.noConnectionProfile
source: No connectionProfile provided from connectionContext : {0}
de: Über den connectionContext wurde kein connectionProfile angegeben: {0}
es: No se proporciona connectionProfile desde connectionContext: {0}
ja: connectionContext から提供された connectionProfile はありません: {0}
pt_br: Não foi fornecido nenhum connectionProfile do connectionContext: {0}
ru: Не указан connectionProfile из connectionContext: {0}
zh_hant: connectionContext 未提供任何 connectionProfile : {0}

# adminToolExtWin.launchingDialogStatus
source: Launching dialog...
de: Das Dialogfeld wird gestartet...
es: Iniciando el cuadro de diálogo...
ja: ダイアログを起動しています...
pt_br: Iniciando a caixa de diálogo...
ru: Запуск диалогового окна…
zh_hant: 正在啟動對話...

# adminToolExtWin.ssmsMinError
source: Error calling SsmsMin with args '{0}' - {1}
de: Fehler beim Aufruf von SsmsMin mit den Argumenten "{0}": {1}
es: Error al llamar a SsmsMin con argumentos "{0}" - {1}
ja: 引数 '{0}' を伴う SsmsMin の呼び出しでエラーが発生しました - {1}
pt_br: Erro ao chamar SsmsMin com os argumentos '{0}' – {1}
ru: Ошибка при вызове SsmsMin с аргументами "{0}" — {1}
zh_hant: 以引數 '{0}' - {1} 呼叫 SsmsMin 時發生錯誤
