Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/agent.*.xlf
Languages: es, it, ja, ko, zh_hant

# agentDialog.OK
source: OK
es: Aceptar
ko: 확인
zh_hant: 確定

# agentDialog.Cancel
source: Cancel
es: Cancelar
it: Annulla
ja: キャンセル
ko: 취소
zh_hant: 取消

# jobStepDialog.fileBrowserTitle
source: Locate Database Files -
es: Ubicar archivos de base de datos -
it: Trova file di database -
ja: データベース ファイルの検索 -
ko: 데이터베이스 파일 찾기 -
zh_hant: 尋找資料庫檔案 -

# jobStepDialog.ok
source: OK
es: Aceptar
ko: 확인
zh_hant: 確定

# jobStepDialog.cancel
source: Cancel
es: Cancelar
it: Annulla
ja: キャンセル
ko: 취소
zh_hant: 取消

# jobStepDialog.general
source: General
it: Generale
ja: 全般
ko: 일반
zh_hant: 一般

# jobStepDialog.advanced
source: Advanced
es: Opciones avanzadas
it: Avanzate
ja: 詳細
ko: 고급
zh_hant: 進階

# jobStepDialog.open
source: Open...
es: Abrir...
it: Apri...
ja: 開く...
ko: 열기...
zh_hant: 開啟...

# jobStepDialog.parse
source: Parse
es: Analizar
it: Analizza
ja: 解析
ko: 구문 분석
zh_hant: 剖析

# jobStepDialog.successParse
source: The command was successfully parsed.
es: El comando se analizó correctamente.
it: Il comando è stato analizzato.
ja: コマンドは正常に解析されました。
ko: 명령을 구문 분석했습니다.
zh_hant: 已成功剖析命令。

# jobStepDialog.failParse
source: The command failed.
es: Error en el comando.
it: Il comando non è riuscito.
ja: コマンドが失敗しました。
ko: 명령이 실패했습니다.
zh_hant: 命令失敗。

# jobStepDialog.blankStepName
source: The step name cannot be left blank
es: El nombre de paso no se puede dejar en blanco
it: Il nome del passaggio non può essere lasciato vuoto
ja: ステップ名を空白のままにすることはできません
ko: 단계 이름은 비워 둘 수 없습니다.
zh_hant: 步驟名稱不能留空

# jobStepDialog.processExitCode
source: Process exit code of a successful command:
es: Procesar código de salida para un comando completado correctamente:
it: Codice di uscita processo di un comando riuscito:
ja: 成功したコマンドのプロセス終了コード:
ko: 성공한 명령의 프로세스 종료 코드:
zh_hant: 處理成功命令的結束代碼:

# jobStepDialog.stepNameLabel
source: Step Name
es: Nombre del paso
it: Nome del passaggio
ja: ステップ名
ko: 단계 이름
zh_hant: 步驟名稱

# jobStepDialog.typeLabel
source: Type
es: Tipo
it: Tipo
ja: 種類
ko: 형식
zh_hant: 類型

# jobStepDialog.runAsLabel
source: Run as
es: Ejecutar como
it: Esegui come
ja: 実行するアカウント名
ko: 다음 계정으로 실행
zh_hant: 執行身分

# jobStepDialog.databaseLabel
source: Database
es: Base de datos
ja: データベース
ko: 데이터베이스
zh_hant: 資料庫

# jobStepDialog.commandLabel
source: Command
es: Comando
it: Comando
ja: コマンド
ko: 명령
zh_hant: 命令

# jobStepDialog.successAction
source: On success action
es: Cuando la acción se realice correctamente
it: Azione in caso di operazione riuscita
ja: 成功時のアクション
ko: 성공한 경우 동작
zh_hant: 當動作成功時

# jobStepDialog.failureAction
source: On failure action
es: En caso de error
it: Azione in caso di errore
ja: 失敗時のアクション
ko: 실패한 경우 동작
zh_hant: 當動作失敗時

# jobStepDialog.runAsUser
source: Run as user
es: Ejecutar como usuario
it: Esegui come utente
ja: ユーザーとして実行
ko: 사용자로 실행
zh_hant: 以使用者身分執行

# jobStepDialog.retryAttempts
source: Retry Attempts
es: Número de reintentos
it: Numero di tentativi
ja: 再試行回数
ko: 재시도 횟수
zh_hant: 重試嘗試

# jobStepDialog.retryInterval
source: Retry Interval (minutes)
es: Intervalo de reintentos (minutos)
it: Intervallo tra tentativi (minuti)
ja: 再試行間隔 (分)
ko: 재시도 간격(분)
zh_hant: 重試間隔 (分鐘)

# jobStepDialog.logToTable
source: Log to table
es: Registrar en tabla
it: Registra nella tabella
ja: テーブルにログを記録する
ko: 테이블에 기록
zh_hant: 記錄到資料表

# jobStepDialog.appendExistingTableEntry
source: Append output to exisiting entry in table
es: Agregar salida a entrada existente en la tabla
it: Accoda output a voce esistente nella tabella
ja: テーブル内の既存のエントリに出力を追加する
ko: 테이블의 기존 항목에 출력 추가
zh_hant: 將輸出附加到表中現有的項目

# jobStepDialog.includeStepOutputHistory
source: Include step output in history
es: Incluir salida del paso en el historial
it: Includi output del passaggio nella cronologia
ja: 履歴にステップ出力を含める
ko: 기록에 단계 출력 포함
zh_hant: 在歷程記錄中包含步驟輸出

# jobStepDialog.outputFile
source: Output File
es: Archivo de salida
it: File di output
ja: 出力ファイル
ko: 출력 파일
zh_hant: 輸出檔案

# jobStepDialog.appendOutputToFile
source: Append output to existing file
es: Anexar resultado a archivo existente
it: Accoda output a file esistente
ja: 既存のファイルに出力を追加する
ko: 기존 파일에 출력 추가
zh_hant: 將輸出附加至現有的檔案

# jobStepDialog.selectedPath
source: Selected path
es: Ruta seleccionada
it: Percorso selezionato
ja: 選択されたパス
ko: 선택한 경로
zh_hant: 選擇的路徑

# jobStepDialog.filesOfType
source: Files of type
es: Archivos de tipo
it: File di tipo
ja: ファイルの種類
ko: 파일 형식
zh_hant: 檔案類型

# jobStepDialog.fileName
source: File name
es: Nombre de archivo
it: Nome file
ja: ファイル名
ko: 파일 이름
zh_hant: 檔案名稱

# jobStepDialog.allFiles
source: All Files (*)
es: Todos los archivos (*)
it: Tutti i file (*)
ja: すべてのファイル (*)
ko: 모든 파일(*)
zh_hant: 所有檔案 (*)

# jobStepDialog.newJobStep
source: New Job Step
es: Nuevo paso de trabajo
it: Nuovo passaggio del processo
ja: 新しいジョブ ステップ
ko: 새 작업 단계
zh_hant: 新增作業步驟

# jobStepDialog.editJobStep
source: Edit Job Step
es: Modificar paso de trabajo
it: Modifica passaggio del processo
ja: ジョブ ステップの編集
ko: 작업 단계 편집
zh_hant: 編輯作業步驟

# jobStepDialog.TSQL
source: Transact-SQL script (T-SQL)
es: Script de Transact-SQL(T-SQL)
it: Script Transact-SQL (T-SQL)
ja: Transact-SQL スクリプト (T-SQL)
ko: Transact-SQL 스크립트(T-SQL)
zh_hant: Transact-SQL 指令碼 (T-SQL)

# jobStepDialog.CmdExec
source: Operating system (CmdExec)
es: Sistema operativo (CmdExec)
it: Sistema operativo (CmdExec)
ja: オペレーティング システム (CmdExec)
ko: 운영 체제(CmdExec)
zh_hant: 作業系統 (cmdexec)

# jobStepDialog.replicationDistribution
source: Replication Distributor
es: Distribuidor de replicación
it: Database di distribuzione repliche
ja: レプリケーション ディストリビューター
ko: 복제 배포자
zh_hant: 複寫散發者

# jobStepDialog.replicationMerge
source: Replication Merge
es: Fusión de replicación
it: Merge repliche
ja: レプリケーション マージ
ko: 복제 병합
zh_hant: 複寫合併

# jobStepDialog.replicationQueueReader
source: Replication Queue Reader
es: Lector de cola de replicación
it: Lettore coda di repliche
ja: レプリケーション キュー リーダー
ko: 복제 큐 판독기
zh_hant: 複本佇列讀取器

# jobStepDialog.replicationSnapshot
source: Replication Snapshot
es: Instantánea de replicación
it: Snapshot repliche
ja: レプリケーション スナップショット
ko: 복제 스냅샷
zh_hant: 複寫快照集

# jobStepDialog.replicationTransactionLogReader
source: Replication Transaction-Log Reader
es: Lector del registro de transacciones de replicación
it: Lettura log delle transazioni di replica
ja: レプリケーション トランザクション ログ リーダー
ko: 복제 트랜잭션 로그 판독기
zh_hant: 複寫交易 - 記錄讀取器

# jobStepDialog.analysisCommand
source: SQL Server Analysis Services Command
es: Comando de SQL Server Analysis Services
it: Comando di SQL Server Analysis Services
ja: SQL Server Analysis Services コマンド
ko: SQL Server Analysis Services 명령
zh_hant: SQL Server Analysis Services 命令

# jobStepDialog.analysisQuery
source: SQL Server Analysis Services Query
es: Consulta de SQL Server Analysis Services
it: Query di SQL Server Analysis Services
ja: SQL Server Analysis Services クエリ
ko: SQL Server Analysis Services 쿼리
zh_hant: SQL Server Analysis Services 查詢

# jobStepDialog.servicesPackage
source: SQL Server Integration Service Package
es: Paquete de servicio de integración de SQL Server
it: Pacchetto SQL Server Integration Services
ja: SQL Server Integration Service パッケージ
ko: SQL Server 통합 서비스 패키지
zh_hant: SQL Server 整合服務套件

# jobStepDialog.agentServiceAccount
source: SQL Server Agent Service Account
es: Cuenta de servicio de Agente SQL Server
it: Account del servizio SQL Server Agent
ja: SQL Server エージェント サービス アカウント
ko: SQL Server 에이전트 서비스 계정
zh_hant: SQL Server Agent 服務帳戶

# jobStepDialog.nextStep
source: Go to the next step
es: Ir al siguiente paso
it: Vai al passaggio successivo
ja: 次のステップに移動
ko: 다음 단계로 이동
zh_hant: 前往下一步

# jobStepDialog.quitJobSuccess
source: Quit the job reporting success
es: Cerrar el trabajo que notifica una realización correcta
it: Termina il processo segnalandone la riuscita
ja: 成功を報告してジョブを終了する
ko: 성공 보고와 함께 작업 종료
zh_hant: 結束作業報告成功

# jobStepDialog.quitJobFailure
source: Quit the job reporting failure
es: Cerrar el trabajo que notifica el error
it: Termina il processo segnalandone un errore
ja: 失敗を報告してジョブを終了する
ko: 실패 보고와 함께 작업 종료
zh_hant: 結束作業報告失敗

# pickSchedule.jobSchedules
source: Job Schedules
es: Programas de trabajos
it: Pianificazioni processi
ja: ジョブ スケジュール
ko: 작업 일정
zh_hant: 作業排程

# pickSchedule.ok
source: OK
es: Aceptar
ko: 확인
zh_hant: 確定

# pickSchedule.cancel
source: Cancel
es: Cancelar
it: Annulla
ja: キャンセル
ko: 취소
zh_hant: 取消

# pickSchedule.availableSchedules
source: Available Schedules:
es: Programaciones disponibles:
it: Pianificazioni disponibili:
ja: 利用可能なスケジュール:
ko: 사용 가능한 일정:
zh_hant: 可用的排程:

# pickSchedule.scheduleName
source: Name
es: Nombre
it: Nome
ja: 名前
ko: 이름
zh_hant: 名稱

# pickSchedule.scheduleID
source: ID
zh_hant: 識別碼

# pickSchedule.description
source: Description
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
zh_hant: 描述

# alertDialog.createAlert
source: Create Alert
es: Crear alerta
it: Crea avviso
ja: アラートの作成
ko: 경고 만들기
zh_hant: 建立警示

# alertDialog.editAlert
source: Edit Alert
es: Editar alerta
it: Modifica avviso
ja: アラートの編集
ko: 경고 편집
zh_hant: 編輯警示

# alertDialog.General
source: General
it: Generale
ja: 全般
ko: 일반
zh_hant: 一般

# alertDialog.Response
source: Response
es: Respuesta
it: Risposta
ja: 応答
ko: 응답
zh_hant: 回應

# alertDialog.Options
source: Options
es: Opciones
it: Opzioni
ja: オプション​​
ko: 옵션
zh_hant: 選項

# alertDialog.eventAlert
source: Event alert definition
es: Definición de alerta de eventos
it: Definizione di avviso di evento
ja: イベント アラート定義
ko: 이벤트 경고 정의
zh_hant: 事件警示定義

# alertDialog.Name
source: Name
es: Nombre
it: Nome
ja: 名前
ko: 이름
zh_hant: 名稱

# alertDialog.Type
source: Type
es: Tipo
it: Tipo
ja: 種類
ko: 형식
zh_hant: 類型

# alertDialog.Enabled
source: Enabled
es: Habilitado
it: Abilitato
ja: 有効
ko: 사용
zh_hant: 啟用

# alertDialog.DatabaseName
source: Database name
es: Nombre de la base de datos
it: Nome del database
ja: データベース名
ko: 데이터베이스 이름
zh_hant: 資料庫名稱

# alertDialog.ErrorNumber
source: Error number
es: Número de error
it: Numero di errore
ja: エラー番号
ko: 오류 번호
zh_hant: 錯誤號碼

# alertDialog.Severity
source: Severity
es: Gravedad
it: Gravità
ja: 重大度
ko: 심각도
zh_hant: 嚴重性

# alertDialog.RaiseAlertContains
source: Raise alert when message contains
es: Generar alerta cuando el mensaje contenga
it: Genera un avviso quando il messaggio contiene
ja: メッセージが含まれているときにアラートを出す
ko: 메시지에 다음 텍스트가 포함될 때 경고 발생
zh_hant: 當訊息包含以下項目時引發警示

# alertDialog.MessageText
source: Message text
es: Texto del mensaje
it: Testo del messaggio
ja: メッセージ テキスト
ko: 메시지 텍스트
zh_hant: 訊息文字

# alertDialog.Severity001
source: 001 - Miscellaneous System Information
es: 001 - Información diversa del sistema
it: 001 - Informazioni di sistema varie
ja: 001 - 各種のシステム情報
ko: 기타 시스템 정보 - 001
zh_hant: 001 - 其他系統資訊

# alertDialog.Severity002
source: 002 - Reserved
es: 002 - Reservado
it: 002 - Riservato
ja: 002 - 予約済み
ko: 예약됨 - 002
zh_hant: 002 - 已保留

# alertDialog.Severity003
source: 003 - Reserved
es: 003 - reservado
it: 003 - Riservato
ja: 003 - 予約済み
ko: 예약됨 - 003
zh_hant: 003 - 已保留

# alertDialog.Severity004
source: 004 - Reserved
es: 004 - Reservado
it: 004 - Riservato
ja: 004 - 予約済み
ko: 예약됨 - 004
zh_hant: 004 - 已保留

# alertDialog.Severity005
source: 005 - Reserved
es: 005 - Reservado
it: 005 - Riservato
ja: 005 - 予約済み
ko: 예약됨 - 005
zh_hant: 005 - 已保留

# alertDialog.Severity006
source: 006 - Reserved
es: 006: Reservado
it: 006 - Riservato
ja: 006 - 予約済み
ko: 예약됨 - 006
zh_hant: 006 - 已保留

# alertDialog.Severity007
source: 007 - Notification: Status Information
es: 007 - Notificación: Información del estado
it: 007 - Notifica: informazioni sullo stato
ja: 007 - 通知: 状態情報
ko: 알림: 상태 정보 - 007
zh_hant: 007 - 通知: 狀態資訊

# alertDialog.Severity008
source: 008 - Notification: User Intervention Required
es: 008 - Notificación: Intervención del usuario requerida
it: 008 - Notifica: richiesto intervento dell'utente
ja: 008 - 通知: ユーザーの介入が必須
ko: 알림: 사용자 개입 필요 - 008
zh_hant: 008 - 通知: 需要使用者操作

# alertDialog.Severity009
source: 009 - User Defined
es: 009 - Definido por el usuario
it: 009 - Definito dall'utente
ja: 009 - ユーザー定義
ko: 사용자 정의 - 009
zh_hant: 009 - 已定義使用者

# alertDialog.Severity010
source: 010 - Information
es: 010 - Información
it: 010 - Informazioni
ja: 010 - 情報
ko: 정보 - 010
zh_hant: 010 - 資訊

# alertDialog.Severity011
source: 011 - Specified Database Object Not Found
es: 011 - No se encontró el objeto especificado de la base de datos
it: 011 - Oggetto di database specificato non trovato
ja: 011 - 指定されたデータベース オブジェクトが見つかりません
ko: 지정된 데이터베이스 개체를 찾을 수 없음 - 011
zh_hant: 011 - 找不到指定的資料庫物件

# alertDialog.Severity012
source: 012 - Unused
es: 012: Sin utilizar
it: 012 - Inutilizzato
ja: 012 - 未使用
ko: 사용 안 함 - 012
zh_hant: 012 - 未使用

# alertDialog.Severity013
source: 013 - User Transaction Syntax Error
es: 013 - Error de sintaxis en una transacción de usuario
it: 013 - Errore di sintassi nella transazione utente
ja: 013 - ユーザー トランザクションの構文エラー
ko: 사용자 트랜잭션 구문 오류 - 013
zh_hant: 013 - 使用者交易語法錯誤

# alertDialog.Severity014
source: 014 - Insufficient Permission
es: 014 - Permiso insuficiente
it: 014 - Autorizzazioni insufficienti
ja: 014 - 必要なアクセス許可がありません
ko: 권한 부족 - 014
zh_hant: 014 - 權限不足

# alertDialog.Severity015
source: 015 - Syntax Error in SQL Statements
es: 015 - Error de sintaxis en las instrucciones SQL
it: 015 - Errore di sintassi nelle istruzioni SQL
ja: 015 - SQL ステートメントの構文エラー
ko: SQL 문의 구문 오류 - 015
zh_hant: 015 - SQL 陳述式中的語法錯誤

# alertDialog.Severity016
source: 016 - Miscellaneous User Error
es: 016 - Error de usuario del tipo varios
it: 016 - Errore dell'utente
ja: 016 - 各種のユーザー エラー
ko: 기타 사용자 오류- 016
zh_hant: 016 - 其他使用者錯誤

# alertDialog.Severity017
source: 017 - Insufficient Resources
es: 017 - Recursos insuficientes
it: 017 - Risorse insufficienti
ja: 017- リソース不足
ko: 리소스 부족 - 017
zh_hant: 017 - 資源不足

# alertDialog.Severity018
source: 018 - Nonfatal Internal Error
es: 018 - Error interno no crítico
it: 018 - Errore interno non irreversibile
ja: 018 - 致命的でない内部エラー
ko: 치명적이지 않은 내부 오류 - 018
zh_hant: 018 - 非嚴重內部錯誤

# alertDialog.Severity019
source: 019 - Fatal Error in Resource
es: 019 - Error grave en el recurso
it: 019 - Errore irreversibile nella risorsa
ja: 019 - リソースにおける致命的なエラー
ko: 치명적인 리소스 오류 - 019
zh_hant: 019 - 資源中的致命錯誤

# alertDialog.Severity020
source: 020 - Fatal Error in Current Process
es: 020 - Error grave en el proceso actual
it: 020 - Errore irreversibile nel processo corrente
ja: 020 - 現在のプロセス内の致命的なエラー
ko: 현재 프로세스 내의 오류 - 020
zh_hant: 020 - 目前的處理發生嚴重錯誤

# alertDialog.Severity021
source: 021 - Fatal Error in Database Processes
es: 021 - Error grave en procesos de base de datos
it: 021 - Errore irreversibile nei processi di database
ja: 021 - データベース プロセスの致命的なエラー
ko: 데이터베이스 프로세스 내의 오류 - 021
zh_hant: 021 - 資料庫處理序發生嚴重錯誤

# alertDialog.Severity022
source: 022 - Fatal Error: Table Integrity Suspect
es: 022: Error grave: Integridad de la tabla sospechosa
it: 022 - Errore irreversibile: integrità tabella sospetta
ja: 022 - 致命的なエラー: テーブルの整合性を確認してください
ko: 오류: 테이블 무결성 의심 - 022
zh_hant: 022 - 嚴重錯誤: 資料表完整性受到質疑

# alertDialog.Severity023
source: 023 - Fatal Error: Database Integrity Suspect
es: 023 - Error grave: Es posible que se presente un problema de integridad de base de datos
it: 023 - Errore irreversibile: integrità database sospetta
ja: 023 - 致命的なエラー: データベースの整合性を確認してください
ko: 오류: 데이터베이스 무결성 의심 - 023
zh_hant: 023 - 嚴重錯誤: 資料庫完整性有疑慮

# alertDialog.Severity024
source: 024 - Fatal Error: Hardware Error
es: 024 - Error grave: Error de Hardware
it: 024 - Errore irreversibile: errore hardware
ja: 024 - 致命的なエラー: ハードウェア エラー
ko: 오류: 하드웨어 오류 - 024
zh_hant: 024 - 嚴重錯誤: 硬體錯誤

# alertDialog.Severity025
source: 025 - Fatal Error
es: 025 - Error grave
it: 025 - Errore irreversibile
ja: 025 - 致命的なエラー
ko: 오류 - 025
zh_hant: 025 - 嚴重錯誤

# alertDialog.AllDatabases
source: <all databases>
es: <todas las bases de datos>
it: <tutti i database>
ja: <すべてのデータベース>
ko: <모든 데이터베이스>
zh_hant: <所有資料庫>

# alertDialog.ExecuteJob
source: Execute Job
es: Ejecutar trabajo
it: Esegui processo
ja: ジョブの実行
ko: 작업 실행
zh_hant: 執行作業

# alertDialog.ExecuteJobName
source: Job Name
es: Nombre de tarea
it: Nome del processo
ja: ジョブ名
ko: 작업 이름
zh_hant: 作業名稱

# alertDialog.NotifyOperators
source: Notify Operators
es: Notificar a los operadores
it: Invia notifica a operatori
ja: オペレーターに通知する
ko: 운영자에게 알림
zh_hant: 通知運算子

# alertDialog.NewJob
source: New Job
es: Nuevo trabajo
it: Nuovo processo
ja: 新しいジョブ
ko: 새 작업
zh_hant: 新增作業

# alertDialog.OperatorList
source: Operator List
es: Lista de operadores
it: Elenco operatori
ja: 演算子の一覧
ko: 운영자 목록
zh_hant: 運算子清單

# alertDialog.OperatorName
source: Operator
es: Operador
it: Operatore
ja: 演算子
ko: 운영자
zh_hant: 運算子

# alertDialog.OperatorEmail
source: E-mail
es: Correo electrónico
it: Posta elettronica
ja: 電子メール
ko: 전자 메일
zh_hant: 電子郵件

# alertDialog.OperatorPager
source: Pager
es: Buscapersonas
it: Cercapersone
ja: ポケットベル
ko: 호출기
zh_hant: 頁面巡覽區

# alertDialog.NewOperator
source: New Operator
es: Nuevo operador
it: Nuovo operatore
ja: 新しい演算子
ko: 새 운영자
zh_hant: 新增運算子

# alertDialog.IncludeErrorInEmail
source: Include alert error text in e-mail
es: Incluir texto de error de la alerta en el correo electrónico
it: Includi testo dell'avviso in messaggi inviati tramite posta elettronica
ja: 電子メールにアラート エラー テキストを含める
ko: 전자 메일에 경고 오류 텍스트 포함
zh_hant: 在電子郵件中包含警示錯誤文字

# alertDialog.IncludeErrorInPager
source: Include alert error text in pager
es: Incluir texto de error de la alerta en el buscapersonas
it: Includi testo dell'avviso in messaggi inviati tramite cercapersone
ja: ポケットベルにアラート エラー テキストを含める
ko: 호출기에 경고 오류 텍스트 포함
zh_hant: 在頁面巡覽區中包括警示文字

# alertDialog.AdditionalNotification
source: Additional notification message to send
es: Mensaje de notificación adicional para enviar
it: Messaggio di notifica aggiuntivo da inviare
ja: 送信する付加的な通知メッセージ
ko: 전송할 추가 알림 메시지
zh_hant: 要傳送的其他通知訊息

# alertDialog.DelayMinutes
source: Delay Minutes
es: Minutos de retardo
it: Ritardo in minuti
ja: 遅延 (分)
ko: 지연(분)
zh_hant: 延遲分鐘數

# alertDialog.DelaySeconds
source: Delay Seconds
es: Segundos de retardo
it: Ritardo in secondi
ja: 遅延 (秒)
ko: 지연(초)
zh_hant: 延遲秒數

# createOperator.createOperator
source: Create Operator
es: Crear operador
it: Crea operatore
ja: 演算子の作成
ko: 연산자 만들기
zh_hant: 建立運算子

# createOperator.editOperator
source: Edit Operator
es: Editar operador
it: Modifica operatore
ja: 演算子の編集
ko: 연산자 편집
zh_hant: 編輯運算子

# createOperator.General
source: General
it: Generale
ja: 全般
ko: 일반
zh_hant: 一般

# createOperator.Notifications
source: Notifications
es: Notificaciones
it: Notifiche
ja: 通知
ko: 알림
zh_hant: 通知

# createOperator.Name
source: Name
es: Nombre
it: Nome
ja: 名前
ko: 이름
zh_hant: 名稱

# createOperator.Enabled
source: Enabled
es: Habilitado
it: Abilitato
ja: 有効
ko: 사용
zh_hant: 啟用

# createOperator.EmailName
source: E-mail Name
es: Nombre de correo electrónico
it: Indirizzo di posta elettronica
ja: 電子メール名
ko: 전자 메일 이름
zh_hant: 電子郵件名稱

# createOperator.PagerEmailName
source: Pager E-mail Name
es: Nombre de correo electrónico del buscapersonas
it: Indirizzo cercapersone
ja: ポケットベル電子メール名
ko: 호출기 전자 메일 이름
zh_hant: 頁面巡覽區電子郵件名稱

# createOperator.PagerMondayCheckBox
source: Monday
es: Lunes
it: Lunedì
ja: 月曜日
ko: 월요일
zh_hant: 星期一

# createOperator.PagerTuesdayCheckBox
source: Tuesday
es: Martes
it: Martedì
ja: 火曜日
ko: 화요일
zh_hant: 星期二

# createOperator.PagerWednesdayCheckBox
source: Wednesday
es: Miércoles
it: Mercoledì
ja: 水曜日
ko: 수요일
zh_hant: 星期三

# createOperator.PagerThursdayCheckBox
source: Thursday
es: Jueves
it: Giovedì
ja: 木曜日
ko: 목요일
zh_hant: 星期四

# createOperator.PagerFridayCheckBox
source: Friday
es: Viernes
it: Venerdì
ja: 金曜日
ko: 금요일
zh_hant: 星期五

# createOperator.PagerSaturdayCheckBox
source: Saturday
es: Sábado
it: Sabato
ja: 土曜日
ko: 토요일
zh_hant: 星期六

# createOperator.PagerSundayCheckBox
source: Sunday
es: Domingo
it: Domenica
ja: 日曜日
ko: 일요일
zh_hant: 星期日

# createOperator.workdayBegin
source: Workday begin
es: Inicio del día laborable
it: Inizio della giornata lavorativa
ja: 始業時刻
ko: 업무 시작일
zh_hant: 工作日開始

# createOperator.workdayEnd
source: Workday end
es: Final del día laborable
it: Fine della giornata lavorativa
ja: 終業時刻
ko: 업무 종료일
zh_hant: 工作日結束

# createOperator.PagerDutySchedule
source: Pager on duty schedule
es: Buscapersonas en horario de trabajo
it: Pianificazione cercapersone per operatore in servizio
ja: ポケットベルの受信スケジュール
ko: 호출기 연락 가능 근무 일정
zh_hant: 呼叫器待命排程

# createOperator.AlertListHeading
source: Alert list
es: Lista de alerta
it: Elenco avvisi
ja: アラートの一覧
ko: 경고 목록
zh_hant: 警示清單

# createOperator.AlertNameColumnLabel
source: Alert name
es: Nombre de alerta
it: Nome dell'avviso
ja: アラート名
ko: 경고 이름
zh_hant: 警示名稱

# createOperator.AlertEmailColumnLabel
source: E-mail
es: Correo electrónico
it: Posta elettronica
ja: 電子メール
ko: 전자 메일
zh_hant: 電子郵件

# createOperator.AlertPagerColumnLabel
source: Pager
es: Buscapersonas
it: Cercapersone
ja: ポケットベル
ko: 호출기
zh_hant: 頁面巡覽區

# jobDialog.general
source: General
it: Generale
ja: 全般
ko: 일반
zh_hant: 一般

# jobDialog.steps
source: Steps
es: Pasos
it: Passaggi
ja: ステップ
ko: 단계
zh_hant: 步驟

# jobDialog.schedules
source: Schedules
es: Programaciones
it: Pianificazioni
ja: スケジュール
ko: 일정
zh_hant: 排程

# jobDialog.alerts
source: Alerts
es: Alertas
it: Avvisi
ja: アラート
ko: 경고
zh_hant: 警示

# jobDialog.notifications
source: Notifications
es: Notificaciones
it: Notifiche
ja: 通知
ko: 알림
zh_hant: 通知

# jobDialog.blankJobNameError
source: The name of the job cannot be blank.
es: El nombre del trabajo no puede estar en blanco.
it: Il nome del processo non può essere vuoto.
ja: ジョブの名前を空白にすることはできません。
ko: 작업 이름을 비워 둘 수 없습니다.
zh_hant: 作業名稱不得為空。

# jobDialog.name
source: Name
es: Nombre
it: Nome
ja: 名前
ko: 이름
zh_hant: 名稱

# jobDialog.owner
source: Owner
es: Propietario
it: Proprietario
ja: 所有者
ko: 소유자
zh_hant: 擁有者

# jobDialog.category
source: Category
es: Categoría
it: Categoria
ja: カテゴリ
ko: 범주
zh_hant: 分類

# jobDialog.description
source: Description
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
zh_hant: 描述

# jobDialog.enabled
source: Enabled
es: Habilitado
it: Abilitato
ja: 有効
ko: 사용
zh_hant: 啟用

# jobDialog.jobStepList
source: Job step list
es: Lista de paso de trabajo
it: Elenco dei passaggi del processo
ja: ジョブ ステップの一覧
ko: 작업 단계 목록
zh_hant: 作業步驟清單

# jobDialog.step
source: Step
es: Paso
it: Passaggio
ja: ステップ
ko: 단계
zh_hant: 步驟

# jobDialog.type
source: Type
es: Tipo
it: Tipo
ja: 種類
ko: 형식
zh_hant: 類型

# jobDialog.onSuccess
source: On Success
es: En caso de éxito
it: In caso di riuscita
ja: 成功時
ko: 성공한 경우
zh_hant: 成功時

# jobDialog.onFailure
source: On Failure
es: En caso de error
it: In caso di errore
ja: 失敗時
ko: 실패한 경우
zh_hant: 失敗時

# jobDialog.new
source: New Step
es: Nuevo paso
it: Nuovo passaggio
ja: 新しいステップ
ko: 새 단계
zh_hant: 新增步驟

# jobDialog.edit
source: Edit Step
es: Editar paso
it: Modifica passaggio
ja: ステップの編集
ko: 단계 편집
zh_hant: 編輯步驟

# jobDialog.delete
source: Delete Step
es: Eliminar paso
it: Elimina passaggio
ja: ステップの削除
ko: 단계 삭제
zh_hant: 刪除步驟

# jobDialog.moveUp
source: Move Step Up
es: Subir un paso
it: Sposta passaggio su
ja: ステップを上に移動
ko: 단계를 위로 이동
zh_hant: 向上移動步驟

# jobDialog.moveDown
source: Move Step Down
es: Bajar un paso
it: Sposta passaggio giù
ja: ステップを下に移動
ko: 단계를 아래로 이동
zh_hant: 向下移動步驟

# jobDialog.startStepAt
source: Start step
es: Iniciar paso
it: Passaggio iniziale
ja: ステップの開始
ko: 시작 단계
zh_hant: 開始步驟

# jobDialog.notificationsTabTop
source: Actions to perform when the job completes
es: Acciones para realizar cuando se completa el trabajo
it: Azioni da eseguire quando il processo viene completato
ja: ジョブ完了時に実行するアクション
ko: 작업 완료 시 수행할 동작
zh_hant: 作業完成時要執行的操作

# jobDialog.email
source: Email
es: Correo electrónico
it: Messaggio di posta elettronica
ja: 電子メール
ko: 전자 메일
zh_hant: 電子郵件

# jobDialog.page
source: Page
es: Página
it: Pagina
ja: ページ
ko: 페이지
zh_hant: 頁面
