Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/agent.*.xlf
Languages: es, it, ja, ko, zh_hant

# jobDialog.eventLogCheckBoxLabel
source: Write to the Windows Application event log
es: Escribir en el registro de eventos de la aplicación de Windows
it: Scrivi nel log eventi dell'applicazione di Windows
ja: Windows アプリケーション イベント ログに書き込む
ko: Windows 애플리케이션 이벤트 로그에 쓰기
zh_hant: 寫入 Windows 應用程式事件記錄檔

# jobDialog.deleteJobLabel
source: Automatically delete job
es: Eliminar automáticamente el trabajo
it: Elimina automaticamente il processo
ja: 自動的にジョブを削除
ko: 자동으로 작업 삭제
zh_hant: 自動刪除作業

# jobDialog.schedulesaLabel
source: Schedules list
es: Lista de programaciones
it: Elenco pianificazioni
ja: スケジュールの一覧
ko: 일정 목록
zh_hant: 排程清單

# jobDialog.pickSchedule
source: Pick Schedule
es: Elegir programación
it: Seleziona pianificazione
ja: スケジュールを選択
ko: 일정 선택
zh_hant: 挑選排程

# jobDialog.removeSchedule
source: Remove Schedule
es: Quitar programación
it: Rimuovi pianificazione
ja: スケジュールの削除
ko: 일정 제거
zh_hant: 移除排程

# jobDialog.alertsList
source: Alerts list
es: Lista de alertas
it: Elenco avvisi
ja: アラート一覧
ko: 경고 목록
zh_hant: 警示清單

# jobDialog.newAlert
source: New Alert
es: Nueva alerta
it: Nuovo avviso
ja: 新しいアラート
ko: 새 경고
zh_hant: 新增警示

# jobDialog.alertNameLabel
source: Alert Name
es: Nombre de alerta
it: Nome dell'avviso
ja: アラート名
ko: 경고 이름
zh_hant: 警示名稱

# jobDialog.alertEnabledLabel
source: Enabled
es: Habilitado
it: Abilitato
ja: 有効
ko: 사용
zh_hant: 啟用

# jobDialog.alertTypeLabel
source: Type
es: Tipo
it: Tipo
ja: 種類
ko: 형식
zh_hant: 類型

# jobDialog.newJob
source: New Job
es: Nuevo trabajo
it: Nuovo processo
ja: 新しいジョブ
ko: 새 작업
zh_hant: 新增作業

# jobDialog.editJob
source: Edit Job
es: Editar trabajo
it: Modifica processo
ja: ジョブの編集
ko: 작업 편집
zh_hant: 編輯作業

# jobData.whenJobCompletes
source: When the job completes
es: Cuando el trabajo termina
it: Al termine del processo
ja: ジョブが完了するとき
ko: 작업 완료 시
zh_hant: 當作業完成時

# jobData.whenJobFails
source: When the job fails
es: Cuando el trabajo genera error
it: Se il processo non riesce
ja: ジョブが失敗するとき
ko: 작업 실패 시
zh_hant: 當作業失敗時

# jobData.whenJobSucceeds
source: When the job succeeds
es: Cuando el trabajo se completa correctamente
it: Se il processo riesce
ja: ジョブが成功するとき
ko: 작업 성공 시
zh_hant: 當作業成功時

# jobData.jobNameRequired
source: Job name must be provided
es: Debe proporcionarse el nombre del trabajo
it: È necessario specificare il nome del processo
ja: ジョブ名を指定する必要があります
ko: 작업 이름을 지정해야 합니다.
zh_hant: 必須提供作業名稱

# jobData.saveErrorMessage
source: Job update failed '{0}'
es: Error de actualización de trabajo "{0}"
it: L'aggiornamento del processo non è riuscito: '{0}'
ja: ジョブの更新に失敗しました '{0}'
ko: '{0}' 작업을 업데이트하지 못했습니다.
zh_hant: 作業更新失敗 '{0}'

# jobData.newJobErrorMessage
source: Job creation failed '{0}'
es: Error de creación de trabajo "{0}"
it: La creazione del processo non è riuscita: '{0}'
ja: ジョブの作成に失敗しました '{0}'
ko: '{0}' 작업을 만들지 못했습니다.
zh_hant: 作業建立失敗 '{0}'

# jobData.saveSucessMessage
source: Job '{0}' updated successfully
es: El trabajo "{0}" se actualizó correctamente
it: Il processo '{0}' è stato aggiornato
ja: ジョブ '{0}' が正常に更新されました
ko: '{0}' 작업을 업데이트했습니다.
zh_hant: 已成功更新作業 '{0}'

# jobData.newJobSuccessMessage
source: Job '{0}' created successfully
es: El trabajo "{0}" se creó correctamente
it: Il processo '{0}' è stato creato
ja: ジョブ '{0}' が正常に作成されました
ko: '{0}' 작업을 만들었습니다.
zh_hant: 已成功建立作業 '{0}'

# jobStepData.saveErrorMessage
source: Step update failed '{0}'
es: Error de actualización en el paso "{0}"
it: L'aggiornamento del passaggio non è riuscito: '{0}'
ja: ステップの更新に失敗しました '{0}'
ko: '{0}' 단계를 업데이트하지 못했습니다.
zh_hant: 步驟更新失敗 '{0}'

# stepData.jobNameRequired
source: Job name must be provided
es: Debe proporcionarse el nombre del trabajo
it: È necessario specificare il nome del processo
ja: ジョブ名を指定する必要があります
ko: 작업 이름을 지정해야 합니다.
zh_hant: 必須提供作業名稱

# stepData.stepNameRequired
source: Step name must be provided
es: Debe proporcionarse el nombre del paso
it: È necessario specificare il nome del passaggio
ja: ステップ名を指定する必要があります
ko: 단계 이름을 지정해야 합니다.
zh_hant: 必須提供步驟名稱

# mainController.notImplemented
source: This feature is under development. Check-out the latest insiders build if you'd like to try out the most recent changes!
es: Esta característica está en desarrollo. ¡Obtenga la última versión para Insiders si desea probar los cambios más recientes!
it: Questa funzionalità è in fase di sviluppo. Per provare le ultime novità, vedere la build più recente per utenti Insider.
ja: この機能は開発中です。最新の変更内容を試す場合には、最新のインサイダー ビルドをご確認ください。
ko: 이 기능은 아직 개발 중입니다. 가장 최근 변경 기능을 사용해 보려면 최신 참가자 빌드를 확인하세요.
zh_hant: 這項功能尚未開發完成。如果您想嘗試最新的變更，請試試最新的測試人員組建!

# agent.templateUploadSuccessful
source: Template updated successfully
es: Plantilla actualizada correctamente
it: Il modello è stato aggiornato
ja: テンプレートが正常に更新されました
ko: 템플릿을 업데이트함
zh_hant: 範本已成功更新

# agent.templateUploadError
source: Template update failure
es: Error de actualización de plantilla
it: Errore di aggiornamento del modello
ja: テンプレートの更新エラー
ko: 템플릿 업데이트 실패
zh_hant: 範本更新失敗

# agent.unsavedFileSchedulingError
source: The notebook must be saved before being scheduled. Please save and then retry scheduling again.
es: Debe guardar el cuaderno antes de programarlo. Guarde y vuelva a intentar programar de nuevo.
it: Prima di pianificare il notebook, è necessario salvarlo. Salvare, quindi ripetere la pianificazione.
ja: ノートブックは、スケジュールする前に保存する必要があります。保存してから、もう一度スケジュールを再試行してください。
ko: 예약하기 전에 전자 필기장을 저장해야 합니다. 저장한 후 예약을 다시 시도하세요.
zh_hant: 必須先儲存筆記本才能排程。請儲存後重試排程。

# agent.AddNewConnection
source: Add new connection
es: Agregar nueva conexión
it: Aggiungere nuova connessione
ja: 新しい接続の追加
ko: 새 연결 추가
zh_hant: 新增新連線

# agent.selectConnection
source: Select a connection
es: Seleccionar una conexión
it: Selezionare una connessione
ja: 接続の選択
ko: 연결 선택
zh_hant: 選取連線

# agent.selectValidConnection
source: Please select a valid connection
es: Seleccione una conexión válida
it: Selezionare una connessione valida.
ja: 有効な接続を選択してください。
ko: 올바른 연결을 선택하세요
zh_hant: 請選取有效的連線

# alertData.saveErrorMessage
source: Alert update failed '{0}'
es: Error de actualización de alerta "{0}"
it: L'aggiornamento dell'avviso non è riuscito: '{0}'
ja: アラートの更新に失敗しました '{0}'
ko: '{0}' 경고를 업데이트하지 못했습니다.
zh_hant: 更新失敗 '{0}'

# alertData.DefaultAlertTypString
source: SQL Server event alert
es: Alerta de evento de SQL Server
it: Avviso per evento di SQL Server
ja: SQL Server イベントのアラート
ko: SQL Server 이벤트 경고
zh_hant: SQL Server 事件警示

# alertDialog.PerformanceCondition
source: SQL Server performance condition alert
es: Alerta de condición de rendimiento de SQL Server
it: Avviso relativo alle prestazioni di SQL Server
ja: SQL Server パフォーマンス条件のアラート
ko: SQL Server 성능 조건 경고
zh_hant: SQL Server 效能條件警示

# alertDialog.WmiEvent
source: WMI event alert
es: Alerta de evento WMI
it: Avviso per evento WMI
ja: WMI イベントのアラート
ko: WMI 이벤트 경고
zh_hant: WMI 事件警示

# createProxy.createProxy
source: Create Proxy
es: Crear proxy
it: Crea proxy
ja: プロキシの作成
ko: 프록시 만들기
zh_hant: 建立 Proxy

# createProxy.editProxy
source: Edit Proxy
es: Editar Proxy
it: Modifica proxy
ja: プロキシの編集
ko: 프록시 편집
zh_hant: 編輯 Proxy

# createProxy.General
source: General
it: Generale
ja: 全般
ko: 일반
zh_hant: 一般

# createProxy.ProxyName
source: Proxy name
es: Nombre del proxy
it: Nome del proxy
ja: プロキシ名
ko: 프록시 이름
zh_hant: Proxy 名稱

# createProxy.CredentialName
source: Credential name
es: Nombre de credencial
it: Nome della credenziale
ja: 資格情報名
ko: 자격 증명 이름
zh_hant: 認證名稱

# createProxy.Description
source: Description
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
zh_hant: 描述

# createProxy.SubsystemName
source: Subsystem
es: Subsistema
it: Sottosistema
ja: サブシステム
ko: 하위 시스템
zh_hant: 子系統

# createProxy.OperatingSystem
source: Operating system (CmdExec)
es: Sistema operativo (CmdExec)
it: Sistema operativo (CmdExec)
ja: オペレーティング システム (CmdExec)
ko: 운영 체제(CmdExec)
zh_hant: 作業系統 (cmdexec)

# createProxy.ReplicationSnapshot
source: Replication Snapshot
es: Instantánea de replicación
it: Snapshot repliche
ja: レプリケーション スナップショット
ko: 복제 스냅샷
zh_hant: 複寫快照集

# createProxy.ReplicationTransactionLog
source: Replication Transaction-Log Reader
es: Lector del registro de transacciones de replicación
it: Lettura log delle transazioni di replica
ja: レプリケーション トランザクション ログ リーダー
ko: 복제 트랜잭션 로그 판독기
zh_hant: 複寫交易 - 記錄讀取器

# createProxy.ReplicationDistributor
source: Replication Distributor
es: Distribuidor de replicación
it: Database di distribuzione repliche
ja: レプリケーション ディストリビューター
ko: 복제 배포자
zh_hant: 複寫散發者

# createProxy.ReplicationMerge
source: Replication Merge
es: Fusión de replicación
it: Merge repliche
ja: レプリケーション マージ
ko: 복제 병합
zh_hant: 複寫合併

# createProxy.ReplicationQueueReader
source: Replication Queue Reader
es: Lector de cola de replicación
it: Lettore coda di repliche
ja: レプリケーション キュー リーダー
ko: 복제 큐 판독기
zh_hant: 複本佇列讀取器

# createProxy.SSASQueryLabel
source: SQL Server Analysis Services Query
es: Consulta de SQL Server Analysis Services
it: Query di SQL Server Analysis Services
ja: SQL Server Analysis Services クエリ
ko: SQL Server Analysis Services 쿼리
zh_hant: SQL Server Analysis Services 查詢

# createProxy.SSASCommandLabel
source: SQL Server Analysis Services Command
es: Comando de SQL Server Analysis Services
it: Comando di SQL Server Analysis Services
ja: SQL Server Analysis Services コマンド
ko: SQL Server Analysis Services 명령
zh_hant: SQL Server Analysis Services 命令

# createProxy.SSISPackage
source: SQL Server Integration Services Package
es: Paquete de SQL Server Integration Services
it: Pacchetto SQL Server Integration Services
ja: SQL Server Integration Services パッケージ
ko: SQL Server Integration Services 패키지
zh_hant: SQL Server Integration Services 套件

# proxyData.saveErrorMessage
source: Proxy update failed '{0}'
es: Error de la actualización de proxy "{0}"
it: L'aggiornamento del proxy non è riuscito: '{0}'
ja: プロキシの更新に失敗しました '{0}'
ko: 프록시를 업데이트하지 못했습니다. '{0}'
zh_hant: Proxy 更新失敗 '{0}'

# proxyData.saveSucessMessage
source: Proxy '{0}' updated successfully
es: El proxy "{0}" se actualizó correctamente
it: Il proxy '{0}' è stato aggiornato
ja: プロキシ '{0}' が正常に更新されました
ko: '{0}' 프록시를 업데이트했습니다.
zh_hant: 已成功更新 Proxy '{0}'

# proxyData.newJobSuccessMessage
source: Proxy '{0}' created successfully
es: Proxy "{0}" creado correctamente
it: Il proxy '{0}' è stato creato
ja: プロキシ '{0}' が正常に作成されました
ko: '{0}' 프록시를 만들었습니다.
zh_hant: 已成功建立 '{0}'

# notebookDialog.newJob
source: New Notebook Job
es: Nuevo trabajo de cuaderno
it: Nuovo processo notebook
ja: 新しいノートブック ジョブ
ko: 새 Notebook 작업
zh_hant: 新增筆記本作業

# notebookDialog.editJob
source: Edit Notebook Job
es: Editar trabajo del cuaderno
it: Modifica processo notebook
ja: ノートブック ジョブの編集
ko: 전자 필기장 작업 편집
zh_hant: 編輯筆記本作業

# notebookDialog.general
source: General
it: Generale
ja: 全般
ko: 일반
zh_hant: 一般

# notebookDialog.notebookSection
source: Notebook Details
es: Detalles del cuaderno
it: Dettagli dei notebook
ja: ノートブックの詳細
ko: Notebook 세부 정보
zh_hant: 筆記本詳細資料

# notebookDialog.templateNotebook
source: Notebook Path
es: Ruta de acceso del cuaderno
it: Percorso del notebook
ja: ノートブックのパス
ko: 전자 필기장 경로
zh_hant: 筆記本路徑

# notebookDialog.targetDatabase
source: Storage Database
es: Base de datos del almacenamiento
it: Database di archiviazione
ja: 記憶域のデータベース
ko: 저장소 데이터베이스
zh_hant: 儲存體資料庫

# notebookDialog.executeDatabase
source: Execution Database
es: Base de datos de ejecución
it: Database di esecuzione
ja: 実行データベース
ko: 실행 데이터베이스
zh_hant: 執行資料庫

# notebookDialog.defaultDropdownString
source: Select Database
es: Seleccionar la base de datos
it: Seleziona database
ja: データベースの選択
ko: 데이터베이스 선택
zh_hant: 選擇資料庫

# notebookDialog.jobSection
source: Job Details
es: Detalles del trabajo
it: Dettagli processo
ja: ジョブの詳細
ko: 작업 정보
zh_hant: 作業詳細資料

# notebookDialog.name
source: Name
es: Nombre
it: Nome
ja: 名前
ko: 이름
zh_hant: 名稱

# notebookDialog.owner
source: Owner
es: Propietario
it: Proprietario
ja: 所有者
ko: 소유자
zh_hant: 擁有者

# notebookDialog.schedulesaLabel
source: Schedules list
es: Lista de programaciones
it: Elenco pianificazioni
ja: スケジュールの一覧
ko: 일정 목록
zh_hant: 排程清單

# notebookDialog.pickSchedule
source: Pick Schedule
es: Elegir programación
it: Seleziona pianificazione
ja: スケジュールの選択
ko: 일정 선택
zh_hant: 挑選排程

# notebookDialog.removeSchedule
source: Remove Schedule
es: Quitar programación
it: Rimuovi pianificazione
ja: スケジュールの削除
ko: 일정 제거
zh_hant: 移除排程

# notebookDialog.description
source: Description
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
zh_hant: 描述

# notebookDialog.templatePath
source: Select a notebook to schedule from PC
es: Seleccione un cuaderno para programar desde el equipo.
it: Selezionare un notebook da pianificare dal computer
ja: PC からスケジュールするノートブックを選択する
ko: PC에서 예약할 전자 필기장 선택
zh_hant: 選取要從電腦排程的筆記本

# notebookDialog.targetDatabaseInfo
source: Select a database to store all notebook job metadata and results
es: Seleccione una base de datos para almacenar todos los cuadernos y resultados del trabajo del cuaderno
it: Selezionare un database per archiviare tutti i metadati e i risultati del processo del notebook
ja: すべてのノートブック ジョブのメタデータと結果を格納するデータベースを選択します
ko: 모든 전자 필기장 작업 메타데이터 및 결과를 저장할 데이터베이스 선택
zh_hant: 選取要儲存所有筆記本作業中繼資料及結果的資料庫

# notebookDialog.executionDatabaseInfo
source: Select a database against which notebook queries will run
es: Seleccione una base de datos en la que se ejecutarán las consultas de cuaderno
it: Selezionare un database in cui verranno eseguite le query del notebook
ja: ノートブックのクエリを実行するデータベースを選択します
ko: 전자 필기장 쿼리를 실행할 데이터베이스 선택
zh_hant: 選取要執行筆記本查詢的資料庫

# notebookData.whenJobCompletes
source: When the notebook completes
es: Cuando se complete el cuaderno
it: Quando il notebook completa
ja: ノートブックが完了した場合
ko: 전자 필기장이 완료되는 경우
zh_hant: 當筆記本完成時

# notebookData.whenJobFails
source: When the notebook fails
es: Cuando se produzca un error en el cuaderno
it: Quando il notebook ha esito negativo
ja: ノートブックが失敗した場合
ko: 전자 필기장이 실패하는 경우
zh_hant: 當筆記本失敗時

# notebookData.whenJobSucceeds
source: When the notebook succeeds
es: Cuando el cuaderno se ejecute correctamente
it: Quando il notebook ha esito positivo
ja: ノートブックが成功した場合
ko: 전자 필기장이 성공하는 경우
zh_hant: 當筆記本成功時

# notebookData.jobNameRequired
source: Notebook name must be provided
es: Se debe proporcionar el nombre del cuaderno
it: È necessario specificare il nome del notebook
ja: ノートブック名を指定する必要があります
ko: 전자 필기장 이름을 제공해야 합니다.
zh_hant: 必須提供筆記本名稱

# notebookData.templatePathRequired
source: Template path must be provided
es: Se debe proporcionar la ruta de acceso de la plantilla
it: È necessario fornire il percorso del modello
ja: テンプレート パスを指定する必要があります
ko: 템플릿 경로를 제공해야 함
zh_hant: 必須提供範本路徑

# notebookData.invalidNotebookPath
source: Invalid notebook path
es: Ruta de acceso del cuaderno no válida
it: Percorso del notebook non valido
ja: 無効なノートブック パス
ko: 전자 필기장 경로가 잘못됨
zh_hant: 無效的筆記本路徑

# notebookData.selectStorageDatabase
source: Select storage database
es: Seleccionar base de datos de almacenamiento
it: Selezionare il database di archiviazione
ja: ストレージ データベースの選択
ko: 저장소 데이터베이스 선택
zh_hant: 選取儲存體資料庫

# notebookData.selectExecutionDatabase
source: Select execution database
es: Seleccionar base de datos de ejecución
it: Selezionare il database di esecuzione
ja: 実行データベースの選択
ko: 실행 데이터베이스 선택
zh_hant: 選取執行資料庫

# notebookData.jobExists
source: Job with similar name already exists
es: Un trabajo con un nombre similar ya existe
it: Un processo con un nome simile esiste già
ja: 同様の名前のジョブが既に存在しています。
ko: 이름이 비슷한 작업이 이미 있음
zh_hant: 已有類似名稱的作業存在

# notebookData.saveErrorMessage
source: Notebook update failed '{0}'
es: Error al actualizar el cuaderno "{0}"
it: Aggiornamento del blocco appunti non riuscito '{0}'
ja: ノートブックの更新に失敗しました '{0}'
ko: Notebook 업데이트 실패 '{0}'
zh_hant: 筆記本更新失敗 '{0}'

# notebookData.newJobErrorMessage
source: Notebook creation failed '{0}'
es: Error al crear el cuaderno "{0}"
it: Creazione del notebook non riuscita '{0}'
ja: ノートブックの作成に失敗しました '{0}'
ko: Notebook 만들기 실패 ‘{0}’
zh_hant: 筆記本建立失敗 '{0}'

# notebookData.saveSucessMessage
source: Notebook '{0}' updated successfully
es: El cuaderno "{0}" se actualizó correctamente
it: Il notebook '{0}' è stato aggiornato
ja: ノートブック '{0}' が正常に更新されました
ko: Notebook '{0}'을(를) 업데이트함
zh_hant: 筆記本 '{0}' 已成功更新

# notebookData.newJobSuccessMessage
source: Notebook '{0}' created successfully
es: El cuaderno "{0}" se ha creado correctamente
it: Il notebook '{0}' è stato creato
ja: ノートブック '{0}' が正常に作成されました
ko: Notebook '{0}'이(가) 생성됨
zh_hant: 已成功建立筆記本 '{0}'
