Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.recovering
source: Recovering
de: Wird wiederhergestellt
es: Recuperando
fr: Récupération
it: Recupero in corso
ja: 復旧しています
ko: 복구 중
pt_br: Recuperando
ru: Восстановление по журналу
zh_hans: 正在恢复
zh_hant: 正在復原

# arc.recoveringPending
source: Recovery Pending
de: Wiederherstellung steht aus
es: Pendiente de recuperación
fr: Récupération en attente
it: Recupero in sospeso
ja: 復旧待ち
ko: 복구 보류 중
pt_br: Recuperação Pendente
ru: Ожидание восстановления
zh_hans: 恢复挂起
zh_hant: 復原暫止

# arc.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# arc.refreshFailed
source: Refresh failed. {0}
de: Fehler beim Aktualisieren. {0}
es: Error al actualizar. {0}
fr: Échec de l’actualisation. {0}
it: Aggiornamento non riuscito. {0}
ja: 更新が失敗しました。{0}
ko: 새로 고치지 못했습니다. {0}
pt_br: Falha na atualização. {0}
ru: Обновление не выполнено. {0}
zh_hans: 刷新失败。{0}
zh_hant: 重新整理失敗。{0}

# arc.refreshToEnterCredentials
source: Refresh node to enter credentials
de: Knoten zum Eingeben von Anmeldeinformationen aktualisieren
es: Actualizar el nodo para especificar credenciales
fr: Actualiser le nœud pour entrer les informations d’identification
it: Aggiornare il nodo per immettere le credenziali
ja: ノードを更新して資格情報を入力する
ko: 자격 증명을 입력하려면 노드 새로 고침
pt_br: Atualizar nó para inserir as credenciais
ru: Обновите узел, чтобы ввести учетные данные
zh_hans: 刷新节点以输入凭据
zh_hant: 重新整理節點以輸入認證

# arc.region
source: Region
es: Región
fr: Région
it: Area
ja: リージョン
ko: 지역
pt_br: Região
ru: Регион
zh_hans: 区域
zh_hant: 區域

# arc.releaseDate
source: Release Date
de: Releasedatum
pt_br: Data de Lançamento
zh_hans: 发布日期
zh_hant: 發行日期

# arc.releaseNotes
source: Release Notes
de: Versionshinweise
pt_br: Notas de Versão
zh_hans: 发行说明
zh_hant: 版本資訊

# arc.rememberPassword
source: Remember Password
de: Kennwort speichern
es: Recordar contraseña
fr: Se souvenir du mot de passe
it: Memorizza password
ja: パスワードを記憶する
ko: 암호 저장
pt_br: Lembrar Senha
ru: Запомнить пароль
zh_hans: 记住密码
zh_hant: 記住密碼

# arc.resetAllToDefault
source: Reset all to default
de: Alle auf Standard zurücksetzen
es: Restablecer todos los valores predeterminados
fr: Rétablir toutes les valeurs par défaut
it: Ripristina tutte le impostazioni predefinite
ja: すべてを既定にリセット
ko: 모두 기본값으로 다시 설정
pt_br: Redefinir tudo para padrão
ru: Сбросить все к значениям по умолчанию
zh_hans: 全部重置为默认设置
zh_hant: 全部重設為預設值

# arc.resetFailed
source: Reset failed. {0}
de: Fehler beim Zurücksetzen. {0}
es: No se pudo restablecer. {0}
fr: Échec de la réinitialisation. {0}
it: Reimpostazione non riuscita. {0}
ja: リセットに失敗しました。{0}
ko: 다시 설정하지 못했습니다. {0}
pt_br: Falha na redefinição. {0}
ru: Сбой сброса. {0}
zh_hans: 重置失败。{0}
zh_hant: 重設失敗。{0}

# arc.resetPassword
source: Reset Password
de: Kennwort zurücksetzen
es: Restablecer contraseña
fr: Réinitialiser le mot de passe
it: Reimposta password
ja: パスワードの再設定
ko: 암호 재설정
pt_br: Redefinir senha
ru: Сброс пароля
zh_hans: 重置密码
zh_hant: 重設密碼

# arc.resetToDefault
source: Reset to default
de: Standard wiederherstellen
es: Restablecer valores predeterminados
fr: Rétablir les valeurs par défaut
it: Ripristinare predefinito
ja: 既定値にリセット
ko: 기본값으로 다시 설정
pt_br: Redefinir para padrão
ru: Восстановить значения по умолчанию
zh_hans: 重置为默认值
zh_hant: 重設為預設值

# arc.resourceGroup
source: Resource Group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de Recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# arc.resourceHealth
source: Resource health
de: Ressourcenintegrität
es: Estado de los recursos
fr: Intégrité des ressources
it: Integrità risorsa
ja: リソース正常性
ko: 리소스 상태
pt_br: Integridade do recurso
ru: Работоспособность ресурсов
zh_hans: 资源运行状况
zh_hant: 資源健康狀態

# arc.resourceHealthDescription
source: Resource health can tell you if your resource is running as expected.
de: Resource Health kann Ihnen mitteilen, ob die Ressource wie erwartet ausgeführt wird.
es: El estado de los recursos puede indicarle si el recurso se está ejecutando según lo esperado.
fr: Resource Health peut vous indiquer si votre ressource s’exécute comme prévu.
it: L'integrità delle risorse può informare in merito al funzionamento previsto della risorsa.
ja: リソース正常性では、リソースが予期したとおりに実行されているかどうか知ることができます。
ko: 리소스 상태는 리소스가 예상대로 실행되고 있는지를 알려줄 수 있습니다.
pt_br: A integridade do recurso pode informar se o recurso está sendo executado como esperado.
ru: Функция "Работоспособность ресурсов" позволит вам понять, правильно ли работает ваш ресурс.
zh_hans: 资源运行状况可以让你了解资源是否按预期运行。
zh_hant: 資源健康狀態可告訴您資源是否以預期的方式執行。

# arc.restore
source: Restore
de: Wiederherstellen
ko: 복원
pt_br: Restaurar
zh_hans: 还原
zh_hant: 還原

# arc.restoreDatabase
source: Restore Database
de: Datenbank wiederherstellen
ko: 데이터베이스 복원
pt_br: Restaurar Banco de Dados
zh_hans: 还原数据库
zh_hant: 還原資料庫

# arc.restoreInfo
source: Restore a database to an Azure Arc enabled SQL Managed Instance.
de: Stellen Sie eine Datenbank in einer SQL Managed Instance mit Azure Arc-Unterstützung wieder her.
ko: Azure Arc 지원 SQL Managed Instance로 데이터베이스를 복원합니다.
pt_br: Restaurar um banco de dados para uma Instância Gerenciada de SQL habilitada para Azure Arc.
zh_hans: 将数据库还原到已启用 Azure Arc 的 SQL 托管实例。
zh_hant: 將資料庫還原到已啟用 Azure Arc 的 SQL 受控執行個體。

# arc.restorePoint
source: Restore point (UTC), in a time format: 'YYYY-MM-DDTHH:MM:SSZ
de: Wiederherstellungspunkt (UTC) in einem Zeitformat: „JJJJ-MM-TTTHH:MM:SSZ
ko: 복원 지점(UTC), 시간 형식: 'YYYY-MM-DDTHH:MM:SSZ
pt_br: Ponto de restauração (UTC), em um formato de hora: 'DD-MM-AAAADTHH:MM:SSZ
zh_hans: 恢复点(UTC)，采用以下时间格式:“年-月-日，时:分:秒
zh_hant: 還原點 (UTC) 時間格式: 'YYYY-MM-DDTHH:MM:SSZ

# arc.restorePointDetails
source: Restore Point Details
de: Details zum Wiederherstellungspunkt
ko: 복원 지점 세부 정보
pt_br: Detalhes do Ponto de Restauração
zh_hans: 还原点详细信息
zh_hant: 還原點詳細資料

# arc.restorePointErrorrMessage
source: Provide time in correct format and within range: {0} to {1}
de: Zeit im richtigen Format und innerhalb des gültigen Bereichs angeben: {0} für {1}
ko: 올바른 형식으로 범위: {0} ~ {1} 내의 시간 제공
pt_br: Forneça a hora no formato correto e dentro do intervalo: {0} a {1}
zh_hans: 提供采用正确格式且在范围内的时间:{0} 至 {1}
zh_hant: 以正確的格式提供時間，且在以下範圍內: {0} 到 {1}

# arc.restorePointText
source: Enter a restore point in the specified time format within given range of earliest and latest restore time.
de: Geben Sie einen Wiederherstellungspunkt im angegebenen Zeitformat innerhalb des angegebenen Bereichs der frühesten und letzten Wiederherstellungszeit ein.
ko: 가장 이른 복원 시간과 가장 늦은 복원 시간의 지정된 범위 내에서 지정된 시간 형식으로 복원 지점을 입력합니다.
pt_br: Insira um ponto de restauração no formato de hora especificado dentro do intervalo de tempo de restauração mais antigo e mais recente.
zh_hans: 以指定时间格式输入处于给定最早和最近的还原时间范围内的还原点。
zh_hant: 以指定的時間格式，在指定的最早和最新還原時間範圍內輸入還原點。

# arc.restoreTimeWindowUpdateFailed
source: Point in time restore time window update failed. {0}
de: Fehler beim Aktualisieren des Zeitfensters für die Zeitpunktwiederherstellung. {0}
ko: 지정 시간 복원 시간 창 업데이트에 실패했습니다. {0}
pt_br: A atualização da janela de tempo de restauração pontual falhou. {0}
zh_hans: 时间点还原时间范围更新失败。{0}
zh_hant: 時間點還原時窗更新失敗。{0}

# arc.restoring
source: Restoring
de: Wird wiederhergestellt
es: Restaurando
fr: Restauration
it: Ripristino in corso
ja: 復元しています
ko: 복원
pt_br: Restaurando
ru: Восстановление
zh_hans: 正在还原
zh_hant: 正在還原

# arc.retentionDays
source: Point-In-Time Recovery retention (days)
de: Aufbewahrungsdauer für Point-In-Time-Wiederherstellung (Tage)
ko: 특정 시점 복원 보존(일)
pt_br: Retenção de Recuperação pontual (dias)
zh_hans: 时点恢复保留期(天)
zh_hant: 時間點復原保留 (天)

# arc.running
source: Running
de: Wird ausgeführt
es: En ejecución
fr: En cours d'exécution
it: In esecuzione
ja: 実行中
ko: 실행
pt_br: Executando
ru: Выполняется
zh_hans: 正在运行
zh_hant: 正在執行

# arc.save
source: Save
de: Speichern
es: Guardar
fr: Enregistrer
it: Salvare
ja: 保存
ko: 저장
pt_br: Salvar
ru: Сохранить
zh_hans: 保存
zh_hant: 儲存

# arc.scalingCompute
source: scaling compute vCores and memory.
de: Compute-V-Kerne und Speicher werden skaliert.
es: escalando núcleos virtuales de cálculo y memoria.
fr: mise à l’échelle du calcul vCores et de la mémoire.
it: ridimensionamento di vCore e memoria dell'ambiente di calcolo in corso.
ja: 計算の仮想コアとメモリをスケーリングしています。
ko: 계산 vCore 및 메모리 크기를 조정합니다.
pt_br: dimensionamento de vCore e memória de computação.
ru: масштабирование виртуальных ядер и памяти вычисления.
zh_hans: 正在缩放计算 vCore 和内存。
zh_hant: 正在調整計算虛擬核心和記憶體。

# arc.searchToFilter
source: Search to filter items...
de: Suchen, um Elemente zu filtern...
es: Buscar en elementos de filtro...
fr: Recherche pour filtrer des éléments...
it: Eseguire una ricerca per filtrare gli elementi...
ja: 項目の検索とフィルター...
ko: 필터링 항목 검색...
pt_br: Pesquisar para filtrar itens...
ru: Поиск для фильтрации элементов...
zh_hans: 通过搜索对项进行筛选...
zh_hant: 搜尋篩選項目...

# arc.security
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
it: Sicurezza
ja: セキュリティ
ko: 보안
pt_br: Segurança
ru: Безопасность
zh_hans: 安全性
zh_hant: 安全性

# arc.selectConnectionString
source: Select from available client connection strings below.
de: Wählen Sie unten die verfügbaren Clientverbindungszeichenfolgen aus.
es: Seleccione una de las cadenas de conexión de cliente disponibles a continuación.
fr: Sélectionnez l'une des chaînes de connexion client disponibles ci-dessous.
it: Selezionare una delle stringhe di connessione client disponibili di seguito.
ja: 使用可能なクライアント接続文字列を以下から選択します。
ko: 아래에서 사용 가능한 클라이언트 연결 문자열 중에서 선택합니다.
pt_br: Selecione uma das cadeias de conexão de cliente disponíveis abaixo.
ru: Выберите строку подключения клиента из доступных строк ниже.
zh_hans: 从下面的可用客户端连接字符串中进行选择。
zh_hant: 從下列可用的用戶端連接字串選取。

# arc.serverEndpoint
source: Server Endpoint
de: Serverendpunkt
es: Punto de conexión del servidor
fr: Point de terminaison de serveur
it: Endpoint server
ja: サーバー エンドポイント
ko: 서버 엔드포인트
pt_br: Ponto de Extremidade do Servidor
ru: Конечная точка сервера
zh_hans: 服务器终结点
zh_hant: 伺服器端點

# arc.serverGroupNodes
source: Server group nodes
de: Servergruppenknoten
es: Nodos de grupo de servidores
fr: Nœuds de groupe de serveurs
it: Nodi del gruppo di server
ja: サーバー グループ ノード
ko: 서버 그룹 노드
pt_br: Nós do grupo de servidores
ru: Узлы группы серверов
zh_hans: 服务器组节点
zh_hant: 伺服器群組節點

# arc.serverGroupType
source: Server group type
de: Typ der Servergruppe
es: Tipo de grupo de servidores
fr: Type de groupe de serveurs
it: Tipo di gruppo di server
ja: サーバー グループの種類
ko: 서버 그룹 유형
pt_br: Tipo de grupo de servidores
ru: Тип группы серверов
zh_hans: 服务器组类型
zh_hant: 伺服器群組類型

# arc.serviceEndpoints
source: Service endpoints
de: Dienstendpunkte
es: Puntos de conexión de servicio
fr: Points de terminaison de service
it: Endpoint servizio
ja: サービス エンドポイント
ko: 서비스 엔드포인트
pt_br: Pontos de extremidade de serviço
ru: Конечные точки службы
zh_hans: 服务终结点
zh_hant: 服務端點

# arc.serviceEndpointsTable
source: Service endpoints table
de: Tabelle mit Dienstendpunkten
es: Tabla de puntos de conexión de servicio
fr: Table des points de terminaison de service
it: Griglia degli endpoint servizio
ja: サービス エンドポイント テーブル
ko: 서비스 엔드포인트 테이블
pt_br: Tabela de ponto de extremidade de serviço
ru: Таблица конечных точек службы
zh_hans: 服务终结点表
zh_hant: 服務端點表格

# arc.settings
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
ko: 설정
pt_br: Configurações
ru: Параметры
zh_hans: 设置
zh_hant: 設定

# arc.showMiaaError
source: Error showing details of SQL managed instance.
de: Fehler beim Anzeigen von Details zur SQL Managed Instance.
pt_br: Erro ao mostrar detalhes da instância gerenciada de SQL.
zh_hans: 显示 SQL 托管实例的详细信息时出错。
zh_hant: 顯示 SQL 受控執行個體詳細資料時發生錯誤。

# arc.sourceDatabase
source: Source database
de: Quelldatenbank
ko: 원본 데이터베이스
pt_br: Banco de dados de origem
zh_hans: 源数据库
zh_hant: 來源資料庫

# arc.sourceDetails
source: Source Details
de: Quelldetails
ko: 원본 세부 정보
pt_br: Detalhes da Origem
zh_hans: 源详细信息
zh_hant: 來源詳細資料

# arc.sourceDetailsText
source: Select a backup source and provide details. Additional settings will be defaulted where possible based on the selected database.
de: Wählen Sie eine Sicherungsquelle aus und geben Sie Details an. Zusätzliche Einstellungen werden basierend auf der ausgewählten Sicherung nach Möglichkeit auf den Standardwert festgelegt.
ko: 백업 원본을 선택하고 세부 정보를 입력합니다. 선택한 데이터베이스를 기준으로 가능한 경우 추가 설정이 기본값으로 설정됩니다.
pt_br: Selecione uma fonte de backup e forneça os detalhes. Configurações adicionais serão padronizados sempre que possível com base no banco de dados selecionado.
zh_hans: 选择备份源并提供详细信息。如果可能，将根据所选数据库默认采用其他设置。
zh_hant: 選取備份來源並提供詳細資料。其他設定將根據選取的資料庫採用預設值。

# arc.state
source: State
de: Zustand
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
pt_br: Estado
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# arc.status
source: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# arc.storagePerNode
source: storage per node
de: Speicher pro Knoten
es: almacenamiento por nodo
fr: Stockage par nœud
it: spazio di archiviazione per nodo
ja: ストレージ (ノードあたり)
ko: 노드당 스토리지
pt_br: armazenamento por nó
ru: размер хранилища на узел
zh_hans: 每个节点的存储
zh_hant: 每個節點的儲存體

# arc.subscription
source: Subscription
de: Abonnement
ko: 구독
pt_br: Assinatura
zh_hans: 订阅
zh_hant: 訂用帳戶

# arc.subscriptionId
source: Subscription ID
de: Abonnement-ID
es: Id. de suscripción
fr: ID d'abonnement
it: ID sottoscrizione
ja: サブスクリプション ID
ko: 구독 ID
pt_br: ID da Assinatura
ru: Идентификатор подписки
zh_hans: 订阅 ID
zh_hant: 訂用帳戶識別碼

# arc.supportAndTroubleshooting
source: Support + troubleshooting
de: Support + Problembehandlung
es: Soporte y solución de problemas
fr: Support + dépannage
it: Supporto e risoluzione dei problemi
ja: サポート + トラブルシューティング
ko: 지원 + 문제 해결
pt_br: Suporte + solução de problemas
ru: Поддержка и устранение неполадок
zh_hans: 支持 + 疑难解答
zh_hant: 支援與疑難排解

# arc.supportRequestNote
source: Note that the resource configuration must have been uploaded to Azure first in order to open a support request.
de: Beachten Sie, dass die Ressourcenkonfiguration zuerst in Azure hochgeladen werden muss, um eine Supportanfrage zu öffnen.
es: Tenga en cuenta que la configuración de recursos debe haberse cargado en Azure primero para poder abrir una solicitud de soporte.
fr: Notez que la configuration de la ressource doit avoir été chargée dans Azure pour ouvrir une demande de support.
it: Tenere presente che la configurazione della risorsa deve essere stata prima caricata in Azure per aprire una richiesta di supporto.
ja: サポート要求を開くには、リソース構成が最初に Azure にアップロードされている必要があることに注意してください。
ko: 지원 요청을 열려면 먼저 리소스 구성을 Azure에 업로드해야 합니다.
pt_br: Observe que a configuração de recurso deve ter sido carregada para o Azure primeiro para abrir uma solicitação de suporte.
ru: Обратите внимание, что перед созданием запроса в службу поддержки необходимо предварительно отправить конфигурацию ресурса в Azure.
zh_hans: 请注意，必须先将资源配置上传到 Azure 才能打开支持请求。
zh_hant: 請注意，資源設定必須先上傳到 Azure 才能開啟支援要求。

# arc.suspect
source: Suspect
de: Fehlerverdächtig
es: Sospechoso
it: Sospetto
ja: 未確認
ko: 주의 대상
pt_br: Suspeito
ru: Подозрительный
zh_hans: 可疑
zh_hant: 有疑問

# arc.syncSecondaryToCommit
source: Sync Secondary To Commit
de: Sekundäre zum Commit synchronisieren
pt_br: Sincronizar Secundário para Confirmar
zh_hans: 同步辅助副本以提交
zh_hant: 同步次要複本到認可

# arc.thePasswordsDoNotMatch
source: The passwords do not match. Confirm the password or press escape to exit.
de: Die Kennwörter stimmen nicht überein. Bestätigen Sie das Kennwort, oder drücken Sie ESC, um den Vorgang zu beenden.
es: Las contraseñas no coinciden. Confirme la contraseña o presione ESC para salir.
fr: Les mots de passe ne correspondent pas. Confirmez le mot de passe ou appuyez sur Echap pour quitter.
it: Le password non corrispondono. Confermare la password o premere ESC per uscire.
ja: パスワードが一致しません。パスワードを確認するか、Esc キーを押して終了します。
ko: 암호가 일치하지 않습니다. 암호를 확인하거나 ESC 키를 눌러 종료합니다.
pt_br: As senhas não coincidem. Confirme a senha ou pressione escape para sair.
ru: Пароли не совпадают. Подтвердите пароль или нажмите клавишу ESC для выхода.
zh_hans: 密码不匹配。确认密码或按 Esc 退出。
zh_hant: 密碼不相符。請確認密碼或按 Esc 鍵結束。

# arc.troubleshoot
source: Troubleshoot
de: Problembehandlung
es: Solucionar problemas
fr: Résoudre les problèmes
it: Risoluzione dei problemi
ja: トラブルシューティング
ko: 문제 해결
pt_br: Solucionar problemas
ru: Устранение неполадок
zh_hans: 疑难解答
zh_hant: 疑難排解

# arc.type
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# arc.unknown
source: Unknown
de: Unbekannt
es: Desconocidas
fr: Inconnu
it: Sconosciuto
ja: 不明
ko: 알 수 없음
pt_br: Desconhecido
ru: Неизвестно
zh_hans: 未知
zh_hant: 未知

# arc.unloadExtensions
source: Unload extensions
de: Extensions entladen
es: Descargar extensiones
fr: Décharger des extensions
it: Scarica estensioni
ja: 拡張機能のアンロード
ko: 확장 언로드
pt_br: Descarregar extensões
ru: Отменить загрузку расширений
zh_hans: 上传扩展
zh_hant: 卸載延伸模組

# arc.updateExtensionsFailed
source: Editing extensions failed. {0}
de: Fehler beim Bearbeiten von Erweiterungen. {0}
es: Error al editar las extensiones. {0}
fr: Échec de la modification des extensions. {0}
it: Modifica delle estensioni non riuscita. {0}
ja: 拡張機能の編集に失敗しました。{0}
ko: 확장을 편집하지 못했습니다. {0}
pt_br: Falha ao editar extensões. {0}
ru: Не удалось изменить расширения. {0}
zh_hans: 编辑扩展失败。{0}
zh_hant: 編輯延伸模組失敗。{0}

# arc.updated
source: Updated {0}
de: Aktualisiert: {0}
es: {0} actualizado
fr: Mise à jour de {0}
it: È stato completato l'aggiornamento di {0}
ja: 更新: {0}
ko: 업데이트된 {0}
pt_br: Atualizado {0}
ru: Обновлено: {0}
zh_hans: 已更新的 {0}
zh_hant: 更新於 {0}

# arc.updatingInstance
source: Updating instance '{0}'...
de: Die Instanz "{0}" wird aktualisiert...
es: Actualizando instancia '{0}'...
fr: Mise à jour des instances « {0} »...
it: Aggiornamento dell'istanza "{0}" in corso...
ja: インスタンス '{0}' を更新しています...
ko: 인스턴스 {0} 업데이트 중...
pt_br: Atualizando a instância '{0}'...
ru: Обновление экземпляра "{0}"…
zh_hans: 正在更新实例“{0}”...
zh_hant: 正在更新執行個體 '{0}'...

# arc.upgrade
source: Upgrade
pt_br: Atualizar
zh_hans: 升级
zh_hant: 升級

# arc.upgradeDataController
source: Upgrade Data Controller
de: Datencontroller upgraden
pt_br: Atualizar Controlador de Dados
zh_hans: 升级数据控制器
zh_hant: 升級資料控制器

# arc.upgradeDialogController
source: During a data controller upgrade, portions of the data control plane such as Custom Resource Definitions (CRDs) and containers may be upgraded. An upgrade of the data controller will not cause downtime for the data services (SQL Managed Instance or PostgreSQL server).
de: Während des Upgrades eines Datencontrollers kann ein Upgrade für Teile der Datensteuerungsebene, z. B. benutzerdefinierte Ressourcendefinitionen (Custom Resource Definitions, CRDs) und Container durchgeführt werden. Ein Upgrade des Datencontrollers führt nicht zu Downtime für die Datendienste (SQL Managed Instance oder PostgreSQL Hyperscale-Server).
pt_br: Durante uma atualização do controlador de dados, partes do plano de controle de dados, como (CRDs) Definições de Recursos Personalizados e contêineres, podem ser atualizados. Uma atualização do controlador de dados não causará tempo de inatividade para os serviços de dados (SQL Instância Gerenciada ou servidor PostgreSQL).
zh_hans: 在数据控制器升级期间，可能会升级数据控制平面的某些部分，例如自定义资源定义(CRD)和容器。升级数据控制器不会导致数据服务(SQL 托管实例或 PostgreSQL 超大规模服务器)停机。
zh_hant: 在資料控制器升級期間，資料控制平面的部分 (例如自訂資源定義 (CRD) 和容器) 可能會升級。資料控制器升級不會導致資料服務 (SQL 受控執行個體或 PostgreSQL Hyperscale 伺服器) 停機。

# arc.upgradeDialogMiaa
source: During a SQL managed instance upgrade, portions of the data control plane such as Custom Resource Definitions (CRDs) and containers may be upgraded. An upgrade of the SQL managed instance will not cause downtime for the data services (SQL Managed Instance or PostgreSQL server).
de: Während eines SQL Managed Instance-Upgrades können Teile der Datensteuerungsebene, z. B. benutzerdefinierte Ressourcendefinitionen (CRDs) und Container, upgegradet werden. Ein Upgrade der SQL Managed Instance führt nicht zu Downtime für die Datendienste (SQL Managed Instance oder PostgreSQL-Server).
pt_br: Durante uma atualização de instância gerenciada de SQL, partes do plano de controle de dados, como CRDs (Custom Resource Definitions) e contêineres, podem ser atualizadas. Uma atualização da instância gerenciada do SQL não causará tempo de inatividade para os serviços de dados (Instância Gerenciada de SQL ou servidor PostgreSQL).
zh_hans: 在 SQL 托管实例升级期间，可能会升级数据控制平面的某些部分，例如自定义资源定义(CRD)和容器。升级 SQL 托管实例不会导致数据服务(SQL 托管实例或 PostgreSQL 超大规模服务器)停机。
zh_hant: 在 SQL 受控執行個體升級期間，資料控制平面的部分 (例如自訂資源定義 (CRD) 和容器) 可能會升級。SQL 受控執行個體升級不會導致資料服務 (SQL 受控執行個體或 PostgreSQL Hyperscale 伺服器) 停機。

# arc.upgradeManagement
source: Upgrade Management
de: Upgradeverwaltung
pt_br: Gerenciamento de Atualizações
zh_hans: 升级管理
zh_hant: 升級管理

# arc.upgradeMiaa
source: Upgrade SQL Managed Instance
de: SQL Managed Instance-Upgrade
pt_br: Atualizar Instância Gerenciada de SQL
zh_hans: 升级 Azure SQL 托管实例
zh_hant: 升級 SQL 受控執行個體

# arc.upgradingController
source: Data controller is being upgraded. You can check the status of the upgrade by running the following command: 'kubectl get datacontrollers -A'
de: Der Datencontroller wird upgegradet. Sie können den Status des Upgrades überprüfen, indem Sie den folgenden Befehl ausführen: “kubectl get datacontrollers -A”
pt_br: O controlador de dados está sendo atualizado. Você pode verificar o status da atualização executando o seguinte comando: 'kubectl get datacontrollers -A'
zh_hans: 正在升级数据控制器。可以通过运行以下命令来检查升级状态: \"kubectl get datacontrollers -A\"
zh_hant: 正在升級資料控制器。您可以執行下列命令來檢查升級的狀態: 'kubectl get datacontrollers -A'

# arc.upgradingDirectDC
source: Upgrading data controller '{0}' with command 'az arcdata dc upgrade --desired-version {1} --name {0} --resource-group {2}'
de: Für den Datencontroller „{0}“ wird mit dem Befehl „az arcdata dc upgrade --desired-version {1} --name {0} --resource-group {2}„ ein Upgrade durchgeführt
pt_br: Atualizando controlador de dados '{0}' com o comando 'az arcdata dc upgrade --desired-version {1} --name {0} --resource-group {2}'
zh_hans: 使用命令 "az arcdata dc upgrade --desired-version {1} --name {0} --resource-group {2}" 升级数据控制器 "{0}"
zh_hant: 使用命令 'az arcdata dc upgrade --desired-version {1} --name {0} --resource-group {2}' 升級資料控制器 '{0}'

# arc.upgradingDirectMiaa
source: Upgrading SQL MIAA '{0}' with command 'az sql mi-arc upgrade --name {0} --resource-group {1}'
de: Für SQL MIAA „{0}“ wird mit dem Befehl „az sql mi-arc upgrade --name {0} --resource-group {1}„ ein Upgrade durchgeführt
pt_br: Atualização do SQL MIAA '{0}' com o comando 'az sql mi-arc upgrade --name {0} --resource-group {1}'
zh_hans: 使用命令 "az sql mi-arc upgrade --name {0} --resource-group {1}" 升级 SQL MIAA "{0}"
zh_hant: 使用命令 'az sql mi-arc upgrade --name {0} --resource-group {1}' 升级 SQL MIAA '{0}'

# arc.upgradingIndirectDC
source: Upgrading data controller '{0}' with command 'az arcdata dc upgrade --desired-version {1} --name {0} --k8s-namespace {2} --use-k8s'
de: Für den Datencontroller „{0}“ wird mit dem Befehl „az arcdata dc upgrade --desired-version {1} --name {0} --k8s-namespace {2} --use-k8s„ ein Upgrade durchgeführt
pt_br: Atualizando controlador de dados '{0}' com o comando 'az arcdata dc upgrade --desired-version {1} --name {0} --k8s-namespace {2} --use-k8s'
zh_hans: 使用命令 "az arcdata dc upgrade --desired-version {1} --name {0} --k8s-namespace {2} --use-k8s" 升级数据控制器 "{0}"
zh_hant: 使用命令 'az arcdata dc upgrade --desired-version {1} --name {0} --k8s-namespace {2} --use-k8s' 升級資料控制器 '{0}'
