Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.postgres.server.group.name.validation.description
source: Server group name must consist of lower case alphanumeric characters or '-', start with a letter, end with an alphanumeric character, and be 11 characters or fewer in length.
de: Der Name der Servergruppe muss aus alphanumerischen Kleinbuchstaben oder "-" bestehen, mit einem Buchstaben beginnen, mit einem alphanumerischen Zeichen enden und höchstens 11 Zeichen lang sein.
es: El nombre del grupo de servidores debe incluir caracteres alfanuméricos en minúsculas o "-", empezar con una letra, terminar con un carácter alfanumérico y tener 11 caracteres de longitud o menos.
fr: Le nom du groupe de serveurs doit être constitué de caractères alphanumériques minuscules ou « - », commencer par une lettre, se terminer par un caractère alphanumérique et comporter 11 caractères au maximum.
it: Il nome del gruppo di server deve essere composto da caratteri alfanumerici minuscoli o "-", iniziare con una lettera, terminare con un carattere alfanumerico e avere una lunghezza massima di 11 caratteri.
ja: サーバー グループ名は、小文字の英数字または '-' で構成され、先頭に文字を使用し、末尾に英数字を使用して、11 文字以下にする必要があります。
ko: 서버 그룹 이름은 소문자 영숫자 또는 '-'로 구성되어야 하며 문자로 시작하고 영숫자로 끝나며 길이가 11자 이하여야 합니다.
pt_br: O nome do grupo de servidores deve consistir em caracteres alfanuméricos minúsculos ou '-', começar com uma letra, terminar com um caractere alfanumérico e ter 11 caracteres ou menos de comprimento.
ru: Имя группы серверов должно состоять из строчных букв и цифр или дефисов "-", начинаться с буквы, заканчиваться буквой или цифрой и содержать не более 11 символов.
zh_hans: 服务器组名称必须包含小写字母数字字符或 “-”，以字母开头，以字母数字字符结尾，并且长度不能超过 11 个字符。
zh_hant: 伺服器群組名稱必須包含小寫英數字元或 '-'、以字母開頭，以英數字元結尾，且長度不得超過 11 個字元。

# arc.postgres.server.group.port
source: Port
es: Puerto
it: Porta
ja: ポート
ko: 포트
pt_br: Porta
ru: Порт
zh_hans: 端口
zh_hant: 連接埠

# arc.postgres.server.group.volume.size.backups.description
source: The size of the storage volume to be used for backups in GB.
de: Die Größe des Speichervolumens, das für Sicherungen verwendet werden soll, in GB.
es: El tamaño del volumen de almacenamiento que se usará en las copias de seguridad, en GB.
fr: La taille du volume de stockage à utiliser pour les sauvegardes en Go.
it: La dimensione del volume di archiviazione da utilizzare per i backup in GB.
ja: バックアップに使用するストレージ ボリュームのサイズ (GB)。
ko: 백업에 사용할 저장소 볼륨의 크기(GB)입니다.
pt_br: O tamanho do volume de armazenamento a ser usado para backups em GB.
ru: Размер тома хранилища, используемого для резервных копий (ГБ).
zh_hans: 用于备份的存储卷大小(GB)。
zh_hant: 要用於備份之儲存磁碟區的大小 (GB)。

# arc.postgres.server.group.volume.size.backups.label
source: Volume Size GB (Backups)
de: Volumegröße GB (Sicherungen)
es: Tamaño de volumen en GB (copias de seguridad)
fr: Taille du volume Go (sauvegardes)
it: GB delle dimensioni del volume (backup)
ja: ボリュームサイズ GB (バックアップ)
ko: 볼륨 크기 GB(백업)
pt_br: Tamanho do Volume em GB (Backups)
ru: Размер тома в ГБ (резервные копии)
zh_hans: 卷大小 GB (备份)
zh_hant: 磁碟區大小 GB (備份)

# arc.postgres.server.group.volume.size.data.description
source: The size of the storage volume to be used for data in GB.
de: Die Größe des Speichervolumens, das für Daten verwendet werden soll, in GB.
es: Tamaño del volumen de almacenamiento que usará para los datos en GB.
fr: La taille du volume de stockage à utiliser pour les données en Go.
it: La dimensione del volume di archiviazione da utilizzare per i dati in GB.
ja: データに使用するストレージ ボリュームのサイズ (GB)。
ko: 데이터에 사용할 스토리지 볼륨의 크기(GB)입니다.
pt_br: O tamanho do volume de armazenamento a ser usado para dados em GB.
ru: Размер тома хранилища, используемого для данных (ГБ).
zh_hans: 对数据所用的存储量大小(GB)。
zh_hant: 要用於資料之儲存磁碟區的大小 (GB)。

# arc.postgres.server.group.volume.size.data.label
source: Volume Size GB (Data)
de: Volumegröße GB (Daten)
es: Tamaño del volumen en GB (datos)
fr: Taille du volume Go (Données)
it: Dimensioni volume in GB (dati)
ja: ボリューム サイズ GB (データ)
ko: 볼륨 크기 GB(데이터)
pt_br: Tamanho do volume em GB (dados)
ru: Размер тома в ГБ (данные)
zh_hans: 卷大小 GB (数据)
zh_hant: 磁碟區大小 GB (資料)

# arc.postgres.server.group.volume.size.logs.description
source: The size of the storage volume to be used for logs in GB.
de: Die Größe des Speichervolumens, das für Protokolle verwendet werden soll, in GB.
es: El tamaño del volumen de almacenamiento que se usará para los registros, en GB.
fr: La taille du volume de stockage à utiliser pour les journaux en Go.
it: La dimensione del volume di archiviazione da utilizzare per i log in GB.
ja: ログに使用するストレージ ボリュームのサイズ (GB)。
ko: 로그에 사용할 저장소 볼륨의 크기(GB)입니다.
pt_br: O tamanho do volume de armazenamento a ser usado para logs em GB.
ru: Размер тома хранилища, используемого для журналов (ГБ).
zh_hans: 用于日志的存储卷大小(GB)。
zh_hant: 要用於記錄之儲存磁碟區的大小 (GB)。

# arc.postgres.server.group.volume.size.logs.label
source: Volume Size GB (Logs)
de: Volumegröße GB (Protokolle)
es: Tamaño de volumen en GB (registros)
fr: Taille du volume Go (journaux)
it: GB delle dimensioni del volume (log)
ja: ボリュームサイズ GB (ログ)
ko: 볼륨 크기 GB(로그)
pt_br: Tamanho do Volume GB (Logs)
ru: Размер тома в ГБ (журналы)
zh_hans: 卷大小 GB (日志)
zh_hant: 磁碟區大小 GB (記錄)

# arc.postgres.server.group.workers.cores.limit.description
source: The maximum number of CPU cores for the Postgres instance that can be used per node. Fractional cores are supported.
de: Die maximale Anzahl von CPU-Kernen für die Postgres-Instanz, die pro Knoten verwendet werden können. Teilkerne werden unterstützt.
es: Número máximo de núcleos de CPU para la instancia de Postgres que se puede usar por nodo. Se admiten núcleos fraccionarios.
fr: Nombre maximal de cœurs de processeur pour l’instance Postgres qui peuvent être utilisés par nœud. Les cœurs fractionnaires sont pris en charge.
it: Numero massimo di core CPU per l'istanza di Postgres che possono essere usati per nodo. Sono supportati core frazionari.
ja: ノードごとに使用できる Postgres インスタンスの CPU コアの最大数。分数のコアがサポートされています。
ko: 노드당 사용할 수 있는 Postgres 인스턴스의 최대 CPU 코어 수입니다. 소수 코어가 지원됩니다.
pt_br: O número máximo de núcleos de CPU para a instância Postgres que pode ser usado por nó. Núcleos fracionários são suportados.
ru: Максимальное число ядер процессора для экземпляра Postgres, которое может использоваться на узел. Поддерживается дробное количество ядер.
zh_hans: 每个节点可使用的 Postgres 实例的最大 CPU 内核数。支持分数核心。
zh_hant: 每個節點可使用之 Postgres 執行個體的 CPU 核心數上限。支援分數的核心數。

# arc.postgres.server.group.workers.cores.limit.label
source: CPU limit (cores per node)
de: CPU-Limit (Kerne pro Knoten)
es: Límite de CPU (núcleos por nodo)
fr: Limite du processeur (cœurs par nœud)
it: Limite CPU (unità di elaborazione per nodo)
ja: CPU の制限 (ノードあたりのコア数)
ko: CPU 제한(노드당 코어 수)
pt_br: Limite de CPU (núcleos por nó)
ru: Ограничение ЦП (ядер на узел)
zh_hans: CPU 限制(每节点核心数)
zh_hant: CPU 限制 (每個節點的核心)

# arc.postgres.server.group.workers.cores.request.description
source: The minimum number of CPU cores that must be available per node to schedule the service. Fractional cores are supported.
de: Die Mindestanzahl von CPU-Kernen, die pro Knoten zur Planung des Diensts verfügbar sein müssen. Teilkerne werden unterstützt.
es: La cantidad mínima de núcleos de CPU que deben estar disponibles por nodo para programar el servicio. Se admiten núcleos fraccionales.
fr: Le nombre minimum de cœurs de processeur qui doivent être disponibles par nœud pour planifier le service. Les fractions de cœurs sont prises en charge.
it: Il numero minimo di core CPU che devono essere disponibili per nodo per pianificare il servizio. Sono supportati i core frazionari.
ja: サービスをスケジュールするために、ノードごとに使用可能でなければならない CPU コアの最小数です。分数のコアがサポートされています。
ko: 서비스를 예약하기 위해 노드당 사용할 수 있어야 하는 최소 CPU 코어 수입니다. 소수 코어가 지원됩니다.
pt_br: O número mínimo de núcleos de CPU que devem estar disponíveis por nó para agendar o serviço. Núcleos fracionários são suportados.
ru: Минимальное количество ядер процессора, которое должно быть доступно каждому узлу, чтобы запланировать службу. Поддерживается дробное количество ядер.
zh_hans: 每个节点上必须可用的用以安排服务的最小 CPU 核心数。支持分数核心。
zh_hant: 每個節點欲排程服務必須可使用之 CPU 核心數的最小值。支援分數的核心數。

# arc.postgres.server.group.workers.cores.request.label
source: CPU request (cores per node)
de: CPU-Anforderung (Kerne pro Knoten)
es: Solicitud de CPU (núcleos por nodo)
fr: Demande processeur (cœurs par nœud)
it: Richiesta CPU (unità di elaborazione per nodo)
ja: CPU 要求 (ノードあたりのコア数)
ko: CPU 요청(노드당 코어 수)
pt_br: Solicitação de CPU (núcleos por nó)
ru: Запрос ЦП (ядер на узел)
zh_hans: CPU 请求(每节点核心数)
zh_hant: CPU 要求 (每個節點的核心)

# arc.postgres.server.group.workers.description
source: The number of worker nodes to provision in a sharded cluster, or zero (the default) for single-node Postgres.
de: Die Anzahl von Workerknoten, die in einem Cluster mit Sharding bereitgestellt wird, oder 0 für Postgre-Instanzen mit einem einzigen Knoten (dies ist die Standardeinstellung).
es: El número de nodos de trabajo que se van a aprovisionar en un clúster con particiones, o cero (valor predeterminado) para Postgres de un solo nodo.
fr: Nombre de nœuds Worker à approvisionner dans un cluster partagé, ou zéro (valeur par défaut) pour Postgres à nœud unique.
it: Il numero di nodi di lavoro di cui eseguire il provisioning in un cluster condiviso oppure zero (impostazione predefinita) per Postgres a nodo singolo.
ja: シャード化されたクラスターでプロビジョニングするワーカー ノードの数、または単一ノード Postgres では 0 (既定値)。
ko: 분할된 클러스터에서 프로비전할 작업자 노드 수 또는 단일 노드 Postgres의 경우 0(기본값)입니다.
pt_br: O número de nós de trabalho para provisionar em um cluster fragmentado ou zero (o padrão) para Postgres de nó único.
ru: Число рабочих узлов для подготовки в сегментированном кластере или нуль (по умолчанию) для Postgres с одним узлом.
zh_hans: 要在分片群集中设置的辅助角色节点的数量，对于单节点 Postgres，默认为零。
zh_hant: 要在分區的叢集中佈建的背景工作節點數，或針對單一節點 Postgres 則為零 (預設值)。

# arc.postgres.server.group.workers.label
source: Number of workers
de: Anzahl von Workern
es: Número de trabajos
fr: Nombre de workers
it: Numero di ruoli di lavoro
ja: ワーカーの数
ko: 작업자 수
pt_br: Número de trabalhadores
ru: Число рабочих ролей
zh_hans: 工作器数量
zh_hant: 背景工作數目

# arc.postgres.server.group.workers.memory.limit.description
source: The memory limit of the Postgres instance per node in GB.
de: Das Arbeitsspeicherlimit der Postgres-Instanz pro Knoten in GB.
es: El límite de memoria de la instancia de Postgres por nodo en GB.
fr: Limite de mémoire de l’instance Postgres par nœud en Go.
it: Il limite di memoria dell'istanza Postgres per nodo in GB.
ja: ノードごとの Postgres インスタンスのメモリ制限 (GB) 。
ko: 노드당 Postgres 인스턴스의 메모리 제한(GB)입니다.
pt_br: O limite de memória da instância do Postgres por nó em GB.
ru: Ограничение памяти экземпляра Postgres на узел (ГБ).
zh_hans: 每个节点 Postgres 实例的内存限制(GB)。
zh_hant: 每個節點之 Postgres 執行個體的記憶體限制 (GB)。

# arc.postgres.server.group.workers.memory.limit.label
source: Memory limit (GB per node)
de: Speicherlimit (GB pro Knoten)
es: Límite de memoria (GB por nodo)
fr: Limite de mémoire (Go par nœud)
it: Limite di memoria (GB per nodo)
ja: メモリの制限 (ノードあたりの GB)
ko: 메모리 제한(노드당 GB)
pt_br: Limite de memória (GB por nó)
ru: Предельный объем памяти (ГБ на узел)
zh_hans: 内存限制(GB/节点)
zh_hant: 記憶體限制 (每個節點的 GB)

# arc.postgres.server.group.workers.memory.request.description
source: The memory request of the Postgres instance per node in GB.
de: Die Speicheranforderung der Postgres-Instanz pro Knoten in GB.
es: Solicitud de memoria de la instancia de Postgres por nodo en GB.
fr: Demande de mémoire de l’instance Postgres par nœud en Go.
it: La richiesta di memoria dell'istanza Postgres per nodo in GB.
ja: ノードごとの Postgres インスタンスのメモリ要求 (GB)。
ko: 노드당 Postgres 인스턴스의 메모리 요청(GB)입니다.
pt_br: A solicitação de memória da instância Postgres por nó em GB.
ru: Запрос памяти экземпляра Postgres на узел (ГБ).
zh_hans: 每个节点的 Postgres 实例的内存请求(GB)。
zh_hant: 每個節點之 Postgres 執行個體的記憶體要求 (GB)。

# arc.postgres.server.group.workers.memory.request.label
source: Memory request (GB per node)
de: Arbeitsspeicheranforderung (GB pro Knoten)
es: Solicitud de memoria (GB por nodo)
fr: Demande de mémoire (Go par nœud)
it: Richiesta di memoria (GB per nodo)
ja: メモリ要求 (ノードあたりの GB)
ko: 메모리 요청(노드당 GB)
pt_br: Solicitação de memória (GB por nó)
ru: Запрос памяти (ГБ на узел)
zh_hans: 内存请求(每节点 GB)
zh_hant: 記憶體要求 (每個節點的 GB)

# arc.postgres.settings.resource.coordinator.title
source: Coordinator Node Compute Configuration
de: Computekonfiguration für Koordinatorknoten
es: Configuración del proceso del nodo de coordinación
fr: Configuration du calcul du nœud coordinateur
it: Configurazione dell'ambiente di calcolo del nodo coordinatore
ja: コーディネーター ノード コンピューティングの構成
ko: 코디네이터 노드 컴퓨팅 구성
pt_br: Configuração de Computação do Nó Coordenador
ru: Конфигурация вычисления узла-координатора
zh_hans: 协调器节点计算配置
zh_hant: 協調器節點計算設定

# arc.postgres.settings.resource.worker.title
source: Worker Nodes Compute Configuration
de: Computekonfiguration für Workerknoten
es: Configuración de proceso de nodos de trabajo
fr: Configuration du calcul des nœuds Worker
it: Configurazione di calcolo dei nodi di lavoro
ja: ワーカー ノード コンピューティングの構成
ko: 작업자 노드 컴퓨팅 구성
pt_br: Configuração de Computação dos Nós de Trabalho
ru: Конфигурация вычисления рабочих узлов
zh_hans: 工作器节点计算配置
zh_hant: 背景工作節點計算設定

# arc.postgres.settings.section.title
source: General settings
de: Allgemeine Einstellungen
es: Configuración general
fr: Paramètres généraux
it: Impostazioni generali
ja: 全般設定
ko: 일반 설정
pt_br: Configurações Gerais
ru: Общие параметры
zh_hans: 常规设置
zh_hant: 一般設定

# arc.postgres.settings.storage.title
source: Storage settings
de: Speichereinstellungen
es: Configuración de almacenamiento
fr: Paramètres de stockage
it: Impostazioni di archiviazione
ja: ストレージ設定
ko: 저장소 설정
pt_br: Configurações de armazenamento
ru: Параметры хранилища
zh_hans: 存储设置
zh_hant: 儲存體設定

# arc.postgres.storage-class.backups.description
source: The storage class to be used for backup persistent volumes
de: Die Speicherklasse, die für persistente Volumes für Sicherungen verwendet werden soll.
es: La clase de almacenamiento que se va a usar para los volúmenes persistentes de las copias de seguridad
fr: La classe de stockage à utiliser pour les volumes persistants de sauvegarde.
it: La classe di archiviazione da usare per il backup di volumi persistenti
ja: バックアップの継続的ボリュームに使用されるストレージ クラスです。
ko: 백업 영구 볼륨에 사용할 스토리지 클래스입니다.
pt_br: A classe de armazenamento a ser utilizada para backups de volumes persistentes
ru: Класс хранения, используемый для постоянных томов резервных копий
zh_hans: 要用于备份永久卷的存储类
zh_hant: 用於備份永久性磁碟區的儲存類別

# arc.postgres.storage-class.data.description
source: The storage class to be used for data persistent volumes
de: Die Speicherklasse, die für persistente Datenvolumes verwendet werden soll
es: Clase de almacenamiento que se usará para volúmenes persistentes de datos.
fr: La classe de stockage à utiliser pour les volumes persistants des données
it: La classe di archiviazione da usare per i dati di volumi persistenti
ja: データの継続的ボリュームのログに使用されるストレージ クラスです
ko: 데이터 영구 볼륨에 사용할 스토리지 클래스입니다.
pt_br: A classe de armazenamento a ser usada para volumes persistentes de dados
ru: Класс хранения, используемый для постоянных томов данных
zh_hans: 要用于数据永久卷的存储类。
zh_hant: 用於資料永久性磁碟區的儲存類別

# arc.postgres.storage-class.logs.description
source: The storage class to be used for logs persistent volumes
de: Die Speicherklasse, die für persistente Protokollvolumes verwendet werden soll
es: La clase de almacenamiento que se va a usar para los volúmenes persistentes de registros
fr: La classe de stockage à utiliser pour les volumes persistants des journaux
it: La classe di archiviazione da usare per i log di volumi persistenti
ja: ログの継続的ボリュームに使用されるストレージ クラス
ko: 로그 영구 볼륨에 사용할 스토리지 클래스입니다.
pt_br: A classe de armazenamento a ser usada para logs volumes persistentes
ru: Класс хранения, используемый для постоянных томов журналов
zh_hans: 要用于日志永久卷的存储类。
zh_hant: 用於記錄永久性磁碟區的儲存類別。

# arc.postgres.wizard.page1.title
source: Provide Azure enabled PostgreSQL Hyperscale server group parameters
de: Servergruppenparameter für PostgreSQL Hyperscale mit Azure Arc-Unterstützung bereitstellen
es: Proporcionar los parámetros del grupo de servidores de hiperescala de PostgreSQL habilitado para Azure
fr: Fournir les paramètres de groupe de serveurs PostgreSQL Hyperscale avec Azure Arc
it: Specificare i parametri del gruppo di server PostgreSQL Hyperscale abilitato per Azure
ja: Azure enabled PostgreSQL Hyperscale サーバー グループのパラメーターを指定する
ko: Azure 지원 PostgreSQL 하이퍼스케일 서버 그룹 매개 변수 제공
pt_br: Fornece parâmetros de grupo de servidores de Hiperescala PostgreSQL habilitados para Azure
ru: Укажите параметры группы серверов гипермасштабирования PostgreSQL с поддержкой Azure
zh_hans: 提供启用 Azure 的 PostgreSQL 超大规模服务器组参数
zh_hant: 提供支援 Azure 的 PostgreSQL 超大規模資料庫伺服器群組參數

# arc.postgres.wizard.title
source: Deploy an Azure Arc-enabled PostgreSQL Hyperscale server group
de: Servergruppe für PostgreSQL Hyperscale mit Azure Arc-Unterstützung bereitstellen
pt_br: Implantar um grupo de servidores de Hiperescala de PostgreSQL habilitada para Azure Arc
zh_hans: 部署启用 Azure Arc 的 PostgreSQL 超大规模服务器组
zh_hant: 部署啟用 Azure Arc 的 PostgreSQL 超大規模資料庫伺服器群組

# arc.sql.connection.settings.section.title
source: SQL Connection information
de: SQL-Verbindungsinformationen
es: Información de conexión de SQL
fr: Informations sur la connexion SQL
it: Informazioni di connessione SQL
ja: SQL 接続情報
ko: SQL 연결 정보
pt_br: Informações da Conexão SQL
ru: Сведения о подключении SQL
zh_hans: SQL 连接信息
zh_hant: SQL 連線資訊

# arc.sql.cores-limit.description
source: The cores limit of the managed instance as an integer.
de: Der Kerngrenzwert der verwalteten Instanz als ganze Zahl.
es: El límite de núcleos de la instancia administrada como un entero.
fr: Limite des cœurs de l’instance managée en tant qu’entier.
it: Il limite core dell'istanza gestita come numero intero.
ja: 整数で表したマネージド インスタンスのコア数の上限。
ko: 정수로 관리되는 인스턴스의 코어 제한입니다.
pt_br: O limite de núcleos da instância gerenciada como um inteiro.
ru: Предельное количество ядер управляемого экземпляра в виде целого числа.
zh_hans: 托管实例的核心限制(整数)。
zh_hant: 受控執行個體的核心數限制 (整數)。

# arc.sql.cores-request.description
source: The request for cores of the managed instance as an integer.
de: Die Anforderung von Kernen der verwalteten Instanz als ganze Zahl.
es: Solicitud de núcleos de la instancia administrada como un entero.
fr: Demande de cœurs de l’instance gérée en tant qu’entier.
it: La richiesta di core dell'istanza gestita come numero intero.
ja: 整数として表したマネージド インスタンスのコアの要求。
ko: 정수로 관리되는 인스턴스의 코어에 대한 요청입니다.
pt_br: A solicitação de núcleos da instância gerenciada como um inteiro.
ru: Запрос ядер управляемого экземпляра в виде целого числа.
zh_hans: 将托管实例的核心作为整数的请求。
zh_hant: 受控執行個體的核心數要求，以整數表示。

# arc.sql.cost.summary
source: Cost Summary
de: Kostenzusammenfassung
ko: 비용 요약
pt_br: Resumo de Custos
zh_hans: 成本摘要
zh_hant: 成本摘要

# arc.sql.cost.summary.additional.charge
source: Additional charge per usage. See {0} for more detail.
de: Zusätzliche Gebühren pro Nutzung. Weitere Informationen finden Sie unter {0}.
ko: 사용량당 추가 요금. 자세한 내용은 {0}을(를) 참조하세요.
pt_br: Custo adicional por uso. Consulte {0} para obter mais detalhes.
zh_hans: 每次使用的额外费用。有关详细信息，请参阅 {0}。
zh_hant: 每個使用方式的額外費用。如需詳細資訊，請參閱 {0}。

# arc.sql.cost.summary.admin.account
source: Administrator account
de: Administratorkonto
ko: 관리자 계정
pt_br: Conta de administrador
zh_hans: 管理员帐户
zh_hant: 系統管理員帳戶

# arc.sql.cost.summary.azure.hybrid.benefit.discount
source: Azure Hybrid Benefit discount (in USD)
de: Azure-Hybridvorteil-Rabatt (in USD)
ko: Azure 하이브리드 혜택 할인(USD)
pt_br: Desconto no Benefício Híbrido do Azure (em USD)
zh_hans: Azure 混合使用权益折扣(美元)
zh_hant: Azure Hybrid Benefit 折扣 (美元)

# arc.sql.cost.summary.basics
source: Basics
de: Allgemeine Informationen
ko: 기본 사항
pt_br: Básico
zh_hans: 基本信息
zh_hant: 基本

# arc.sql.cost.summary.billable.replicas
source: Billable replicas
de: Abrechenbare Replikate
pt_br: Réplicas faturáveis
zh_hans: 可计费副本
zh_hant: 計費複本

# arc.sql.cost.summary.business.critical
source: Business Critical
de: Unternehmenskritisch
ko: 중요 비즈니스용
pt_br: Comercialmente Crítico
zh_hans: 业务关键
zh_hant: 業務關鍵

# arc.sql.cost.summary.cost.vcore
source: Cost per vCore (in USD)
de: Kosten pro V-Kern (in USD)
ko: vCore당 비용(USD)
pt_br: Custo por vCore (em USD)
zh_hans: 每个 vCore 的成本(美元)
zh_hant: 每 vCore 成本 (美元)

# arc.sql.cost.summary.custom.location
source: Custom location
de: Benutzerdefinierter Speicherort
ko: 사용자 지정 위치
pt_br: Localização personalizada
zh_hans: 自定义位置
zh_hant: 自訂位置

# arc.sql.cost.summary.estimated.cost.per.month
source: Estimated cost per month
de: Geschätzte Kosten pro Monat
ko: 월별 예상 비용
pt_br: Custo estimado por mês
zh_hans: 每月估计成本
zh_hant: 每月預估費用

# arc.sql.cost.summary.general.purpose
source: General Purpose
de: Universell
ko: 범용
pt_br: Uso Geral
zh_hans: 常规用途
zh_hant: 一般用途

# arc.sql.cost.summary.instance.name
source: Instance name
de: Instanzname
ko: 인스턴스 이름
pt_br: Nome da instância
zh_hans: 实例名称
zh_hant: 執行個體名稱

# arc.sql.cost.summary.managed.instance.admin.login
source: Managed Instance admin login
de: Administratoranmeldung für verwaltete Instanz
ko: Managed Instance 관리자 로그인
pt_br: Instância Gerenciada logon de administrador
zh_hans: 托管实例管理员登录名
zh_hant: 受控執行個體系統管理員登入

# arc.sql.cost.summary.pricing.details
source: pricing details
de: Preisdetails
ko: 가격 책정 세부 정보
pt_br: detalhes do preço
zh_hans: 定价详情
zh_hant: 價格詳細資料

# arc.sql.cost.summary.resource.group
source: Resource group
de: Ressourcengruppe
ko: 리소스 그룹
pt_br: Grupo de recursos
zh_hans: 资源组
zh_hant: 資源群組

# arc.sql.cost.summary.service.tier
source: Service Tier
de: Dienstebene
ko: 서비스 계층
pt_br: Camada de Serviço
zh_hans: 服务层
zh_hant: 服務層級

# arc.sql.cost.summary.service.tier.learn.more.description
source: Select from the latest vCore service tiers available for SQL Managed Instance - Azure Arc including General Purpose and Business Critical.
de: Wählen Sie aus den neuesten V-Kern-Dienstebenen aus, die für SQL Managed Instance verfügbar sind – Azure Arc einschließlich Universell und Unternehmenskritisch.
pt_br: Selecione entre as camadas de serviço vCore mais recentes disponíveis para o Instância Gerenciada de SQL - Azure Arc incluindo Uso Geral e Comercialmente Crítico.
zh_hans: 从可用于 SQL 托管实例 - Azure Arc 的最新 vCore 服务层(包括常规用途和业务关键型)中进行选择。
zh_hant: 從 Azure SQL 受控執行個體 - Azure Arc (包括一般用途和商務關鍵性) 可用的最新 V 核心服務層級中選取。

# arc.sql.cost.summary.service.tier.learn.more.text
source: Learn more
de: Weitere Informationen
ko: 자세히 알아보기
pt_br: Saiba mais
zh_hans: 了解详细信息
zh_hant: 深入了解

# arc.sql.cost.summary.sql.connection.info
source: SQL Connection Information
de: SQL-Verbindungsinformationen
ko: SQL 연결 정보
pt_br: Informações da conexão SQL
zh_hans: SQL 连接信息
zh_hant: SQL 連線資訊

# arc.sql.cost.summary.sql.instance.settings
source: SQL Instance Settings
de: SQL-Instanzeinstellungen
ko: SQL 인스턴스 설정
pt_br: Configurações da Instância do SQL
zh_hans: SQL 实例设置
zh_hant: SQL 執行個體設定

# arc.sql.cost.summary.sql.miaa
source: SQL managed instance - Azure Arc
de: Verwaltete SQL-Instanz – Azure Arc
ko: SQL 관리형 인스턴스 - Azure Arc
pt_br: Instância gerenciada do SQL – Azure Arc
zh_hans: SQL 托管实例 - Azure Arc
zh_hant: SQL 受控執行個體 - Azure Arc

# arc.sql.cost.summary.sql.miaa.cost.summary
source: SQL Managed Instance - Azure Arc Cost Summary
de: SQL Managed Instance – Azure Arc-Kostenzusammenfassung
ko: SQL Managed Instance - Azure Arc 비용 요약
pt_br: Instância Gerenciada de SQL — Resumo de custos do Azure Arc
zh_hans: Azure SQL 托管实例 – Azure Arc 成本摘要
zh_hant: SQL 受控執行個體 - Azure Arc 成本摘要

# arc.sql.cost.summary.subscription
source: Subscription
de: Abonnement
ko: 구독
pt_br: Assinatura
zh_hans: 订阅
zh_hant: 訂用帳戶

# arc.sql.cost.summary.vcore.limit
source: CPU vCores Limit
de: CPU-Grenzwert für virtuelle Kerne
ko: CPU vCore 제한
pt_br: Limite de vCores da CPU
zh_hans: CPU vCores 限制
zh_hant: CPU vCore 限制
