Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.coordinatorNodeConfigurationInformation
source: You can configure the number of CPU cores and storage size that will apply to the coordinator node. Adjust the number of CPU cores and memory settings for your server group. To reset the requests and/or limits, pass in empty value.
de: Sie können die Anzahl der CPU-Kerne und die Speichergröße konfigurieren, die für den Koordinatorknoten gelten. Passen Sie die Anzahl der CPU-Kerne und Speichereinstellungen für Ihre Servergruppe an. Übergeben Sie einen leeren Wert, um die Anforderungen und/oder Grenzwerte zurückzusetzen.
es: Puede configurar el número de núcleos de CPU y el tamaño de almacenamiento que se aplicará al nodo de coordinación. Ajuste el número de núcleos de CPU y la configuración de memoria para su grupo de servidores. Para restablecer las solicitudes o los límites, utilice un valor vacío.
fr: Vous pouvez configurer le nombre de cœurs d’UC et la taille de stockage qui s’appliqueront au nœud coordinateur. Ajustez le nombre de cœurs d’UC et de paramètres de mémoire pour votre groupe de serveurs. Pour réinitialiser les demandes et/ou les limites, transmettez une valeur vide.
it: È possibile configurare il numero di core CPU e le dimensioni di archiviazione che verranno applicati al nodo coordinatore. Modificare il numero di core CPU e le impostazioni di memoria per il gruppo di server. Per reimpostare le richieste e/o i limiti, inserire un valore vuoto.
ja: すべてのコーディネーター ノードに適用される CPU コアの数とストレージ サイズを構成できます。サーバー グループの CPU コアの数とメモリの設定を調整します。要求または制限をリセットするには、空の値を渡してください。
ko: 코디네이터 노드에 적용되는 CPU 코어 수와 스토리지 크기를 구성할 수 있습니다. 서버 그룹의 CPU 코어 수 및 메모리 설정을 조정합니다. 요청 및/또는 제한을 초기화하려면 빈 값을 전달하세요.
pt_br: Você pode configurar o número de núcleos de CPU e o tamanho de armazenamento que serão aplicados ao nó coordenador. Ajuste o número de núcleos de CPU e configurações de memória para o grupo de servidores. Para redefinir as solicitações e/ou limites, passe um valor vazio.
ru: Можно настроить количество ядер ЦП и размер хранилища, которые будут применяться к узлу-координатору. Настройте количество ядер ЦП и параметры памяти для группы серверов. Чтобы сбросить запросы и/или ограничения, передайте пустое значение.
zh_hans: 可以配置将应用于协调器节点的 CPU 核心数和存储大小。调整服务器组的 CPU 核心数和内存设置。要重置请求和/或限制，请传入空值。
zh_hant: 您可以設定將套用至協調器節點的 CPU 核心數和儲存體大小。調整您伺服器群組的 CPU 核心數和記憶體設定。若要重設要求和/或限制，請傳入空值。

# arc.coordinatorNodeParameters
source: Coordinator Node Parameters
de: Parameter für Koordinatorknoten
es: Parámetros del nodo de coordinación
fr: Paramètres du nœud coordinateur
it: Parametri del nodo coordinatore
ja: コーディネーター ノードのパラメーター
ko: 코디네이터 노드 매개 변수
pt_br: Parâmetros do nó coordenador
ru: Параметры узла-координатора
zh_hans: 协调器节点参数
zh_hant: 協調器節點參數

# arc.coordinatorNodeParametersDescription
source: These server parameters of the Coordinator node can be set to custom (non-default) values. Search to find parameters.
de: Diese Serverparameter des Koordinatornnotens können auf benutzerdefinierte (nicht standardmäßige) Werte festgelegt werden. Suchen Sie nach Parametern.
es: Estos parámetros de servidor del nodo de coordinación se pueden establecer en valores personalizados (no predeterminados). Buscar parámetros.
fr: Ces paramètres de serveur des nœuds coordinateur peuvent être définis sur des valeurs personnalisées (non définies par défaut). Recherchez des paramètres.
it: Questi parametri del server del nodo Coordinatore possono essere impostati su valori personalizzati (non predefiniti). Cerca per trovare i parametri.
ja: コーディネーター ノードのこれらのサーバー パラメーターは、カスタム (既定値以外) の値に設定することができます。検索してパラメーターを検出します。
ko: 코디네이터 노드의 이러한 서버 매개 변수는 사용자 지정(기본값이 아닌) 값으로 설정할 수 있습니다. 검색하여 매개 변수를 찾습니다.
pt_br: Esses parâmetros do servidor do nó coordenador podem ser definidos como valores personalizados (não padrão). Pesquisar para localizar parâmetros.
ru: Этим параметрам сервера узла-координатора могут быть присвоены настраиваемые (нестандартные) значения. Выполните поиск, чтобы найти параметры.
zh_hans: 协调器节点的这些服务器参数可以设置为自定义(非默认)值。搜索以查找参数。
zh_hant: 協調器節點的這些伺服器參數可以設定為自訂 (非預設) 值。搜尋以尋找參數。

# arc.copiedToClipboard
source: {0} copied to clipboard
de: {0} in Zwischenablage kopiert
es: {0} copiado al portapapeles
fr: {0} copié dans le Presse-papiers
it: {0} copiato negli Appunti
ja: {0} はクリップボードにコピーされました
ko: 클립보드에 복사된 {0}
pt_br: {0} copiado para a área de transferência
ru: {0} — скопировано в буфер обмена
zh_hans: 已将 {0} 复制到剪贴板
zh_hant: {0} 已複製到剪貼簿

# arc.copyConnectionStringToClipboard
source: Copy {0} Connection String to clipboard
de: Verbindungszeichenfolge "{0}" in Zwischenablage kopieren
es: Copiar cadena de conexión {0} en el portapapeles
fr: Copier {0} la chaîne de connexion dans le Presse-papiers
it: Copia la stringa di connessione {0} negli Appunti
ja: {0} 接続文字列をクリップボードにコピーする
ko: {0} 연결 문자열을 클립보드에 복사
pt_br: Copiar {0} cadeia de conexão para a área de transferência
ru: Копировать строку подключения {0} в буфер обмена
zh_hans: 将 {0} 连接字符串复制到剪贴板
zh_hant: 將 {0} 連接字串複製到剪貼簿

# arc.copyValueToClipboard
source: Copy {0} to clipboard
de: "{0}" in Zwischenablage kopieren
es: Copiar {0} en el Portapapeles
fr: Copier {0} dans le Presse-papiers
it: Copia {0} negli Appunti
ja: {0} をクリップボードにコピー
ko: {0}을(를) 클립보드에 복사
pt_br: Copiar {0} para a área de transferência
ru: Копировать {0} в буфер обмена
zh_hans: 将 {0} 复制到剪贴板
zh_hant: 將 {0} 複製到剪貼簿

# arc.coresLimit
source: CPU limit
es: Límite de CPU
fr: Limite UC
it: Limite CPU
ja: CPU の制限
ko: CPU 제한
pt_br: Limite de CPU
ru: Ограничение на использование ЦП
zh_hans: CPU 限制
zh_hant: CPU 限制

# arc.coresRequest
source: CPU request
de: CPU-Anforderung
es: Solicitud de CPU
fr: Demande UC
it: Richiesta CPU
ja: CPU 要求
ko: CPU 요청
pt_br: Solicitação de CPU
ru: Запрос ЦП
zh_hans: CPU 请求
zh_hant: CPU 要求

# arc.couldNotFindAzureResource
source: Could not find Azure resource for {0}
de: Die Azure-Ressource für "{0}" wurde nicht gefunden
es: No se encontró el recurso de Azure para {0}
fr: Ressource Azure introuvable pour {0}
it: Non è stato possibile trovare la risorsa di Azure per {0}
ja: {0} に Azure リソースが見つかりませんでした
ko: {0}에 대한 Azure 리소스를 찾을 수 없습니다.
pt_br: Não foi possível localizar o recurso do Azure para {0}
ru: Не удалось найти ресурс Azure для {0}
zh_hans: 找不到 {0} 的 Azure 资源
zh_hant: 找不到 {0} 的 Azure 資源

# arc.couldNotFindControllerRegistration
source: Could not find controller registration.
de: Die Controllerregistrierung wurde nicht gefunden.
es: No se pudo encontrar el registro del controlador.
fr: L’inscription du contrôleur est introuvable.
it: Non è stato possibile trovare la registrazione del controller.
ja: コントローラーの登録が見つかりませんでした。
ko: 컨트롤러 등록을 찾을 수 없습니다.
pt_br: Não foi possível localizar o registro do controlador.
ru: Не удалось найти регистрацию контроллера.
zh_hans: 找不到控制器注册。
zh_hant: 找不到控制器註冊。

# arc.createNew
source: New Instance
de: Neue Instanz
es: Nueva instancia
fr: Nouvelle instance
it: Nuova istanza
ja: 新しいインスタンス
ko: 새 인스턴스
pt_br: Nova Instância
ru: Новый экземпляр
zh_hans: 新实例
zh_hant: 新執行個體

# arc.currentVersion
source: Current version
de: Aktuelle Version
pt_br: Versão atual
zh_hans: 当前版本
zh_hant: 目前的版本

# arc.dataController
source: Data controller
de: Datencontroller
es: Controlador de datos
fr: Contrôleur de données
it: Controller dei dati
ja: データ コントローラー
ko: 데이터 컨트롤러
pt_br: Controlador de dados
ru: Контроллер данных
zh_hans: 数据控制器
zh_hant: 資料控制器

# arc.dataControllersType
source: Azure Arc Data Controller
es: Controlador de datos de Azure Arc
fr: Contrôleur de données Azure Arc
it: Controller dei dati di Azure Arc
ja: Azure Arc データ コントローラー
ko: Azure Arc 데이터 컨트롤러
pt_br: Controlador de dados do Azure Arc
ru: Контроллер данных Azure Arc
zh_hans: Azure Arc 数据控制器
zh_hant: Azure Arc 資料控制器

# arc.dataStorage
source: {0} data
de: {0} Daten
es: Datos de {0}
fr: Données {0}
it: Dati di {0}
ja: {0} データ
ko: {0} 데이터
pt_br: {0} dados
ru: Данные: {0}
zh_hans: {0} 数据
zh_hant: {0} 資料

# arc.database
source: Database
de: Datenbank
ko: 데이터베이스
pt_br: Banco de dados
zh_hans: 数据库
zh_hant: 資料庫

# arc.databaseCreated
source: Database {0} created
de: Datenbank "{0}" erstellt
es: Base de datos {0} creada
fr: Base de données {0} créée
it: Database {0} creato
ja: {0} データベースが作成されました
ko: 데이터베이스 {0} 생성됨
pt_br: Banco de dados {0} criado
ru: База данных {0} создана
zh_hans: 已创建数据库 {0}
zh_hant: 資料庫 {0} 已建立

# arc.databaseCreationFailed
source: Failed to create database {0}. {1}
de: Fehler beim Erstellen der Datenbank "{0}". {1}
es: No se pudo crear la base de datos {0}. {1}
fr: Échec de la création de la base de données {0}. {1}
it: Non è stato possibile creare il database {0}. {1}
ja: データベース {0} を作成できませんでした。{1}
ko: {0} 데이터베이스를 만들지 못했습니다. {1}
pt_br: Falha ao criar o banco de dados {0}. {1}
ru: Не удалось создать базу данных {0}. {1}
zh_hans: 未能创建数据库 {0}。{1}
zh_hant: 無法建立資料庫 {0}。{1}

# arc.databaseDetails
source: Destination Details
de: Zieldetails
ko: 대상 세부 정보
pt_br: Detalhes do Destino
zh_hans: 目标详细信息
zh_hant: 目的地詳細資料

# arc.databaseDetailsText
source: Enter the required settings for target database name and SQL managed instance. By default, the source managed instance is selected.
de: Geben Sie die erforderlichen Einstellungen für den Namen der Zieldatenbank und die verwaltete SQL-Instanz ein. Standardmäßig ist die verwaltete Quellinstanz ausgewählt.
ko: 대상 데이터베이스 이름 및 SQL Managed Instance에 필요한 설정을 입력합니다. 기본적으로 원본 Managed Instance가 선택됩니다.
pt_br: Insira as configurações necessárias para o nome do banco de dados de destino e a instância gerenciada de SQL. Por padrão, é selecionada a instância gerenciada de origem.
zh_hans: 请输入目标数据库所需的设置，包括名称和 SQL 托管实例。源托管实例默认已选择。
zh_hant: 輸入目標資料庫名稱和 SQL 受控執行個體的必要設定。根據預設，會選取來源受控執行個體。

# arc.databaseName
source: Database name
de: Datenbankname
es: Nombre de la base de datos
fr: Nom de la base de données
it: Nome del database
ja: データベース名
ko: 데이터베이스 이름
pt_br: Nome do banco de dados
ru: Имя базы данных
zh_hans: 数据库名
zh_hant: 資料庫名稱

# arc.databases
source: Databases
de: Datenbanken
es: Bases de datos
fr: Bases de données
it: Database
ja: データベース
ko: 데이터베이스
pt_br: Bancos de dados
ru: Базы данных
zh_hans: 数据库
zh_hant: 資料庫

# arc.delete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# arc.deletingInstance
source: Deleting instance '{0}'...
de: Instanz "{0}" wird gelöscht...
es: Eliminando instancia '{0}'...
fr: Suppression de l'instance « {0} »...
it: Eliminazione dell'istanza '{0}'...
ja: インスタンス '{0}' を削除しています...
ko: 인스턴스 '{0}'을(를) 삭제하는 중...
pt_br: Excluindo instância '{0}'...
ru: Удаляется экземпляр "{0}"...
zh_hans: 正在删除实例“{0}”
zh_hant: 正在刪除執行個體 '{0}'...

# arc.description
source: Description
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
pt_br: Descrição
ru: Описание
zh_hans: 说明
zh_hant: 描述

# arc.details
source: Details
es: Detalles
fr: Détails
it: Dettagli
ja: 詳細
ko: 세부 정보
pt_br: Detalhes
ru: Подробные сведения
zh_hans: 详细信息
zh_hant: 詳細資料

# arc.diagnoseAndSolveProblems
source: Diagnose and solve problems
de: Diagnose und Problembehandlung
es: Diagnosticar y solucionar problemas
fr: Diagnostiquer et résoudre les problèmes
it: Diagnostica e risoluzione dei problemi
ja: 問題の診断と解決
ko: 문제 진단 및 해결
pt_br: Diagnosticar e resolver problemas
ru: Диагностика и решение проблем
zh_hans: 诊断并解决问题
zh_hant: 診斷並解決問題

# arc.direct
source: Direct
de: Direkt
es: Directa
fr: Directement
it: Diretto
ja: 直接
ko: 직접
pt_br: Direto
ru: Прямой
zh_hans: 直接
zh_hant: 直接

# arc.discard
source: Discard
de: Verwerfen
es: Descartar
fr: Abandonner
it: Rimuovi
ja: 破棄
ko: 삭제
pt_br: Descartar
ru: Отменить
zh_hans: 放弃
zh_hant: 捨棄

# arc.drop
source: Drop
de: Ablegen
es: Depositar
fr: Déposer
it: Rimuovere
ja: ドロップ
ko: 삭제
pt_br: Remover
ru: Удалить
zh_hans: 放置
zh_hant: 卸除

# arc.dropMultipleExtensions
source: Currently dropping another extension, try again once that is completed.
de: Zurzeit wird eine andere Erweiterung gelöscht. Versuchen Sie es noch mal, sobald der Vorgang abgeschlossen ist.
es: Se está depositando otra extensión en este momento, vuelva a intentarlo una vez que se haya completado.
fr: Suppression en cours d’une autre extension, réessayez une fois celle-ci terminée.
it: È in corso l'eliminazione di un'altra estensione. Riprovare al termine dell'operazione.
ja: 現在、別の拡張機能を切断しています。完了してからもう一度お試しください。
ko: 현재 다른 확장을 삭제하고 있습니다. 완료된 후 다시 시도하세요.
pt_br: Descartando outra extensão no momento. Tente novamente após a conclusão.
ru: Сейчас выполняется удаление другого расширения. Повторите попытку после его завершения.
zh_hans: 当前正在删除另一个扩展，请在完成后重试。
zh_hant: 目前正在卸載另一個延伸模組，請在完成後再試一次。

# arc.earliestPitrRestorePoint
source: Earliest point in time
de: Frühester Zeitpunkt
ko: 가장 빠른 시점
pt_br: Ponto no tempo mais antigo
zh_hans: 最早的时间点
zh_hant: 最早的時間點

# arc.emergency
source: Emergency
de: Notfall
es: Emergencia
fr: Urgence
it: Emergenza
ja: 緊急
ko: 비상
pt_br: Emergência
ru: Аварийный режим
zh_hans: 紧急
zh_hant: 緊急

# arc.endpoint
source: Endpoint
de: Endpunkt
es: Punto de conexión
fr: Point de terminaison
ja: エンドポイント
ko: 엔드포인트
pt_br: Ponto de Extremidade
ru: Конечная точка
zh_hans: 终结点
zh_hant: 端點

# arc.enterANonEmptyPassword
source: Enter a non empty password or press escape to exit.
de: Geben Sie ein nicht leeres Kennwort ein, oder drücken Sie ESC, um den Vorgang zu beenden.
es: Escriba una contraseña que no esté vacía o presione ESC para salir.
fr: Entrez un mot de passe non vide ou appuyez sur Echap pour quitter.
it: Immettere una password non vuota o premere ESC per uscire.
ja: 空でないパスワードを入力するか、esc キーを押して終了してください。
ko: 비어 있지 않은 암호를 입력하거나 Esc 키를 눌러 종료합니다.
pt_br: Insira uma senha não vazia ou clique em escape para sair.
ru: Введите непустой пароль или нажмите клавишу ESC, чтобы выйти.
zh_hans: 输入非空密码或按 Esc 退出。
zh_hant: 輸入非空白的密碼或按 Esc 鍵結束。

# arc.enterNewPassword
source: Enter a new password
de: Geben Sie ein neues Kennwort ein
es: Escriba una nueva contraseña
fr: Entrez un nouveau mot de passe
it: Immettere una nuova password
ja: 新しいパスワードの入力
ko: 새 암호 입력
pt_br: Insira uma nova senha
ru: Введите новый пароль
zh_hans: 输入新密码
zh_hant: 輸入新密碼

# arc.errorConnectingToController
source: Error connecting to controller. {0}
de: Fehler beim Verbinden mit dem Controller. {0}
es: Error al conectar con el controlador. {0}
fr: Erreur lors de la connexion au contrôleur. {0}
it: Errore durante la connessione al controller. {0}
ja: コントローラーへの接続中にエラーが発生しました。{0}
ko: 컨트롤러에 연결하는 동안 오류가 발생했습니다. {0}
pt_br: Erro ao conectar-se ao controlador. {0}
ru: Ошибка при подключении к контроллеру. {0}
zh_hans: 连接到控制器时出现错误。{0}
zh_hant: 連線至控制器時發生錯誤。{0}

# arc.errorGettingConnectionMode
source: Error getting data controller connection mode.
de: Fehler beim Abrufen des Datencontroller-Verbindungsmodus.
pt_br: Erro ao obter o modo de conexão do controlador de dados.
zh_hans: 获取数据控制器连接模式时出错。
zh_hant: 取得資料控制器連線模式時發生錯誤。

# arc.errorListingLogAnalyticsWorkspaces
source: Error listing Log Analytics workspaces {0}
de: Fehler beim Auflisten der Log Analytics-Arbeitsbereiche {0}
pt_br: Erro ao listar os workspaces do Log Analytics {0}
zh_hans: 列出 Log Analytics 工作区 {0} 时出错
zh_hant: 列出 Log Analytics 工作區 {0} 時發生錯誤

# arc.errorVerifyingPassword
source: Error encountered while verifying password. {0}
de: Fehler beim Überprüfen des Kennworts. {0}
es: Se produjo un error al comprobar la contraseña. {0}
fr: Une erreur s’est produite lors de la vérification du mot de passe. {0}
it: Si è verificato un errore durante la verifica della password. {0}
ja: パスワードの確認中にエラーが発生しました。{0}
ko: 암호를 확인하는 동안 오류가 발생했습니다. {0}
pt_br: Erro encontrado ao verificar a senha. {0}
ru: При проверке пароля произошла ошибка. {0}
zh_hans: 验证密码时遇到错误。{0}
zh_hant: 驗證密碼時發生錯誤。{0}

# arc.extensionInstallationFailed
source: Failed to install extension {0}.
de: Fehler beim Installieren der Erweiterung "{0}".
es: No se pudo instalar la extensión {0}.
fr: Échec d'installation de l'extension {0}.
it: Impossibile installare l'estensione {0}.
ja: 拡張機能 {0} のインストールが失敗しました。
ko: 확장 {0}을(를) 설치하지 못했습니다.
pt_br: Ocorreu um erro ao instalar a extensão {0}.
ru: Расширение {0} не установлено.
zh_hans: 未能安装扩展 {0}
zh_hant: 無法安裝延伸模組 {0}。

# arc.extensionInstalled
source: Extension '{0}' has been installed.
de: Die Erweiterung "{0}" wurde installiert.
es: Se ha instalado la extensión '{0}'.
fr: L'extension « {0} » a été installée.
it: L'estensione '{0}' è stata installata.
ja: 拡張機能 '{0}' がインストールされました。
ko: '{0}' 확장이 설치되었습니다.
pt_br: A extensão '{0}' foi instalada.
ru: Расширение "{0}" установлено.
zh_hans: 已安装扩展“{0}”。
zh_hant: 已安裝延伸模組 '{0}'。

# arc.extensionName
source: Extension name
de: Name der Erweiterung
es: Nombre de la extensión
fr: Nom de l'extension
it: Nome dell'estensione
ja: 拡張機能名
ko: 확장 이름
pt_br: Nome da extensão
ru: Имя расширения
zh_hans: 扩展名
zh_hant: 延伸模組名稱

# arc.extensionsAddDialog
source: PostgreSQL provides the ability to extend the functionality of your database by using extensions.
de: PostgreSQL bietet die Möglichkeit, die Funktionalität Ihrer Datenbank mithilfe von Erweiterungen zu erweitern.
es: PostgreSQL proporciona la capacidad de ampliar la funcionalidad de la base de datos mediante extensiones.
fr: PostgreSQL permet d’étendre les fonctionnalités de votre base de données à l’aide d’extensions.
it: PostgreSQL offre la possibilità di estendere la funzionalità del database tramite le estensioni.
ja: PostgreSQL には、拡張機能を使用してデータベースの機能を拡張する機能が用意されています。
ko: PostgreSQL은 확장을 사용하여 데이터베이스의 기능을 확장할 수 있도록 합니다.
pt_br: O PostgreSQL fornece a capacidade de estender a funcionalidade do banco de dados usando extensões.
ru: PostgreSQL обеспечивает возможность расширения функциональных возможностей базы данных с помощью расширений.
zh_hans: 通过使用扩展，PostgreSQL 提供扩展数据库功能的能力。
zh_hant: PostgreSQL 可讓您使用延伸模組擴充資料庫的功能。

# arc.extensionsAddErrorrMessage
source: Value should be either of the following: ({0}).
de: Der Wert sollte einer der Folgenden sein: ({0}).
es: El valor debe ser uno de los siguientes: ({0}).
fr: La valeur doit être l’une des suivantes : ({0}).
it: Il valore dovrebbe essere uno dei seguenti ({0}).
ja: 値は次のいずれかにする必要があります: ({0})。
ko: 값은 다음 중 하나여야 합니다({0}).
pt_br: O valor deve ser um dos seguintes: ({0}).
ru: Допустимые значения: ({0}).
zh_hans: 值应为以下值之一: ({0})。
zh_hant: 值應為下列其中一項: ({0})。

# arc.extensionsAddFunction
source: Some extensions must be loaded into PostgreSQL at startup time before they can be used. To edit, type in comma separated list of valid extensions: ({0}).
de: Einige Erweiterungen müssen zum Startzeitpunkt in PostgreSQL geladen werden, bevor Sie verwendet werden können. Geben Sie zum Bearbeiten eine durch Kommata getrennte Liste gültiger Erweiterungen ein: ({0}).
es: Algunas extensiones se deben cargar en PostgreSQL durante el inicio para poder usarlas. Para editar este comportamiento, escriba una lista separada por comas de extensiones válidas: ({0}).
fr: Certaines extensions doivent être chargées dans PostgreSQL au démarrage avant de pouvoir être utilisées. Pour modifier, tapez dans la liste séparée par des virgules des extensions valides : ({0}).
it: Alcune estensioni devono essere caricate in PostgreSQL all'ora di avvio prima di poter essere usate. Per modificare, digitare un elenco delimitato da virgole di estensioni valide: ({0}).
ja: 一部の拡張機能を使用するには、起動時に PostgreSQL に読み込む必要があります。編集するには、有効な拡張機能のコンマ区切りの一覧を入力します({0})。
ko: 일부 확장을 사용하려면 시작 시 PostgreSQL에 로드해야 합니다. 편집하려면 유효한 확장의 쉼표로 구분된 목록을 입력합니다({0}).
pt_br: Algumas extensões devem ser carregadas no PostgreSQL no momento da inicialização antes que possam ser usadas. Para editar, digite uma lista separada por vírgulas de extensões válidas: ({0}).
ru: Некоторые расширения необходимо загрузить в PostgreSQL во время запуска, прежде чем их можно будет использовать. Чтобы изменить список расширений, укажите допустимые расширения, разделенные запятыми: ({0}).
zh_hans: 某些扩展必须在启动时加载到 PostgreSQL 中，然后才能使用它们。若要编辑，请键入有效扩展列表，以逗号分隔: ({0})。
zh_hant: 某些延伸模組必須先載入至 PostgreSQL 才能使用。若要編輯，請輸入以逗號分隔的有效延伸模組清單: ({0})。

# arc.extensionsAddList
source: Extensions
de: Erweiterungen
es: Extensiones
it: Estensioni
ja: 拡張
ko: 확장
pt_br: Extensões
ru: Расширения
zh_hans: 扩展
zh_hant: 延伸模組

# arc.extensionsAdded
source: Extensions '{0}' added
de: Erweiterungen "{0}" hinzugefügt
es: Extensiones '{0}' agregadas
fr: Extensions « {0} » ajoutées
it: Estensioni '{0}' aggiunte
ja: '{0}' 拡張機能が追加されました
ko: 확장 '{0}'이(가) 추가됨
pt_br: Extensões '{0}' adicionadas
ru: Добавлены расширения "{0}"
zh_hans: 已添加扩展“{0}”
zh_hant: 已新增延伸模組 '{0}'

# arc.extensionsDescription
source: PostgreSQL provides the ability to extend the functionality of your database by using extensions. Extensions allow for bundling multiple related SQL objects together in a single package that can be loaded or removed from your database with a single command. After being loaded in the database, extensions can function like built-in features.
de: PostgreSQL bietet die Möglichkeit, die Funktionalität Ihrer Datenbank mithilfe von Erweiterungen zu erweitern. Erweiterungen ermöglichen das Bündeln mehrerer verwandter SQL-Objekte in einem einzelnen Paket, das mit einem einzigen Befehl geladen oder aus Ihrer Datenbank entfernt werden kann. Nach dem Laden in die Datenbank können Erweiterungen wie integrierte Features funktionieren.
es: PostgreSQL proporciona la capacidad de ampliar la funcionalidad de la base de datos mediante extensiones. Las extensiones permiten agrupar varios objetos SQL relacionados en un único paquete que se puede cargar o quitar de la base de datos con un solo comando. Una vez cargado en la base de datos, las extensiones pueden funcionar como características integradas.
fr: PostgreSQL permet d’étendre les fonctionnalités de votre base de données à l’aide d’extensions. Les extensions permettent de regrouper plusieurs objets SQL associés dans un package unique qui peut être chargé ou supprimé de votre base de données à l’aide d’une seule commande. Une fois chargées dans la base de données, les extensions peuvent fonctionner comme des fonctionnalités intégrées.
it: PostgreSQL offre la possibilità di estendere le funzionalità del database usando le estensioni. Le estensioni consentono di raggruppare più oggetti SQL correlati in un unico pacchetto che può essere caricato o rimosso dal database con un unico comando. Dopo il caricamento nel database, le estensioni possono operare come le funzionalità predefinite.
ja: PostgreSQL には、拡張機能を使用してデータベースの機能を拡張する機能が用意されています。拡張機能により、複数の関連する SQL オブジェクトを1つのパッケージにまとめて、1つのコマンドでデータベースに読み込みまたは削除できます。データベースに読み込まれると、拡張機能は組み込み機能と同様に機能できます。
ko: PostgreSQL은 확장을 사용하여 데이터베이스의 기능을 확장할 수 있도록 합니다. 확장을 사용하면 단일 명령으로 데이터베이스에서 로드하거나 제거할 수 있는 단일 패키지에서 여러 관련 SQL 개체를 함께 묶을 수 있습니다. 데이터베이스에 로드된 후 확장은 기본 제공 기능처럼 작동할 수 있습니다.
pt_br: O PostgreSQL fornece a capacidade de estender a funcionalidade do seu banco de dados usando extensões. As extensões permitem o agrupamento de vários objetos SQL relacionados em um único pacote que pode ser carregado ou removido do seu banco de dados com um único comando. Após serem carregadas no banco de dados, as extensões podem funcionar como recursos internos.
ru: PostgreSQL предоставляет возможность расширять функциональность базы данных с помощью расширений. Расширения позволяют объединять несколько связанных объектов SQL в один пакет, который можно загрузить или удалить из базы данных с помощью одной команды. После загрузки в базу данных расширения могут работать как встроенные функции.
zh_hans: PostgreSQL 提供使用扩展程序扩展数据库功能的能力。扩展允许在单个包中将多个相关的 SQL 对象捆绑在一起，可以使用单个命令从数据库中加载或删除这些对象。在数据库中加载后，扩展可以像内置功能一样运行。
zh_hant: PostgreSQL 可讓您使用延伸模組擴充資料庫的功能。延伸模組允許將多個相關的 SQL 物件捆綁到單一套件中，而您可使用單一命令在資料庫中載入或移除該套件。載入資料庫之後，延伸模組可以像內建功能一樣運作。

# arc.extensionsDropped
source: Extensions '{0}' dropped
de: Erweiterungen "{0}" gelöscht
es: Extensiones "{0}" quitadas
fr: Extensions «{0}» supprimées
it: Estensioni '{0}' eliminate
ja: 拡張機能 '{0}' が削除されました
ko: '{0}' 확장을 삭제했습니다.
pt_br: Extensões '{0}' removidas
ru: Расширения "{0}" удалены
zh_hans: 已删除扩展 "{0}"
zh_hant: 已卸除延伸模組 '{0}'
