Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.USD
source: USD
zh_hans: 美元
zh_hant: 美元

# arc.addingWorkerNodes
source: adding worker nodes
de: Workerknoten werden hinzugefügt
es: agregando nodos de trabajo
fr: ajout de nœuds Worker
it: aggiunta di nodi di lavoro
ja: ワーカー ノードを追加しています
ko: 작업자 노드 추가
pt_br: adicionando nós de trabalho
ru: добавление рабочих узлов
zh_hans: 正在添加工作器节点
zh_hant: 正在新增背景工作節點

# arc.apply
source: Apply
de: Anwenden
ko: 적용
pt_br: Aplicar
zh_hans: 应用
zh_hant: 套用

# arc.arcDeploymentDeprecation
source: The Arc Deployment extension has been replaced by the Arc extension and has been uninstalled.
de: Die Erweiterung "Arc-Bereitstellung" wurde durch die Arc-Erweiterung ersetzt und wurde deinstalliert.
es: La extensión de implementación de Arc se ha reemplazado por la extensión Arc y se ha desinstalado.
fr: L’extension de déploiement d’Arc a été remplacée par l’extension Arc et a été désinstallée.
it: L'estensione di distribuzione Arc è stata sostituita dall'estensione Arc ed è stata disinstallata.
ja: Arc 展開拡張機能が Arc 拡張機能に置き換えられ、アンインストールされました。
ko: Arc 배포 확장이 Arc 확장으로 대체되었으며 제거되었습니다.
pt_br: A extensão de implantação ARC foi substituída pela extensão Arc e foi desinstalada.
ru: Расширение развертывания Arc было заменено расширением Arc и было удалено.
zh_hans: Arc 部署扩展已由 Arc 扩展取代，并已卸载。
zh_hant: Arc 部署延伸模組已被 Arc 延伸模組取代，且已解除安裝。

# arc.arcResources
source: Azure Arc Resources
de: Azure Arc-Ressourcen
es: Recursos de Azure Arc
fr: Ressources Azure Arc
it: Risorse Azure Arc
ja: Azure Arc リソース
ko: Azure Arc 리소스
pt_br: Recursos do Azure Arc
ru: Ресурсы Azure Arc
zh_hans: Azure Arc 资源
zh_hant: Azure Arc 資源

# arc.areYouSure
source: Are you sure you want to apply the selected upgrade?
de: Wollen Sie wirklich das ausgewählte Upgrade anwenden?
pt_br: Tem certeza de que deseja aplicar a atualização selecionada?
zh_hans: 是否确定要应用所选升级?
zh_hant: 確定要套用選取的升級?

# arc.available
source: Available
de: Verfügbar
es: Disponible
fr: Disponible
it: Disponibile
ja: 利用可能
ko: 사용 가능
pt_br: Disponíveis
ru: Доступно
zh_hans: 可用
zh_hant: 可用

# arc.availableUpgrades
source: Available Upgrades
de: Verfügbare Upgrades
pt_br: Atualizações Disponíveis
zh_hans: 可用升级
zh_hant: 可用的升級

# arc.availableUpgradesDescription
source: Available upgrades for this resource are listed below. You can apply upgrades by clicking the upgrade button.
de: Verfügbare Upgrades für diese Ressource sind unten aufgeführt. Sie können Upgrades anwenden, indem Sie auf die Upgrade-Schaltfläche klicken.
pt_br: As atualizações disponíveis para este recurso estão listadas abaixo. Você pode aplicar as atualizações ao clicar em o botão de atualização.
zh_hans: 下面列出了此资源的可用升级。你可以通过单击升级按钮来应用升级。
zh_hant: 此資源的可用升級如下所示。您可以點擊下方的按鈕以套用升級。

# arc.backup
source: Backup
de: Sicherung
es: Copia de seguridad
fr: Sauvegarder
ja: バックアップ
ko: 백업
ru: Резервное копирование
zh_hans: 备份
zh_hant: 備份

# arc.backups
source: Backups
de: Sicherungen
ko: 백업
zh_hans: 备份
zh_hant: 備份

# arc.backupsStorage
source: {0} backups
de: {0} Sicherungen
es: copias de seguridad de {0}
fr: {0} sauvegardes
it: {0} backup
ja: {0} 個のバックアップ
ko: 백업 {0}개
ru: Резервные копии: {0}
zh_hans: {0} 备份
zh_hant: {0} 個備份

# arc.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# arc.clickTheNewSupportRequestButton
source: Click the new support request button to file a support request in the Azure Portal.
de: Klicken Sie auf die Schaltfläche "Neue Supportanfrage", um eine Supportanfrage im Azure-Portal zu übertragen.
es: Haga clic en el botón de nueva solicitud de soporte para archivar una solicitud de soporte en Azure Portal.
fr: Cliquez sur le bouton nouvelle demande de support pour défiler une demande de support dans le Portail Azure.
it: Fare clic sul pulsante nuova richiesta di supporto per archiviare una richiesta di supporto nel portale di Azure.
ja: [新しいサポートリクエスト] ボタンをクリックして、Azure Portal でサポート リクエストを作成します。
ko: [새 지원 요청] 단추를 클릭하여 Azure Portal에서 지원 요청을 제출합니다.
pt_br: Clique no botão nova solicitação de suporte para enviar uma solicitação de suporte no Portal do Azure.
ru: Нажмите кнопку "Новый запрос в службу поддержки", чтобы отправить запрос в службу поддержки на портале Azure.
zh_hans: 单击“新建支持请求”按钮可在 Azure 门户中提出支持请求。
zh_hant: 按一下新的支援要求按鈕，以在 Azure 入口網站中提出支援要求。

# arc.clickTheTroubleshootButton
source: Click the troubleshoot button to open the Azure Arc {0} troubleshooting notebook.
de: Klicken Sie auf die Schaltfläche "Problembehandlung", um das Notizbuch "Azure Arc {0}-Problembehandlung" zu öffnen.
es: Haga clic en el botón Solucionar problemas para abrir el bloc de notas de solución de problemas de Azure Arc {0}.
fr: Cliquez sur le bouton résoudre les problèmes pour ouvrir le bloc-notes résolution des problèmes Azure Arc {0}.
it: Fare clic sul pulsante per la risoluzione dei problemi per aprire il notebook per la risoluzione dei problemi di Azure Arc {0}.
ja: [トラブルシューティング] ボタンをクリックして、Azure Arc {0} トラブルシューティング ノートブックを開きます。
ko: [문제 해결] 단추를 클릭하여 Azure Arc {0} 문제 해결 Notebook을 엽니다.
pt_br: Clique no botão solução de problemas para abrir o bloco de anotações de solução de problemas{0} do Azure Arc.
ru: Нажмите кнопку "Устранение неполадок", чтобы открыть записную книжку по устранению неполадок в Azure Arc {0}.
zh_hans: 单击“故障排除”按钮以打开 Azure Arc {0} 疑难解答笔记本。
zh_hant: 按一下 [疑難排解] 按鈕，開啟 Azure Arc {0} 疑難排解筆記本。

# arc.compute
source: Compute
es: Proceso
fr: Calcul
it: Ambiente di calcolo
ja: コンピューティング
ko: 컴퓨팅
pt_br: Computação
ru: Вычислительный
zh_hans: 计算
zh_hant: 計算

# arc.computeAndStorage
source: Compute + Storage
de: Compute + Speicher
es: Proceso y almacenamiento
fr: Calcul + stockage
it: Calcolo e archiviazione
ja: コンピューティングとストレージ
ko: 컴퓨팅 + 스토리지
pt_br: Computação + Armazenamento
ru: Вычислительная среда и хранилище
zh_hans: 计算 + 存储
zh_hant: 計算 + 儲存體

# arc.computeAndStorageDescriptionPartFive
source: there are sufficient resources available
de: es sind genügend Ressourcen verfügbar
es: hay suficientes recursos disponibles
fr: Il y a suffisamment de ressources disponibles
it: sono disponibili risorse sufficienti
ja: 使用可能な十分なリソースがあります
ko: 사용 가능한 리소스가 충분합니다.
pt_br: há recursos suficientes disponíveis
ru: достаточно доступных ресурсов
zh_hans: 有足够的资源可用
zh_hant: 有足夠的資源可供使用

# arc.computeAndStorageDescriptionPartFour
source: Before doing so, you need to ensure
de: Vor dem Ausführen müssen Sie sicherstellen, dass
es: Antes de hacerlo, debe asegurarse
fr: Avant d’effectuer cette opération, vous devez vous assurer
it: Prima di eseguire questa operazione, è necessario verificare
ja: それを行う前に、確認する必要があります
ko: 이렇게 하려면 먼저 다음을 확인해야 합니다.
pt_br: Antes de fazer isso, é necessário garantir
ru: Перед этим необходимо убедиться, что
zh_hans: 在执行此操作之前，需要确保
zh_hant: 執行此作業之前，您必須先確定

# arc.computeAndStorageDescriptionPartSix
source: in your Kubernetes cluster to honor this configuration.
de: in Ihrem Kubernetes-Cluster hinzufügen, um diese Konfiguration zu berücksichtigen.
es: en el clúster de Kubernetes para seguir esta configuración.
fr: dans votre cluster Kubernetes pour honorer cette configuration.
it: nel cluster Kubernetes per rispettare questa configurazione.
ja: Kubernetes クラスターでこの構成を有効にします。
ko: Kubernetes 클러스터에서 이 구성을 준수합니다.
pt_br: no cluster do Kubernetes para respeitar esta configuração.
ru: в кластере Kubernetes, чтобы соблюдать эту конфигурацию.
zh_hans: 在你的 Kubernetes 群集中，以接受此配置。
zh_hant: 在您的 Kubernetes 叢集中，以接受此設定。

# arc.computeAndStorageDescriptionPartThree
source: without downtime and by
de: ohne Downtime und durch
es: sin tiempo de inactividad y por
fr: sans temps d’arrêt et par
it: senza tempo di inattività e da
ja: ダウンタイムなしで
ko: 가동 중지 시간 없이
pt_br: sem tempo de inatividade e por
ru: без простоев и
zh_hans: 无故障时间和
zh_hant: 不停機且依

# arc.condition
source: Condition
de: Bedingung
es: Condición
it: Condizione
ja: 条件
ko: 조건
pt_br: Condição
ru: Условие
zh_hans: 条件
zh_hant: 條件

# arc.configurationCoordinatorNode
source: Configuration
de: Konfiguration
es: Configuración
it: Configurazione
ja: 構成
ko: 구성
pt_br: Configuração
ru: Конфигурация
zh_hans: 配置
zh_hant: 設定

# arc.configurationPerNode
source: Configuration (per node)
de: Konfiguration (pro Knoten)
es: Configuración (por nodo)
fr: Configuration (par nœud)
it: Configurazione (per nodo)
ja: 構成 (ノードあたり)
ko: 구성(노드당)
pt_br: Configuração (por nó)
ru: Конфигурация (по каждому узлу)
zh_hans: 配置(每个节点)
zh_hant: 設定 (每個節點)

# arc.configureRP
source: Configure retention policy
de: Konfigurieren der Aufbewahrungsrichtlinie
ko: 보존 정책 구성
pt_br: Configurar política de retenção
zh_hans: 配置保留策略
zh_hant: 設定保留原則

# arc.configureRetentionPolicyButton
source: Configure Retention Policy
de: Konfigurieren der Aufbewahrungsrichtlinie
ko: 보존 정책 구성
pt_br: Configurar Política de Retenção
zh_hans: 配置保留策略
zh_hant: 設定保留原則

# arc.confirmNewPassword
source: Confirm the new password
de: Bestätigen Sie das neue Kennwort
es: Confirme la nueva contraseña
fr: Confirmer le nouveau mot de passe
it: Confermare la nuova password
ja: 新しいパスワードを確認入力します
ko: 새 암호 확인
pt_br: Confirmar a nova senha
ru: Подтвердите новый пароль
zh_hans: 确认新密码
zh_hant: 確認新密碼

# arc.connect
source: Connect
de: Verbinden
es: Conectar
fr: Connecter
it: Connettere
ja: 接続
ko: 연결
pt_br: Conectar
ru: Подключиться
zh_hans: 连接
zh_hant: 連線

# arc.connectToController
source: Connect to Existing Controller
de: Verbindung mit vorhandenem Controller herstellen
es: Conexión con el controlador existente
fr: Se connecter au contrôleur existant
it: Connetti al controller esistente
ja: 既存のコントローラーに接続する
ko: 기존 컨트롤러에 연결
pt_br: Conectar-se ao Controlador Existente
ru: Подключение к существующему контроллеру
zh_hans: 连接到现有控制器
zh_hant: 連線至現有的控制器

# arc.connectToControllerFailed
source: Could not connect to controller {0}. {1}
de: Es konnte keine Verbindung mit dem Controller "{0}" hergestellt werden. {1}
es: No se pudo conectar con el controlador {0}. {1}
fr: Impossible de se connecter au contrôleur {0}. {1}
it: Impossibile connettersi al controller {0}. {1}
ja: コントローラー {0} に接続できませんでした。{1}
ko: 컨트롤러 {0}에 연결할 수 없습니다. {1}
pt_br: Não foi possível conectar-se ao controlador {0}. {1}
ru: Не удалось подключиться к контроллеру {0}. {1}
zh_hans: 无法连接到控制器 {0}。{1}
zh_hant: 無法連線到控制器 {0}。{1}

# arc.connectToMSSql
source: Connect to SQL managed instance - Azure Arc ({0})
de: Verbinden zur SQL Managed Instance – Azure Arc ({0})
es: Conexión a instancia administrada de SQL: Azure Arc ({0})
fr: Se connecter à SQL Managed Instance : Azure Arc ({0})
it: Connettersi all'istanza gestita di SQL - Azure Arc ({0})
ja: SQL Managed Instance - Azure Arc ({0})
ko: SQL Managed Instance에 연결 - Azure Arc({0})
pt_br: Conectar-se à instância gerenciada do SQL - Azure Arc ({0})
ru: Подключиться к управляемому экземпляру SQL — Azure Arc ({0})
zh_hans: 连接到 SQL 托管实例 - Azure Arc ({0})
zh_hant: 連線到 SQL 受控執行個體 - Azure Arc ({0})

# arc.connectToMSSqlFailed
source: Could not connect to SQL managed instance - Azure Arc Instance {0}. {1}
de: Es konnte keine Verbindung mit SQL Managed Instance – Azure Arc-Instanz "{0}" hergestellt werden. {1}
es: No se pudo conectar con la instancia administrada de SQL: instancia de Azure Arc {0}. {1}
fr: Impossible de se connecter à l’instance managée SQL : instance Azure Arc {0}. {1}
it: Non è stato possibile connettersi all'istanza gestita di SQL - Istanza di Azure Arc {0}. {1}
ja: SQL マネージド インスタンス - Azure Arc インスタンス {0} に接続できませんでした。{1}
ko: SQL Managed Instance - Azure Arc 인스턴스 {0}에 연결할 수 없습니다. {1}
pt_br: Não foi possível conectar à instância gerenciada do SQL-Instância do Azure Arc {0}. {1}
ru: Не удалось подключиться к управляемому экземпляру SQL — экземпляр Azure Arc {0}. {1}
zh_hans: 无法连接到 SQL 托管实例 - Azure Arc 实例 {0}。{1}
zh_hant: 無法連線到 SQL 受控執行個體 - Azure Arc 執行個體 {0}。{1}

# arc.connectToPGSql
source: Connect to PostgreSQL Hyperscale - Azure Arc ({0})
de: Verbindung mit PostgreSQL Hyperscale – Azure Arc ({0}) herstellen
es: Conexión a hiperescala de PostgreSQL: Azure Arc ({0})
fr: Se connecter à PostgreSQL Hyperscale : Azure Arc ({0})
it: Connettersi a PostgreSQL Hyperscale - Azure Arc ({0})
ja: PostgreSQL Hyperscale への接続 – Azure Arc ({0})
ko: PostgreSQL 하이퍼스케일에 연결 - Azure Arc({0})
pt_br: Conectar-se à Hiperescala do PostgreSQL – Azure Arc ({0})
ru: Подключиться к гипермасштабированию PostgreSQL — Azure Arc ({0})
zh_hans: 连接到 PostgreSQL 超大规模 - Azure Arc ({0})
zh_hant: 連線到 PostgreSQL 超大規模資料庫 - Azure Arc ({0})

# arc.connectToPGSqlFailed
source: Could not connect to PostgreSQL Hyperscale - Azure Arc Instance {0}. {1}
de: Es konnte keine Verbindung zur PostgreSQL Hyperscale – Azure Arc-Instanz {0} hergestellt werden. {1}
es: No se pudo conectar a hiperescala de PostgreSQL: instancia de Azure Arc {0}. {1}
fr: Impossible de se connecter à PostgreSQL Hyperscale : Instance Azure Arc {0}. {1}
it: Non è stato possibile connettersi all’istanza di PostgreSQL Hyperscale - Azure Arc {0}. {1}
ja: PostgreSQL Hyperscale - Azure Arc インスタンス {0} に接続できませんでした。{1}
ko: PostgreSQL 하이퍼스케일 - Azure Arc 인스턴스 {0}에 연결할 수 없습니다. {1}
pt_br: Não foi possível conectar-se à Hiperescala do PostgreSQL - Instância do Azure Arc {0}. {1}
ru: Не удалось подключиться к гипермасштабированию PostgreSQL {0} — экземпляр Azure Arc. {1}
zh_hans: 无法连接到 PostgreSQL 超大规模 - Azure Arc 实例 {0}。{1}
zh_hant: 無法連線到 PostgreSQL 超大規模資料庫 - Azure Arc 執行個體 {0}。{1}

# arc.connectToPostgresDescription
source: A connection to the server is required to show and set database engine settings, which will require the PostgreSQL Extension to be installed.
de: Zum Anzeigen und Festlegen der Datenbankmodul-Einstellungen, für die die PostgreSQL-Erweiterung installiert werden muss, ist eine Verbindung mit dem Server erforderlich.
es: Se requiere una conexión al servidor para mostrar y establecer la configuración del motor de base de datos, lo que requerirá la instalación de la extensión PostgreSQL.
fr: Une connexion au serveur est requise pour afficher et définir les paramètres du moteur de base de données, ce qui nécessite l’installation de l’extension PostgreSQL.
it: Per visualizzare e impostare le impostazioni del motore di database, è necessaria una connessione al server che richiede l'installazione dell'estensione PostgreSQL.
ja: データベース エンジンの設定を表示して設定するには、サーバーへの接続が必要であり、そのためにはPostgreSQL Extension のインストールが必要です。
ko: PostgreSQL 확장을 설치해야 하는 데이터베이스 엔진 설정을 표시하고 설정하려면 서버에 연결해야 합니다.
pt_br: Uma conexão com o servidor é necessária para mostrar e definir as configurações do mecanismo de banco de dados, que exigirão a instalação da extensão PostgreSQL.
ru: Для отображения и настройки параметров ядра СУБД требуется подключение к серверу, которое потребует установки расширения PostgreSQL.
zh_hans: 要显示和设置数据库引擎设置，需要连接到服务器，这将需要安装 PostgreSQL 扩展。
zh_hant: 需要伺服器連線才能顯示及設定資料庫引擎設定，這需要安裝 PostgreSQL 延伸模組。

# arc.connectToServer
source: Connect to Server
de: Mit Server verbinden
pt_br: Conectar ao Servidor
zh_hans: 连接到服务器
zh_hant: 連線到伺服器

# arc.connectionMode
source: Connection Mode
de: Verbindungsmodus
es: Modo de conexión
fr: Mode de connexion
it: Modalità di connessione
ja: 接続モード
ko: 연결 모드
pt_br: Modo de Conexão
ru: Режим подключения
zh_hans: 连接模式
zh_hant: 連線模式

# arc.connectionString
source: Connection string for {0}
de: Verbindungszeichenfolge für {0}
es: Cadena de conexión para {0}
fr: Chaîne de connexion pour {0}
it: Stringa di connessione per {0}
ja: {0} の接続文字列
ko: {0}에 대한 연결 문자열
pt_br: Cadeia de conexão para {0}
ru: Строка подключения для {0}
zh_hans: {0} 的连接字符串
zh_hant: {0} 的連接字串

# arc.connectionStrings
source: Connection Strings
de: Verbindungszeichenfolgen
es: Cadenas de conexión
fr: Chaînes de connexion
it: Stringhe di connessione
ja: 接続文字列
ko: 연결 문자열
pt_br: Cadeias de conexão
ru: Строки подключения
zh_hans: 连接字符串
zh_hant: 連接字串

# arc.containerReady
source: Pod containers are ready.
de: Pod-Container sind bereit.
es: Los contenedores pod están listos.
fr: Les conteneurs Pod sont prêts.
it: I contenitori dei pod sono pronti.
ja: ポッド コンテナーの準備が完了しました。
ko: Pod 컨테이너가 준비되었습니다.
pt_br: Os contêineres Pod estão prontos.
ru: Контейнеры Pod готовы.
zh_hans: Pod 容器已准备就绪。
zh_hant: Pod 容器已就緒。

# arc.controllerClusterContext
source: Cluster Context
de: Clusterkontext
es: Contexto de clúster
fr: Contexte de cluster
it: Contesto del cluster
ja: クラスター コンテキスト
ko: 클러스터 컨텍스트
pt_br: Contexto do cluster
ru: Контекст кластера
zh_hans: 群集上下文
zh_hant: 叢集內容

# arc.controllerDashboard
source: Azure Arc Data Controller Dashboard - {0}
de: Azure Arc-Datencontroller-Dashboard (Vorschau) – {0}
pt_br: Azure Arc Painel do Controlador de Dados – {0}
zh_hans: Azure Arc 数据控制器仪表板 - {0}
zh_hant: Azure Arc 資料控制器儀表板 - {0}

# arc.controllerKubeConfig
source: Kube Config File Path
de: Pfad der Kube-Konfigurationsdatei
es: Ruta de acceso al archivo de kubeconfig
fr: Chemin du fichier de configuration Kube
it: Percorso del file di configurazione kube
ja: Kube 構成のファイル パス
ko: Kube 구성 파일 경로
pt_br: Caminho do arquivo de configuração de Kube
ru: Путь к файлу kube config
zh_hans: Kube 配置文件路径
zh_hant: Kube 組態檔路徑

# arc.controllerName
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# arc.controllerNameDescription
source: The name to display in the tree view, this is not applied to the controller itself.
de: Der in der Strukturansicht anzuzeigende Name, der nicht auf den Controller selbst angewendet wird.
es: Nombre para mostrar en la vista de árbol, que no se aplica al controlador propiamente dicho.
fr: Nom à afficher dans l’arborescence, ceci n’est pas appliqué au contrôleur lui-même.
it: Nome da visualizzare nella visualizzazione struttura ad albero, che non viene applicato al controller stesso.
ja: ツリービューに表示される名前です。これはコントローラー自体には適用されません。
ko: 트리 뷰에 표시할 이름이며 컨트롤러 자체에 적용되지 않습니다.
pt_br: O nome a ser exibido no modo de exibição de árvore não é aplicado ao próprio controlador.
ru: Имя, отображаемое в представлении в виде дерева. Оно не применяется к самому контроллеру.
zh_hans: 要在树视图中显示的名称，这不会应用于控制器本身。
zh_hant: 要在樹狀檢視中顯示的名稱，這不會套用到控制器本身。

# arc.controllerPassword
source: Controller Password
de: Controller-Kennwort
es: Contraseña del controlador
fr: Mot de passe du contrôleur
it: Password del controller
ja: コントローラー パスワード
ko: 컨트롤러 암호
pt_br: Senha do controlador
ru: Пароль контроллера
zh_hans: 控制器密码
zh_hant: 控制器密碼

# arc.controllerUrl
source: Controller URL
es: Dirección URL del controlador
fr: URL du contrôleur
it: Controller dell’URL
ja: コントローラーの URL
ko: 컨트롤러 URL
pt_br: URL do controlador
ru: URL-адрес контроллера
zh_hans: 控制器 URL
zh_hant: 控制器 URL

# arc.controllerUrlDescription
source: The Controller URL is necessary if there are multiple clusters with the same namespace - this should generally not be necessary.
de: Die Controller-URL ist erforderlich, wenn mehrere Cluster mit demselben Namespace vorhanden sind – dies sollte im Allgemeinen nicht erforderlich sein.
es: La dirección URL del controlador es necesaria si hay varios clústeres con el mismo espacio de nombres: normalmente no debería ser necesario.
fr: L’URL du contrôleur est nécessaire si plusieurs clusters ont le même espace de noms, ce qui n’est généralement pas nécessaire.
it: L'URL del controller è necessario se sono presenti più cluster con lo stesso spazio dei nomi. In genere non è necessario.
ja: コントローラー URL は、同じ名前空間を持つ複数のクラスターが存在する場合に必要ですが、通常は必要ありません。
ko: 동일한 네임스페이스를 사용하는 클러스터가 여러 개 있는 경우 컨트롤러 URL이 필요합니다. 일반적으로 필요하지 않습니다.
pt_br: A URL do Controlador será necessária se houver vários clusters com o mesmo namespace – isso geralmente não deverá ser necessário.
ru: URL-адрес контроллера необходим при наличии нескольких кластеров с одним и тем же пространством имен. Обычно это не требуется.
zh_hans: 如果存在多个具有相同命名空间的群集，则控制器 URL 是必需的 - 而通常这一点并不是必需的。
zh_hant: 如果有多個叢集具有相同的命名空間，就必須有控制器 URL - 這通常不是必要項目。

# arc.controllerUrlPlaceholder
source: https://<IP or hostname>:<port>
de: https://<IP oder Hostname>:<port>
es: https://<IP o nombre de host>:<puerto>
fr: https://<IP ou nom d’hôte>:<port>
it: https://<IP o nome host>:<port>
ko: https://<IP 또는 호스트 이름>:<port>
pt_br: https://<IP ou nome do host>:<porta>
ru: https://<IP-адрес или имя узла>:<port>
zh_hant: https://<IP 或主機名稱>:<port>

# arc.controllerUsername
source: Controller Username
de: Benutzername für Controller
es: Nombre de usuario del controlador
fr: Nom d'utilisateur du contrôleur
it: Nome utente del controller
ja: コントローラーのユーザー名
ko: 컨트롤러 사용자 이름
pt_br: Nome de usuário do controlador
ru: Имя пользователя контроллера
zh_hans: 控制器用户名
zh_hant: 控制器使用者名稱

# arc.coordinator
source: Coordinator
de: Koordinator
es: Coordinador
fr: Coordonnateur
it: Coordinatore
ja: コーディネーター
ko: 코디네이터
pt_br: Coordenador
ru: Координатор
zh_hans: 协调器
zh_hant: 協調器

# arc.coordinatorCoresLimit
source: Coordinator Node CPU limit
de: CPU-Limit für Koordinatorknoten
es: Límite de CPU del nodo de coordinación
fr: Limite du processeur du nœud coordinateur
it: Limite CPU del nodo coordinatore
ja: コーディネーター ノード CPU の制限
ko: 코디네이터 노드 CPU 제한
pt_br: Limite da CPU do nó coordenador
ru: Предел ЦП для узла-координатора
zh_hans: 协调器节点 CPU 限制
zh_hant: 協調器節點 CPU 限制

# arc.coordinatorCoresRequest
source: Coordinator Node CPU request
de: CPU-Anforderung für Koordinatorknoten
es: Solicitud de CPU del nodo de coordinación
fr: Demande du processeur du nœud coordinateur
it: Richiesta CPU nodo coordinatore
ja: コーディネーター ノード CPU 要求
ko: 코디네이터 노드 CPU 요청
pt_br: Solicitação da CPU do nó coordenador
ru: Запрос ЦП для узла-координатора
zh_hans: 协调器节点 CPU 请求
zh_hant: 協調器節點 CPU 要求

# arc.coordinatorEndpoint
source: Coordinator endpoint
de: Koordinatorendpunkt
es: Punto de conexión del coordinador
fr: Point de terminaison coordinateur
it: Endpoint coordinatore
ja: コーディネーターのエンドポイント
ko: 코디네이터 엔드포인트
pt_br: Ponto de extremidade do coordenador
ru: Конечная точка координатора
zh_hans: 协调器终结点
zh_hant: 協調器端點

# arc.coordinatorMemoryLimit
source: Coordinator Node Memory limit (in GB)
de: Speicherlimit für Koordinatorknoten (in GB)
es: Límite de memoria de nodo de coordinación (en GB)
fr: Limite de la mémoire du nœud coordinateur (en Go)
it: Limite di memoria del nodo coordinatore (in GB)
ja: コーディネーター ノードのメモリ制限 (GB)
ko: 코디네이터 노드 메모리 제한(GB)
pt_br: Limite de Memória do Nó Coordenador (em GB)
ru: Предельный объем памяти узла-координатора (в ГБ)
zh_hans: 控制器节点内存限制(GB)
zh_hant: 協調器節點記憶體限制 (GB)

# arc.coordinatorMemoryRequest
source: Coordinator Node Memory request (in GB)
de: Speicheranforderung für Koordinatorknoten (in GB)
es: Solicitud de memoria de nodo de coordinación (en GB)
fr: Demande de mémoire de nœud coordinateur (en Go)
it: Richiesta di memoria del nodo coordinatore (in GB)
ja: コーディネーター ノードのメモリ要求 (GB)
ko: 코디네이터 노드 메모리 요청(GB)
pt_br: Solicitação de Memória do Nó Coordenador (em GB)
ru: Запрос памяти узла-координатора (в ГБ)
zh_hans: 协调器节点内存请求(以 GB 为单位)
zh_hant: 協調器節點記憶體要求 (GB)

# arc.coordinatorNode
source: Coordinator Node
de: Koordinatorknoten
es: Nodo de coordinación
fr: Nœud coordinateur
it: Nodo coordinatore
ja: コーディネーター ノード
ko: 코디네이터 노드
pt_br: Nó coordenador
ru: Узел-координатор
zh_hans: 协调器节点
zh_hant: 協調器節點
