Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.extensionsFunction
source: Some extensions must be loaded into PostgreSQL at startup time before they can be used. These preloaded extensions can be viewed and edited below.
de: Einige Erweiterungen müssen zum Startzeitpunkt in PostgreSQL geladen werden, bevor Sie verwendet werden können. Diese im Voraus geladenen Erweiterungen können unten angezeigt und bearbeitet werden.
es: Algunas extensiones se deben cargar en PostgreSQL en el momento del inicio para poder usarlas. Estas extensiones precargadas se pueden ver y editar a continuación.
fr: Certaines extensions doivent être chargées dans PostgreSQL au moment du démarrage avant de pouvoir être utilisées. Ces extensions préchargées peuvent être affichées et modifiées ci-dessous.
it: Alcune estensioni devono essere caricate in PostgreSQL all'avvio prima di poter essere usate. È possibile visualizzare e modificare queste estensioni precaricate di seguito.
ja: 一部の拡張機能は、使用する前に起動時に PostgreSQL に読み込む必要があります。これらの事前読み込み済みの拡張機能は以下で表示し、編集することができます。
ko: 일부 확장을 사용하려면 시작 시 PostgreSQL에 로드해야 합니다. 이러한 미리 로드된 확장은 아래에서 보고 편집할 수 있습니다.
pt_br: Algumas extensões devem ser carregadas no PostgreSQL no momento da inicialização antes que possam ser usadas. Essas extensões pré-carregadas podem ser exibidas e editadas abaixo.
ru: Некоторые расширения необходимо загрузить в PostgreSQL во время запуска, прежде чем их можно будет использовать. Эти предварительно загруженные расширения можно просмотреть и отредактировать ниже.
zh_hans: 启动时必须将某些扩展加载到 PostgreSQL 中，然后才能使用它们。可在下面查看和编辑这些预加载的扩展。
zh_hant: 某些延伸模組在啟動時必須先載入至 PostgreSQL 才能使用。可在下方檢視及編輯這些預先載入的延伸模組。

# arc.extensionsLearnMore
source: Learn more about PostgreSQL extensions.
de: Weitere Informationen zu PostgreSQL-Erweiterungen.
es: Más información sobre las extensiones de PostgreSQL.
fr: En savoir plus sur les extensions PostgreSQL.
it: Altre informazioni sulle estensioni PostgreSQL.
ja: PostgreSQL 拡張機能に関する詳細を説明します。
ko: PostgreSQL 확장에 대해 자세히 알아보세요.
pt_br: Saiba mais sobre as extensões do PostgreSQL.
ru: Дополнительные сведения о расширениях PostgreSQL.
zh_hans: 了解 PostgreSQL 扩展的详细信息。
zh_hant: 深入了解 PostgreSQL 延伸模組。

# arc.extensionsTableLabel
source: Table of preloaded extensions.
de: Tabelle der im Voraus geladenen Erweiterungen.
es: Tabla de extensiones precargadas.
fr: Table des extensions préchargées.
it: Tabella delle estensioni precaricate.
ja: 事前読み込みの拡張機能のテーブル。
ko: 미리 로드된 확장의 테이블입니다.
pt_br: Tabela de extensões pré-carregadas.
ru: Таблица предварительно загруженных расширений.
zh_hans: 预加载扩展的表。
zh_hant: 預先載入之延伸模組的資料表。

# arc.extensionsTableLoading
source: Table of preloaded extensions are loading.
de: Die Tabelle der im Voraus geladenen Erweiterungen wird geladen.
es: Se está cargando la tabla de extensiones precargadas.
fr: Table des extensions préchargées est en cours de chargement.
it: È in corso il caricamento della tabella delle estensioni precaricate.
ja: 事前読み込みの拡張機能のテーブルを読み込んでいます。
ko: 미리 로드된 확장의 테이블이 로드되고 있습니다.
pt_br: A tabela de extensões pré-carregadas está sendo carregada.
ru: Таблица предварительно загруженных расширений загружается.
zh_hans: 正在加载预加载扩展的表。
zh_hant: 正在載入預先載入之延伸模組的資料表。

# arc.extensionsTableLoadingComplete
source: Preloaded extensions can now be viewed.
de: Im Voraus geladene Erweiterungen können jetzt angezeigt werden.
es: Ahora se pueden ver las extensiones precargadas.
fr: Les extensions préchargées peuvent désormais être affichées.
it: È ora possibile visualizzare le estensioni precaricate.
ja: 事前に読み込まれた拡張機能を表示できます。
ko: 이제 미리 로드된 확장을 볼 수 있습니다.
pt_br: As extensões pré-carregadas já podem ser exibidas.
ru: Теперь можно просмотреть предварительно загруженные расширения.
zh_hans: 现在可以查看预加载的扩展。
zh_hant: 現在可以檢視預先載入的延伸模組。

# arc.externalEndpoint
source: External Endpoint
de: Externer Endpunkt
es: Punto de conexión externo
fr: Point de terminaison externe
it: Endpoint esterno
ja: 外部エンドポイント
ko: 외부 엔드포인트
pt_br: Ponto de extremidade externo
ru: Внешняя конечная точка
zh_hans: 外部终结点
zh_hant: 外部端點

# arc.failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
it: Non riuscito
ja: 失敗
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 已失败
zh_hant: 失敗

# arc.feedback
source: Feedback
es: Comentarios
fr: Commentaires
ja: フィードバック
ko: 피드백
pt_br: Comentários
ru: Отзывы
zh_hans: 反馈
zh_hant: 意見反應

# arc.fetchConfigFailed
source: An unexpected error occurred retrieving the config for '{0}'. {1}
de: Unerwarteter Fehler beim Abrufen der Konfiguration für "{0}". {1}
es: Error inesperado al recuperar la configuración de '{0}'. {1}
fr: Une erreur inattendue s’est produite lors de la récupération de la configuration pour « {0} ». {1}
it: Errore imprevisto durante il recupero della configurazione per '{0}'. {1}
ja: '{0}' の構成を取得中に予期しないエラーが発生しました。{1}
ko: '{0}'에 대한 구성을 검색하는 동안 예기치 않은 오류가 발생했습니다. {1}
pt_br: Ocorreu um erro inesperado ao recuperar a configuração de '{0}'. {1}
ru: Произошла непредвиденная ошибка при извлечении конфигурации для "{0}". {1}
zh_hans: 检索“{0}”的配置时出现意外错误。{1}
zh_hant: 擷取 '{0}' 的設定時發生未預期的錯誤。{1}

# arc.fetchDatabasesFailed
source: An unexpected error occurred retrieving the databases for '{0}'. {1}
de: Unerwarteter Fehler beim Abrufen der Datenbanken für "{0}". {1}
es: Error inesperado al recuperar las bases de datos de '{0}'. {1}
fr: Une erreur inattendue s’est produite lors de la récupération des base de données pour « {0} ». {1}
it: Errore imprevisto durante il recupero dei database per '{0}'. {1}
ja: '{0}' のデータベースを取得中に予期しないエラーが発生しました。{1}
ko: '{0}'에 대한 데이터베이스를 검색하는 동안 예기치 않은 오류가 발생했습니다. {1}
pt_br: Ocorreu um erro inesperado ao recuperar o banco de dados de '{0}'. {1}
ru: Произошла непредвиденная ошибка при извлечении баз данных для "{0}". {1}
zh_hans: 检索“{0}”的数据库时出现意外错误。{1}
zh_hant: 擷取 '{0}' 的資料庫時發生未預期的錯誤。{1}

# arc.fetchEndpointsFailed
source: An unexpected error occurred retrieving the endpoints for '{0}'. {1}
de: Unerwarteter Fehler beim Abrufen der Endpunkte für "{0}". {1}
es: Error inesperado al recuperar los puntos de conexión de '{0}'. {1}
fr: Une erreur inattendue s’est produite lors de la récupération des points de terminaison pour « {0} ». {1}
it: Errore imprevisto durante il recupero degli endpoint per '{0}'. {1}
ja: '{0}' のエンドポイントを取得中に予期しないエラーが発生しました。{1}
ko: '{0}'에 대한 엔드포인트를 검색하는 동안 예기치 않은 오류가 발생했습니다. {1}
pt_br: Ocorreu um erro inesperado ao recuperar os pontos de extremidade de '{0}'. {1}
ru: Произошла непредвиденная ошибка при извлечении конечных точек для "{0}". {1}
zh_hans: 检索“{0}”的终结点时发生意外错误。{1}
zh_hant: 擷取 '{0}' 的端點時發生未預期的錯誤。{1}

# arc.fetchEngineSettingsFailed
source: An unexpected error occurred retrieving the engine settings for '{0}'. {1}
de: Unerwarteter Fehler beim Abrufen der Engine-Einstellungen für "{0}". {1}
es: Error inesperado al recuperar la configuración del motor para '{0}'. {1}
fr: Une erreur inattendue s’est produite lors de la récupération des paramètres du moteur pour « {0} ». {1}
it: Errore imprevisto durante il recupero delle impostazioni del motore per '{0}'. {1}
ja: '{0}' のエンジン設定を取得中に予期しないエラーが発生しました。{1}
ko: '{0}'에 대한 엔진 설정을 검색하는 동안 예기치 않은 오류가 발생했습니다. {1}
pt_br: Ocorreu um erro inesperado ao recuperar as configurações do mecanismo de '{0}'. {1}
ru: Произошла непредвиденная ошибка при извлечении параметров обработчика для "{0}". {1}
zh_hans: 检索“{0}”的引擎设置时出现意外错误。{1}
zh_hant: 擷取 '{0}' 的引擎設定時發生未預期的錯誤。{1}

# arc.fetchRegistrationsFailed
source: An unexpected error occurred retrieving the registrations for '{0}'. {1}
de: Unerwarteter Fehler beim Abrufen der Registrierungen für "{0}". {1}
es: Error inesperado al recuperar los registros de '{0}'. {1}
fr: Une erreur inattendue s’est produite lors de la récupération des inscription pour « {0} ». {1}
it: Errore imprevisto durante il recupero delle registrazioni per '{0}'. {1}
ja: '{0}' の登録を取得中に予期しないエラーが発生しました。{1}
ko: '{0}'에 대한 등록을 검색하는 동안 예기치 않은 오류가 발생했습니다. {1}
pt_br: Ocorreu um erro inesperado ao recuperar os registros de '{0}'. {1}
ru: Произошла непредвиденная ошибка при извлечении регистраций для "{0}". {1}
zh_hans: 检索“{0}”的注册时出现意外错误。{1}
zh_hant: 擷取 '{0}' 的註冊時發生未預期的錯誤。{1}

# arc.fullyQualifiedDomain
source: Fully qualified domain
de: Vollqualifizierte Domäne
es: Nombre de dominio completo
fr: Domaine complet
it: Dominio completo
ja: 完全修飾ドメイン
ko: 정규화된 도메인
pt_br: Domínio totalmente qualificado
ru: Полное доменное имя
zh_hans: 完全限定的域
zh_hant: 完整網域

# arc.grafanaDashboard
source: Grafana Dashboard
es: Panel de Grafana
fr: Tableau de bord Grafana
it: Dashboard Grafana
ja: Grafana ダッシュボード
ko: Grafana 대시보드
pt_br: Painel do Grafana
ru: Панель мониторинга Grafana
zh_hans: Grafana 仪表板
zh_hant: Grafana 儀表板

# arc.grafanaDashboardDescription
source: Dashboard for viewing metrics
de: Dashboard zum Anzeigen von Metriken
es: Panel para ver métricas
fr: Tableau de bord pour l’affichage des métriques
it: Dashboard per la visualizzazione delle metriche
ja: メトリックを表示するためのダッシュボード
ko: 메트릭을 보기 위한 대시보드
pt_br: Painel para a exibição de métricas
ru: Панель мониторинга для просмотра метрик
zh_hans: 用于查看指标的仪表板
zh_hant: 用於檢視計量的儀表板

# arc.indirect
source: Indirect
de: Indirekt
es: Indirecta
fr: Indirectement
it: Indiretto
ja: 間接
ko: 간접
pt_br: Indireto
ru: Косвенный
zh_hans: 间接
zh_hant: 間接

# arc.installingExtension
source: Installing extension '{0}'...
de: Die Erweiterung "{0}" wird installiert...
es: Instalando la extensión '{0}'...
fr: Installation de l'extension '{0}'...
it: Installazione dell'estensione "{0}" in corso...
ja: 拡張機能 '{0}' をインストールしています...
ko: '{0}' 확장을 설치하는 중...
pt_br: Instalando a Extensão '{0}'...
ru: Установка расширения "{0}"…
zh_hans: 正在安装扩展“{0}”...
zh_hant: 正在安裝延伸模組 '{0}'...

# arc.instance
source: Instance
de: Instanz
ko: 인스턴스
pt_br: Instância
zh_hans: 实例
zh_hant: 執行個體

# arc.instanceDeleted
source: Instance '{0}' deleted
de: Die Instanz "{0}" wurde gelöscht
es: Instancia '{0}' eliminada
fr: Instance « {0} » supprimée
it: L'istanza ' {0}' è stata eliminata
ja: インスタンス '{0}' が削除されました
ko: 인스턴스 '{0}'이(가) 삭제됨
pt_br: Instância '{0}' excluída
ru: Экземпляр "{0}" удален
zh_hans: 已删除实例“{0}”
zh_hant: 執行個體 '{0}' 已刪除

# arc.instanceDeletionFailed
source: Failed to delete instance {0}. {1}
de: Fehler beim Löschen der Instanz "{0}". {1}
es: No se pudo eliminar la instancia {0}. {1}
fr: Échec de la suppression de l’instance {0}. {1}
it: Impossibile eliminare l'istanza {0}. {1}
ja: インスタンス {0} を削除できません。{1}
ko: {0} 인스턴스를 삭제하지 못했습니다. {1}
pt_br: Ocorreu um erro ao excluir a instância {0}. {1}
ru: Не удалось удалить экземпляр {0}. {1}
zh_hans: 未能删除实例 {0}。{1}
zh_hant: 無法刪除執行個體 {0}。{1}

# arc.instanceDeletionWarning
source: Warning! Deleting an instance is permanent and cannot be undone. To delete the instance '{0}' type the name '{0}' below to proceed.
de: Warnung! Das Löschen einer Instanz ist dauerhaft und kann nicht rückgängig gemacht werden. Um die Instanz "{0}" zu löschen, geben Sie unten den Namen "{0}" ein, um den Vorgang fortzusetzen.
es: ¡Advertencia! La eliminación de una instancia es permanente y no se puede deshacer. Para eliminar la instancia '{0}' escriba el nombre '{0}' a continuación.
fr: Avertissement ! La suppression d’une instance est permanente et ne peut pas être annulée. Pour supprimer l’instance « {0} », tapez le nom « {0} » ci-dessous pour continuer.
it: Avviso! L'eliminazione di un'istanza è permanente e non può essere annullata. Per eliminare l'istanza '{0}' digitare il nome '{0}' di seguito per continuare.
ja: 警告!インスタンスの削除は永久的であり、元に戻すことはできません。インスタンス '{0}' を削除するには、下に名前 '{0}' を入力して続行します。
ko: 경고! 인스턴스 삭제는 영구적이므로 실행 취소할 수 없습니다. 인스턴스 '{0}'을(를) 삭제하려면 아래에 '{0}' 이름을 입력하고 계속합니다.
pt_br: Aviso! A exclusão de uma instância é permanente e não pode ser desfeita. Para excluir a instância '{0}', digite o nome '{0}' abaixo para continuar.
ru: Предупреждение! Удаление экземпляра является окончательным и не может быть отменено. Чтобы удалить экземпляр "{0}" введите имя "{0}" ниже для продолжения.
zh_hans: 警告! 删除实例是永久性操作，且无法撤消。要删除实例“{0}”，请在下面键入名称“{0}”以继续。
zh_hant: 警告! 刪除執行個體是永久性的，無法復原。若要刪除執行個體 '{0}'，請在下方輸入名稱 '{0}' 以繼續。

# arc.instanceUpdateFailed
source: Failed to update instance {0}. {1}
de: Fehler beim Aktualisieren der Instanz "{0}". {1}
es: No se pudo actualizar la instancia {0}. {1}
fr: Échec de la mise à jour de l’instance {0}. {1}
it: Impossibile aggiornare l'istanza {0}. {1}
ja: インスタンス {0} を更新できませんでした。{1}
ko: 인스턴스 {0}을(를) 업데이트하지 못했습니다. {1}
pt_br: Ocorreu um erro ao atualizar a instância {0}. {1}
ru: Не удалось обновить экземпляр {0}. {1}
zh_hans: 未能更新实例 {0}。{1}
zh_hant: 無法更新執行個體 {0}。{1}

# arc.instanceUpdated
source: Instance '{0}' updated
de: Instanz "{0}" wurde aktualisiert
es: Instancia '{0}' actualizada
fr: Instance « {0} » mise à jour
it: L'istanza '{0}' è stata aggiornata
ja: インスタンス '{0}' が更新されました
ko: 인스턴스 '{0}'이(가) 업데이트됨
pt_br: Instância '{0}' atualizada
ru: Экземпляр "{0}" обновлен
zh_hans: 已更新实例“{0}”
zh_hant: 執行個體 '{0}' 已更新

# arc.invalidConfigPath
source: Invalid config path
de: Ungültiger Konfigurationspfad
es: Ruta de acceso de configuración no válida
fr: Chemin d'accès de configuration non valide
it: Percorso di configurazione non valido
ja: 無効な構成パス
ko: 잘못된 구성 경로
pt_br: Caminho de configuração inválido
ru: Недопустимый путь к конфигурации
zh_hans: 配置路径无效
zh_hant: config 路徑無效

# arc.invalidInstanceDeletionName
source: The value '{0}' does not match the instance name. Try again or press escape to exit
de: Der Wert "{0}" stimmt nicht mit dem Instanznamen überein. Versuchen Sie es erneut, oder drücken Sie ESC, um den Vorgang zu beenden.
es: El valor '{0}' no coincide con el nombre de instancia. Inténtelo de nuevo o presione Escape para salir
fr: La valeur « {0} » ne correspond pas au nom de l’instance. Réessayez ou appuyez sur Echap pour quitter
it: Il valore ' {0}' non corrisponde al nome dell'istanza. Riprovare o premere ESC per uscire
ja: 値 '{0}' がインスタンス名と一致しません。もう一度やり直すか、esc キーを押して終了してください
ko: '{0}' 값이 인스턴스 이름과 일치하지 않습니다. 다시 시도하거나 Esc 키를 눌러 종료합니다.
pt_br: O valor '{0}' não corresponde com o nome da instância. Tente novamente ou clique em escape para sair
ru: Значение "{0}" не соответствует имени экземпляра. Повторите попытку или нажмите клавишу ESC, чтобы выйти
zh_hans: 值“{0}”与实例名称不匹配。请重试或按 Esc 退出
zh_hant: 值 '{0}' 不符合執行個體名稱。請再試一次或按 Esc 鍵結束

# arc.issuesDetected
source: Issues Detected
de: Es wurden Probleme festgestellt.
es: Problemas detectados
fr: Problèmes détectés
it: Problemi rilevati
ja: 問題検出
ko: 문제 검색됨
pt_br: Problemas Detectados
ru: Обнаруженные проблемы
zh_hans: 已检测到问题
zh_hant: 偵測到的問題

# arc.kibanaDashboard
source: Kibana Dashboard
es: Panel de Kibana
fr: Tableau de bord Kibana
it: Dashboard Kibana
ja: Kibana ダッシュボード
ko: Kibana 대시보드
pt_br: Painel do Kibana
ru: Панель мониторинга Kibana
zh_hans: Kibana 仪表板
zh_hant: Kibana 儀表板

# arc.kibanaDashboardDescription
source: Dashboard for viewing logs
de: Dashboard zum Anzeigen von Protokollen
es: Panel para ver registros
fr: Tableau de bord pour l’affichage des journaux
it: Dashboard per la visualizzazione dei log
ja: ログを表示するためのダッシュボード
ko: 로그를 보기 위한 대시보드
pt_br: Painel para a exibição de registros
ru: Панель мониторинга для просмотра журналов
zh_hans: 用于查看日志的仪表板
zh_hant: 用於檢視記錄的儀表板

# arc.lastTransition
source: Last transition
de: Letzter Übergang
es: Última transición
fr: Dernière transition
it: Ultima transizione
ja: 最終移行
ko: 마지막 전환
pt_br: Última transição
ru: Последний переход
zh_hans: 上次转换时间
zh_hant: 上次轉換時間

# arc.latestpitrRestorePoint
source: Latest point in time
de: Letzter Zeitpunkt
ko: 최신 시점
pt_br: Último ponto no tempo
zh_hans: 最近的时间点
zh_hant: 最近的時間點

# arc.learnAboutNodeParameters
source: Learn more about database engine settings for Azure Arc-enabled PostgreSQL Hyperscale
de: Weitere Informationen zu den Einstellungen des Datenbankmoduls für PostgreSQL Hyperscale mit Azure Arc-Unterstützung
es: Más información sobre la configuración del motor de base de datos para hiperescala de PostgreSQL habilitada para Azure Arc
fr: En savoir plus sur les paramètres du moteur de base de données pour PostgreSQL Hyperscale avec Azure Arc
it: Altre informazioni sulle impostazioni del motore di database per PostgreSQL Hyperscale abilitato per Azure Arc
ja: Azure Arc を有効にした PostgreSQL Hyperscale のデータベース エンジンの設定に関する詳細情報
ko: Azure Arc 지원 PostgreSQL 하이퍼스케일의 데이터베이스 엔진 설정에 대한 자세한 정보
pt_br: Saiba mais sobre as configurações do mecanismo de banco de dados da Hiperescala de PostgreSQL habilitada para o Azure Arc
ru: Дополнительные сведения о параметрах ядра СУБД для гипермасштабирования PostgreSQL с поддержкой Azure Arc
zh_hans: 详细了解已启用 Azure Arc 的 PostgreSQL 超大规模数据库引擎设置
zh_hant: 深入了解支援 Azure Arc 之 PostgreSQL 超大規模資料庫的資料庫引擎設定

# arc.learnAboutPostgresClients
source: Learn more about Azure PostgreSQL Hyperscale client interfaces
de: Weitere Informationen zu Azure PostgreSQL Hyperscale-Clientschnittstellen
es: Más información sobre las interfaces de cliente de hiperescala de Azure PostgreSQL
fr: En savoir plus sur les interfaces clientes Hyperscale Azure PostgreSQL
it: Altre informazioni sulle interfacce client di Azure PostgreSQL Hyperscale
ja: PostgreSQL Hyperscale クライアント インターフェースに関する詳細情報
ko: Azure PostgreSQL 하이퍼스케일 클라이언트 인터페이스에 대한 자세한 정보
pt_br: Saiba mais sobre a Hiperescala de PostgreSQL habilitada para o Azure Arc.
ru: Дополнительные сведения о клиентских интерфейсах гипермасштабирования PostgreSQL Azure
zh_hans: 详细了解 Azure PostgreSQL 超大规模客户端接口
zh_hant: 深入了解 Azure PostgreSQL 超大規模資料庫用戶端介面

# arc.learnMore
source: Learn More.
de: Weitere Informationen.
es: Más información.
fr: En savoir plus.
it: Altre informazioni.
ja: 詳細情報。
ko: 자세히 알아보세요.
pt_br: Saiba mais.
ru: Дополнительные сведения.
zh_hans: 了解详细信息。
zh_hant: 深入了解。

# arc.loadExtensions
source: Load extensions
de: Extensions laden
es: Cargar extensiones
fr: Charger des extensions
it: Carica estensioni
ja: 拡張機能の読み込み
ko: 확장 로드
pt_br: Carregar extensões
ru: Загрузить расширения
zh_hans: 加载扩展
zh_hant: 載入延伸模組

# arc.loading
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
it: Caricamento...
ja: 読み込んでいます...
ko: 로드하는 중...
pt_br: Carregando...
ru: Загрузка…
zh_hans: 正在加载...
zh_hant: 正在載入...

# arc.loadingClusterContextCompleted
source: Loading cluster contexts completed
de: Laden von Clusterkontexten abgeschlossen
es: Carga de contextos de clúster completada
fr: Chargement des contextes de cluster terminé
it: Caricamento dei contesti cluster completato
ja: クラスター コンテキストの読み込みが完了しました
ko: 클러스터 컨텍스트 로드 완료
pt_br: Carregamento de contextos de cluster concluídos
ru: Загрузка контекстов кластера завершена
zh_hans: 已完成加载群集上下文
zh_hant: 載入叢集內容完成

# arc.loadingClusterContextsError
source: Error loading cluster contexts. {0}
de: Fehler beim Laden von Clusterkontexten. {0}
es: Error al cargar los contextos de clúster. {0}
fr: Erreur lors du chargement des contextes de cluster. {0}
it: Errore durante il caricamento dei contesti cluster. {0}
ja: クラスター コンテキストの読み込み時のエラー。{0}
ko: 클러스터 컨텍스트를 로드하는 동안 오류가 발생했습니다. {0}
pt_br: Ocorreu um erro ao carregar os contextos do cluster. {0}
ru: Ошибка при загрузке контекстов кластера. {0}
zh_hans: 加载群集上下文时出错。{0}
zh_hant: 載入叢集內容時發生錯誤。{0}

# arc.logStorage
source: {0} log
de: {0} Protokoll
es: Registro de {0}
it: Log {0}
ja: {0} ログ
ko: {0} 로그
pt_br: log {0}
ru: Журнал {0}
zh_hans: {0} 日志
zh_hant: {0} 記錄

# arc.loginFailed
source: Error logging into controller - wrong username or password
de: Fehler beim Anmelden beim Controller – falscher Benutzername oder Kennwort.
es: Error al iniciar sesión en el controlador: nombre de usuario o contraseña incorrectos
fr: Erreur de connexion au contrôleur : nom d’utilisateur ou mot de passe incorrect
it: Errore durante l'accesso al controller: nome utente o password errati
ja: コントローラーへのログイン エラー - ユーザー名またはパスワードが間違っています
ko: 컨트롤러에 로그인하는 동안 오류 발생 - 잘못된 사용자 이름 또는 암호
pt_br: Erro ao fazer logon no controlador - nome de usuário ou senha incorreto
ru: Ошибка входа в систему контроллера: неправильное имя пользователя или пароль
zh_hans: 登录控制器时出错 - 用户名或密码错误
zh_hant: 登入控制器時發生錯誤 - 使用者名稱或密碼錯誤

# arc.memoryLimit
source: Memory limit (in GB)
de: Speicherlimit (in GB)
es: Límite de memoria (en GB)
fr: Limite de mémoire (en Go)
it: Limite di memoria (in GB)
ja: メモリの制限 (GB)
ko: 메모리 제한(GB)
pt_br: Limite de Memória (em GB)
ru: Предельный объем памяти (в ГБ)
zh_hans: 内存限制(以 GB 为单位)
zh_hant: 記憶體限制 (GB)

# arc.memoryRequest
source: Memory request (in GB)
de: Speicheranforderung (in GB)
es: Solicitud de memoria (en GB)
fr: Demande de mémoire (en Go)
it: Richiesta di memoria (in GB)
ja: メモリ要求 (GB)
ko: 메모리 요청(GB)
pt_br: Solicitação de Memória (em GB)
ru: Запрошенная память (в ГБ)
zh_hans: 内存请求(以 GB 为单位)
zh_hant: 記憶體要求 (GB)

# arc.miaaAdmin
source: Managed instance admin
de: MI-Administrator
es: Administrador de instancia administrada
fr: Administrateur d'instance managée
it: Amministratore dell'istanza gestita
ja: マネージド インスタンスの管理者
ko: 관리되는 인스턴스 관리자
pt_br: Administrador da instância gerenciada
ru: Администратор управляемого экземпляра
zh_hans: 托管实例管理员
zh_hant: 受控執行個體管理員

# arc.miaaBackupsDatabasesDescription
source: Databases with available backups are displayed below. Restore databases to this instance or any other instance within the same custom location.
de: Datenbanken mit verfügbaren Sicherungen werden unten angezeigt. Stellen Sie Datenbanken in dieser Instanz oder einer anderen Instanz innerhalb desselben benutzerdefinierten Speicherorts wieder her.
ko: 사용 가능한 백업이 있는 데이터베이스가 아래에 표시됩니다. 이 인스턴스 또는 동일한 사용자 지정 위치 내의 다른 인스턴스로 데이터베이스를 복원합니다.
pt_br: Os bancos de dados com backups disponíveis são exibidos abaixo. Restaure bancos de dados para essa instância ou qualquer outra instância no mesmo local personalizado.
zh_hans: 下面显示了具有可用备份的数据库。将数据库还原到此实例或同一自定义位置内的任何其他实例。
zh_hant: 具有可用備份的資料庫顯示如下。將資料庫還原到此執行個體或相同自訂位置內的任何其他執行個體。

# arc.miaaComputeAndStorageDescriptionPartOne
source: You can scale your Azure SQL managed instance - Azure Arc by
de: Sie können Ihre Azure SQL Managed Instance – Azure Arc skalieren nach
es: Puede escalar su instancia administrada de Azure SQL: Azure Arc por
fr: Vous pouvez mettre à l’échelle votre Azure SQL Managed Instance : Azure Arc par
it: È possibile ridimensionare l'istanza gestita di SQL di Azure - Azure Arc di
ja: Azure SQL Managed Instance - Azure Arc を拡張できます
ko: Azure SQL Managed Instance - Azure Arc의 크기를 조정할 수 있습니다.
pt_br: Você pode dimensionar sua instância SQL do Azure gerenciada – pelo Azure Arc
ru: Вы можете масштабировать управляемый экземпляр SQL Azure — Azure Arc с помощью
zh_hans: 可以通过以下方式缩放 Azure SQL 托管实例 - Azure Arc
zh_hant: 您可以縮放 Azure SQL 受控執行個體 - Azure Arc，依據為

# arc.miaaConnectionRequired
source: A connection is required to list the databases on this instance.
de: Zum Auflisten der Datenbanken in dieser Instanz ist eine Verbindung erforderlich.
es: Se necesita una conexión para enumerar las bases de datos de esta instancia.
fr: Une connexion est requise pour répertorier les bases de données sur cette instance.
it: È necessaria una connessione per elencare i database in questa istanza.
ja: このインスタンスのデータベースを一覧表示するには接続する必要があります。
ko: 이 인스턴스의 데이터베이스를 나열하려면 연결이 필요합니다.
pt_br: Uma conexão é necessária para listar os bancos de dados nesta instância.
ru: Для перечисления баз данных в этом экземпляре требуется подключение.
zh_hans: 需要连接以列出此实例上的数据库。
zh_hant: 需要連線才能列出此執行個體上的資料庫。

# arc.miaaDashboard
source: SQL managed instance - Azure Arc Dashboard - {0}
de: SQL Managed Instance – Azure Arc-Dashboard (Vorschau) – {0}
pt_br: Instância gerenciada do SQL - Painel do Azure Arc - {0}
zh_hans: SQL 托管实例 - Azure Arc 仪表板 - {0}
zh_hant: SQL 受控執行個體 - Azure Arc 儀表板 - {0}

# arc.miaaType
source: SQL managed instance - Azure Arc
de: Verwaltete SQL-Instanz – Azure Arc
es: Instancia administrada de SQL: Azure Arc
fr: Instance managée SQL - Azure Arc
it: Istanza gestita di SQL- Azure Arc
ja: SQL マネージド インスタンス - Azure Arc
ko: SQL 관리형 인스턴스 - Azure Arc
pt_br: Instância gerenciada do SQL – Azure Arc
ru: Управляемый экземпляр SQL — Azure Arc
zh_hans: SQL 托管实例 - Azure Arc
zh_hant: SQL 受控執行個體 - Azure Arc
