Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.agreement.sql.help.text
source: Azure Arc enabled Managed Instance provides SQL Server access and feature compatibility that can be deployed on the infrastructure of your choice. {0}. By clicking 'Script to notebook' or 'Deploy', I (a) agree to the legal terms and privacy statement(s) associated with the Marketplace offering(s) listed below; (b) authorize Microsoft to bill my current payment method for the fees associated with the offering(s), with the same billing frequency as my Azure subscription; and (c) agree that Microsoft may share my contact, usage and transactional information with the provider(s) of the offering(s) for support, billing and other transactional activities. Microsoft does not provide rights for third-party offerings. For additional details see {1}, {2}, and {3}.
de: Azure Arc fähige verwaltete Instanzen bieten SQL Server Zugriff und Funktionskompatibilität, die in der Infrastruktur Ihrer Wahl bereitgestellt werden können. {0}. Indem ich auf ‚Script to notebook‘ oder ‚Deploy‘ klicke, (a) stimme ich den rechtlichen Bedingungen und der/den Datenschutzerklärung(en) zu, die mit den unten aufgeführten Marketplace-Angeboten verbunden sind; (b) Microsoft zu autorisieren, meine aktuelle Zahlungsmethode für die mit dem/den Angebot(en) verbundenen Gebühren mit der gleichen Abrechnungshäufigkeit wie mein Azure-Abonnement in Rechnung zu stellen; und (c) stimme zu, dass Microsoft meine Kontakt-, Nutzungs und Transaktionsinformationen mit dem/den Anbieter(n) des Angebots/der Angebote für Support, Abrechnungs und andere Transaktionsaktivitäten teilen darf. Microsoft gewährt keine Rechte für Angebote von Drittanbietern. Weitere Einzelheiten finden Sie unter {1}, {2}, und {3}.
pt_br: A instância gerenciada habilitada para Azure Arc fornece acesso ao SQL Server e compatibilidade de recursos que podem ser implantados na infraestrutura de sua escolha. {0}. Ao clicar em 'Script to notebook' ou 'Deploy', eu (a) concordo com os termos legais e as políticas de privacidade associadas às ofertas do Marketplace listadas abaixo; (b) autorizar a Microsoft a cobrar do meu método de pagamento atual as taxas associadas à(s) oferta(s), com a mesma frequência de cobrança da minha assinatura do Azure; e (c) concordar que a Microsoft pode compartilhar meu contato, uso e informações transacionais com o(s) fornecedor(es) da(s) oferta(s) para suporte, cobrança e outras atividades transacionais. A Microsoft não fornece direitos para ofertas de terceiros. Para detalhes adicionais consulte {1}, {2} e {3}.
zh_hans: 已启用 Azure Arc 的托管实例提供可在所选基础结构上部署的 SQL Server 访问权限和功能兼容性。{0}。 单击“脚本到笔记本”或“部署”即表示本人: (a) 同意与下面列出的市场产品/服务关联的法律条款和隐私声明；(b) 授权 Microsoft 按与我的 Azure 订阅相同的账单频率，以我当前的付款方式向我收取使用这项或这些产品/服务所产生的费用；以及 (c) 同意 Microsoft 与产品/服务的提供商共享我的联系信息、使用情况和交易信息，用于支持、计费和其他交易活动。Microsoft 不提供针对第三方产品/服务的权利。有关其他详细信息，请参阅 {1}、{2} 和 {3}。
zh_hant: 已啟用 Azure Arc 的受控執行個體不僅可以存取 SQL Server，還提供相容的功能，可以部署到您選擇的基礎結構上。已啟用 Azure Arc 的受控執行個體不僅可以存取 SQL Server，還提供相容的功能，可以部署到您選擇的基礎結構上。{0}。 按一下 [編寫指令碼到筆記本] 表示我 (a) 同意下方 Marketplace 供應項目的相關法律條款及隱私權聲明; (b) 授權 Microsoft 使用我目前的付款方式，收取供應項目的相關費用，帳單週期與我的 Azure 訂閱相同; 並 (c) 同意 Microsoft 可以將我的連絡資料、使用方式及交易資訊，提供給供應項目的提供者，供支援、帳單及其他交易活動之用。Microsoft 不提供第三方供應項目的權利。如需其他詳細資料，請參閱 {1}、{2} 以及 {3}。

# arc.agreement.sql.help.text.azure.marketplace.terms
source: Azure Marketplace Terms
de: Azure Marketplace Bedingungen
pt_br: Termos do Azure Marketplace
zh_hans: Azure 市场条款
zh_hant: Azure Marketplace 條款

# arc.agreement.sql.help.text.learn.more
source: Learn more
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세히 알아보기
pt_br: Saiba mais
ru: Дополнительные сведения
zh_hans: 了解详细信息
zh_hant: 深入了解

# arc.agreement.sql.help.text.learn.more.ariaLabel
source: Learn more about Azure Arc enabled Managed Instance
de: Weitere Informationen zu verwalteten Instanzen mit Azure Arc-Unterstützung
es: Más información sobre la instancia administrada habilitada para Azure Arc
fr: En savoir plus sur Managed Instance avec Azure Arc
it: Altre informazioni sull'istanza gestita abilitata per Azure Arc
ja: Azure Arc 対応マネージド インスタンスに関する詳細情報
ko: Azure Arc 지원 Managed Instance 대해 자세히 알아보기
pt_br: Saiba mais sobre a Instância Gerenciada habilitada para Azure Arc
ru: Подробнее об управляемом экземпляре с поддержкой Azure Arc
zh_hans: 详细了解已启用 Azure Arc 的托管实例
zh_hant: 深入了解啟用 Azure Arc 的受控執行個體

# arc.agreement.sql.help.text.privacy.policy
source: Privacy policy
de: Datenschutzrichtlinien
pt_br: Política de privacidade
zh_hans: 隐私策略
zh_hant: 隱私權原則

# arc.agreement.sql.help.text.terms.of.use
source: Terms of use
de: Nutzungsbedingungen
pt_br: Termos de uso
zh_hans: 使用条款
zh_hant: 使用規定

# arc.agreement.sql.terms.conditions
source: Azure SQL managed instance - Azure Arc terms and conditions
de: Azure SQL Managed Instance – Azure Arc Geschäftsbedingungen
es: Azure SQL Managed Instance: términos y condiciones de Azure Arc
fr: Instance managée Azure SQL : conditions générales Azure Arc
it: Istanza gestita di SQL di Azure - Termini e condizioni di Azure Arc
ja: Azure SQL マネージド インスタンス - Azure Arc のご契約条件
ko: Azure SQL Managed Instance - Azure Arc 사용 약관
pt_br: Instância Gerenciada de SQL do Azure - Termos e condições do Azure Arc
ru: Управляемый экземпляр SQL Azure — условия Azure Arc
zh_hans: Azure SQL 托管实例 - Azure Arc 条款和条件
zh_hant: Azure SQL 受控執行個體 - Azure Arc 條款及條件

# arc.azure.account
source: Azure account
de: Azure-Konto
es: Cuenta de Azure
fr: Compte Azure
it: Account Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Conta do Azure
ru: Учетная запись Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶

# arc.azure.location
source: Azure location
de: Azure-Standort
es: Ubicación de Azure
fr: Emplacement Azure
it: Percorso di Azure
ja: Azure の場所
ko: Azure 위치
pt_br: Local do Azure
ru: Расположение Azure
zh_hans: Azure 位置
zh_hant: Azure 位置

# arc.azure.resource.group
source: Azure resource group
de: Azure-Ressourcengruppe
es: Grupo de recursos de Azure
fr: Groupe de ressources Azure
it: Gruppo di risorse di Azure
ja: Azure リソース グループ
ko: Azure 리소스 그룹
pt_br: Grupo de recursos do Azure
ru: Группа ресурсов Azure
zh_hans: Azure 资源组
zh_hant: Azure 資源群組

# arc.azure.section.title
source: Azure information
de: Azure-Informationen
es: Información de Azure
fr: Informations Azure
it: Informazioni su Azure
ja: Azure 情報
ko: Azure 정보
pt_br: Informações do Azure
ru: Информация Azure
zh_hans: Azure 信息
zh_hant: Azure 資訊

# arc.azure.subscription
source: Azure subscription
de: Azure-Abonnement
es: Suscripción a Azure
fr: Abonnement Azure
it: Sottoscrizione di Azure
ja: Azure サブスクリプション
ko: Azure 구독
pt_br: Assinatura do Azure
ru: Подписка Azure
zh_hans: Azure 订阅
zh_hant: Azure 訂用帳戶

# arc.confirm.password
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Confermare password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# arc.controller
source: Target Azure Arc Controller
de: Ziel-Azure Arc-Controller
es: Controlador de destino de Azure Arc
fr: Contrôleur Azure Arc cible
it: Controller Azure Arc di destinazione
ja: 対象の Azure Arc コントローラー
ko: 대상 Azure Arc 컨트롤러
pt_br: Controlador de destino do Azure Arc
ru: Целевой контроллер Azure Arc
zh_hans: 目标 Azure Arc 控制器
zh_hant: 目標 Azure Arc 控制器

# arc.cores-limit.label
source: Cores Limit
de: Kerne-Limit
es: Límite de núcleos
fr: Nombre maximal de mémoires à tores magnétiques
it: Limite core
ja: コア制限
ko: 코어 제한
pt_br: Núcleos limite
ru: Ограничение на число ядер
zh_hans: 内核限制
zh_hant: 核心數限制

# arc.cores-request.label
source: Cores Request
de: Cores-Anforderung
es: Solicitud de núcleos
fr: Demande de mémoire à tores magnétiques
it: Richiesta core
ja: コア要求
ko: 코어 요청
pt_br: Solicitação de Núcleos
ru: Запрос ядер
zh_hans: 核心请求
zh_hant: 核心數要求

# arc.data.controller.auto.upload.logs
source: Auto-upload Logs
de: Protokolle automatisch hochladen
ko: 로그 자동 업로드
pt_br: Carregar logs automaticamente
zh_hans: 自动上传日志
zh_hant: 自動上傳記錄

# arc.data.controller.auto.upload.logs.description
source: Enable the automatic upload of logs. Direct mode only.
de: Aktivieren des automatischen Hochladens von Protokollen. Nur direkter Modus.
ko: 로그의 자동 업로드를 사용하도록 설정합니다. 직접 모드 전용입니다.
pt_br: Habilitar o carregamento automático de logs. Somente modo direto.
zh_hans: 启用日志的自动上传。仅限直接模式。
zh_hant: 啟用自動上傳記錄檔。僅直接模式。

# arc.data.controller.auto.upload.metrics
source: Auto-upload Metrics
de: Metriken automatisch hochladen
ko: 메트릭 자동 업로드
pt_br: Métricas de carregamento automático
zh_hans: 自动上传指标
zh_hant: 自動上傳計量

# arc.data.controller.auto.upload.metrics.description
source: Enable the automatic upload of metrics. Direct mode only.
de: Aktivieren des automatischen Hochladens von Metriken. Nur direkter Modus.
ko: 메트릭의 자동 업로드를 사용하도록 설정합니다. 직접 모드 전용입니다.
pt_br: Habilitar o carregamento automático de métricas. Somente modo direto.
zh_hans: 启用指标的自动上传。仅限直接模式。
zh_hant: 啟用計量的自動上傳。僅直接模式。

# arc.data.controller.cluster.config.profile
source: Kubernetes configuration template
de: Kubernetes-Konfigurationsvorlage
pt_br: Configuração do modelo de Kubernetes
zh_hans: Kubernetes 配置模板
zh_hant: Kube 設定範本

# arc.data.controller.cluster.config.profile.description
source: Choose the Kubernetes configuration template that matches with your Kubernetes distribution. This template provides defaults for storage class, service type, etc.
de: Wählen Sie die Kubernetes-Konfigurationsvorlage aus, die Ihrer Kubernetes-Verteilung entspricht. Diese Vorlage stellt Standardwerte z. B. für die Speicherklasse oder den Diensttyp bereit.
pt_br: Escolha o modelo de configuração Kubernetes que corresponde à sua distribuição da Kubernetes. Esse modelo fornece padrões para classe de armazenamento, tipo de serviço etc.
zh_hans: 选择匹配 Kubernetes 分发的 Kubernetes 配置模版。此模版提供了存储类、服务类型等的默认设置。
zh_hant: 選擇符合您 Kube 發佈的 Kube 設定範本。此範本提供儲存類別、服務類型等的預設。

# arc.data.controller.cluster.config.profile.loading
source: Loading config profiles
de: Konfigurationsprofile werden geladen
es: Cargando perfiles de configuración
fr: Chargement des profils de configuration
it: Caricamento profili di configurazione
ja: 構成プロファイルの読み込み中
ko: 구성 프로필 로드 중
pt_br: Carregando perfis de configuração
ru: Загрузка профилей конфигурации
zh_hans: 正在加载配置文件
zh_hant: 正在載入組態設定檔

# arc.data.controller.cluster.config.profile.loadingcompleted
source: Loading config profiles complete
de: Das Laden der Konfigurationsprofile ist abgeschlossen
es: Carga de perfiles de configuración completada
fr: Chargement des profils de configuration effectué
it: Caricamento profili di configurazione completato
ja: 構成プロファイルの完了を読み込み中
ko: 구성 프로필 로드 완료
pt_br: Carregamento de perfis de configuração concluído
ru: Загрузка профилей конфигурации завершена
zh_hans: 加载配置文件已完成
zh_hant: 載入組態設定檔完成

# arc.data.controller.cluster.config.profile.title
source: Choose the config profile
de: Konfigurationsprofil auswählen
es: Elegir el perfil de configuración
fr: Choisir le profil de configuration
it: Scegliere il profilo di configurazione
ja: 構成プロファイルを選択する
ko: 구성 프로필 선택
pt_br: Escolher o perfil de configuração
ru: Выберите профиль конфигурации
zh_hans: 选择配置文件
zh_hant: 選擇組態設定檔

# arc.data.controller.cluster.environment.title
source: What is your target existing Kubernetes cluster environment?
de: Was ist Ihre Zielumgebung für den bestehenden Kubernetes-Cluster?
es: ¿Cuál es el entorno de clúster de Kubernetes existente de destino?
fr: Quel est votre environnement de cluster Kubernetes existant cible ?
it: Qual è l'ambiente cluster Kubernetes esistente di destinazione?
ja: 対象の既存の Kubernetes クラスター環境は何ですか?
ko: 대상 기존 Kubernetes 클러스터 환경은 무엇인가요?
pt_br: Qual é a sua meta de ambiente de cluster Kubernete existente?
ru: Какова целевая существующая среда кластера Kubernetes?
zh_hans: 你的目标现有 Kubernetes 群集环境是什么?
zh_hant: 您的目標現有 Kubernetes 叢集環境是什麼?

# arc.data.controller.cluster.name
source: Cluster Name
pt_br: Nome do Cluster
zh_hans: 群集名称
zh_hant: 叢集名稱

# arc.data.controller.cluster.name.description
source: The name of the cluster. Direct mode only.
de: Der Name des Clusters. Nur Direktmodus.
pt_br: O nome do cluster. Somente modo direto.
zh_hans: 群集的名称。仅限直接模式。
zh_hant: 叢集的名稱。僅直接模式。

# arc.data.controller.connectivity.mode
source: Connectivity mode
de: Verbindungsmodus
ko: 연결 모드
pt_br: Modo de conectividade
zh_hans: 连接模式
zh_hant: 連線模式

# arc.data.controller.create.azureconfig.title
source: Azure Configuration
de: Azure-Konfiguration
es: Configuración de Azure
fr: Configuration Azure
it: Configurazione di Azure
ja: Azure の構成
ko: Azure 구성
pt_br: Configuração do Azure
ru: Конфигурация Azure
zh_hans: Azure 配置
zh_hant: Azure 組態

# arc.data.controller.create.controllerconfig.title
source: Controller Configuration
de: Controllerkonfiguration
es: Configuración de controlador
fr: Configuration du contrôleur
it: Configurazione controller
ja: コントローラーの構成
ko: 컨트롤러 구성
pt_br: Configuração do Controlador
ru: Конфигурация контроллера
zh_hans: 控制器配置
zh_hant: 控制器設定

# arc.data.controller.create.summary.title
source: Review your configuration
de: Konfiguration überprüfen
es: Revise la configuración
fr: Vérifier votre configuration
it: Verificare la configurazione
ja: 構成の確認
ko: 구성 검토
pt_br: Examine a sua configuração
ru: Проверьте конфигурацию
zh_hans: 查看配置
zh_hant: 檢閱您的設定

# arc.data.controller.custom.location
source: Custom Location
de: Benutzerdefinierter Speicherort
ko: 사용자 지정 위치
pt_br: Local Personalizado
zh_hans: 自定义位置
zh_hant: 自訂位置

# arc.data.controller.custom.location.description
source: The name of the custom location. Direct mode only.
de: Der Name des benutzerdefinierten Speicherorts. Nur direkter Modus.
ko: 사용자 지정 위치의 이름입니다. 직접 모드 전용입니다.
pt_br: O nome do local personalizado. Apenas modo direto.
zh_hans: 自定义位置的名称。仅限直接模式。
zh_hant: 自訂位置的名稱。僅直接模式。

# arc.data.controller.details.description
source: For indirect mode, namespace, name and storage class are required. This name will be used to identify your Arc instance for remote management and monitoring. For direct mode, custom location name is required.
de: Für den indirekten Modus sind der Namespace, der Name und die Speicherklasse erforderlich. Dieser Name wird verwendet, um Ihre Arc-Instanz für die Remoteverwaltung und -überwachung zu identifizieren. Für den direkten Modus ist ein benutzerdefinierter Standortname erforderlich.
pt_br: Para o modo indireto, o namespace, o nome e a classe de armazenamento são obrigatórios. Esse nome será usado para identificar sua instância do Arc para gerenciamento e monitoramento remotos. Para o modo direto, é necessário um nome de local personalizado.
zh_hans: 对于间接模式，需要命名空间、名称和存储类。此名称将用于标识 Arc 实例以进行远程管理和监视。对于直接模式，则需要自定义位置名称。
zh_hant: 對於間接模式，需要命名空間、名稱和儲存類別。此名稱將用來識別您的 Arc 執行個體，以便進行遠端系統管理和監視。對於直接模式，需要自訂位置名稱。

# arc.data.controller.details.title
source: Data controller details
de: Details zum Datencontroller
es: Detalles del controlador de datos
fr: Détails du contrôleur de données
it: Dettagli del controller dei dati
ja: データ コントローラーの詳細
ko: 데이터 컨트롤러 세부 정보
pt_br: Detalhes do controlador de dados
ru: Сведения о контроллере данных
zh_hans: 数据控制器详细信息
zh_hant: 資料控制器詳細資料

# arc.data.controller.direct.display.name
source: Direct
de: Direkt
pt_br: Direto
zh_hans: 直接
zh_hant: 直接

# arc.data.controller.help.text
source: The Kubernetes cluster must already be arc-enabled with the az connectedk8s connect command. Please use our {0} to learn more.
de: Der Kubernetes-Cluster muss bereits mit dem Connect-Befehl az connectedk8s arc-fähig sein. Lesen Sie unsere {0}, um weitere Informationen zu erhalten.
pt_br: O cluster Kubernetes já deve estar habilitado para arc com o comando az connectk8s connect. Use nosso {0} para saber mais.
zh_hans: Kubernetes 群集必须已使用 az connectedk8s 连接命令启用 arc。请使用我们的 {0} 了解详细信息。
zh_hant: Kubernetes 叢集必須已使用 Az connectedk8s 連線命令來啟用 Arc。請使用我們的 {0} 深入了解。

# arc.data.controller.help.text.documentation.page
source: documentation page
de: Dokumentationsseite
pt_br: página de documentação
zh_hans: 文档页面
zh_hant: 文件頁面

# arc.data.controller.indirect.display.name
source: Indirect
de: Indirekt
pt_br: Indireto
zh_hans: 间接
zh_hant: 間接

# arc.data.controller.infrastructure
source: Infrastructure
de: Infrastruktur
es: Infraestructura
it: Infrastruttura
ja: インフラストラクチャ
ko: 인프라
pt_br: Infraestrutura
ru: Инфраструктура
zh_hans: 基础结构
zh_hant: 基礎結構

# arc.data.controller.kube.cluster.context
source: Cluster context
de: Clusterkontext
es: Contexto del clúster
fr: Contexte de cluster
it: Contesto del cluster
ja: クラスター コンテキスト
ko: 클러스터 컨텍스트
pt_br: Contexto de cluster
ru: Контекст кластера
zh_hans: 群集上下文
zh_hant: 叢集內容

# arc.data.controller.location
source: Location
de: Speicherort
es: Ubicación
fr: Emplacement
it: Percorso
ja: 場所
ko: 위치
pt_br: Localização
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# arc.data.controller.location.description
source: Location is only used for indirect mode deployment. This field will be ignored for direct mode.
de: Der Speicherort wird nur für die Bereitstellung im indirekten Modus verwendet. Dieses Feld wird für den direkten Modus ignoriert.
pt_br: A localização só é usada para implantação de modo indireto. Este campo será ignorado para o modo direto.
zh_hans: 位置仅用于间接模式部署。对于直接模式，将忽略此字段。
zh_hant: 位置僅用於間接模式部署。直接模式將忽略此欄位。

# arc.data.controller.log.analytics.primary.key
source: Log Analytics primary key
de: Primärschlüssel für Log Analytics
pt_br: A Chave primária do Log Analytics
zh_hans: Log Analytics 主键
zh_hant: 記錄分析主要金鑰

# arc.data.controller.log.analytics.workspace.id
source: Log Analytics workspace ID
de: ID des Log Analytics-Arbeitsbereichs
pt_br: ID do Workspace do Log Analytics
zh_hans: Log Analytics 工作区 ID
zh_hant: Log Analytics 工作區識別碼

# arc.data.controller.log.analytics.workspace.names
source: Log Analytics workspace
de: Log Analytics-Arbeitsbereich
pt_br: Workspace do Log Analytics
zh_hans: Log Analytics 工作区
zh_hant: Log Analytics 工作區

# arc.data.controller.metrics.and.logs.dashboard.credentials.confirm.password
source: Confirm password
de: Kennwort bestätigen
pt_br: Confirmar a senha
zh_hans: 确认密码
zh_hant: 確認密碼

# arc.data.controller.metrics.and.logs.dashboard.credentials.password
source: Password
de: Kennwort
pt_br: Senha
zh_hans: 密码
zh_hant: 密碼

# arc.data.controller.metrics.and.logs.dashboard.credentials.password.description
source: Enter the password that will be used to log in to the metrics and logs dashboards.
de: Geben Sie das Kennwort ein, das für die Anmeldung bei den Dashboards für Metriken und Protokolle verwendet wird.
pt_br: Insira a senha que será usada para fazer logon nos painéis de métricas e logs.
zh_hans: 输入将用于登录指标和日志仪表板的密码。
zh_hant: 輸入將用於登入計量和記錄儀表板的密碼。

# arc.data.controller.metrics.and.logs.dashboard.credentials.title
source: Metrics and Logs Dashboard Credentials
de: Anmeldeinformationen für das Dashboard für Metriken und Protokolle
pt_br: Credenciais do Pai de Métricas e Logs
zh_hans: 指标和日志仪表板凭据
zh_hant: 計量和記錄儀表板認證

# arc.data.controller.metrics.and.logs.dashboard.credentials.username
source: Username
de: Benutzername
pt_br: Nome de usuário
zh_hans: 用户名
zh_hant: 使用者名稱

# arc.data.controller.metrics.and.logs.dashboard.credentials.username.description
source: Enter the username that will be used for the metrics and logs dashboards.
de: Geben Sie den Benutzernamen ein, der für die Dashboards für Metriken und Protokolle verwendet wird.
pt_br: Insira o nome de usuário que será usado nos painéis de métricas e logs.
zh_hans: 输入将用于指标和日志仪表板的用户名。
zh_hant: 輸入將用於計量和記錄儀表板的使用者名稱。

# arc.data.controller.name
source: Data controller name
de: Name des Datencontrollers
es: Nombre del controlador de datos
fr: Nom du contrôleur de données
it: Nome del controller dei dati
ja: データ コントローラー名
ko: 데이터 컨트롤러 이름
pt_br: Nome do controlador de dados
ru: Имя контроллера данных
zh_hans: 数据控制器名称
zh_hant: 資料控制器名稱

# arc.data.controller.name.validation.description
source: Name must consist of lower case alphanumeric characters, '-' or '.', start/end with an alphanumeric character and be 253 characters or less in length.
de: Der Name muss aus alphanumerischen Kleinbuchstaben, "-" oder "." bestehen, mit einem alphanumerischen Zeichen beginnen/enden und maximal 253 Zeichen lang sein.
es: El nombre debe constar de caracteres alfanuméricos en minúsculas, "-" o ".", empezar y terminar con un carácter alfanumérico y tener 253 caracteres de longitud o menos.
fr: Le noms doit être constitué de caractères alphanumériques minuscules, « - » ou « . », commencer/se terminer par un caractère alphanumérique et comporter 253 caractères au maximum.
it: Il nome deve essere composto da caratteri alfanumerici minuscoli, '-' o '.', iniziare/terminare con un carattere alfanumerico e avere una lunghezza massima di 253 caratteri.
ja: 名前は、小文字の英数字、'-'、または '.' で構成され、先頭と末尾には英数字を使用し、253 文字以下にする必要があります。
ko: 이름은 소문자 영숫자 문자, '-' 또는 '.'로 구성되어야 하며, 시작/끝은 영숫자 문자로 구성되어야 하며 길이는 253자 이하여야 합니다.
pt_br: O nome deve consistir em caracteres alfanuméricos minúsculos, '-' ou '.', Iniciar/terminar com um caractere alfanumérico e ter 253 caracteres ou menos.
ru: Имя должно состоять из строчных букв и цифр или дефисов "-", начинаться с буквы или цифры, заканчиваться буквой или цифрой и содержать не более 253 символов.
zh_hans: 名称必须包含小写字母数字字符、"-" 或 "。"，以字母数字字符开头/结尾，并且长度不能超过 253 个字符。
zh_hant: 名稱必須包含小寫英數字元、'-' 或 '.'、以英數字元開頭/結尾，且長度不得超過 253 個字元。

# arc.data.controller.namespace
source: Data controller namespace
de: Namespace des Datencontrollers
es: Espacio de nombres del controlador de datos
fr: Espace de noms du contrôleur de données
it: Spazio dei nomi del controller dei dati
ja: データ コントローラー名前空間
ko: 데이터 컨트롤러 네임스페이스
pt_br: Namespace do controlador de dados
ru: Пространство имен контроллера данных
zh_hans: 数据控制器命名空间
zh_hant: 資料控制器命名空間

# arc.data.controller.namespace.description
source: Data controller namespace. Indirect mode only.
de: Namespace des Datencontrollers. Nur indirekter Modus.
pt_br: Namespace do controlador de dados. Somente modo indireto.
zh_hans: 数据控制器命名空间。仅限间接模式。
zh_hant: 資料控制器命名空間。僅間接模式。

# arc.data.controller.namespace.validation.description
source: Namespace must consist of lower case alphanumeric characters or '-', start/end with an alphanumeric character, and be 63 characters or fewer in length.
de: Der Namespace muss aus alphanumerischen Kleinbuchstaben oder "-" bestehen, mit einem alphanumerischen Zeichen beginnen/enden und maximal 63 Zeichen lang sein.
es: El espacio de nombres debe incluir caracteres alfanuméricos en minúsculas o "-", empezar y terminar con una letra, y tener 63 caracteres de longitud o menos.
fr: L’espace de noms doit être constitué de caractères alphanumériques minuscules ou « - », commencer/se terminer par un caractère alphanumérique et comporter 63 caractères au maximum.
it: Lo spazio dei nomi deve essere composto da caratteri alfanumerici minuscoli o "-", iniziare/terminare con un carattere alfanumerico e avere una lunghezza massima di 63 caratteri.
ja: 名前空間は、小文字の英数字または '-' で構成され、先頭と末尾には英数字を使用し、63 文字以下にする必要があります。
ko: 네임스페이스는 소문자 영숫자 문자 또는 '-'로 구성되어야 하며, 시작/끝은 영숫자 문자로 구성되어야 하며 길이는 63자 이하여야 합니다.
pt_br: O namespace deve consistir em caracteres alfanuméricos minúsculos ou '-', iniciar/terminar com um caractere alfanumérico e ter 63 caracteres ou menos de comprimento.
ru: Пространство имен должно состоять из строчных букв и цифр или дефисов "-", начинаться с буквы или цифры, заканчиваться буквой или цифрой и содержать не более 63 символов.
zh_hans: 命名空间必须包含小写字母数字字符或 “-”，以字母数字字符开头/结尾，并且长度不能超过 63 个字符。
zh_hant: 命名空間必須包含小寫英數字元或 '-'、以英數字元開頭/結尾，且長度不得超過 63 個字元。

# arc.data.controller.new.wizard.title
source: Create Azure Arc data controller
de: Azure Arc-Datencontroller erstellen
es: Crear el controlador de datos de Azure Arc
fr: Créer le contrôleur de données Azure Arc
it: Creare controller dei dati di Azure Arc
ja: Azure Arc データ コントローラーの作成
ko: Azure Arc 데이터 컨트롤러 만들기
pt_br: Criar controlador de dados do Azure Arc
ru: Создать контроллер данных Azure Arc
zh_hans: 创建 Azure Arc 数据控制器
zh_hant: 建立 Azure Arc 資料控制器
