Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.sql.volume.size.datalogs.description
source: The size of the storage volume to be used for database logs in gibibytes.
de: Die Größe des Speichervolumes, das für Datenbankprotokolle in GiB verwendet werden soll.
es: Tamaño del volumen de almacenamiento que se va a usar para los registros de base de datos en gigabytes.
fr: Taille du volume de stockage à utiliser pour les journaux de base de données en gibioctets.
it: La dimensione del volume di archiviazione da utilizzare per i log di database in gibibyte.
ja: データベース ログに使用するストレージ ボリュームのサイズ (GB)。
ko: 데이터베이스 로그에 사용할 저장소 볼륨의 크기(기비바이트)입니다.
pt_br: O tamanho do volume de armazenamento a ser usado nos logs de banco de dados em gibibytes.
ru: Размер тома хранилища для журналов базы данных (гибибайт).
zh_hans: 用于数据库日志的存储卷大小(GB)。
zh_hant: 要用於資料庫記錄之儲存區的大小 (以 GI 為單位)。

# arc.sql.volume.size.datalogs.label
source: Volume Size in Gi (Database logs)
de: Volumegröße in Gi (Datenbankprotokolle)
es: Tamaño del volumen en Gi (registros de base de datos)
fr: Taille du volume en Gio (journaux de base de données)
it: Dimensioni volume in Gi (log di database)
ja: ボリュームのサイズ (Gi) (データベース ログ)
ko: 볼륨 크기(Gi)(데이터베이스 로그)
pt_br: Tamanho do Volume em Gi (Logs do banco de dados)
ru: Размер тома в ГиБ (журналы базы данных)
zh_hans: 以 Gi 为单位的卷(数据库日志)
zh_hant: 以 Gi 表示的磁碟區大小 (資料庫記錄)

# arc.sql.volume.size.logs.description
source: The size of the storage volume to be used for logs in gibibytes.
de: Die Größe des Speichervolumes, das für Protokolle in GiB verwendet werden soll.
es: Tamaño del volumen de almacenamiento que se va a usar para los registros en gigabytes.
fr: Taille du volume de stockage à utiliser pour les journaux en gibioctets.
it: La dimensione del volume di archiviazione da utilizzare per i log in gibibyte.
ja: ログに使用するストレージ ボリュームのサイズ (GB)。
ko: 로그에 사용할 저장소 볼륨의 크기(기비바이트)입니다.
pt_br: O tamanho do volume de armazenamento a ser usado nos logs em gibibytes.
ru: Размер тома хранилища для журналов (гибибайт).
zh_hans: 用于日志的存储卷大小(GB)。
zh_hant: 要用於記錄之儲存磁碟區的大小 (GB)。

# arc.sql.volume.size.logs.label
source: Volume Size in Gi (Logs)
de: Volumegröße in Gi (Protokolle)
es: Tamaño del volumen en Gi (Registros)
fr: Taille du volume en Gio (journaux)
it: Dimensioni del volume di Gi (log)
ja: ボリュームのサイズ (Gi) (ログ)。
ko: Gi 단위의 볼류 크기(로그)
pt_br: Tamanho do volume em Gi (Logs).
ru: Размер тома в ГиБ (журналы)
zh_hans: 以 Gi 为单位的卷大小(日志)
zh_hant: 以 Gi 表示的磁碟區大小 (記錄)

# arc.sql.wizard.page1.title
source: Provide Azure SQL managed instance parameters
de: Azure SQL Managed Instance-Parameter bereitstellen
es: Proporción de parámetros de Azure SQL Managed Instance
fr: Fournir les paramètres d’instance managée Azure SQL
it: Specificare i parametri dell'istanza gestita di SQL di Azure
ja: Azure SQL Managed Instance のパラメーターを指定します
ko: Azure SQL 관리되는 인스턴스 매개 변수 제공
pt_br: Fornece parâmetros de instância gerenciada do SQL do Azure
ru: Укажите параметры Управляемого экземпляра Azure SQL
zh_hans: 提供 Azure SQL 托管实例参数
zh_hant: 提供 Azure SQL 受控執行個體參數

# arc.sql.wizard.title
source: Deploy Azure SQL managed instance - Azure Arc
de: Azure SQL Managed Instance bereitstellen – Azure Arc
pt_br: Implantar instância gerenciada do SQL do Azure - Azure Arc
zh_hans: 部署 Azure SQL 托管实例 - Azure Arc
zh_hant: 部署 Azure SQL 受控執行個體 - Azure Arc

# arc.storage-class.backups.label
source: Storage Class (Backups)
de: Speicherklasse (Sicherungen)
es: Clase de almacenamiento (copias de seguridad)
fr: Classe de stockage (sauvegardes)
it: Classe di archiviazione (backup)
ja: ストレージ クラス (バックアップ)
ko: 스토리지 클래스(백업)
pt_br: Classe de Armazenamento (Backups)
ru: Класс хранения (резервные копии)
zh_hans: 存储类(备份)
zh_hant: 儲存類別 (備份)

# arc.storage-class.backups.warning.link
source: RWX capable
de: RWX-fähig
pt_br: Compatível com RWX
zh_hans: 支持 RWX
zh_hant: 具備 RWX 功能

# arc.storage-class.data.label
source: Storage Class (Data)
de: Speicherklasse (Daten)
es: Clase de almacenamiento (datos)
fr: Classe de stockage (Données)
it: Classe di archiviazione (dati)
ja: ストレージ クラス (データ)
ko: 스토리지 클래스(데이터)
pt_br: Classe de Armazenamento (Dados)
ru: Класс хранения (данные)
zh_hans: 存储类(数据)
zh_hant: 儲存類別 (資料)

# arc.storage-class.datalogs.label
source: Storage Class (Database logs)
de: Storage-Klasse (Datenbankprotokolle)
es: Clase de almacenamiento (registros de base de datos)
fr: Classe de stockage (journaux de base de données)
it: Classe di archiviazione (log di database)
ja: ストレージ クラス (データベース ログ)
ko: 저장소 클래스(데이터베이스 로그)
pt_br: Classe de Armazenamento (Logs do banco de dados)
ru: Класс хранения (журналы базы данных)
zh_hans: 存储类(数据库日志)
zh_hant: 儲存類別 (資料庫記錄)

# arc.storage-class.dc.label
source: Storage Class
de: Speicherklasse
es: Clase de almacenamiento
fr: Classe de stockage
it: Classe di archiviazione
ja: ストレージ クラス
ko: 스토리지 클래스
pt_br: Classe de Armazenamento
ru: Класс хранения
zh_hans: 存储类
zh_hant: 儲存類別

# arc.storage-class.logs.label
source: Storage Class (Logs)
de: Speicherklasse (Protokolle)
es: Clase de almacenamiento (registros)
fr: Classe de stockage (journaux)
it: Classe di archiviazione (log)
ja: ストレージ クラス (ログ)
ko: 스토리지 클래스(로그)
pt_br: Classe de Armazenamento (Registros)
ru: Класс хранения (журналы)
zh_hans: 存储类(日志)
zh_hant: 儲存類別 (記錄)

# arc.view.title
source: Azure Arc Controllers
de: Azure Arc-Controller
es: Controladores de Azure Arc
fr: Contrôleurs Azure Arc
it: Controller Azure Arc
ko: Azure Arc 컨트롤러
pt_br: Controladores de Azure Arc
ru: Контроллеры Azure Arc
zh_hans: Azure Arc 控制器
zh_hant: Azure Arc 控制器

# arc.view.welcome.connect
source: No Azure Arc controllers registered. [Learn More](https://azure.microsoft.com/services/azure-arc/) [Connect Controller](command:arc.connectToController)
de: Es sind keine Azure Arc-Controller registriert. [Weitere Informationen](https://azure.microsoft.com/services/azure-arc/) [Controller verbinden](command:arc.connectToController)
es: No hay ningún controlador de Azure Arc registrado. [Más información](https://azure.microsoft.com/services/azure-arc/) [Conectar controlador](command:arc.connectToController)
fr: Aucun contrôleur Azure Arc inscrit. [En savoir plus] (https://azure.microsoft.com/services/azure-arc/) [Connecter un contrôleur] (command:arc.connectToController)
it: Nessun controller Azure Arc registrato. [Altre informazioni](https://azure.microsoft.com/services/azure-arc/) [Collegare controller](command:arc.connectToController)
ja: Azure Arc コントローラーが登録されていません。[詳細情報] (https://azure.microsoft.com/services/azure-arc/) [接続コントローラー] (command:arc.connect ToController)
ko: 등록된 Azure Arc 컨트롤러가 없습니다.[자세한 정보] (https://azure.microsoft.com/services/azure-arc/) [컨트롤러 연결](command:arc.connectToController)
pt_br: Nenhum controlador Azure Arc registrado. [Saiba mais](https://azure.microsoft.com/services/azure-arc/) [Connect Controller](command:arc.connectToController)
ru: Контроллеры Azure Arc не зарегистрированы. [Подробнее](https://azure.microsoft.com/services/azure-arc/) [Подключение контроллера](command:arc.connectToController)
zh_hant: 未註冊任何 Azure Arc 控制器。[深入了解](https://azure.microsoft.com/services/azure-arc/) [連線控制器](command:arc.connectToController)

# arc.view.welcome.loading
source: Loading controllers...
de: Controller werden geladen...
es: Se están cargando los controladores...
fr: Chargement des contrôleurs...
it: Caricamento controller...
ja: コントローラーを読み込んでいます...
ko: 컨트롤러를 로드하는 중...
pt_br: Carregando controladores...
ru: Загрузка контроллеров…
zh_hans: 正在加载控制器...
zh_hant: 正在載入控制器...

# command.connectToController.title
source: Connect to Existing Azure Arc Controller
de: Verbindung mit vorhandenem Azure Arc-Controller herstellen
es: Conexión a un controlador existente de Azure Arc
fr: Se connecter à un contrôleur Azure Arc existant
it: Connettersi al controller esistente di Azure Arc
ja: 既存の Azure Arc Controller に接続する
ko: 기존 Azure Arc 컨트롤러에 연결
pt_br: Conectar-se ao Controlador Azure Arc Existente
ru: Подключение к существующему контроллеру Azure Arc
zh_hans: 连接到现有 Azure Arc 控制器
zh_hant: 連線到現有的 Azure Arc 控制器

# command.createController.title
source: Create New Azure Arc Controller
de: Neuen Azure Arc-Controller erstellen
es: Creación de un controlador de Azure Arc
fr: Créer un contrôleur Azure Arc
it: Creare nuovo controller Azure Arc
ja: 新しい Azure Arc コントローラーの作成
ko: 새 Azure Arc 컨트롤러 만들기
pt_br: Criar novo controlador do Azure Arc
ru: Создание нового контроллера Azure Arc
zh_hans: 新建 Azure Arc 控制器
zh_hant: 建立新的 Azure Arc 控制器

# command.editConnection.title
source: Edit Connection
de: Verbindung bearbeiten
es: Edición de la conexión
fr: Modifier la connexion
it: Modificare connessione
ja: 接続の編集
ko: 연결 편집
pt_br: Editar Conexão
ru: Изменение подключения
zh_hans: 编辑连接
zh_hant: 編輯連線

# command.estimateCostSqlMiaa.title
source: Estimate Cost of SQL Managed Instance - Azure Arc
de: Geschätzte Kosten für SQL Managed Instance – Azure Arc
ko: SQL Managed Instance 예상 비용 - Azure Arc
pt_br: Estimar o custo da Instância Gerenciada de SQL - Azure Arc
zh_hans: SQL 托管实例的估计成本 - Azure Arc
zh_hant: SQL 受控執行個體預估成本 - Azure Arc

# command.refresh.title
source: Refresh
de: Aktualisieren
es: Actualización
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновление
zh_hans: 刷新
zh_hant: 重新整理

# command.removeController.title
source: Remove Controller
de: Controller entfernen
es: Eliminación del controlador
fr: Supprimer le contrôleur
it: Rimuovere controller
ja: コントローラーの削除
ko: 컨트롤러 제거
pt_br: Remover Controlador
ru: Удаление контроллера
zh_hans: 删除控制器
zh_hant: 移除控制器

# cores.limit.greater.than.or.equal.to.requested.cores
source: Cores limit must be greater than or equal to requested cores
de: Der Kerngrenzwert muss größer als oder gleich den angeforderten Kernen sein
es: El límite de núcleos debe ser mayor o igual que la cantidad de núcleos solicitados.
fr: La limite de cœurs doit être supérieure ou égale aux cœurs demandés
it: Il limite dei core deve essere maggiore o uguale ai core richiesti
ja: コアの上限は要求されたコア以上でなければなりません
ko: 코어 제한은 요청된 코어보다 크거나 같아야 합니다.
pt_br: O limite de núcleos deve ser maior ou igual aos núcleos solicitados
ru: Предельное число ядер должно быть не менее запрошенного
zh_hans: 内核限制必须大于或等于请求内核
zh_hant: 核心數限制必須大於或等於要求的核心數

# deploy.done.action
source: Deploy
de: Bereitstellen
es: Implementar
fr: Déployer
it: Distribuisci
ja: デプロイ
ko: 배포
pt_br: Implantar
ru: Развернуть
zh_hans: 部署
zh_hant: 部署

# deploy.script.action
source: Script to notebook
de: Skript in Notebook schreiben
es: De script a cuaderno
fr: Exécuter un script sur un notebook
it: Genera script nel notebook
ja: ノートブックへのスクリプト
ko: Notebook에 스크립트
pt_br: Script para notebook
ru: Сохранить скрипт в записную книжку
zh_hans: 脚本到笔记本
zh_hant: 編寫指令碼到筆記本

# memory.limit.greater.than.or.equal.to.requested.memory
source: Memory limit must be greater than or equal to requested memory
de: Das Speicherlimit muss größer oder gleich dem angeforderten Speicher sein
es: El límite de memoria debe ser mayor o igual que la cantidad de memoria solicitada.
fr: La limite de mémoire doit être supérieure ou égale à la mémoire demandée
it: Il limite di memoria deve essere maggiore o uguale alla memoria richiesta
ja: メモリ制限は要求されたメモリ以上である必要があります
ko: 메모리 제한은 요청된 메모리보다 크거나 같아야 합니다.
pt_br: O limite de memória deve ser maior ou igual à memória solicitada
ru: Предельный объем памяти должен быть не менее запрошенного
zh_hans: 内存限制必须大于或等于请求内存
zh_hant: 記憶體限制必須大於或等於要求的記憶體

# microsoft.agreement.privacy.statement
source: Microsoft Privacy Statement
de: Microsoft-Datenschutzbestimmungen
es: Declaración de privacidad de Microsoft
fr: Déclaration de confidentialité Microsoft
it: Informativa sulla privacy di Microsoft
ja: Microsoft プライバシー ステートメント
ko: Microsoft 개인정보처리방침
pt_br: Declaração de Privacidade da Microsoft
ru: Заявление о конфиденциальности корпорации Майкрософт
zh_hans: Microsoft 隐私声明
zh_hant: Microsoft 隱私權聲明

# requested.cores.less.than.or.equal.to.cores.limit
source: Requested cores must be less than or equal to cores limit
de: Die angeforderten Kerne müssen kleiner oder gleich dem Kerngrenzwert sein
es: La cantidad de núcleos solicitados debe ser menor o igual que el límite de núcleos.
fr: Les cœurs demandés doivent être inférieurs ou égaux à la limite de cœurs
it: I core richiesti devono essere minori o uguali al limite di core
ja: 要求されたコアは、コアの上限以下である必要があります
ko: 요청된 코어는 코어 제한보다 작거나 같아야 합니다.
pt_br: Os núcleos solicitados devem ser menores ou iguais ao limite dos núcleos
ru: Число запрошенных ядер не должно превышать предельное
zh_hans: 请求的内核数必须小于或等于内核限制
zh_hant: 要求的核心數必須小於或等於核心數限制

# requested.memory.less.than.or.equal.to.memory.limit
source: Requested memory must be less than or equal to memory limit
de: Der angeforderte Speicher muss kleiner oder gleich dem Speicherlimit sein
es: La cantidad de memoria solicitada debe ser menor o igual que el límite de memoria.
fr: La mémoire demandée doit être inférieure ou égale à la limite de la mémoire
it: La memoria richiesta deve essere minore o uguale al limite di memoria
ja: 要求されたメモリはメモリ制限以下でなければなりません
ko: 요청한 메모리는 메모리 제한보다 작거나 같아야 합니다.
pt_br: A memória solicitada deve ser menor ou igual ao limite de memória
ru: Объем запрошенной памяти не должен превышать предельный
zh_hans: 请求内存必须小于或等于内存限制
zh_hant: 要求的記憶體必須小於或等於記憶體限制

# resource.type.arc.postgres.description
source: Deploy PostgreSQL Hyperscale server groups into an Azure Arc environment
de: PostgreSQL Hyperscale-Servergruppen in einer Azure Arc-Umgebung bereitstellen
es: Permite implementar grupos de servidores de hiperescala de PostgreSQL en un entorno de Azure Arc.
fr: Déployer les groupes de serveurs PostgreSQL Hyperscale dans un environnement Azure Arc
it: Distribuire gruppi di server PostgreSQL Hyperscale in un ambiente Azure Arc
ja: Azure Arc 環境に PostgreSQL Hyperscale サーバー グループを展開する
ko: Azure Arc 환경에 PostgreSQL 하이퍼스케일 서버 그룹 배포
pt_br: Implantar grupos de servidores de Hiperescala PostgreSQL em um ambiente Azure Arc
ru: Развертывание групп серверов гипермасштабирования PostgreSQL в среде Azure Arc
zh_hans: 将 PostgreSQL 超大规模服务器组部署到 Azure Arc 环境
zh_hant: 將 PostgreSQL 超大規模資料庫伺服器群組部署到 Azure Arc 環境

# resource.type.arc.postgres.display.name
source: PostgreSQL Hyperscale server groups - Azure Arc
de: PostgreSQL Hyperscale-Servergruppen – Azure Arc
pt_br: Grupos de servidores de Hiperescala do PostgreSQL - Azure Arc
zh_hans: PostgreSQL 超大规模服务器组 - Azure Arc
zh_hant: PostgreSQL 超大規模資料庫伺服器群組 - Azure Arc

# resource.type.arc.sql.description
source: Managed SQL Instance service for app developers in a customer-managed environment
de: Verwalteter SQL-Instanzdienst für App-Entwickler in einer kundenseitig verwalteten Umgebung
es: Servicio de instancia administrada de SQL para desarrolladores de aplicaciones en un entorno administrado por el cliente
fr: Service managé d'instance SQL pour les développeurs d'applications dans un environnement géré par le client
it: Servizio Istanza gestita di SQL per sviluppatori di app in un ambiente gestito dal cliente
ja: ユーザーが管理する環境内のアプリ開発者向けのマネージド SQL インスタンス サービス
ko: 고객 관리형 환경의 앱 개발자를 위한 관리형 SQL 인스턴스 서비스
pt_br: Serviço de Instância SQL gerenciado para desenvolvedores de aplicativos em um ambiente gerenciado pelo cliente
ru: Управляемая служба экземпляра SQL для разработчиков приложений в управляемой клиентом среде
zh_hans: 客户管理的环境中面向应用开发人员的托管 SQL 实例服务
zh_hant: 適用於客戶自控環境中應用程式開發人員的受控 SQL 執行個體服務

# resource.type.arc.sql.display.name
source: Azure SQL managed instance - Azure Arc
pt_br: Instância Gerenciada de SQL do Azure – Azure Arc
zh_hans: Azure SQL 托管实例 - Azure Arc
zh_hant: Azure SQL 受控執行個體 - Azure Arc

# resource.type.azure.arc.description
source: Creates an Azure Arc data controller. Ensure that you have run az login before starting this wizard.
de: Erstellt einen Azure Arc-Datencontroller. Stellen Sie sicher, dass Sie „az login“ ausgeführt haben, bevor Sie diesen Assistenten starten.
pt_br: Cria um controlador de dados do Azure Arc. Certifique-se de executado o logon no az antes de iniciar este assistente.
zh_hans: 创建 Azure Arc 数据控制器。在启动此向导前，请确保已运行 az 登录。
zh_hant: 建立 Azure Arc 資料控制器。啟動此精靈之前，請先確認您已執行 AZ 登入。

# resource.type.azure.arc.display.name
source: Azure Arc data controller
de: Azure Arc-Datencontroller
pt_br: Controlador de dados do Azure Arc
zh_hans: Azure Arc 数据控制器
zh_hant: Azure Arc 資料控制器

# should.be.integer
source: Value must be an integer
de: Der Wert muss eine ganze Zahl sein.
es: El valor debe ser un entero
fr: La valeur doit être un entier
it: Il valore deve essere un intero
ja: 値は整数でなければなりません
ko: 값은 정수여야 함
pt_br: O valor deve ser um inteiro
ru: Значение должно быть целым числом
zh_hans: 值必须为整数
zh_hant: 值必須是整數

# worker.node.count.should.not.be.one
source: Value of 1 is not supported.
de: Der Wert 1 wird nicht unterstützt.
es: No se admite el valor 1.
fr: La valeur de 1 n'est pas prise en charge.
it: Il valore 1 non è supportato.
ja: 1 の値はサポートされていません。
ko: 값 1은 지원되지 않습니다.
pt_br: O valor 1 não é compatível.
ru: Значение 1 не поддерживается.
zh_hans: 不支持值为 1。
zh_hant: 不支援 1 的值。

# arc.businessCriticalLabel
source: BusinessCritical
zh_hans: 业务关键

# arc.generalPurposeLabel
source: GeneralPurpose
zh_hans: 常规用途

# arc.connecToServer
source: Connect to Server
es: Conectar al servidor
fr: Se connecter au serveur
it: Connetti al server
ja: サーバーに接続
ko: 서버에 연결
ru: Подключиться к серверу

# arc.controllerDashboard
source: Azure Arc Data Controller Dashboard (Preview) - {0}
es: Panel del controlador de datos de Azure Arc (versión preliminar): {0}
fr: Tableau de bord du contrôleur de données Azure Arc (préversion) - {0}
it: Dashboard del controller dei dati di Azure Arc (anteprima)-{0}
ja: Azure Arc データ コントラクター ダッシュボード (プレビュー) -{0}
ko: Azure Arc 데이터 컨트롤러 대시보드(미리 보기) - {0}
ru: Панель мониторинга контроллера данных Azure Arc (предварительная версия) — {0}

# arc.miaaDashboard
source: SQL managed instance - Azure Arc Dashboard (Preview) - {0}
es: Instancia administrada de SQL: panel de Azure Arc (versión preliminar): {0}
fr: SQL Managed Instance : tableau de bord Azure Arc (préversion) : {0}
it: Istanza gestita di SQL - Dashboard Azure Arc (anteprima) - {0}
ja: SQL Managed Instance - Azure Arc ダッシュボード (プレビュー) - {0}
ko: Azure SQL Managed Instance - Azure Arc(미리 보기) - {0}
ru: Управляемый экземпляр SQL — панель мониторинга Azure Arc (предварительная версия) — {0}

# arc.postgresDashboard
source: PostgreSQL Hyperscale - Azure Arc Dashboard (Preview) - {0}
es: Hiperescala de PostgreSQL: panel de Azure Arc (versión preliminar) - {0}
fr: PostgreSQL Hyperscale : tableau de bord Azure Arc (préversion) - {0}
it: PostgreSQL Hyperscale - Dashboard Azure Arc (anteprima) - {0}
ja: PostgreSQL Hyperscale - Azure Arc ダッシュボード (プレビュー) - {0}
ko: PostgreSQL 하이퍼스케일 - Azure Arc 대시보드(미리 보기) - {0}
ru: Гипермасштабирование PostgreSQL — панель мониторинга Azure Arc (предварительная версия) — {0}

# arc.agreement.sql.help.text
source: Azure Arc enabled Managed Instance provides SQL Server access and feature compatibility that can be deployed on the infrastructure of your choice. {0}
es: La instancia administrada habilitada para Azure Arc proporciona a SQL Server acceso y compatibilidad de características que se pueden implementar en la infraestructura de su elección. {0}
fr: Azure Arc activé Managed Instance fournit SQL Server l’accès et la compatibilité des fonctionnalités qui peuvent être déployées sur l’infrastructure de votre choix. {0}
it: L'Istanza gestita con abilitazione di Azure Arc fornisce l'accesso a SQL Server e la compatibilità delle funzionalità che possono essere distribuite nell'infrastruttura desiderata. {0}
ja: Azure Arc 対応 Managed Instance により、選択したインフラストラクチャにデプロイ可能な SQL Server のアクセスと機能の互換性が得られます。{0}
ko: Azure Arc 사용 Managed Instance는 원하는 인프라에 배포할 수 있는 SQL Server 액세스 및 기능 호환성을 제공합니다. {0}
ru: Управляемый экземпляр с поддержкой Azure Arc предоставляет доступ к SQL Server и совместимые функции, которые можно развернуть в любой удобной инфраструктуре. {0}

# arc.data.controller.admin.account.confirm.password
source: Confirm password
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Confermare password
ja: パスワードの確認
ko: 암호 확인
ru: Подтвердить пароль

# arc.data.controller.admin.account.name
source: Data controller login
es: Inicio de sesión en el controlador de datos
fr: Connexion au contrôleur de données
it: Account di accesso del controller dei dati
ja: データ コントローラーのログイン
ko: 데이터 컨트롤러 로그인
ru: Имя для входа контроллера данных

# arc.data.controller.admin.account.password
source: Password
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
ru: Пароль

# arc.data.controller.admin.account.title
source: Administrator account
es: Cuenta de administrador
fr: Compte Administrateur
it: Account amministratore
ja: 管理者アカウント
ko: 관리자 계정
ru: Учетная запись администратора

# arc.data.controller.agreement
source: I accept {0} and {1}.
es: Acepto {0} y {1}.
fr: J'accepte {0} et {1}.
it: Accetto {0} e {1}.
ja: {0} および {1} に同意します。
ko: {0} 및 {1}에 동의합니다.
ru: Я принимаю {0} и {1}.

# arc.data.controller.cluster.config.profile
source: Config profile
es: Perfil de configuración
fr: Profil de configuration
it: Profilo di configurazione
ja: 構成プロファイル
ko: 구성 프로필
ru: Профиль конфигурации

# arc.data.controller.details.description
source: For indirect mode, provide a namespace, name and storage class for your Azure Arc data controller. This name will be used to identify your Arc instance for remote management and monitoring. For direct mode you do not need to provide a namespace, but please provide the custom location name.
ko: 간접 모드의 경우 Azure Arc 데이터 컨트롤러의 네임스페이스, 이름, 스토리지 클래스를 제공하세요. 원격 관리와 모니터링을 위한 Arc 인스턴스 식별에 이 이름을 사용합니다. 직접 모드의 경우 네임스페이스는 제공할 필요가 없지만 사용자 지정 위치 이름을 제공해 주세요.

# arc.data.controller.namespace.description
source: Indirect mode only.
ko: 간접 모드 전용입니다.

# arc.postgres.wizard.title
source: Deploy an Azure Arc-enabled PostgreSQL Hyperscale server group (Preview)
es: Implementar un grupo de servidores de hiperescala de PostgreSQL habilitado para Azure Arc (versión preliminar)
fr: Déployer un groupe de serveurs PostgreSQL Hyperscale compatibles avec Azure Arc (préversion)
it: Implementare un gruppo di server di PostgreSQL Hyperscale abilitato per Azure Arc (anteprima)
ja: Azure Arc 対応 PostgreSQL Hyperscale サーバー グループの展開 (プレビュー)
ko: Azure Arc 지원 PostgreSQL 하이퍼스케일 서버 그룹 배포(미리 보기)
ru: Развернуть группу серверов гипермасштабирования PostgreSQL с поддержкой Azure Arc

# arc.sql.cost.summary.service.tier.learn.more.description
source: Select from the latest vCore service tiers available for SQL Managed Instance - Azure Arc including General Purpose and Business Critical. {0}
ko: 범용 및 중요 비즈니스용을 포함하여 SQL Managed Instance - Azure Arc에 사용할 수 있는 최신 vCore 서비스 계층에서 선택합니다. {0}

# arc.sql.high.availability.description
source: Enable additional replicas for high availabilty. The compute and storage configuration selected below will be applied to all replicas. Choose from: General Purpose (Up to 24 vCores and 128 Gi of RAM, standard high availability) or [PREVIEW] Business Critical (Unlimited vCores and RAM, advanced high availability).
ko: 고가용성을 위해 추가 복제본을 사용하도록 설정합니다. 아래에서 선택한 컴퓨팅 및 저장소 구성은 모든 복제본에 적용됩니다. 범용(최대 24개의 vCore 및 128Gi의 RAM, 표준 고가용성) 또는 [미리 보기] 중요 비즈니스용(무제한 vCore 및 RAM, 고급 고가용성) 중에서 선택하세요.

# arc.sql.replicas
source: Replicas
ko: 복제본
