Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.upgradingIndirectMiaa
source: Upgrading SQL MIAA '{0}' with command 'az sql mi-arc upgrade --name {0} --k8s-namespace {1} --use-k8s'
de: Für SQL MIAA „{0}“ wird mit dem Befehl az sql mi-arc upgrade --name {0} --k8s-namespace {1} --use-k8s„ ein Upgrade durchgeführt
pt_br: Atualização do SQL MIAA '{0}' com o comando 'az sql mi-arc upgrade --name {0} --k8s-namespace {1} --use-k8s'
zh_hans: 使用命令 "az sql mi-arc upgrade --name {0} --k8s-namespace {1} --use-k8s" 升级 SQL MIAA "{0}"
zh_hant: 使用命令 'az sql mi-arc upgrade --name {0} --k8s-namespace {1} --use-k8s' 升级 SQL MIAA '{0}'

# arc.upgradingMiaa
source: SQL managed instance is being upgraded. You can check the status of the upgrade by running the following command: 'kubectl get sqlmi -A'
de: Die SQL Managed Instance wird upgegradet. Sie können den Status des Upgrades überprüfen, indem Sie den folgenden Befehl ausführen: „kubectl get sqlmi -A“
pt_br: A instância gerenciada do SQL está sendo atualizada. Você pode verificar o status da atualização executando o seguinte comando: 'kubectl get sqlmi -A'
zh_hans: 正在升级 SQL 托管实例。可以通过运行以下命令来检查升级状态: 'kubectl get sqlmi -A'
zh_hant: 正在升級 SQL 受控執行個體。您可以執行下列命令來檢查升級的狀態: 'kubectl get sqlmi -A'

# arc.userCancelledError
source: User cancelled the dialog
de: Das Dialogfeld wurde vom Benutzer abgebrochen.
es: El usuario canceló el cuadro de diálogo
fr: L'utilisateur a annulé la boîte de dialogue.
it: La finestra di dialogo è stata chiusa dall'utente tramite il comando Annulla
ja: ユーザーがダイアログを取り消しました
ko: 사용자가 대화 상자를 취소했습니다.
pt_br: O usuário cancelou a caixa de diálogo
ru: Пользователь отменил это диалоговое окно
zh_hans: 用户取消了此对话框
zh_hant: 使用者已取消對話方塊

# arc.username
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# arc.vCores
source: vCores
de: Virtuelle Kerne
es: Núcleos virtuales
it: vCore
ja: 仮想コア
ko: vCore
ru: Виртуальные ядра
zh_hans: vCore
zh_hant: 虛擬核心

# arc.value
source: Value
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
ko: 값
pt_br: Valor
ru: Значение
zh_hans: 值
zh_hant: 值

# arc.version
source: Version
pt_br: Versão
zh_hans: 版本
zh_hant: 版本

# arc.versionLog
source: Learn more about each release here.
de: Erfahren Sie hier mehr über jede Version.
pt_br: Saiba mais sobre cada versão aqui.
zh_hans: 在此处详细了解每个版本。
zh_hant: 深入了解每項發行版本。

# arc.worker
source: Worker
es: Trabajador
fr: Collaborateur
it: Ruolo di lavoro
ja: ワーカー
ko: 작업자
pt_br: Trabalhador
ru: Рабочая роль
zh_hans: 工作器
zh_hant: 背景工作

# arc.workerCoresLimit
source: Worker Nodes CPU limit
de: CPU-Limit für Workerknoten
es: Límite de CPU de nodos de trabajo
fr: Limite du processeur des nœuds Worker
it: Limite CPU dei nodi di lavoro
ja: ワーカー ノードの CPU 制限
ko: 작업자 노드 CPU 제한
pt_br: Limite de CPU de Nós de Trabalho
ru: Ограничение ЦП для рабочих узлов
zh_hans: 工作节点 CPU 限制
zh_hant: 背景工作節點 CPU 限制

# arc.workerCoresRequest
source: Worker Nodes CPU request
de: CPU-Anforderung für Workerknoten
es: Solicitud de CPU de nodos de trabajo
fr: Demande du processeur des nœuds Worker
it: Richiesta CPU dei nodi di lavoro
ja: ワーカーノードの CPU 要求
ko: 작업자 노드 CPU 요청
pt_br: Solicitação de CPU de Nós de Trabalho
ru: Запрос ЦП рабочих узлов
zh_hans: 工作节点 CPU 请求
zh_hant: 背景工作節點 CPU 要求

# arc.workerMemoryLimit
source: Worker Nodes Memory limit (in GB)
de: Speicherlimit für Workerknoten (in GB)
es: Límite de memoria de nodos de trabajo (en GB)
fr: Limite de mémoire des nœuds Worker (en Go)
it: Limite di memoria dei nodi di lavoro (in GB)
ja: ワーカー ノードのメモリ制限 (GB)
ko: 작업자 노드 메모리 제한(GB)
pt_br: Limite de Memória de Nós de Trabalho (em GB)
ru: Ограничение на объем памяти для рабочих узлов (в ГБ)
zh_hans: 工作器节点内存限制(以 GB 为单位)
zh_hant: 背景工作節點記憶體限制 (GB)

# arc.workerMemoryRequest
source: Worker Nodes Memory request (in GB)
de: Arbeitsspeicheranforderung für Workerknoten (in GB)
es: Solicitud de memoria de nodos de trabajo (en GB)
fr: Demande de mémoire des nœuds Woker (en Go)
it: Richiesta di memoria dei nodi di lavoro (in GB)
ja: ワーカー ノードのメモリ要求 (GB)
ko: 작업자 노드 메모리 요청(GB)
pt_br: Solicitação de Memória de Nós de Trabalho (em GB)
ru: Запрос памяти рабочих узлов (в ГБ)
zh_hans: 工作器节点内存请求(以 GB 为单位)
zh_hant: 背景工作節點記憶體要求 (GB)

# arc.workerNodeCount
source: Worker node count
de: Anzahl von Workerknoten
es: Número de nodos de trabajo
fr: Nombre de nœuds worker
it: Numero di nodi del ruolo di lavoro
ja: ワーカー ノードの数
ko: 작업자 노드 수
pt_br: Contagem de nós de trabalho
ru: Число рабочих узлов
zh_hans: 工作器节点计数
zh_hant: 背景工作節點計數

# arc.workerNodeInformation
source: It is possible to scale in and out your server group by reducing or increasing the number of worker nodes. The value must be 0 or greater than 1.
de: Sie können Ihre Servergruppe ab- und aufskalieren, indem Sie die Anzahl von Workerknoten verringern oder erhöhen. Der Wert muss 0 oder größer als 1 sein.
es: Es posible escalar y cambiar el grupo de servidores reduciendo o aumentando el número de nodos de trabajo. El valor debe ser 0 o mayor que 1.
fr: Il est possible d’échelonner et de réduire votre groupe de serveurs en réduisant ou en augmentant le nombre de nœuds Worker. La valeur doit être supérieure ou égale à 1.
it: È possibile ridurre o aumentare il gruppo di server riducendo o aumentando il numero di nodi di lavoro. Il valore deve essere pari a 0 o maggiore di 1.
ja: ワーカー ノードの数を減らしたり増やしたりすることで、サーバー グループをスケールインまたはスケールアウトすることができます。値は 0 または 1 より大きい値でなければなりません。
ko: 작업자 노드 수를 줄이거나 늘려서 서버 그룹을 확장 및 축소할 수 있습니다. 값은 0이거나 1보다 커야 합니다.
pt_br: É possível expandir e reduzir o grupo de servidores reduzindo ou aumentando o número de nós de trabalho. O valor deve ser 0 ou maior que 1.
ru: Вы можете горизонтально увеличивать и уменьшать масштаб группы серверов, уменьшая или увеличивая число рабочих узлов. Значение должно быть равно 0 или превышать 1.
zh_hans: 可以通过减少或增加工作器节点数来横向缩减和放大服务器组。值必须为 0 或大于 1。
zh_hant: 您可以減少或增加背景工作節點數，以縮減或擴增您的伺服器群組。值必須是 0 或大於 1。

# arc.workerNodeParameters
source: Worker Node Parameters
de: Parameter für Workerknoten
es: Parámetros del nodo de trabajo
fr: Paramètres de nœud worker
it: Parametri del nodo di lavoro
ja: ワーカー ノードのパラメーター
ko: 작업자 노드 매개 변수
pt_br: Parâmetros do Nó de Trabalho
ru: Параметры рабочего узла
zh_hans: 工作器节点参数
zh_hant: 背景工作節點參數

# arc.workerNodes
source: Worker Nodes
de: Workerknoten
es: Nodos de trabajo
fr: Nœuds worker
it: Nodi di lavoro
ja: ワーカー ノード
ko: 작업자 노드
pt_br: Nós de trabalho
ru: Рабочие узлы
zh_hans: 工作器节点
zh_hant: 背景工作節點

# arc.workerNodesConfigurationInformation
source: You can configure the number of CPU cores and storage size that will apply to all worker nodes. Adjust the number of CPU cores and memory settings for your server group. To reset the requests and/or limits, pass in empty value.
de: Sie können die Anzahl der CPU-Kerne und die Speichergröße konfigurieren, die für alle Workerknoten gelten. Passen Sie die Anzahl der CPU-Kerne und Speichereinstellungen für Ihre Servergruppe an. Übergeben Sie einen leeren Wert, um die Anforderungen und/oder Grenzwerte zurückzusetzen.
es: Puede configurar el número de núcleos de CPU y el tamaño de almacenamiento que se aplicará a todos los nodos de trabajo. Ajuste el número de núcleos de CPU y la configuración de memoria para su grupo de servidores. Para restablecer las solicitudes o los límites, utilice un valor vacío.
fr: Vous pouvez configurer le nombre de cœurs d’UC et la taille de stockage qui s’appliqueront à tous les nœuds Worker. Ajustez le nombre de cœurs d’UC et de paramètres de mémoire pour votre groupe de serveurs. Pour réinitialiser les demandes et/ou les limites, transmettez une valeur vide.
it: È possibile configurare il numero di core CPU e le dimensioni dello spazio di archiviazione che verranno applicate a tutti i nodi del ruolo di lavoro. Modificare il numero di core CPU e le impostazioni di memoria per il gruppo di server. Per reimpostare le richieste e/o i limiti, inserire un valore vuoto.
ja: すべてのワーカー ノードに適用される CPU コア数とストレージ サイズを構成することができます。サーバー グループに CPU コア数とメモリ設定を調整します。要求や制限をリセットするには、空の値を渡します。
ko: 모든 작업자 노드에 적용되는 CPU 코어 수와 스토리지 크기를 구성할 수 있습니다. 서버 그룹의 CPU 코어 수 및 메모리 설정을 조정합니다. 요청 및/또는 제한을 초기화하려면 빈 값을 전달하세요.
pt_br: Você pode configurar o número de núcleos de CPU e o tamanho da memória que serão aplicados a todos os nós de trabalho. Ajuste o número de núcleos de CPU e configurações de memória para o grupo de servidores. Para redefinir as solicitações e/ou limites, transmita um valor vazio.
ru: Вы можете настроить количество ядер ЦП и размер хранилища, которые будут применяться ко всем рабочим узлам. Настройте количество ядер ЦП и параметры памяти для группы серверов. Чтобы сбросить запросы и/или ограничения, укажите пустое значение.
zh_hans: 可以配置将应用于所有工作器节点的 CPU 核心数和存储大小。调整服务器组的 CPU 核心数和内存设置。要重置请求和/或限制，请传入空值。
zh_hant: 您可以設定將套用至所有背景工作節點的 CPU 核心數和儲存體大小。調整您伺服器群組的 CPU 核心數和記憶體設定。若要重設要求和/或限制，請傳入空值。

# arc.workerNodesDescription
source: Expand your server group and scale your database by adding worker nodes.
de: Erweitern Sie Ihre Servergruppe und skalieren Sie Ihre Datenbank, indem Sie Workerknoten hinzufügen.
es: Agregue nodos de trabajo para expandir el grupo de servidores y escalar la base de datos.
fr: Développez votre groupe de serveurs et mettez à l’échelle votre base de données en ajoutant des nœuds Worker.
it: Espandere il gruppo di server e ridimensionare il database aggiungendo nodi di lavoro.
ja: サーバー グループを拡張し、ワーカー ノードを追加してデータベースを拡張します。
ko: 작업자 노드를 추가하여 서버 그룹을 확장하고 데이터베이스 크기를 조정합니다.
pt_br: Expanda o grupo de servidores e dimensione o banco de dados adicionando nós de trabalho.
ru: Разверните группу серверов и масштабируйте свою базу данных, добавив рабочие узлы.
zh_hans: 展开服务器组并通过添加工作器节点缩放数据库。
zh_hant: 新增背景工作節點，擴充您的伺服器群組並調整資料庫規模。

# arc.workerNodesParametersDescription
source: These server parameters of the Worker nodes can be set to custom (non-default) values. Search to find parameters.
de: Diese Serverparameter des Workerknotens können auf benutzerdefinierte (nicht standardmäßige) Werte festgelegt werden. Suchen Sie nach Parametern.
es: Estos parámetros de servidor de los nodos de trabajo se pueden establecer en valores personalizados (no predeterminados). Buscar parámetros.
fr: Ces paramètres de serveur des nœuds Worker peuvent être définis sur des valeurs personnalisées (non définies par défaut). Recherchez des paramètres.
it: Questi parametri del server dei nodi di lavoro possono essere impostati su valori personalizzati (non predefiniti). Cercare per trovare i parametri.
ja: ワーカー ノードのこれらのサーバー パラメーターは、カスタム (既定値以外) の値に設定することができます。検索してパラメーターを検出します。
ko: 작업자 노드의 이러한 서버 매개 변수는 사용자 지정(기본값이 아닌) 값으로 설정할 수 있습니다. 검색하여 매개 변수를 찾습니다.
pt_br: Esses parâmetros do servidor do nó de trabalho podem ser definidos como valores personalizados (não padrão). Pesquisar para localizar parâmetros.
ru: Для этих параметров сервера рабочих узлов могут быть заданы пользовательские значения (отличные от значений по умолчанию). Воспользуйтесь поиском, чтобы найти параметры.
zh_hans: 工作器节点的这些服务器参数可以设置为自定义(非默认)值。搜索以查找参数。
zh_hant: 背景工作節點的這些伺服器參數可以設定為自訂 (非預設) 值。搜尋以尋找參數。

# arc.workerOneNodeValidationMessage
source: Value of 1 is not supported.
de: Der Wert 1 wird nicht unterstützt.
es: No se admite el valor de 1.
fr: La valeur de 1 n'est pas prise en charge.
it: Il valore 1 non è supportato.
ja: 1 の値はサポートされていません。
ko: 값 1은 지원되지 않습니다.
pt_br: Não há suporte para o valor de 1.
ru: Значение 1 не поддерживается.
zh_hans: 不支持值为 1。
zh_hant: 不支援 1 的值。

# arc.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# button.label
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

# clusterContextConfigNoLongerValid
source: The cluster context information specified by config file: {0} and cluster context: {1} is no longer valid. Error is: {2} Do you want to update this information?
de: Die in der Konfigurationsdatei angegebenen Clusterkontext-Informationen: {0} und Clusterkontext: {1} sind nicht mehr gültig. Fehler: {2} Möchten Sie diese Informationen aktualisieren?
es: La información de contexto de clúster especificada por el archivo de configuración: {0} y contexto de clúster: {1} ya no es válida. Error: {2} ¿Quiere actualizar esta información?
fr: Les informations de contexte de cluster spécifiées par le fichier de configuration : {0} et le contexte du cluster : {1} n'est plus valide. L'erreur est : {2} Voulez-vous mettre à jour ces informations ?
it: Le informazioni sul contesto del cluster specificate dal file di configurazione: {0} e dal contesto del cluster: {1} non sono più valide. L'errore è: {2} Aggiornare queste informazioni?
ja: 構成ファイルで指定された {0} とクラスター・コンテキストのクラスター コンテキスト情報 {1} は有効ではありません。 {2} のエラーがあります。この情報を更新しますか？
ko: 구성 파일에서 지정한 클러스터 컨텍스트 정보: {0} 및 클러스터 컨텍스트: {1}은(는) 더 이상 유효하지 않습니다. 오류: {2} 이 정보를 업데이트하시겠습니까?
pt_br: As informações de contexto do cluster especificadas pelo arquivo de configuração: {0} e contexto de cluster: {1} não são mais válidas. O erro é: {2} Deseja atualizar essas informações?
ru: Сведения о контексте кластера, указанные в файле конфигурации: {0} и контекст кластера: {1} больше не действительны. Ошибка: {2} Вы хотите обновить эти сведения?
zh_hans: 配置文件指定的群集上下文信息: {0} 和群集上下文: {1} 不再有效。错误为: >{2} 是否要更新此信息?
zh_hant: 組態檔所指定的叢集內容資訊: {0} 和叢集內容: {1} 不再有效。錯誤為: {2} 您要更新此資訊嗎?

# clusterContextNotFound
source: Cluster Context with name: {0} not found in the Kube config file
de: Eiin Clusterkontext mit dem Namen: {0} wurde nicht in der Kube-Konfigurationsdatei gefunden.
es: No se encuentra el contexto del clúster con el nombre {0} en el archivo de configuración de Kube
fr: Contexte de cluster portant le nom : {0} introuvable dans le fichier de configuration Kube
it: Contesto cluster con nome {0} non trovato nel file di configurazione Kube
ja: 名前を含むクラスター コンテキスト: Kube 構成ファイルで {0} が見つかりませんでした
ko: 이름이 {0}인 클러스터 컨텍스트를 Kube 구성 파일에서 찾을 수 없습니다.
pt_br: Contexto de Cluster com nome: {0} não encontrado no arquivo de configuração do Kube
ru: Не удалось найти контекст кластера с именем {0} в файле kube config
zh_hans: 在 Kube 配置文件中未找到名为 {0} 的群集上下文
zh_hant: 在 Kube 組態檔中找不到名稱為: {0} 的叢集內容

# filePicker.browse
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
pt_br: Procurar
ru: Обзор
zh_hans: 浏览
zh_hant: 瀏覽

# getIsPassword.unknownVariableName
source: Attempt to get isPassword for unknown variable:{0}
de: Es wird versucht, "isPassword" für eine unbekannte Variable abzurufen: {0}
es: Intento de obtener isPassword para una variable desconocida: {0}
fr: Tentative d'obtention de isPassword pour une variable inconnue : {0}
it: Tentativo di ottenere isPassword per la variabile sconosciuta: {0}
ja: 不明な変数 {0} の isPassword の取得を試みます
ko: 알 수 없는 변수 {0}의 isPassword를 가져오려고 시도합니다.
pt_br: Tentativa de obter isPassword para uma variável desconhecida: {0}
ru: Попытка получить пароль (isPassword) для неизвестной переменной: {0}
zh_hans: 尝试获取未知变量的 isPassword: {0}
zh_hant: 嘗試取得未知變數 {0} 的 isPassword

# getVariableValue.unknownVariableName
source: Attempt to get variable value for unknown variable:{0}
de: Es wird versucht, den Variablenwert für eine unbekannte Variable abzurufen: {0}
es: Intento de obtener un valor de variable para una variable desconocida: {0}
fr: Tentative d'obtention de la valeur de variable pour une variable inconnue : {0}
it: Tentativo di ottenere il valore della variabile per la variabile sconosciuta: {0}
ja: 不明な変数 {0} の変数値の取得を試みます
ko: 알 수 없는 변수 {0}의 변수 값을 가져오려고 시도합니다.
pt_br: Tentativa de obter o valor de variável para a variável desconhecida: {0}
ru: Попытка получить значение переменной для неизвестной переменной: {0}
zh_hans: 尝试获取未知变量的变量值: {0}
zh_hant: 嘗試取得未知變數 {0} 的變數值

# noContextFound
source: No 'contexts' found in the config file: {0}
de: In der Konfigurationsdatei wurden keine Kontexte gefunden: {0}
es: No se encontraron "contextos" en el archivo de configuración {0}
fr: Aucun « contexte » n’a été trouvé dans le fichier de configuration : {0}
it: Nessun "contesto" trovato nel file di configurazione: {0}
ja: 構成ファイルで 'コンテキスト' が見つかりませんでした: {0}
ko: 구성 파일 {0}에서 '컨텍스트'를 찾을 수 없습니다.
pt_br: Nenhum 'contexto' encontrado no arquivo de configuração: {0}
ru: Не найдены "контексты" в файле конфигурации: {0}
zh_hans: 在配置文件中找不到“上下文”: {0}
zh_hant: 組態檔: {0} 中找不到「內容」

# noControllerInfoFound
source: Controller Info could not be found with name: {0}
de: Controllerinformationen mit folgendem Namen wurden nicht gefunden: {0}
es: No se encontró la información del controlador con el nombre {0}
fr: Les informations du contrôleur sont introuvables avec le nom : {0}
it: Non è stato possibile trovare le informazioni sul controller con il nome {0}
ja: 名前を含むコントローラー情報が見つかりませんでした: {0}
ko: 이름이 {0}인 컨트롤러 정보를 찾을 수 없습니다.
pt_br: Não foi possível encontrar as Informações do Controlador com o nome: {0}
ru: Не удалось найти сведения о контроллере с именем {0}
zh_hans: 找不到名称为 {0} 的控制器信息
zh_hant: 找不到名稱為: {0} 的控制器資訊

# noControllersConnected
source: No Azure Arc controllers are currently connected. Please run the command: 'Connect to Existing Azure Arc Controller' and then try again
de: Zurzeit sind keine Azure Arc-Controller verbunden. Führen Sie den Befehl "Verbindung mit vorhandenem Azure Arc-Controller herstellen" aus, und wiederholen Sie den Vorgang.
es: No hay controladores de Azure Arc conectados actualmente. Ejecute el comando: 'Conectar con el controlador de Azure Arc existente' y vuelva a intentarlo
fr: Aucun contrôleur Azure Arc n’est actuellement connecté. Exécutez la commande : « Se connecter au contrôleur Azure Arc existante », puis réessayez
it: Nessun controller di Azure Arc è attualmente connesso. Eseguire il comando: "Connetti a controller Azure Arc esistente" e riprovare
ja: 現在、Azure Arc コントローラーが接続されていません。コマンド '既存の Azure Arc コントローラーに接続' を実行してから、もう一度お試しください。
ko: 현재 연결된 Azure Arc 컨트롤러가 없습니다. '기존 Azure Arc 컨트롤러에 연결' 명령을 실행한 후 다시 시도하세요.
pt_br: Não há controladores Azure Arc conectados no momento. Execute o comando: 'Conectar-se ao Controlador Azure Arc Existente' e tente novamente
ru: Подключенные контроллеры Azure Arc отсутствуют. Выполните команду "Подключиться к существующему контроллеру Azure Arc" и повторите попытку.
zh_hans: 当前未连接 Azure Arc 控制器。请运行命令:“连接到现有Azure Arc控制器”，然后重试
zh_hant: 目前未連線任何 Azure Arc 控制器。請執行命令: [連線到現有的 Azure Arc 控制器]，然後再試一次

# noCurrentClusterContext
source: No current cluster context was found in the kube config file
de: In der Kube-Konfigurationsdatei wurde kein aktueller Clusterkontext gefunden
es: No se encontró ningún contexto de clúster actual en el archivo kubeconfig.
fr: Aucun contexte de cluster actif n’a été trouvé dans le fichier de configuration kube
it: Nessun contesto del cluster corrente è stato trovato nel file di configurazione kube
ja: Kube 構成ファイルで現在のクラスター コンテキストが見つかりませんでした
ko: kube 구성 파일에서 현재 클러스터 컨텍스트를 찾을 수 없습니다.
pt_br: Nenhum contexto de cluster atual foi encontrado no arquivo de configuração kube
ru: В файле kube config не найден текущий контекст кластера
zh_hans: 在 kube 配置文件中找不到当前群集上下文
zh_hant: 在 Kube 組態檔中找不到目前的叢集內容

# noCurrentContextFound
source: No context is marked as 'current-context' in the config file: {0}
de: In der Konfigurationsdatei ist kein Kontext als "current-context" gekennzeichnet: {0}
es: No hay ningún contexto marcado como 'current-context' en el archivo de configuración: {0}
fr: Aucun contexte n’est marqué comme « contexte actuel » dans le fichier de configuration : {0}
it: Nessun contesto è contrassegnato come "contesto corrente" nel file di configurazione: {0}
ja: 構成ファイルでは、コンテキストが 'current-context' としてマークされていません: {0}
ko: 구성 파일에 'current-context'로 표시된 컨텍스트가 없습니다. {0}
pt_br: Nenhum contexto está marcado como 'current-context' no arquivo de configuração: {0}
ru: В файле конфигурации отсутствует контекст, помеченный как "current-context": {0}
zh_hans: 配置文件中没有标记为 “current-context” 的上下文: {0}
zh_hant: 組態檔中沒有內容標示為 'current-context': {0}

# noNameInContext
source: No name field was found in a cluster context in the config file: {0}
de: In der Konfigurationsdatei wurde kein Namensfeld in einem Clusterkontext gefunden: {0}
es: No se encontró ningún campo de nombre en un contexto de clúster en el archivo de configuración {0}
fr: Aucun champ de nom n’a été trouvé dans un contexte de cluster dans le fichier de configuration : {0}
it: Nessun campo nome è stato trovato in un contesto cluster nel file di configurazione: {0}
ja: 構成ファイルのクラスター コンテキストに名前フィールドが見つかりませんでした: {0}
ko: 구성 파일의 클러스터 컨텍스트에서 이름 필드를 찾을 수 없습니다. {0}
pt_br: Nenhum campo de nome foi encontrado em um contexto de cluster no arquivo de configuração: {0}
ru: В контексте кластера в файле конфигурации не найдено поле имени: {0}
zh_hans: 在配置文件中的群集上下文中找不到任何名称字段: {0}
zh_hant: 在組態檔 {0} 中的叢集內容中找不到名稱欄位

# noPasswordFound
source: Password could not be retrieved for controller: {0} and user did not provide a password. Please retry later.
de: Das Kennwort konnte für den Controller nicht abgerufen werden: {0} und der Benutzer hat kein Kennwort angegeben. Versuchen Sie es später noch mal.
es: No se pudo recuperar la contraseña para el controlador {0} y el usuario no proporcionó una contraseña. Vuelva a intentarlo más tarde.
fr: Impossible de récupérer le mot de passe pour le contrôleur : {0} et l’utilisateur n’a pas fourni de mot de passe. Réessayez plus tard.
it: Non è stato possibile recuperare la password per il controller {0} e l'utente non ha fornito una password. Riprovare più tardi.
ja: コントローラーのパスワードを取得できませんでした: {0} とユーザーはパスワードを指定しませんでした。後でもう一度お試しください。
ko: {0} 컨트롤러에 대한 암호를 검색할 수 없으며 사용자가 암호를 제공하지 않았습니다. 나중에 다시 시도하세요.
pt_br: A senha não pôde ser recuperada para o controlador: {0} e o usuário não forneceu uma senha. Tente novamente mais tarde.
ru: Не удалось получить пароль для контроллера {0}, и пользователь не предоставил пароль. Повторите попытку позже.
zh_hans: 无法检索到控制器的密码: {0}，并且用户未提供密码。请稍后重试。
zh_hant: 無法擷取控制器: {0} 的密碼，且使用者未提供密碼。請稍後重試。

# arc.agreement
source: I accept {0} and {1}.
de: Ich akzeptiere die {0} und die {1}.
es: Acepto {0} y {1}.
fr: J'accepte {0} et {1}.
it: Accetto {0} e {1}.
ja: {0} および {1} に同意します。
ko: {0} 및 {1}에 동의합니다.
pt_br: Aceito {0} e {1}.
ru: Я принимаю {0} и {1}.
zh_hans: 我接受 {0} 和 {1}。
zh_hant: 我接受 {0} 和 {1}。

# arc.agreement.postgres.terms.conditions
source: Azure Arc-enabled PostgreSQL Hyperscale terms and conditions
de: PostgreSQL Hyperscale mit Azure Arc-Unterstützung – Geschäftsbedingungen
es: Términos y condiciones de hiperescala de PostgreSQL habilitados para Azure Arc
fr: Conditions générales d'utilisation de PostgreSQL Hyperscale activé par Azure Arc
it: Termini e condizioni di PostgreSQL Hyperscale abilitato per Azure Arc
ja: Azure Arc 対応 PostgreSQL Hyperscale のご契約条件
ko: Azure Arc 지원 PostgreSQL 하이퍼스케일 사용 약관
pt_br: Termos e condições da Hiperescala PostgreSQL do Azure Arc habilitado
ru: Условия использования гипермасштабирования PostgreSQL с поддержкой Azure Arc
zh_hans: 启用 Azure Arc 的 PostgreSQL 超大规模条款和条件
zh_hant: 支援 Azure Arc 的 PostgreSQL 超大規模資料庫條款及條件
