Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.sql.dev.use.description
source: Check the box to indicate this instance will be used for development or testing purposes only. This instance will not be billed.
de: Aktivieren Sie das Kontrollkästchen, um anzugeben, dass diese Instanz nur zu Entwicklungs- oder Testzwecken verwendet wird. Diese Instanz wird nicht in Rechnung gestellt.
es: Active la casilla para indicar que esta instancia se utilizará solo con fines de prueba o desarrollo. Esta instancia no se facturará.
fr: Activez la case à cocher pour indiquer que cette instance sera utilisée uniquement à des fins de développement ou de test. Cette instance ne sera pas facturée.
it: Selezionare la casella per indicare che questa istanza verrà usata solo a scopo di sviluppo o di test. Questa istanza non verrà fatturata.
ja: このインスタンスが開発またはテスト目的でのみ使用されることを示すチェックボックスをオンにします。このインスタンスには請求されません。
ko: 이 인스턴스가 개발 또는 테스트 목적으로만 사용됨을 나타내려면 확인란을 선택합니다. 이 인스턴스는 청구되지 않습니다.
pt_br: Marque a caixa para indicar que esta instância será usada apenas para fins de desenvolvimento ou de teste. Esta instância não será cobrada.
ru: Установите этот флажок, чтобы указать, что этот экземпляр будет использоваться только для разработки и тестирования. За этот экземпляр не будет взиматься оплата.
zh_hans: 选中此框以指示此实例将仅用于开发或测试目的。将不会对此实例计费。
zh_hant: 勾選此方塊以表示此執行個體將僅用於開發或測試用途。此執行個體將不會計費。

# arc.sql.dev.use.label
source: For development use only
de: Nur für die Entwicklung
es: Solo para uso de desarrollo
fr: Pour une utilisation de développement uniquement
it: Solo per lo sviluppo
ja: 開発用途のみ
ko: 개발용으로만 사용
pt_br: Somente para uso em desenvolvimento
ru: Только для разработки
zh_hans: 仅供开发使用
zh_hant: 僅供開發使用

# arc.sql.high.availability
source: High availability
de: Hohe Verfügbarkeit
pt_br: Alta disponibilidade
zh_hans: 高可用性
zh_hant: 高可用性

# arc.sql.high.availability.description
source: Enable additional replicas for high availabilty. The compute and storage configuration selected below will be applied to all replicas.
de: Aktivieren Sie zusätzliche Replikate, um Hochverfügbarkeit zu erzielen. Die nachstehend ausgewählte Konfiguration für Compute- und Speicherressourcen wird auf alle Replikate angewendet.
es: Habilite réplicas adicionales para la alta disponibilidad. La configuración de proceso y almacenamiento seleccionada a continuación se aplicará a todas las réplicas.
fr: Activez des réplicas supplémentaires pour une haute disponibilité. La configuration de calcul et de stockage sélectionnée ci-dessous sera appliquée à tous les réplicas.
it: Abilita le repliche aggiuntive per la disponibilità elevata. La configurazione di calcolo e archiviazione selezionata di seguito verrà applicata a tutte le repliche.
ja: 高可用性のために追加のレプリカを有効にします。以下で選択したコンピューティングとストレージの構成は、すべてのレプリカに適用されます。
pt_br: Habilite réplicas adicionais para alta disponibilidade. A configuração de computador e armazenamento selecionada abaixo será aplicada a todas as réplicas.
ru: Включите дополнительные реплики для высокого уровня доступности. Выбранная ниже конфигурация вычислений и хранилища будет применена ко всем репликам.
zh_hans: 启用其他副本以实现高可用性。所选的计算和存储配置将应用于所有副本。
zh_hant: 為求高可用性啟用其他複本。下方選取的計算與儲存體組態將會套用至所有複本。

# arc.sql.instance.name
source: Instance name
de: Instanzname
es: Nombre de la instancia
fr: Nom de l'instance
it: Nome dell'istanza
ja: インスタンス名
ko: 인스턴스 이름
pt_br: Nome da instância
ru: Имя экземпляра
zh_hans: 实例名称
zh_hant: 執行個體名稱

# arc.sql.instance.retention.policy.title
source: SQL Instance Backup Retention Policy
de: Aufbewahrungsrichtlinie für SQL-Instanzsicherung
es: Directiva de retención de copia de seguridad de la instancia de SQL
ko: SQL 인스턴스 백업 보존 정책
pt_br: Política de Retenção de Backup da Instância SQL
ru: Политика хранения резервных копий экземпляров SQL
zh_hans: SQL 实例备份保留策略
zh_hant: SQL 執行個體備份保留原則

# arc.sql.instance.settings.section.title
source: SQL Instance settings
de: SQL-Instanzeinstellungen
es: Configuración de la instancia de SQL
fr: Paramètres d'instance SQL
it: Impostazioni istanza di SQL
ja: SQL インスタンスの設定
ko: SQL 인스턴스 설정
pt_br: Configurações da Instância do SQL
ru: Параметры экземпляра SQL
zh_hans: SQL 实例设置
zh_hant: SQL 執行個體設定

# arc.sql.invalid.instance.name
source: Instance name must consist of lower case alphanumeric characters or '-', start with a letter, end with an alphanumeric character, and be 13 characters or fewer in length.
de: Der Instanzname muss aus alphanumerischen Kleinbuchstaben oder "-" bestehen, mit einem Buchstaben beginnen, mit einem alphanumerischen Zeichen enden und höchstens 13 Zeichen lang sein.
es: El nombre de instancia debe constar de caracteres alfanuméricos en minúsculas o "-", empezar con una letra, terminar con un carácter alfanumérico y tener 13 caracteres o menos de longitud.
fr: Le nom de l’instance doit être constitué de caractères alphanumériques minuscules ou « - », commencer par une lettre, se terminer par un caractère alphanumérique et comporter 13 caractères au maximum.
it: Il nome dell'istanza deve essere composto da caratteri alfanumerici minuscoli o "-", iniziare con una lettera, terminare con un carattere alfanumerico e avere una lunghezza massima di 13 caratteri.
ja: インスタンス名は、小文字の英数字または '-' で構成され、先頭に文字を使用し、末尾に英数字を使用して、13 文字以下にする必要があります。
ko: 인스턴스 이름은 소문자 영숫자 또는 '-'로 구성되어야 하며, 문자로 시작하고 영숫자로 끝나며 길이가 13자 이하여야 합니다.
pt_br: O nome da instância deve consistir em caracteres alfanuméricos minúsculos ou '-', iniciar com uma letra, terminar com um caractere alfanumérico e ter 13 caracteres ou menos.
ru: Имя экземпляра должно состоять из строчных букв и цифр или дефисов "-", начинаться с буквы, заканчиваться буквой или цифрой и содержать не более 13 символов.
zh_hans: 实例名称必须包含小写字母数字字符或 "-"，以字母开头，以字母数字字符结尾，并且长度不能超过 13 个字符。
zh_hant: 執行個體名稱必須包含小寫英數字元或 '-'、以字母開頭，以英數字元結尾，且長度不得超過 13 個字元。

# arc.sql.invalid.username
source: sa username is disabled, please choose another username
de: der SA-Benutzername ist deaktiviert, wählen Sie einen anderen Benutzernamen aus
es: El nombre de usuario de sa está deshabilitado; elija otro nombre de usuario.
fr: le nom d’utilisateur sa est désactivé, choisissez un autre nom d’utilisateur
it: il nome utente sa è disabilitato. Scegliere un altro nome utente
ja: sa ユーザー名が無効です。別のユーザー名を選択してください
ko: sa 사용자 이름을 사용할 수 없습니다. 다른 사용자 이름을 선택하세요.
pt_br: nome de usuário sa está desabilitado, escolha outro nome
ru: Имя пользователя sa отключено, выберите другое имя пользователя
zh_hans: sa 用户名已禁用，请选择其他用户名
zh_hant: 已停用 sa 使用者名稱，請選擇其他使用者名稱

# arc.sql.license.type.description
source: Apply the Azure Hybrid Benefit if you already own a SQL Server License
de: Wenden Sie den Azure-Hybridvorteil an, wenn Sie bereits über eine SQL Server-Lizenz verfügen.
ko: 이미 SQL Server 라이선스를 소유하고 있는 경우 Azure 하이브리드 혜택을 적용하세요
pt_br: Aplique o Benefício Híbrido do Azure se você já possui uma Licença do SQL Server
zh_hans: 如果你已经拥有 SQL Server 许可证，请申请 Azure 混合权益
zh_hant: 如果您已擁有 SQL Server 授權，請套用 Azure Hybrid Benefit

# arc.sql.license.type.label
source: I already have a SQL Server License
de: Ich habe bereits eine SQL Server-Lizenz
ko: 이미 SQL Server 라이선스가 있습니다.
pt_br: Já tenho uma licença SQL Server cliente
zh_hans: 我已有 SQL Server 许可证
zh_hant: 我已有 SQL Server 授權

# arc.sql.memory-limit.description
source: The limit of the capacity of the managed instance as an integer.
de: Der Kapazitätsgrenzwert der verwalteten Instanz als ganze Zahl.
es: El límite de la capacidad de la instancia administrada como un entero.
fr: Limite de la capacité de l’instance managée en tant qu’entier.
it: Il limite della capacità dell'istanza gestita come numero intero.
ja: 整数で表したマネージド インスタンスの容量の上限。
ko: 정수로 관리되는 인스턴스의 용량 제한입니다.
pt_br: O limite da capacidade da instância gerenciada como um inteiro.
ru: Предельная емкость управляемого экземпляра в виде целого числа.
zh_hans: 托管实例的容量限制(整数)。
zh_hant: 受控執行個體的容量限制 (整數)。

# arc.sql.memory-request.description
source: The request for the capacity of the managed instance as an integer amount of memory in GBs.
de: Die Anforderung für die Kapazität der verwalteten Instanz als ganzzahlige Menge an Arbeitsspeicher in GB.
es: La solicitud para la capacidad de la instancia administrada como un entero de cantidad de memoria, en GB.
fr: Demande de la capacité de l’instance managée en tant que quantité entière de mémoire en Go.
it: La richiesta per la capacità dell'istanza gestita come quantità intera di memoria in GB.
ja: マネージド インスタンスの容量を要求して、整数のメモリ量 (GB) で指定します。
ko: 관리되는 인스턴스의 용량에 대한 요청(GB의 정수 메모리 양)입니다.
pt_br: A solicitação para a capacidade da instância gerenciada como uma quantidade inteira de memória em GBs.
ru: Запрос емкости управляемого экземпляра в виде целочисленного объема памяти в ГБ.
zh_hans: 对托管实例容量的请求(整数内存量，以 GB 为单位)。
zh_hant: 受控執行個體的容量要求，以記憶體整數 GB 為單位。

# arc.sql.one.replica
source: 1 replica
de: 1 Replikat
es: 1 réplica
ja: 1 個のレプリカ
pt_br: 1 réplica
ru: 1 реплика
zh_hans: 1 个副本
zh_hant: 1 個複本

# arc.sql.pitr.description
source: Point in time restore
de: Zeitpunktwiederherstellung
es: Restauración a un momento dado
ko: 지정 시간 복원
pt_br: Restauração pontual
ru: Восстановление на момент времени
zh_hans: 时点还原
zh_hant: 還原時間點

# arc.sql.pitr.retention.description
source: Configure retention for point-in-time backups. {0}
de: Konfigurieren Sie die Aufbewahrung für Point-in-Time-Sicherungen. {0}
es: Configure la retención de las copias de seguridad puntualmente. {0}
ko: 특정 시점 백업의 보존을 구성합니다. {0}
pt_br: Configure a retenção para backups pontuais. {0}
ru: Настройте хранение резервных копий до определенного момента во времени. {0}
zh_hans: 配置时间点备份的保留期。{0}
zh_hant: 設定時間點備份的保留期。{0}

# arc.sql.readable.secondaries.description
source: The number of readable secondary replicas.
de: Die Anzahl lesbarer sekundärer Replikate.
pt_br: Número de réplicas secundárias para leitura.
zh_hans: 可读次要副本的数目。
zh_hant: 可讀取次要複本數目。

# arc.sql.readable.secondaries.label
source: Readable secondary replicas
de: Lesbare sekundäre Replikate
pt_br: Réplicas secundárias para leitura
zh_hans: 可读次要副本
zh_hant: 可讀取次要複本

# arc.sql.retention.days.description
source: Specify how long you want to keep your point-in-time backups.
de: Geben Sie an, wie lange Ihre Point-in-Time-Sicherungen beibehalten werden sollen.
es: Especifique durante cuánto tiempo quiere conservar sus copias de seguridad a un momento dado.
ko: 특정 시점 백업을 유지할 기간을 지정합니다.
pt_br: Especifique por quanto tempo você deseja manter os seus backups pontuais.
ru: Укажите срок хранения резервных копий для восстановления до точки во времени.
zh_hans: 指定要将时间点备份保留多长时间。
zh_hant: 指定時間點備份的保留時間長度。

# arc.sql.retention.days.label
source: Point in time retention (days)
de: Zeitpunktaufbewahrung (Tage)
ko: 특정 시점 보존(일)
pt_br: Retenção de ponto no tempo (dias)
zh_hans: 时间点保留(天)
zh_hant: 保留時間點 (天)

# arc.sql.service.tier.business.critical
source: Business Critical (Unlimited vCores and RAM, advanced high availability)
de: Unternehmenskritisch (Unbegrenzte virtuelle Kerne und RAM, erweiterte Hochverfügbarkeit)
pt_br: Comercialmente Crítico (vCores e RAM ilimitados, alta disponibilidade avançada)
zh_hans: 业务关键(无限制的 vCore 和 RAM，高级高可用性)
zh_hant: 商務關鍵性 (無限虛擬核心及 RAM，進階高可用性)

# arc.sql.service.tier.description
source: Select from the latest vCore service tiers available for SQL Managed Instance - Azure Arc including General Purpose and Business Critical.
de: Wählen Sie aus den neuesten V-Kern-Dienstebenen aus, die für SQL Managed Instance verfügbar sind – Azure Arc einschließlich Universell und Unternehmenskritisch.
pt_br: Selecione entre as camadas de serviço vCore mais recentes disponíveis para o Instância Gerenciada de SQL - Azure Arc incluindo Uso Geral e Comercialmente Crítico.
zh_hans: 从可用于 SQL 托管实例 - Azure Arc 的最新 vCore 服务层(包括常规用途和业务关键型)中进行选择。
zh_hant: 從 Azure SQL 受控執行個體 - Azure Arc (包括一般用途和商務關鍵性) 可用的最新 V 核心服務層級中選取。

# arc.sql.service.tier.general.purpose
source: General Purpose (Up to 24 vCores and 128 Gi of RAM, standard high availability)
de: Universell (bis zu 24 virtuelle Kerne und 128 Gi RAM, Standard-Hochverfügbarkeit)
es: De uso general (hasta 24 núcleos virtuales y 128 GI de RAM, alta disponibilidad estándar)
fr: Usage général (jusqu’à 24 vCores et 128 GI de RAM, haute disponibilité standard)
it: Per utilizzo generico (fino a 24 vCore e 128 Gi di RAM, disponibilità elevata standard)
ja: General Purpose (最大 24 個の仮想コアと 128Gi の RAM、標準的な高可用性)
pt_br: Uso Geral (até 24 vCores e 128 Gi de RAM, alta disponibilidade padrão)
ru: Общего назначения (до 24 виртуальных ядер и 128 ГБ ОЗУ, стандартные функции высокого уровня доступности)
zh_hans: 常规用途(最多 24 个 Vcore 和 128 Gi RAM，标准高可用性)
zh_hant: 一般用途 (最高 24 個虛擬核心及 128 Gi RAM，標準高可用性)

# arc.sql.service.tier.label
source: Service Tier
de: Dienstebene
es: Nivel de servicio
fr: Niveau de service
it: Livello di servizio
ja: サービス層
ko: 서비스 계층
pt_br: Camada de Serviço
ru: Уровень служб
zh_hans: 服务层
zh_hant: 服務層級

# arc.sql.storage-class.backups.description
source: The storage class to be used for Backups. If no value is specified, backups will be stored in same storage class assigned to Data. Must be a RWX capable storage class.
de: Die Speicherklasse, die für Sicherungen verwendet werden soll. Wenn kein Wert angegeben wird, werden Sicherungen in derselben Speicherklasse gespeichert, die "Data" zugewiesen ist. Muss eine RWX-fähige Speicherklasse sein.
pt_br: A classe de armazenamento a ser usada para Backups. Se nenhum valor for especificado, os backups serão armazenados na mesma classe de armazenamento atribuída a Dados. Deve ser uma classe de armazenamento compatível com RWX.
zh_hans: 要用于备份的存储类。如果未指定任何值，备份将存储在分配给数据的同一存储类中。必须是支持 RWX 的存储类。
zh_hant: 要用於備份的儲存體類別。如果未指定任何值，備份將儲存在指派給資料的相同儲存體類別中。必須是具備 RWX 功能的儲存體類別。

# arc.sql.storage-class.data.description
source: The storage class to be used for data (.mdf). If no value is specified, the default storage class will be used.
de: Die für Daten (.mdf) zu verwendende Speicherklasse. Wenn kein Wert angegeben wird, wird die Standardspeicherklasse verwendet.
es: Clase de almacenamiento que se va a usar para los datos (.mdf). Si no se especifica ningún valor, se usará la clase de almacenamiento predeterminada.
fr: Classe de stockage à utiliser pour les données (. mdf). Si aucune valeur n’est spécifiée, la classe de stockage par défaut est utilisée.
it: Classe di archiviazione da utilizzare per i dati (.mdf). Se non viene specificato alcun valore, verrà utilizzata la classe di archiviazione predefinita.
ja: データ (.mdf) に使用されるストレージ クラス。値が指定されない場合は、既定のストレージ クラスが使用されます。
ko: 데이터(.mdf)에 사용할 스토리지 클래스입니다. 값을 지정하지 않으면 기본 스토리지 클래스가 사용됩니다.
pt_br: A classe de armazenamento a ser usada para dados (.mdf). Se nenhum valor for especificado, a classe de armazenamento padrão será usada.
ru: Класс хранения, используемый для данных (.mdf). Если значение не указано, будет использован класс хранения по умолчанию.
zh_hans: 用于数据的存储类(.mdf)。如果未指定任何值，则将使用默认存储类。
zh_hant: 用於資料 (.mdf) 的儲存類別。如果未指定任何值，則會使用預設儲存類別。

# arc.sql.storage-class.datalogs.description
source: The storage class to be used for database logs (.ldf). If no value is specified, the default storage class will be used.
de: Die Speicherklasse, die für Datenbankprotokolle (LDF) verwendet werden soll. Wenn kein Wert angegeben wird, wird die Standardspeicherklasse verwendet.
es: Clase de almacenamiento que se va a usar para los registros de base de datos (.ldf). Si no se especifica ningún valor, se usará la clase de almacenamiento predeterminada.
fr: Classe de stockage à utiliser pour les journaux de base de données (.ldf). Si aucune valeur n’est spécifiée, la classe de stockage par défaut est utilisée.
it: La classe di archiviazione da utilizzare per i log di database (.ldf). Se non viene specificato alcun valore, verrà utilizzata la classe di archiviazione predefinita.
ja: データベース ログ (.ldf) に使用されるストレージ クラス。値が指定されない場合は、既定のストレージ クラスが使用されます。
ko: 데이터베이스 로그(.ldf)에 사용할 저장소 클래스입니다. 값을 지정하지 않으면 기본 저장소 클래스가 사용됩니다.
pt_br: A classe de armazenamento a ser usada nos logs dos banco de dados (.ldf). Se nenhum valor for especificado, a classe de armazenamento padrão será usada.
ru: Класс хранения для журналов базы данных (.ldf). Если значение не указано, будет использоваться класс по умолчанию.
zh_hans: 用于数据的数据库日志(.ldf)。如果未指定任何值，则将使用默认存储类。
zh_hant: 用於資料庫記錄 (.ldf) 的儲存類別。如果未指定任何值，則會使用預設儲存類別。

# arc.sql.storage-class.dc.description
source: The storage class to be used for all data and logs persistent volumes for all data controller pods that require them.
de: Die Speicherklasse, die für alle persistenten Daten- und Protokollvolumes für alle Datencontrollerpods verwendet werden soll, die diese benötigen.
es: La clase de almacenamiento que se va a usar para todos los volúmenes persistentes de datos y registros para todos los pods de controlador de datos que los requieran.
fr: Classe de stockage à utiliser pour toutes les données et journalise les volumes persistants pour tous les gousses de contrôleur de données qui en ont besoin.
it: La classe di archiviazione da utilizzare per tutti i volumi persistenti di dati e log per tutti i pod del controller di dati che li richiedono.
ja: すべてのデータとログの永続ボリュームを必要とするすべてのデータ コントローラー ポッドに使用されるストレージ クラス。
ko: 모든 데이터에 사용할 스토리지 클래스이며 필요한 모든 데이터 컨트롤러 Pod의 영구 볼륨을 기록합니다.
pt_br: A classe de armazenamento a ser usada para todos os dados e logs de volumes persistentes para todos os pods do controlador de dados que os exigem.
ru: Класс хранения, используемый для всех данных и постоянных томов журналов во всех объектах pod контроллеров данных, которым они требуются.
zh_hans: 要用于所有数据的存储类，以及所有需要它们的数据控制器 Pod 的 日志永久卷。
zh_hant: 用於所有資料以及記錄永久性磁碟區 (所有資料控制器 Pod 都需要) 的儲存類別。

# arc.sql.storage-class.logs.description
source: The storage class to be used for logs (/var/log). If no value is specified, the default storage class will be used.
de: Die für Protokolle (/var/log) zu verwendende Speicherklasse. Wenn kein Wert angegeben wird, wird die Standardspeicherklasse verwendet.
es: Clase de almacenamiento que se va a usar para los registros (/var/log). Si no se especifica ningún valor, se usará la clase de almacenamiento predeterminada.
fr: Classe de stockage à utiliser pour les journaux (/var/log). Si aucune valeur n’est spécifiée, la classe de stockage par défaut est utilisée.
it: Classe di archiviazione da utilizzare per i log (/var/log). Se non viene specificato alcun valore, verrà utilizzata la classe di archiviazione predefinita.
ja: ログ (/var/log) に使用されるストレージ クラス。値が指定されない場合は、既定のストレージ クラスが使用されます。
ko: 로그에 사용할 스토리지 클래스(/var/log). 값을 지정하지 않으면 기본 스토리지 클래스가 사용됩니다.
pt_br: A classe de armazenamento a ser usada para logs (/var/log). Se nenhum valor for especificado, a classe de armazenamento padrão será usada.
ru: Класс хранения, используемый для журналов (/var/log). Если значение не указано, будет использован класс хранения по умолчанию.
zh_hans: 用于日志的存储类(/var/log)。如果未指定任何值，则将使用默认存储类。
zh_hant: 用於記錄 (/var/log) 的儲存類別。如果未指定任何值，則會使用預設儲存類別。

# arc.sql.summary.arc.by.microsoft
source: by Microsoft
de: von Microsoft
ko: Microsoft 제공
pt_br: por Microsoft
zh_hans: 由 Microsoft 提供
zh_hant: 由 Microsoft 提供

# arc.sql.sync.secondaries.description
source: The number of synchronous replicas required to commit a transaction before the primary replica is allowed to commit. Setting this value to -1 will set the number of required synchronized secondaries to '(# of replicas - 1) / 2', rounded down.
de: Die Anzahl der synchronen Replikate, die zum Ausführen eines Commits für eine Transaktion erforderlich sind, bevor ein Commit für das primäre Replikat zulässig ist. Wenn Sie diesen Wert auf -1 festlegen, wird die Anzahl der erforderlichen synchronisierten sekundären Replikate auf "(Anzahl der Replikate – 1) / 2" festgelegt und abgerundet.
pt_br: O número de réplicas síncronas necessárias para confirmar uma transação antes que a réplica primária tenha permissão para confirmar. Definir esse valor como -1 definirá o número de secundários sincronizados necessários para '(# de réplicas - 1) / 2', arredondado para baixo.
zh_hans: 允许提交主副本之前提交事务所需的同步副本数。将此值设置为 -1 会将所需的同步辅助副本数设置为 '(# of replicas - 1) / 2',(向下舍入)。
zh_hant: 允許認可主要複本之前認可交易所需的同步複本數目。將此值設定為 -1 會將所需的同步次要數設定為'(副本數 - 1) / 2'，並向下四捨五入。

# arc.sql.sync.secondaries.label
source: Synchronized secondaries required to commit
de: Synchronisierte sekundäre Replikate, die zum Committen erforderlich sind
pt_br: Secundários sincronizados necessários para confirmar
zh_hans: 提交所需的同步辅助副本
zh_hant: 需要同步處理次要項目才能進行認可

# arc.sql.three.replicas
source: 3 replicas
de: 3 Replikate
es: 3 réplicas
fr: 3 réplicas
it: 3 repliche
ja: 3 個のレプリカ
pt_br: 3 réplicas
ru: 3 реплики
zh_hans: 3 个副本
zh_hant: 3 個複本

# arc.sql.two.replicas
source: 2 replicas
de: 2 Replikate
es: 2 réplicas
fr: 2 réplicas
it: 2 repliche
ja: 2 個のレプリカ
pt_br: 2 réplicas
ru: 2 реплики
zh_hans: 2 个副本
zh_hant: 2 個複本

# arc.sql.username
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# arc.sql.volume.size.backups.description
source: The size of the storage volume to be used for backups in gibibytes.
de: Die Größe des Speichervolumes, das für Sicherungen in GiB verwendet werden soll.
es: Tamaño del volumen de almacenamiento que se va a usar para las copias de seguridad en gigabytes.
fr: Taille du volume de stockage à utiliser pour les sauvegardes en gibioctets.
it: La dimensione del volume di archiviazione da utilizzare per i backup in gibibyte.
ja: バックアップに使用するストレージ ボリュームのサイズ (GB)。
ko: 백업에 사용할 저장소 볼륨의 크기(기비바이트)입니다.
pt_br: O tamanho do volume de armazenamento a ser usado nos backups em gibibytes.
ru: Размер тома хранилища для резервных копий (гибибайт).
zh_hans: 用于备份的存储卷大小(GB)。
zh_hant: 要用於備份之儲存磁碟區的大小 (GB)。

# arc.sql.volume.size.backups.label
source: Volume Size in Gi (Backups)
de: Volumegröße in Gi (Sicherungen)
es: Tamaño del volumen en Gi (copias de seguridad)
fr: Taille du volume en Gio (sauvegardes)
it: Dimensioni del volume in Gi (backup)
ja: ボリュームのサイズ (Gi) (バックアップ)
ko: Gi 단위의 볼류 크기(백업)
pt_br: Tamanho do volume em Gi (Backups)
ru: Размер тома в ГиБ (резервные копии)
zh_hans: 以 Gi 为单位的卷大小(备份)。
zh_hant: 以 Gi 表示的磁碟區大小 (備份)

# arc.sql.volume.size.data.description
source: The size of the storage volume to be used for data in gibibytes.
de: Die Größe des Speichervolumes, das für Daten in Gibibytes verwendet werden soll.
es: Tamaño del volumen de almacenamiento que se va a usar para los datos en gigabytes.
fr: Taille du volume de stockage à utiliser pour les données en gibioctets.
it: La dimensione del volume di archiviazione da utilizzare per i dati in gibibyte.
ja: データに使用するストレージ ボリュームのサイズ (GB)。
ko: 데이터에 사용할 저장소 볼륨의 크기(기비바이트)입니다.
pt_br: O tamanho do volume de armazenamento a ser usado nos dados em gibibytes.
ru: Размер тома хранилища для данных (гибибайт).
zh_hans: 用于数据的存储卷大小(GB)。
zh_hant: 要用於資料之儲存磁碟區的大小 (GB)。

# arc.sql.volume.size.data.label
source: Volume Size in Gi (Data)
de: Volumegröße in Gi (Daten)
es: Tamaño del volumen en Gi (Datos)
fr: Taille du volume en Gio (données)
it: Dimensioni del volume di Gi (dati)
ja: ボリュームのサイズ (Gi) (データ)。
ko: Gi 단위의 볼류 크기(데이터)
pt_br: Tamanho do volume em Gi (Dados).
ru: Размер тома в ГиБ (данные)
zh_hans: 以 Gi 为单位的卷大小(数据)
zh_hant: 以 Gi 表示的磁碟區大小 (資料)
