Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.miaaVersionError
source: Error getting SQL managed instance version number.
de: Fehler beim Abrufen der Versionsnummer der SQL Managed Instance.
pt_br: Erro ao obter o número da versão da instância gerenciada de SQL.
zh_hans: 获取 SQL 托管实例版本号时出错。
zh_hant: 取得 SQL 受控執行個體版本號碼時發生錯誤。

# arc.missingExtension
source: The {0} extension is required to view engine settings. Do you wish to install it now?
de: Die Erweiterung "{0}" ist zum Anzeigen der Engine-Einstellungen erforderlich. Möchten Sie sie jetzt installieren?
es: Se requiere la extensión {0} para ver la configuración del motor. ¿Quiere instalarlo ahora?
fr: L’extension {0} est obligatoire pour afficher les paramètres du moteur. Voulez-vous l’installer maintenant ?
it: L'estensione {0} è necessaria per visualizzare le impostazioni del motore. Installare adesso?
ja: エンジンの設定を表示するには、{0} 拡張機能が必要です。今すぐインストールしますか?
ko: 엔진 설정을 보려면 {0} 확장이 필요합니다. 지금 설치하시겠습니까?
pt_br: A extensão {0} é necessária para exibir as configurações do mecanismo. Deseja instalá-lo agora?
ru: Для просмотра параметров модуля требуется расширение {0}. Вы хотите установить его сейчас?
zh_hans: 需要 {0} 扩展才能查看引擎设置。是否要立即安装?
zh_hant: 需要 {0} 延伸模組才能檢視引擎設定。要立即安裝嗎?

# arc.monitor
source: Monitor
fr: Analyse
ja: モニター
ko: 모니터
ru: Монитор
zh_hans: 监视器
zh_hant: 監視

# arc.monitorUpgrade
source: You can check the status of the upgrade by running the following command:
de: Sie können den Status des Upgrades überprüfen, indem Sie den folgenden Befehl ausführen:
pt_br: Você pode verificar o status da atualização executando o seguinte comando:
zh_hans: 可以通过运行以下命令来检查升级的状态:
zh_hant: 您可以執行下列命令來檢查升級狀態:

# arc.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# arc.namespace
source: Namespace
es: Espacio de nombres
fr: Espace de noms
it: Spazio dei nomi
ja: 名前空間
ko: 네임스페이스
ru: Пространство имен
zh_hans: 命名空间
zh_hant: 命名空間

# arc.networking
source: Networking
de: Netzwerk
es: Redes
fr: Réseau
it: Rete
ja: ネットワーク
ko: 네트워킹
pt_br: Rede
ru: Сеть
zh_hans: 网络
zh_hant: 網路功能

# arc.newDatabase
source: New Database
de: Neue Datenbank
es: Nueva base de datos
fr: Nouvelle base de données
it: Nuovo database
ja: 新しいデータベース
ko: 새 데이터베이스
pt_br: Novo banco de dados
ru: Новая база данных
zh_hans: 新建数据库
zh_hant: 新增資料庫

# arc.newSupportRequest
source: New support request
de: Neue Supportanfrage
es: Nueva solicitud de soporte
fr: Nouvelle demande de support
it: Nuova richiesta di supporto
ja: 新しいサポート リクエスト
ko: 새 지원 요청
pt_br: Nova solicitação de suporte
ru: Новый запрос на поддержку
zh_hans: 新建支持请求
zh_hant: 新增支援要求

# arc.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# arc.noExtensions
source: No extensions listed in configuration.
de: In der Konfiguration sind keine Erweiterungen aufgeführt.
es: No hay ninguna extensión enumerada en la configuración.
fr: Aucune extension répertoriée dans la configuration.
it: Nessuna estensione elencata nella configurazione.
ja: 構成に拡張機能が一覧表示されていません。
ko: 구성에 나열된 확장이 없습니다.
pt_br: Nenhuma extensão listada na configuração.
ru: В конфигурации не перечислены расширения.
zh_hans: 配置中未列出任何扩展。
zh_hant: 設定中未列出任何延伸模組。

# arc.noExternalEndpoint
source: No External Endpoint has been configured so this information isn't available.
de: Es wurde kein externer Endpunkt konfiguriert, daher sind diese Informationen nicht verfügbar.
es: No se ha configurado ningún punto de conexión externo, por lo que esta información no está disponible.
fr: Aucun point de terminaison externe n’a été configuré, ce qui signifie que ces informations ne sont pas disponibles.
it: Nessun endpoint esterno configurato, quindi queste informazioni non sono disponibili.
ja: 外部エンドポイントが構成されていないため、この情報は使用できません。
ko: 외부 엔드포인트가 구성되지 않았으므로 이 정보를 사용할 수 없습니다.
pt_br: Nenhum ponto de extremidade externo foi configurado, por isso, essa informação não está disponível.
ru: Нет настроенных внешних конечных точек, поэтому эти сведения недоступны.
zh_hans: 尚未配置外部终结点，此信息不可用。
zh_hant: 未設定任何外部端點，因此無法使用此資訊。

# arc.noInstancesAvailable
source: No instances available
de: Keine Instanzen verfügbar
es: No hay instancias disponibles
fr: Aucune instance disponible
it: Nessuna istanza disponibile
ja: 使用可能なインスタンスがありません
ko: 인스턴스를 사용할 수 없음
pt_br: Não há nenhuma instância disponível
ru: Нет доступных экземпляров
zh_hans: 没有可用的实例
zh_hant: 沒有執行個體可用

# arc.noNodeParametersFound
source: No worker server parameters found...
de: Es wurden keine Workerserverparameter gefunden...
es: No se encontraron parámetros de servidor de trabajo...
fr: Aucun paramètre de serveur worker...
it: Non sono stati trovati parametri del server del ruolo di lavoro...
ja: ワーカー サーバー パラメーターが見つかりません...
ko: 작업자 서버 매개 변수를 찾을 수 없습니다...
pt_br: Não foi encontrado nenhum parâmetro do servidor de trabalho...
ru: Параметры сервера рабочих ролей не найдены…
zh_hans: 找不到工作器服务器参数...
zh_hant: 找不到背景工作伺服器參數...

# arc.noPodIssuesDetected
source: There aren’t any known issues affecting this PostgreSQL Hyperscale instance.
de: Es liegen keine bekannten Probleme vor, die sich auf diese PostgreSQL Hyperscale-Instanz auswirken.
es: No hay ningún problema conocido que afecte a esta instancia de hiperescala de PostgreSQL.
fr: Aucun problème connu n'affecte cette instance PostgreSQL Hyperscale.
it: Non ci sono problemi noti che interessano questa istanza di PostgreSQL Hyperscale.
ja: この PostgreSQL Hyperscale インスタンスに影響する既知の問題はありません。
ko: 이 PostgreSQL 하이퍼스케일 인스턴스에 영향을 주는 알려진 문제는 없습니다.
pt_br: Não há problemas conhecidos afetando essa instância de Hiperescala do PostgreSQL.
ru: Нет известных проблем, затрагивающих этот экземпляр гипермасштабирования PostgreSQL.
zh_hans: 没有任何影响此 PostgreSQL 超大规模实例的已知问题。
zh_hant: 沒有任何已知的問題會影響此 PostgreSQL 超大規模資料庫執行個體。

# arc.noUpgrades
source: The current version is the latest version. No upgrades available.
de: Die aktuelle Version ist die neueste Version. Keine Upgrades verfügbar.
pt_br: A versão atual é a versão mais recente. Não há atualizações disponíveis.
zh_hans: 当前版本是最新版本。没有可用的升级。
zh_hant: 目前的版本是最新版本。沒有可用的升級。

# arc.noWorkerPods
source: No worker pods in this configuration.
de: Diese Konfiguration enthält keine Worker-Pods.
es: No hay ningún pod de trabajo en esta configuración.
fr: Aucun pod Worker dans cette configuration.
it: Nessun pod di lavoro in questa configurazione.
ja: この構成にはワーカー ポッドがありません。
ko: 이 구성에는 작업자 Pod가 없습니다.
pt_br: Nenhum pod de trabalhador nesta configuração.
ru: В этой конфигурации нет рабочих экземпляров pod.
zh_hans: 此配置中没有辅助角色 Pod。
zh_hant: 此設定中沒有背景工作角色 Pod。

# arc.node
source: node
de: Knoten
es: nodo
fr: nœud
it: nodo
ja: ノード
ko: 노드
pt_br: nó
ru: узел
zh_hans: 节点
zh_hant: 節點

# arc.nodeConfiguration
source: Node configuration
de: Knotenkonfiguration
es: Configuración del nodo
fr: Configuration de nœud
it: Configurazione del nodo
ja: ノード構成
ko: 노드 구성
pt_br: Configuração do nó
ru: Конфигурация узла
zh_hans: 节点配置
zh_hant: 節點設定

# arc.nodes
source: nodes
de: Knoten
es: nodos
fr: nœuds
it: nodi
ja: ノード
ko: 노드
pt_br: nós
ru: узлы
zh_hans: 节点
zh_hant: 節點

# arc.notConfigured
source: Not Configured
de: Nicht konfiguriert
es: Sin configurar
fr: Non configuré
it: Non configurato
ja: 構成されていません
ko: 구성되지 않음
pt_br: Não Configurado
ru: Не настроено
zh_hans: 未配置
zh_hant: 未設定

# arc.notReady
source: Not Ready
de: Nicht bereit
es: No está listo
fr: Non prêt
it: Non pronto
ja: 準備ができていません
ko: 준비되지 않음
pt_br: Não está pronto
ru: Не готово
zh_hans: 未就绪
zh_hant: 未就緒

# arc.numVCore
source: {0} vCore
de: {0} virtueller Kern
es: {0} núcleo virtual
ja: {0} 個の仮想コア
ko: vCore {0}
ru: {0} виртуальное ядро
zh_hans: {0} 个 vCore
zh_hant: {0} 個 vCore

# arc.numVCores
source: {0} vCores
de: {0} virtuelle Kerne
es: {0} núcleos virtuales
it: {0} vCore
ja: {0} 個の仮想コア
ko: vCore {0}개
ru: Виртуальных ядер: {0}
zh_hans: {0} 个 vCore
zh_hant: {0} 個虛擬核心

# arc.numberOfIssuesDetected
source: • {0} ({1} issues)
de: • {0} ({1} Probleme)
es: • {0} ({1} problemas)
fr: • {0} (problèmes {1})
it: • {0} ({1} problemi)
ja: • {0} ({1} 件の問題)
ko: •{0} (문제 {1}개)
pt_br: • {0} (problemas {1})
ru: • {0} (проблем: {1})
zh_hans: • {0} ({1} 个问题)
zh_hant: • {0} ({1} 個問題)

# arc.off
source: Off
de: Aus
es: Desactivar
fr: Inactif
it: Disattivato
ja: オフ
ko: 끄기
pt_br: Desativado
ru: Выкл.
zh_hans: 关闭
zh_hant: 關閉

# arc.offline
source: Offline
es: Sin conexión
fr: Hors connexion
ja: オフライン
ko: 오프라인
ru: Вне сети
zh_hans: 脱机
zh_hant: 離線

# arc.ok
source: Ok
es: Aceptar
ko: 확인
ru: ОК
zh_hans: 确定
zh_hant: 確定

# arc.on
source: On
de: Ein
es: Activar
fr: Activé
it: Attivato
ja: オン
ko: 켜짐
pt_br: Ligar
ru: Вкл.
zh_hans: 开
zh_hant: 開啟

# arc.online
source: Online
es: En línea
fr: En ligne
ja: オンライン
ko: 온라인
ru: В Интернете
zh_hans: 联机
zh_hant: 上線

# arc.onlyNextImmediateVersion
source: Currently, only upgrading to the next immediate version is supported.
de: Derzeit werden nur Upgrades auf die nächsthöhere Version unterstützt.
pt_br: Atualmente, apenas a atualização para a próxima versão imediata é suportada.
zh_hans: 目前，仅支持升级到下一个即时版本。
zh_hant: 目前僅支援升級至下一個立即版本。

# arc.onlyNextImmediateVersionMiaa
source: The version of a SQL Managed Instance can not be newer than the version of its data controller. Currently, only upgrading to the next immediate version is supported.
de: Die Version einer SQL Managed Instance darf nicht neuer als die Version des Datencontrollers sein. Derzeit werden nur Upgrades auf die nächsthöhere Version unterstützt.
pt_br: A versão de uma Instância Gerenciada de SQL não pode ser mais recente que a versão de seu controlador de dados. Atualmente, apenas a atualização para a próxima versão imediata é suportada.
zh_hans: SQL 托管实例的版本不能高于其数据控制器的版本。目前，仅支持升级到下一个最近的版本。
zh_hant: SQL 受控執行個體的版本不能比其資料控制器的版本新。目前只支援升級至下一個立即版本。

# arc.openDashboardFailed
source: Error opening dashboard. {0}
de: Fehler beim Öffnen des Dashboards. {0}
es: Error al abrir el panel. {0}
fr: Erreur lors de l’ouverture du tableau de bord. {0}
it: Errore durante l'apertura del dashboard. {0}
ja: ダッシュボードを開く際のエラー。 {0}
ko: 대시보드를 여는 동안 오류가 발생했습니다. {0}
pt_br: Ocorreu um erro ao abrir o painel. {0}
ru: Ошибка при открытии панели мониторинга. {0}
zh_hans: 打开仪表板时出错。{0}
zh_hant: 開啟儀表板時發生錯誤。{0}

# arc.openInAzurePortal
source: Open in Azure Portal
de: In Azure-Portal öffnen
es: Abrir en Azure Portal
fr: Ouvrir dans le portail Azure
it: Apri nel portale di Azure
ja: Azure Portal で開きます
ko: Azure Portal에서 열기
pt_br: Abrir no Portal do Azure
ru: Открыть на портале Azure
zh_hans: 在 Azure 门户中打开
zh_hant: 在 Azure 入口網站中開啟

# arc.overview
source: Overview
de: Übersicht
es: Información general
fr: Vue d'ensemble
it: Panoramica
ja: 概要
ko: 개요
pt_br: Visão geral
ru: Обзор
zh_hans: 概述
zh_hant: 概觀

# arc.pageDiscardFailed
source: Failed to discard user input. {0}
de: Fehler beim Verwerfen der Benutzereingabe. {0}
es: No se pudo descartar la entrada del usuario. {0}
fr: Échec de l’abandon de l’entrée utilisateur. {0}
it: Non è stato possibile rimuovere l'input dell'utente. {0}
ja: ユーザー入力を破棄できませんでした。{0}
ko: 사용자 입력을 삭제하지 못했습니다. {0}
pt_br: Ocorreu um erro ao descartar a entrada do usuário. {0}
ru: Не удалось отменить ввод пользователя. {0}
zh_hans: 未能放弃用户输入。{0}
zh_hant: 無法捨棄使用者輸入。{0}

# arc.parameterName
source: Parameter Name
es: Nombre de parámetro
fr: Nom du paramètre
it: Nome parametro
ja: パラメーター名
ko: 매개 변수 이름
pt_br: Nome do parâmetro
ru: Имя параметра
zh_hans: 参数名
zh_hant: 參數名稱

# arc.password
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# arc.passwordAcquisitionFailed
source: Failed to acquire password. {0}
de: Fehler beim Abrufen des Kennworts. {0}
es: No se pudo adquirir la contraseña. {0}
fr: Échec de l’acquisition du mot de passe. {0}
it: Non è stato possibile acquisire la password. {0}
ja: パスワードを取得できませんでした。{0}
ko: 암호를 가져오지 못했습니다. {0}
pt_br: Falha ao adquirir a senha. {0}
ru: Не удалось получить пароль. {0}
zh_hans: 未能获取密码。{0}
zh_hant: 無法取得密碼。{0}

# arc.passwordReset
source: Password reset successfully
de: Kennwortzurücksetzung erfolgreich
es: Contraseña restablecida correctamente
fr: Réinitialisation réussie du mot de passe
it: Reimpostazione della password completata
ja: パスワードのリセットに成功しました
ko: 암호 재설정 성공
pt_br: A redefinição de senha foi bem-sucedida
ru: Пароль успешно сброшен
zh_hans: 已成功重置密码
zh_hant: 密碼重設成功

# arc.passwordResetFailed
source: Failed to reset password. {0}
de: Fehler beim Zurücksetzen des Kennworts. {0}
es: No se pudo restablecer la contraseña. {0}
fr: Échec de réinitialisation du mot de passe. {0}
it: Non è possibile ripristinare la password. {0}
ja: パスワードをリセットできませんでした。{0}
ko: 암호를 다시 설정하지 못했습니다. {0}
pt_br: Falha ao redefinir senha. {0}
ru: Не удалось сбросить пароль. {0}
zh_hans: 未能重置密码。{0}
zh_hant: 無法重設密碼。{0}

# arc.passwordToController
source: Provide Password to Controller
de: Kennwort für Controller angeben
es: Proporcionar contraseña al controlador
fr: Fournir le mot de passe au contrôleur
it: Fornire la password al titolare
ja: コントローラーにパスワードを指定する
ko: 컨트롤러에 암호 제공
pt_br: Fornecer a senha ao controlador
ru: Укажите пароль для контроллера
zh_hans: 向控制器提供密码
zh_hant: 為控制器提供密碼

# arc.pending
source: Pending
de: Ausstehend
es: Pendiente
fr: En attente
it: In sospeso
ja: 保留中
ko: 보류 중
pt_br: Pendente
ru: Ожидание
zh_hans: 挂起
zh_hant: 擱置中

# arc.pgConnectionRequired
source: A connection is required to show and set database engine settings.
de: Zum Anzeigen und Festlegen der Datenbankmodul-Einstellungen ist eine Verbindung erforderlich.
es: Se necesita una conexión para mostrar y establecer la configuración del motor de base de datos.
fr: Une connexion est requise pour afficher et définir les paramètres du moteur de base de données.
it: Per visualizzare e impostare le impostazioni del motore di database, è necessaria una connessione.
ja: データベース エンジンの設定を表示および設定するには接続する必要があります。
ko: 데이터베이스 엔진 설정을 표시하고 설정하려면 연결이 필요합니다.
pt_br: É necessária uma conexão para mostrar e definir as configurações do mecanismo do banco de dados.
ru: Для отображения и настройки параметров ядра СУБД требуется подключение.
zh_hans: 需要连接才能显示和设置数据库引擎设置。
zh_hant: 需要連線才能顯示及設定資料庫引擎設定。

# arc.pgSqlType
source: PostgreSQL Hyperscale - Azure Arc
es: Hiperescala de PostgreSQL: Azure Arc
ko: PostgreSQL 하이퍼스케일 - Azure Arc
pt_br: Hiperescala do PostgreSQL – Azure Arc
ru: Гипермасштабирование PostgreSQL — Azure Arc
zh_hans: PostgreSQL 超大规模 - Azure Arc
zh_hant: PostgreSQL 超大規模資料庫 - Azure Arc

# arc.pitr
source: Point in time restore
de: Zeitpunktwiederherstellung
ko: 지정 시간 복원
pt_br: Restauração pontual
zh_hans: 时点还原
zh_hant: 還原時間點

# arc.pitrInfo
source: Specify how long you want to keep your point-in-time backups. Customize this for backup availability.
de: Geben Sie an, wie lange Ihre Point-in-Time-Sicherungen beibehalten werden sollen. Passen Sie dies für Sicherungsverfügbarkeit an.
ko: 특정 시점 백업을 유지할 기간을 지정합니다. 백업 가용성을 위해 이를 사용자 지정합니다.
pt_br: Especifique por quanto tempo você deseja manter seus backups point-in-time. Personalize isso para disponibilidade de backup.
zh_hans: 指定要保留时点备份的时长。可按备份可用性自定义此项。
zh_hant: 指定您想要保留時間點備份的時間。自訂此備份可用性。

# arc.podConditionsTable
source: Pod conditions table
de: Tabelle mit Podbedingungen
es: Tabla de condiciones del pod
fr: Tableau des conditions de pod
it: Tabella condizioni Pod
ja: ポッド条件テーブル
ko: Pod 조건 테이블
pt_br: Tabela de condições Pod
ru: Таблица условий pod
zh_hans: Pod 条件表
zh_hant: Pod 條件表格

# arc.podInitialized
source: Pod is initialized.
de: Pod wurde initialisiert.
es: Se ha inicializado el pod.
fr: Le pod est initialisé.
it: Il pod è stato inizializzato.
ja: ポッドが初期化されました。
ko: Pod가 초기화됩니다.
pt_br: O pod foi inicializado.
ru: Объект pod инициализирован.
zh_hans: Pod 已初始化。
zh_hant: 已初始化 Pod。

# arc.podIssuesDetected
source: The pods listed below are experiencing issues that may affect performance or availability.
de: In den nachstehend aufgeführten Pods treten Probleme auf, die sich auf die Leistung oder die Verfügbarkeit auswirken können.
es: Los pods que se indican a continuación están experimentando problemas que pueden afectar al rendimiento o a la disponibilidad.
fr: Les pods répertoriés ci-dessous rencontrent des problèmes susceptibles d'affecter les performances ou la disponibilité.
it: I pod indicati di seguito stanno riscontrando problemi che potrebbero influire sulle prestazioni o sulla disponibilità.
ja: 以下のポッドでは、パフォーマンスや可用性に影響を与える可能性のある問題が発生しています。
ko: 아래에 나열된 Pod에는 성능 또는 가용성에 영향을 줄 수 있는 문제가 있습니다.
pt_br: Os pods listados abaixo estão enfrentando problemas que podem afetar o desempenho ou a disponibilidade.
ru: В указанных ниже объектах pod возникли проблемы, которые могут повлиять на производительность или доступность.
zh_hans: 下面列出的 Pod 遇到可能会影响性能或可用性的问题。
zh_hant: 以下所列的 pod 出現可能會影響效能或可用性的問題。

# arc.podReady
source: Pod is ready.
de: Pod ist bereit.
es: El pod está listo.
fr: Le pod est prêt.
it: Il pod è pronto.
ja: ポッドの準備ができました。
ko: Pod가 준비되었습니다.
pt_br: O pod está pronto.
ru: Объект pod готов.
zh_hans: Pod 已准备就绪。
zh_hant: Pod 已就緒。

# arc.podScheduled
source: Pod is schedulable.
de: Pod ist planbar.
es: El pod es programable.
fr: Le pod est programmable.
it: Il pod è programmabile.
ja: ポッドがスケジュール可能です。
ko: Pod를 예약할 수 있습니다.
pt_br: O pod é agendável.
ru: Объект pod может быть добавлен в расписание.
zh_hans: Pod 是可计划的。
zh_hant: Pod 是可排程的。

# arc.podsPresent
source: Pods Present
de: Vorhandene Pods
es: Pods presentes
fr: Pods présents
it: Pod presenti
ja: 存在するポッド
ko: Pod 있음
pt_br: Pods Presentes
ru: Число имеющихся объектов pod
zh_hans: 存在 Pod
zh_hant: Pod 存在

# arc.podsReady
source: pods ready
de: Bereite Pods
es: pods listos
fr: pods prêts
it: pod pronti
ja: 準備完了ポッド
ko: Pod 준비
pt_br: pods prontos
ru: объекты pod готовы
zh_hans: Pod 已就绪
zh_hant: 已就緒的 Pod

# arc.podsUsedDescription
source: Select a pod in the dropdown below for detailed health information.
de: Wählen Sie in der Dropdownliste unten einen Pod für detaillierte Integritätsinformationen aus.
es: Seleccione un pod en la lista desplegable para obtener información de estado detallada.
fr: Sélectionnez un pod dans la liste déroulante ci-dessous pour obtenir des informations détaillées sur l’intégrité.
it: Selezionare un pod nell'elenco a discesa seguente per informazioni dettagliate sull'integrità.
ja: 正常性情報の詳細を参照するには、下のドロップダウンリストからポッドを選択してください。
ko: 자세한 상태 정보를 보려면 아래 드롭다운에서 Pod를 선택합니다.
pt_br: Selecione um pod na lista suspensa abaixo para obter informações detalhadas sobre a integridade.
ru: Выберите pod в раскрывающемся списке ниже, чтобы получить подробные сведения о работоспособности.
zh_hans: 请在下面的下拉列表中选择一个 Pod，以获取详细的运行状况信息。
zh_hant: 請在下方的下拉式清單中選取 Pod，以取得詳細的健康情況資訊。

# arc.podsUsedDescriptionAria
source: Select a pod in the dropdown below for detailed health information
de: Wählen Sie in der Dropdownliste unten einen Pod für detaillierte Integritätsinformationen aus
es: Seleccione un pod en la lista desplegable para obtener información detallada sobre el estado.
fr: Sélectionnez un pod dans la liste déroulante ci-dessous pour obtenir des informations détaillées sur l’intégrité
it: Selezionare un pod nell'elenco a discesa seguente per informazioni dettagliate sull'integrità
ja: 正常性情報の詳細を参照するには、下のドロップダウンリストからポッドを選択してください
ko: 자세한 상태 정보를 보려면 아래 드롭다운에서 Pod를 선택합니다.
pt_br: Selecionar uma cápsula no menu suspenso abaixo para informação detalhada sobre integridade
ru: Выберите pod в раскрывающемся списке ниже, чтобы получить подробные сведения о работоспособности
zh_hans: 请在下面的下拉列表中选择一个 Pod，以获取详细的运行状况信息
zh_hant: 請在下方的下拉式清單中選取 Pod，以取得詳細的健康情況資訊

# arc.postgres.computeAndStorageDescriptionPartTwo
source: PostgreSQL Hyperscale server group by
de: PostgreSQL Hyperscale-Servergruppe nach
es: Grupo de servidores de hiperescala de PostgreSQL por
fr: Groupe de serveurs PostgreSQL Hyperscale par
it: Gruppo di server PostgreSQL Hyperscale di
ja: PostgreSQL Hyperscale サーバー グループで
ko: PostgreSQL 하이퍼스케일 서버 그룹 기준
pt_br: Grupo de servidores de Hiperescala do PostgreSQL por
ru: Группирование серверов гипермасштабирования PostgreSQL по
zh_hans: PostgreSQL 超大规模服务器组依据
zh_hant: PostgreSQL 超大規模資料庫伺服器群組依據

# arc.postgresAdminUsername
source: Admin username
de: Administratorbenutzername
es: Nombre de usuario del administrador
fr: Nom d'utilisateur de l'administrateur
it: Nome utente dell'amministratore
ja: 管理者ユーザー名
ko: 관리자 사용자 이름
pt_br: Nome do usuário administrador
ru: Имя администратора
zh_hans: 管理员用户名
zh_hant: 系統管理員使用者名稱

# arc.postgresArcProductName
source: Azure Database for PostgreSQL - Azure Arc
fr: Azure Database pour PostgreSQL - Azure Arc
it: Database di Azure per PostgreSQL - Azure Arc
pt_br: Banco de Dados do Azure para PostgreSQL – Azure Arc
ru: База данных Azure для PostgreSQL — Azure Arc
zh_hant: 適用於 PostgreSQL 的 Azure 資料庫 - Azure Arc

# arc.postgresComputeAndStorageDescriptionPartOne
source: You can scale your Azure Arc-enabled
de: Sie können die Funktion "mit Azure Arc-Unterstützung" skalieren
es: Puede escalar Azure Arc: habilitado
fr: Vous pouvez mettre à l’échelle votre Azure Arc
it: È possibile ridimensionare l'Azure Arc abilitato
ja: Azure Arc に対応した拡張ができます
ko: Azure Arc 지원의 크기를 조정할 수 있습니다.
pt_br: Você pode dimensionar seu Azure Arc habilitado
ru: Вы можете масштабировать поддерживающий Azure Arc…
zh_hans: 可以缩放已启用的 Azure Arc
zh_hant: 您可以調整已啟用的 Azure Arc 規模

# arc.postgresDashboard
source: PostgreSQL Hyperscale - Azure Arc Dashboard - {0}
de: PostgreSQL Hyperscale – Azure Arc-Dashboard (Vorschau) – {0}
pt_br: Hiperescala PostgreSQL - Painel do Azure Arc - {0}
zh_hans: PostgreSQL 超大规模 - Azure Arc 仪表板 - {0}
zh_hant: PostgreSQL 超大規模資料庫 - Azure Arc 儀表板 - {0}

# arc.postgresVersion
source: PostgreSQL version
es: Versión de PostgreSQL
fr: Version de PostgreSQL
it: Versione di PostgreSQL
ja: PostgreSQL のバージョン
ko: PostgreSQL 버전
pt_br: Versão do PostgreSQL
ru: Версия PostgreSQL
zh_hans: PostgreSQL 版本
zh_hant: PostgreSQL 版本

# arc.preloaded Extensions
source: Preloaded Extensions
de: Im Voraus geladene Erweiterungen
es: Extensiones cargadas
fr: Extensions préchargées
it: Estensioni precaricate
ja: 事前読み込みの拡張機能
ko: 미리 로드된 확장
pt_br: Extensões pré-carregadas
ru: Предварительно загруженные расширения
zh_hans: 预加载的扩展
zh_hant: 預先載入的延伸模組

# arc.projectDetails
source: Project Details
de: Projektdetails
ko: 프로젝트 세부 정보
pt_br: Detalhes do projeto
zh_hans: 项目详细信息
zh_hant: 專案詳細資料

# arc.projectDetailsText
source: Select the subscription to manage deployed resources. Use resource groups like folders to organize and manage all your resources.
de: Wählen Sie das Abonnement aus, um bereitgestellte Ressourcen und Kosten zu verwalten. Verwenden Sie Ressourcengruppen wie z. B. Ordner, um alle Ihre Ressourcen zu organisieren und zu verwalten.
ko: 배포된 리소스를 관리할 구독을 선택합니다. 폴더와 같은 리소스 그룹을 사용하여 모든 리소스를 구성하고 관리합니다.
pt_br: Selecione a assinatura para gerenciar recursos implantados. Use grupos de recursos como pastas para organizar e gerenciar todos os seus recursos.
zh_hans: 选择订阅以管理已部署的资源。使用资源组(如文件夹)来整理和管理所有资源。
zh_hant: 請選取訂閱，以管理已部署資源。您可以使用資源群組 (例如資料夾) 整理及管理您的所有資源。

# arc.properties
source: Properties
de: Eigenschaften
es: Propiedades
fr: Propriétés
it: Proprietà
ja: プロパティ
ko: 속성
pt_br: Propriedades
ru: Свойства
zh_hans: 属性
zh_hant: 屬性

# arc.rangeSetting
source: Value is expected to be in the range {0} - {1}
de: Es wird erwartet, dass der Wert im Bereich {0}–{1} liegt
es: Se espera que el valor esté en el intervalo {0} - {1}
fr: La valeur doit être comprise dans la plage {0} - {1}
it: Il valore dovrebbe essere compreso nell'intervallo {0} - {1}
ja: 値は {0} から {1} の範囲内である必要があります
ko: 값이 {0}-{1} 범위에 있어야 합니다.
pt_br: Espera-se que o valor esteja no intervalo {0} - {1}
ru: Значение должно находиться в диапазоне от {0} до {1}
zh_hans: 值应位于 {0} - {1} 范围内
zh_hant: 值應在 {0} - {1} 的範圍內

# arc.ready
source: Ready
de: Bereit
es: Listo
fr: Prêt
it: Pronto
ja: 準備完了
ko: 준비
pt_br: Pronto
ru: Готово
zh_hans: 准备就绪
zh_hant: 就緒
