Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.data.controller.project.details.description
source: Select the subscription to manage deployed resources and costs. Use resource groups like folders to organize and manage all your resources.
de: Wählen Sie das Abonnement aus, um bereitgestellte Ressourcen und Kosten zu verwalten. Verwenden Sie Ressourcengruppen wie z. B. Ordner, um all Ihre Ressourcen zu organisieren und zu verwalten.
es: Seleccione la suscripción para administrar los recursos y costos implementados. Use grupos de recursos como carpetas para organizar y administrar todos los recursos.
fr: Sélectionnez l'abonnement pour gérer les ressources déployées et les coûts. Utilisez des groupes de ressources comme des dossiers pour organiser et gérer toutes vos ressources.
it: Selezionare la sottoscrizione per gestire le risorse distribuite e i costi. Usare i gruppi di risorse come le cartelle per organizzare e gestire tutte le risorse.
ja: サブスクリプションを選択して、デプロイ済みのリソースとコストを管理します。フォルダーなどのリソース グループを使用して、すべてのリソースを整理して管理します。
ko: 배포된 리소스 및 비용을 관리할 구독을 선택합니다. 폴더와 같은 리소스 그룹을 사용하여 모든 리소스를 구성하고 관리합니다.
pt_br: Selecione a assinatura para gerenciar os recursos e os custos implantados. Use grupos de recursos como pastas para organizar e gerenciar todos os seus recursos.
ru: Выберите подписку для управления развернутыми ресурсами и затратами. Используйте группы ресурсов, такие как папки, для организации всех ресурсов и управления ими.
zh_hans: 选择订阅以管理已部署的资源和成本。使用资源组(如文件夹)来整理和管理所有资源。
zh_hant: 請選取訂閱，以管理部署的資源與費用。您可以使用資源群組 (例如資料夾) 整理及管理您的所有資源。

# arc.data.controller.project.details.title
source: Azure details
es: Detalles de Azure
fr: Détails Azure
it: Dettagli su Azure
ja: Azure の詳細
ko: Azure 세부 정보
pt_br: Detalhes do Azure
ru: Сведения об Azure
zh_hans: Azure 详细信息
zh_hant: Azure 詳細資料

# arc.data.controller.readmore
source: Read more
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Leia mais
ru: Дополнительные сведения
zh_hans: 阅读更多信息
zh_hant: 深入了解

# arc.data.controller.select.cluster.title
source: Select from existing Kubernetes clusters
de: Aus vorhandenen Kubernetes-Clustern auswählen
es: Seleccionar de los clústeres de Kubernetes existentes
fr: Sélectionner des clusters Kubernetes existants
it: Selezionare da cluster Kubernetes esistenti
ja: 既存の Kubernetes クラスターから選択する
ko: 기존 Kubernetes 클러스터에서 선택
pt_br: Selecione um dos clusters Kubernetes existentes
ru: Выбор из существующих кластеров Kubernetes
zh_hans: 从现有 Kubernetes 群集中选择
zh_hant: 從現有的 Kubernetes 叢集選取

# arc.data.controller.summary.arc.by.microsoft
source: by Microsoft
de: von Microsoft
es: de Microsoft
fr: par Microsoft
it: di Microsoft
ja: Microsoft 提供
ko: Microsoft 제공
pt_br: pela Microsoft
ru: от Майкрософт
zh_hans: 由 Microsoft 提供
zh_hant: 由 Microsoft 提供

# arc.data.controller.summary.arc.data.controller
source: Azure Arc data controller
de: Azure Arc-Datencontroller
es: Controlador de datos de Azure Arc
fr: Contrôleur de données Azure Arc
it: Controller dei dati di Azure Arc
ja: Azure Arc データ コントローラー
ko: Azure Arc 데이터 컨트롤러
pt_br: Controlador de dados do Azure Arc
ru: Контроллер данных Azure Arc
zh_hans: Azure Arc 数据控制器
zh_hant: Azure Arc 資料控制器

# arc.data.controller.summary.arc.terms.of.use
source: Terms of use
de: Nutzungsbedingungen
es: Términos de uso
fr: Conditions d’utilisation
it: Condizioni per l'utilizzo
ja: 使用条件
ko: 사용 약관
pt_br: Termos de uso
ru: Условия использования
zh_hans: 使用条款
zh_hant: 使用規定

# arc.data.controller.summary.arc.terms.privacy.policy
source: Privacy policy
de: Datenschutzrichtlinien
es: Directiva de privacidad
fr: Politique de confidentialité
it: Informativa sulla privacy
ja: プライバシー ポリシー
ko: 개인정보처리방침
pt_br: Política de privacidade
ru: Политика конфиденциальности
zh_hans: 隐私策略
zh_hant: 隱私權原則

# arc.data.controller.summary.cluster.context
source: Cluster context
de: Clusterkontext
es: Contexto del clúster
fr: Contexte de cluster
it: Contesto del cluster
ja: クラスター コンテキスト
ko: 클러스터 컨텍스트
pt_br: Contexto de cluster
ru: Контекст кластера
zh_hans: 群集上下文
zh_hant: 叢集內容

# arc.data.controller.summary.cluster.name
source: Cluster name
pt_br: Nome do cluster
zh_hans: 群集名称
zh_hant: 叢集名稱

# arc.data.controller.summary.controller
source: Controller
es: Controlador
fr: Contrôleur
ja: コントローラー
ko: 컨트롤러
pt_br: Controlador
ru: Контроллер
zh_hans: 控制器
zh_hant: 控制器

# arc.data.controller.summary.data.controller.custom.location
source: Data controller custom location
de: Benutzerdefinierter Speicherort des Datencontrollers
pt_br: Localização personalizada do controlador de dados
zh_hans: 数据控制器自定义位置
zh_hant: 資料控制器自訂位置

# arc.data.controller.summary.data.controller.infrastructure
source: Data controller infrastructure
de: Datencontrollerinfrastruktur
es: Infraestructura del controlador de datos
fr: Infrastructure du contrôleur de données
it: Infrastruttura del titolare del trattamento
ja: データ コントローラー インフラストラクチャ
ko: 데이터 컨트롤러 인프라
pt_br: Infraestrutura do controlador de dados
ru: Инфраструктура контроллера данных
zh_hans: 数据控制器基础结构
zh_hant: 料控制器基礎結構

# arc.data.controller.summary.data.controller.name
source: Data controller name
de: Name des Datencontrollers
es: Nombre del controlador de datos
fr: Nom du contrôleur de données
it: Nome del controller dei dati
ja: データ コントローラー名
ko: 데이터 컨트롤러 이름
pt_br: Nome do controlador de dados
ru: Имя контроллера данных
zh_hans: 数据控制器名称
zh_hant: 資料控制器名稱

# arc.data.controller.summary.data.controller.namespace
source: Data controller namespace
de: Namespace des Datencontrollers
es: Espacio de nombres del controlador de datos
fr: Espace de noms du contrôleur de données
it: Spazio dei nomi del controller dei dati
ja: データ コントローラー名前空間
ko: 데이터 컨트롤러 네임스페이스
pt_br: Namespace do controlador de dados
ru: Пространство имен контроллера данных
zh_hans: 数据控制器命名空间
zh_hant: 資料控制器命名空間

# arc.data.controller.summary.estimated.cost.per.month
source: Estimated cost per month
de: Geschätzte Kosten pro Monat
es: Costo estimado al mes
fr: Coût estimé par mois
it: Costo stimato al mese
ja: 月ごとの推定コスト
ko: 월별 예상 비용
pt_br: Custo estimado por mês
ru: Примерная стоимость в месяц
zh_hans: 每月估计成本
zh_hant: 每月預估費用

# arc.data.controller.summary.free
source: Free
es: Gratis
fr: Gratuit
it: Gratuito
ja: 無料
ko: 무료
pt_br: Gratuito
ru: Бесплатно
zh_hans: 免费
zh_hant: 免費

# arc.data.controller.summary.kube.config.file.path
source: Kube config file path
de: Pfad der kube-Konfigurationsdatei
es: Ruta de acceso al archivo de configuración de Kube
fr: Chemin du fichier de configuration Kube
it: Percorso del file di configurazione kube
ja: Kube 構成のファイル パス
ko: Kube 구성 파일 경로
pt_br: Caminho do arquivo de configuração de Kube
ru: Путь к файлу kube config
zh_hans: Kube 配置文件路径
zh_hant: Kube 設定檔路徑

# arc.data.controller.summary.location
source: Location
de: Standort
es: Ubicación
fr: Emplacement
it: Percorso
ja: 場所
ko: 위치
pt_br: Local
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# arc.data.controller.summary.profile
source: Config profile
de: Konfigurationsprofil
es: Perfil de configuración
fr: Profil de configuration
it: Profilo di configurazione
ja: 構成プロファイル
ko: 구성 프로필
pt_br: Perfil de configuração
ru: Профиль конфигурации
zh_hans: 配置文件
zh_hant: 設定檔

# arc.data.controller.summary.resource.group
source: Resource group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# arc.data.controller.summary.subscription
source: Subscription
de: Abonnement
es: Suscripción
fr: Abonnement
it: Sottoscrizione
ja: サブスクリプション
ko: 구독
pt_br: Assinatura
ru: Подписка
zh_hans: 订阅
zh_hant: 訂用帳戶

# arc.data.controller.summary.terms
source: Terms
de: Bestimmungen
es: Términos
fr: Conditions
it: Condizioni
ja: 使用条件
ko: 사용 약관
pt_br: Termos
ru: Условия
zh_hans: 条款
zh_hant: 條款

# arc.data.controller.summary.terms.description
source: By clicking 'Script to notebook', I (a) agree to the legal terms and privacy statement(s) associated with the Marketplace offering(s) listed above; (b) authorize Microsoft to bill my current payment method for the fees associated with the offering(s), with the same billing frequency as my Azure subscription; and (c) agree that Microsoft may share my contact, usage and transactional information with the provider(s) of the offering(s) for support, billing and other transactional activities. Microsoft does not provide rights for third-party offerings. For additional details see {0}.
de: Durch Klicken auf "Skript in Notebook schreiben" (a) stimme ich den mit den oben genannten Marketplace-Angeboten verbundenen rechtlichen Bedingungen und Datenschutzbestimmungen zu, (b) ermächtige ich Microsoft, mir die Gebühren für die Angebote über meine aktuelle Zahlungsmethode und gemäß Fakturierungsintervall für mein Azure-Abonnement in Rechnung zu stellen, und (c) erkläre ich mich damit einverstanden, dass Microsoft meine Kontakt-, Nutzungs- und Transaktionsdaten an die Anbieter der von mir genutzten Produkte oder Dienste für Support-, Abrechnungs- und andere Transaktionsaktivitäten weitergeben darf. Microsoft gewährt keine Rechte für Drittanbieterprodukte oder -dienste. Weitere Informationen finden Sie hier: {0}.
es: Al hacer clic en "De script a cuaderno", (a) acepto los términos legales y las declaraciones de privacidad asociados a cada oferta de Marketplace enumerada previamente; (b) autorizo a Microsoft a facturar, de acuerdo con mi método de pago actual, las cuotas relativas a las ofertas con la misma frecuencia de facturación que mi suscripción de Azure; y (c) autorizo a Microsoft a compartir mi información de contacto y los datos de transacción y uso con los proveedores de dichas ofertas para fines de soporte técnico, facturación y otras actividades transaccionales. Microsoft no proporciona derechos sobre ofertas de terceros. Para más información, consulte {0}.
fr: En cliquant sur « Exécuter un script sur un bloc-notes », (a) j'accepte les conditions légales et les déclarations de confidentialité associées aux offres de la Place de marché indiquées ci-dessus, (b) j'autorise Microsoft à facturer selon mon mode de paiement actuel les frais associés aux offres, avec la même fréquence de facturation que mon abonnement Azure et (c) j'accepte que Microsoft puisse partager mes informations de contact et celles relatives à mon utilisation et à mes transactions avec les fournisseurs des offres dans le cadre du support, de la facturation et d'autres activités liées aux transactions. Microsoft ne fournit pas de droits pour les produits tiers. Pour plus d'informations, consultez {0}.
it: Facendo clic su "Genera script nel notebook", dichiaro di (a) accettare le note legali e le informative sulla privacy associate alle offerte del Marketplace elencate sopra, (b) autorizzare Microsoft a fatturare le spese associate alle offerte sul metodo di pagamento corrente con la stessa frequenza di fatturazione della sottoscrizione di Azure e (c) accettare che Microsoft possa condividere le mie informazioni sul contatto, sulle transazioni e sull'utilizzo con i fornitori delle offerte ai fini del supporto, della fatturazione e di altre attività relative alle transazioni. Microsoft non concede i diritti per le offerte di terze parti. Per informazioni aggiuntive, vedere {0}.
ja: [ノートブックへのスクリプト] をクリックすることで、お客様は (a) 上記の Marketplace のオファリングに関連する法律条項とプライバシーに関する声明に同意し、(b) Microsoft がそのオファリングに関連する料金を現在の支払い方法で Azure サブスクリプションと同じ請求頻度で請求することを認め、かつ、(c) Microsoft がお客様の連絡先、使用量および取引に関する情報を、サポート、請求、その他の取引上のアクティビティを目的として、オファリングのプロバイダーと共有する可能性があることに同意します。Microsoft は、サード パーティのオファリングに対する権利は提供しません。その他の詳細については、{0} を参照してください。
ko: "전자 필기장으로 스크립트"를 클릭함으로써 (a) 위에 열거된 해당 Marketplace 제품 및 서비스와 관련된 약관 및 개인정보처리방침에 동의하고, (b) Microsoft가 현재 결제 방법으로 제품 및 서비스와 관련된 요금을 Azure 구독과 동일한 대금 청구 주기로 청구하도록 권한을 부여하는 데 동의합니다. 또한 (c) Microsoft가 지원, 청구 및 기타 거래 활동을 목적으로 연락처, 사용량 그리고 거래 정보를 제품 및 서비스 공급자와 공유할 수 있다는 데 동의합니다. Microsoft는 타사 제품 및 서비스에 대한 권리를 제공하지 않습니다. 자세한 내용은 {0}를 참조하세요.
pt_br: Ao clicar em "Script para bloco de anotações", eu (a) concordo com os termos legais e as políticas de privacidade associados às ofertas do Marketplace listadas acima; (b) autorizo a Microsoft a cobrar as taxas associadas às ofertas na minha forma de pagamento atual, com a mesma frequência de cobrança da minha assinatura do Azure; e (c) concordo que a Microsoft compartilhe as minhas informações de contato, de uso e de transações com os provedores das ofertas para fins de suporte, cobrança e outras atividades transacionais. A Microsoft não fornece direitos para ofertas de terceiros. Para obter mais detalhes, confira{0}
ru: Нажимая кнопку "Сохранить скрипт в записную книжку", я (а) соглашаюсь с юридическими условиями и заявлениями о конфиденциальности, связанными с вышеуказанными предложениями Marketplace; (б) разрешаю корпорации Майкрософт выставлять мне счета по сборам, связанным с этими предложениями, с использованием моего текущего метода оплаты и с той же периодичностью, что и для моей подписки Azure; (в) соглашаюсь, что корпорация Майкрософт имеет право передавать мои контактные данные, а также сведения об использовании и транзакциях поставщикам предложений для целей предоставления поддержки, выставления счетов и других действий с транзакциями. Корпорация Майкрософт не предоставляет права на сторонние предложения. Дополнительные сведения см. в {0}.
zh_hans: 单击“脚本到笔记本”即表示本人: (a) 同意与上面列出的一项或多项市场产品/服务关联的法律条款和一条或多条隐私声明；(b) 授权 Microsoft 按与我的 Azure 订阅相同的账单频率，以我当前的付款方式向我收取使用这项或这些产品/服务所产生的费用；以及 (c) 同意 Microsoft 与这项或这些产品/服务的一个或多个提供商共享我的联系信息、使用情况和交易信息，用于支持、计费和其他交易活动。Microsoft 不提供针对第三方产品/服务的权利。有关其他详细信息，请参阅 {0}
zh_hant: 按一下 [編寫指令碼到筆記本] 表示我 (a) 同意上述 Marketplace 供應項目的相關法律條款及隱私權聲明; (b) 授權 Microsoft 使用我目前的付款方式，收取供應項目的相關費用，帳單週期與我的 Azure 訂閱相同; 並 (c) 同意 Microsoft 可以將我的連絡資料、使用方式及交易資訊，提供給供應項目的提供者，供支援、帳單及其他交易活動之用。Microsoft 不提供第三方供應項目的權利。如需其他詳細資料，請參閱 {0}。

# arc.data.controller.summary.terms.link.text
source: Azure Marketplace Terms
de: Azure Marketplace-Nutzungsbedingungen
es: Términos de Azure Marketplace
fr: Conditions de la Place de marché Azure
it: Condizioni di Azure Marketplace
ja: Azure Marketplace の使用条件
ko: Azure Marketplace 약관
pt_br: Termos do Azure Marketplace
ru: Условия Azure Marketplace
zh_hans: Azure 市场条款
zh_hant: Azure Marketplace 條款

# arc.data.controller.summary.username
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# arc.description
source: Support for Azure Arc
de: Unterstützung für Azure Arc
es: Compatibilidad con Azure Arc
fr: Prise en charge d’Azure Arc
it: Supporto per Azure Arc
ja: Azure Arc 対応
ko: Azure Arc 지원
pt_br: Suporte para Azure Arc
ru: Поддержка Azure Arc
zh_hans: 支持 Azure Arc
zh_hant: 支援 Azure Arc

# arc.memory-limit.label
source: Memory Limit
de: Speicherlimit
es: Límite de memoria
fr: Limite de mémoire
it: Limite memoria
ja: メモリの制限
ko: 메모리 제한
pt_br: Limite de Memória
ru: Предельный объем памяти
zh_hans: 内存限制
zh_hant: 記憶體限制

# arc.memory-request.label
source: Memory Request
de: Arbeitsspeicheranforderung
es: Solicitud de memoria
fr: Demande de mémoire
it: Richiesta memoria
ja: メモリ要求
ko: 메모리 요청
pt_br: Solicitação de Memória
ru: Запрос памяти
zh_hans: 内存请求
zh_hant: 記憶體要求

# arc.openDashboard
source: Manage
de: Verwalten
es: Administrar
fr: Gérer
it: Gestire
ja: 管理
ko: 관리
pt_br: Gerenciar
ru: Управление
zh_hans: 管理
zh_hant: 管理

# arc.postgres.server.group.coordinator.cores.limit.description
source: The maximum number of CPU cores for the Postgres instance that can be used on the coordinator node. Fractional cores are supported.
de: Die maximale Anzahl von CPU-Kernen für die Postgres-Instanz, die auf dem Koordinatorknoten verwendet werden können. Teilkerne werden unterstützt.
es: Número máximo de núcleos de CPU para la instancia de Postgres que se puede usar por nodo de coordinación. Se admiten núcleos fraccionarios.
fr: Nombre maximal de cœurs de processeur pour l’instance Postgres qui peuvent être utilisés sur nœud coordinateur. Les cœurs fractionnaires sont pris en charge.
it: Numero massimo di core CPU per l'istanza di Postgres che possono essere usati nel nodo coordinatore. Sono supportati core frazionari.
ja: ノードごとに使用できる Postgres インスタンスの CPU コアの最大数。分数のコアがサポートされています。
ko: 코디네이터 노드에서 사용할 수 있는 Postgres 인스턴스의 최대 CPU 코어 수입니다. 소수 코어가 지원됩니다.
pt_br: O número máximo de núcleos de CPU para a instância Postgres que podem ser usados ​​no nó coordenador. Núcleos fracionários são suportados.
ru: Максимальное числ ядер процессора для экземпляра Postgres, которое может использоваться в узле-координаторе. Поддерживается дробное количество ядер.
zh_hans: 可以在协调器节点上使用的 Postgres 实例的最大 CPU 内核数。支持分数核心。
zh_hant: 協調器節點可使用之 Postgres 執行個體的 CPU 核心數上限。支援分數的核心數。

# arc.postgres.server.group.coordinator.cores.limit.label
source: CPU limit
es: Límite de CPU
fr: Limite UC
it: Limite CPU
ja: CPU の制限
ko: CPU 제한
pt_br: Limite de CPU
ru: Ограничение на использование ЦП
zh_hans: CPU 限制
zh_hant: CPU 限制

# arc.postgres.server.group.coordinator.cores.request.description
source: The minimum number of CPU cores that must be available on the coordinator node to schedule the service. Fractional cores are supported.
de: Die Mindestanzahl von CPU-Kernen, die auf dem Koordinatorknoten zur Planung des Diensts verfügbar sein müssen. Teilkerne werden unterstützt.
es: Número mínimo de núcleos de CPU que deben estar disponibles en el nodo de coordinación para programar el servicio. Se admiten núcleos fraccionarios.
fr: Le nombre minimum de cœurs de processeur qui doivent être disponibles sur le nœud coordinateur pour planifier le service. Les fractions de cœurs sont prises en charge.
it: Il numero minimo di core CPU che devono essere disponibili sul nodo coordinatore per pianificare il servizio. Sono supportati i core frazionari.
ja: サービスをスケジュールするために、コーディネーター ノードにて使用可能でなければならない CPU コアの最小数です。分数のコアがサポートされています。
ko: 서비스를 예약하기 위해 코디네이터 노드에서 사용할 수 있어야 하는 최소 CPU 코어 수입니다. 소수 코어가 지원됩니다.
pt_br: O número mínimo de núcleos de CPU que devem estar disponíveis no nó coordenador para planejar o serviço. Núcleos fracionários são suportados.
ru: Минимальное число ядер процессора, которое должно быть доступно в узле-координаторе, чтобы запланировать службу. Поддерживается дробное количество ядер.
zh_hans: 协调器节点上必须可用的用以安排服务的最小 CPU 核心数。支持分数核心。
zh_hant: 協調器節點欲排程服務必須可使用之 CPU 核心數的最小值。支援分數的核心數。

# arc.postgres.server.group.coordinator.cores.request.label
source: CPU request
de: CPU-Anforderung
es: Solicitud de CPU
fr: Demande UC
it: Richiesta CPU
ja: CPU 要求
ko: CPU 요청
pt_br: Solicitação de CPU
ru: Запрос ЦП
zh_hans: CPU 请求
zh_hant: CPU 要求

# arc.postgres.server.group.coordinator.memory.limit.description
source: The memory limit of the Postgres instance on the coordinator node in GB.
de: Das Arbeitsspeicherlimit der Postgres-Instanz auf dem Koordinatorknoten in GB.
es: Límite de memoria de la instancia de Postgres en el nodo de coordinación en GB.
fr: La limite de mémoire de l'instance Postgres sur le nœud coordinateur en Go.
it: Il limite di memoria dell'istanza di Postgres sul nodo coordinatore in GB.
ja: コーディネーター ノードの Postgres インスタンスのメモリ制限 (GB)。
ko: 코디네이터 노드의 Postgres 인스턴스 메모리 제한(GB)입니다.
pt_br: O limite de memória da instância do Postgres no nó coordenador em GB.
ru: Ограничение памяти экземпляра Postgres в узле-координаторе (ГБ).
zh_hans: 协调器节点上 Postgres 实例的内存限制(GB)。
zh_hant: 協調器節點之 Postgres 執行個體的記憶體限制 (GB)。

# arc.postgres.server.group.coordinator.memory.limit.label
source: Memory limit (GB)
de: Arbeitsspeicherlimit (GB)
es: Límite de memoria (GB)
fr: Limite de mémoire (Go)
it: Limite di memoria (GB)
ja: メモリの制限 (GB)
ko: 메모리 제한(GB)
pt_br: Limite de memória (GB)
ru: Предельный объем памяти (ГБ)
zh_hans: 内存限制(GB)
zh_hant: 記憶體限制 (GB)

# arc.postgres.server.group.coordinator.memory.request.description
source: The memory request of the Postgres instance on the coordinator node in GB.
de: Die Speicheranforderung der Postgres-Instanz auf dem Koordinatorknoten in GB.
es: Solicitud de memoria de la instancia de Postgres en el nodo de coordinación en GB.
fr: La demande de mémoire de l'instance Postgres sur le nœud coordinateur en Go.
it: La richiesta di memoria dell'istanza di Postgres sul nodo coordinatore in GB.
ja: コーディネーター ノードの Postgres インスタンスのメモリ要求 (GB)。
ko: 코디네이터 노드에 있는 Postgres 인스턴스의 메모리 요청(GB)입니다.
pt_br: A solicitação de memória da instância Postgres no nó coordenador em GB.
ru: Запрос памяти экземпляра Postgres в узле-координаторе (ГБ).
zh_hans: 协调器节点上的 Postgres 实例的内存请求(GB)。
zh_hant: 協調器節點之 Postgres 執行個體的記憶體要求 (GB)。

# arc.postgres.server.group.coordinator.memory.request.label
source: Memory request (GB)
de: Speicheranforderung (GB)
es: Solicitud de memoria (GB)
fr: Demande de mémoire (Go)
it: Richiesta di memoria (GB)
ja: メモリ要求 (GB)
ko: 메모리 요청(GB)
pt_br: Solicitação de memória (GB)
ru: Запрос памяти (ГБ)
zh_hans: 内存请求(GB)
zh_hant: 記憶體要求 (GB)

# arc.postgres.server.group.engine.version
source: Engine Version
es: Versión del motor
fr: Version du moteur
it: Versione motore
ja: エンジンのバージョン
ko: 엔진 버전
pt_br: Versão do Motor
ru: Версия подсистемы
zh_hans: 引擎版本
zh_hant: 引擎版本

# arc.postgres.server.group.extensions.description
source: A comma-separated list of the Postgres extensions that should be loaded on startup. Please refer to the postgres documentation for supported values.
de: Eine durch Trennzeichen getrennte Liste der Postgres-Erweiterungen, die beim Start geladen werden sollen. Unterstützte Werte finden Sie in der Postgres-Dokumentation.
es: Lista separada por comas de las extensiones Postgres que deben cargarse durante el inicio. Consulte la documentación de Postgres para obtener información sobre los valores admitidos.
fr: Une liste, séparée par des virgules, des extensions Postgres qui doivent être chargées au démarrage. Veuillez vous référer à la documentation postgres pour les valeurs prises en charge.
it: Elenco delimitato da virgole delle estensioni Postgres che devono essre caricate all'avvio. Consulta la documentazione di Postgres per i valori supportati.
ja: スタートアップ時に読み込まれる Postgres 拡張のコンマ区切りリストです。サポートされている値については postgres のドキュメントを参照してください。
ko: 시작 시 로드해야 하는 Postgres 확장의 쉼표로 구분된 목록입니다. 지원되는 값은 Postgres 설명서를 참조하세요.
pt_br: Uma lista separada por vírgulas das extensões Postgres que devem ser carregadas na inicialização. Consulte a documentação do Postgres para obter os valores suportados.
ru: Разделенный запятыми список расширений Postgres, которые должны загружаться при запуске. Поддерживаемые значения см. в документации по Postgres.
zh_hans: 应在启动时加载的 Postgres 扩展的列表(以逗号分隔)。请参阅 postgres 文档以查找支持的值。
zh_hant: 啟動時應該載入 Postgres 延伸模組的逗號分隔清單。請參閱 Postgres 文件以尋求支援的值。

# arc.postgres.server.group.extensions.label
source: Extensions
de: Erweiterungen
es: Extensiones
it: Estensioni
ja: 拡張
ko: 확장
pt_br: Extensões
ru: Расширения
zh_hans: 扩展
zh_hant: 延伸模組

# arc.postgres.server.group.name
source: Server group name
de: Name der Servergruppe
es: Nombre del grupo de servidores
fr: Nom de groupe de serveurs
it: Nome del gruppo di server
ja: サーバー グループ名
ko: 서버 그룹 이름
pt_br: Nome do grupo de servidores
ru: Имя группы серверов
zh_hans: 服务器组名称
zh_hant: 伺服器群組名稱
