Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/arc.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# arc.sql.service.tier.description
source: Select from the latest vCore service tiers available for SQL Managed Instance - Azure Arc including General Purpose and Business Critical. {0}
es: Seleccione entre los últimos niveles de servicio de núcleo virtual disponibles para SQL Managed Instance - Azure Arc, incluidos De uso general y Crítico para la empresa. {0}
fr: Sélectionnez les niveaux de service vCore les plus récents pour SQL Managed Instance - Azure Arc, notamment Usage général et Critique pour l'entreprise.{0}
it: Scegliere tra i livelli di servizio vCore disponibile più recenti per l'Istanza gestita di SQL - Azure Arc, compresi Per utilizzo generico e Business critical. {0}
ja: SQL Managed Instance に使用可能な最新の仮想コア サービス レベルから General Purpose と Business Critical を含む Azure Arc を選択します。{0}
ko: 범용 및 중요 비즈니스용을 포함하여 SQL Managed Instance - Azure Arc에 사용할 수 있는 최신 vCore 서비스 계층에서 선택합니다. {0}
ru: Выберите один из последних уровней служб vCore, доступных для Управляемого экземпляра SQL Managed Instance — Azure Arc, включая уровни "Общего назначения" и "Критически важный для бизнеса". {0}

# arc.sql.storage-class.backups.description
source: The storage class to be used for backup persistent volumes. If no value is specified, the default storage class will be used.
es: Clase de almacenamiento que se va a usar para realizar copias de seguridad de volúmenes persistentes. Si no se especifica ningún valor, se usará la clase de almacenamiento predeterminada.
fr: Classe de stockage à utiliser pour les volumes persistants de sauvegarde. Si aucune valeur n’est spécifiée, la classe de stockage par défaut est utilisée.
it: La classe di archiviazione da utilizzare per i volumi persistenti di backup. Se non viene specificato alcun valore, verrà utilizzata la classe di archiviazione predefinita.
ja: バックアップ永続ボリュームに使用されるストレージ クラス。値が指定されない場合は、既定のストレージ クラスが使用されます。
ko: 백업 영구 볼륨에 사용할 저장소 클래스입니다. 값을 지정하지 않으면 기본 저장소 클래스가 사용됩니다.
ru: Класс хранения для постоянных томов резервного копирования. Если значение не указано, будет использоваться класс по умолчанию.

# arc.sql.wizard.title
source: Deploy Azure SQL managed instance - Azure Arc (preview)
es: Implementación de Azure SQL Managed Instance: Azure Arc (versión preliminar)
fr: Déployer Azure SQL Managed Instance : Azure Arc (préversion)
it: Distribuire istanza gestita di SQL di Azure - Azure Arc (anteprima)
ja: Azure SQL Managed Instance - Azure Arc を展開 - Azure Arc (プレビュー)
ko: Azure SQL Managed Instance - Azure Arc(미리 보기)
ru: Развертывание Управляемого экземпляра SQL Azure — Azure Arc (предварительная версия)

# resource.type.arc.postgres.display.name
source: PostgreSQL Hyperscale server groups - Azure Arc (preview)
es: Grupos de servidores de hiperescala de PostgreSQL: Azure Arc (versión preliminar)
fr: Groupes de serveurs PostgreSQL Hyperscale : Azure Arc (préversion)
it: Gruppi di server PostgreSQL Hyperscale - Azure Arc (anteprima)
ja: PostgreSQL Hyperscale サーバー グループ - Azure Arc (プレビュー)
ko: PostgreSQL 하이퍼스케일 서버 그룹 - Azure Arc(미리 보기)
ru: Группы серверов гипермасштабирования PostgreSQL — Azure Arc (предварительная версия)

# resource.type.arc.sql.display.name
source: Azure SQL managed instance - Azure Arc (preview)
es: Azure SQL Managed Instance: Azure Arc (versión preliminar)
fr: Azure SQL Managed Instance : Azure Arc (préversion)
it: Istanza gestita di SQL di Azure - Azure Arc (anteprima)
ja: Azure SQL Managed Instance - Azure Arc (プレビュー)
ko: Azure SQL Managed Instance - Azure Arc(미리 보기)
ru: Управляемый экземпляр SQL Azure — Azure Arc (предварительная версия)

# resource.type.azure.arc.description
source: Creates an Azure Arc data controller
es: Permite crear un controlador de datos de Azure Arc.
fr: Crée un contrôleur de données Azure Arc
it: Creare un controller dei dati Azure Arc
ja: Azure Arc データ コントローラーの作成
ko: Azure Arc 데이터 컨트롤러 만들기
ru: Создание контроллера данных Azure Arc

# resource.type.azure.arc.display.name
source: Azure Arc data controller (preview)
es: Controlador de datos de Azure Arc (versión preliminar)
fr: Contrôleur de données Azure Arc (préversion)
it: Controller dei dati di Azure Arc (anteprima)
ja: Azure Arc データ コントローラー (プレビュー)
ko: Azure Arc 데이터 컨트롤러(미리 보기)
ru: Контроллер данных Azure Arc (предварительная версия)

# arc.ram
source: RAM
ru: ОЗУ

# arc.data.controller.details.description
source: Provide a namespace, name and storage class for your Azure Arc data controller. This name will be used to identify your Arc instance for remote management and monitoring.
es: Proporcione un espacio de nombres, un nombre y una clase de almacenamiento para el controlador de datos de Azure Arc. Este nombre se usará para identificar la instancia de Arc para la administración y supervisión remotas.
fr: Fournissez un espace de noms, un nom et une classe de stockage pour votre contrôleur de données Azure Arc. Ce nom sera utilisé pour identifier votre instance Arc à des fins de gestion et de surveillance à distance.
it: Specificare uno spazio dei nomi, un nome e una classe di archiviazione per il controller dei dati Azure Arc. Questo nome verrà usato per identificare l'istanza di Arc per la gestione e il monitoraggio remoti.
ja: Azure Arc データ コントローラーの名前空間、名前、およびストレージクラスを指定します。 この名前は、リモート管理および監視用の Arc インスタンスを識別するために使用されます。
ru: Укажите пространство имен, имя и класс хранения для контроллера данных Azure Arc. Это имя будет использоваться для идентификации экземпляра Arc в целях удаленного управления и мониторинга.

# arc.sql.high.availability.label
source: High Availability
es: Alta disponibilidad
fr: Haute disponibilité
it: Disponibilità elevata
ja: 高可用性
ru: Высокая доступность

# arc.sql.retention.days.label
source: PITR retention (days)
es: Retención de restauración a un momento dado (PITR) (días)
ru: Хранение PITR (в днях)

# arc.sql.service.tier.business.critical
source: [PREVIEW] Business Critical (Unlimited vCores and RAM, advanced high availability)
es: [VERSIÓN PRELIMINAR] Crítico para la empresa (núcleos virtuales ilimitados y RAM, alta disponibilidad avanzada)
fr: [PRÉVERSION] critique pour l’entreprise (nombre illimité de vCores et de RAM, haute disponibilité avancée)
it: [ANTEPRIMA] Business critical (vCore e RAM illimitati, disponibilità elevata avanzata)
ja: [PREVIEW] Business Critical (無制限の仮想コアと RAM、詳細な高可用性)
ru: [ПРЕДВАРИТЕЛЬНАЯ ВЕРСИЯ] Критически важный для бизнеса (неограниченное количество виртуальных ядер и объем ОЗУ, расширенные функции высокого уровня доступности)
