Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/asde-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# extension-displayName
source: Azure SQL Edge Deployment Extension
de: Azure SQL Edge-Bereitstellungserweiterung
es: Extensión de implementación de Azure SQL Edge
fr: Extension de déploiement Azure SQL Edge
it: Estensione di distribuzione di SQL Edge di Azure
ja: Azure SQL Edge デプロイ拡張機能
ko: Azure SQL Edge 배포 확장
pt_br: Extensão de implantação do SQL do Azure no Edge
ru: Расширение развертывания SQL Azure для пограничных вычислений
zh_hans: Azure SQL Edge 部署扩展
zh_hant: Azure SQL Edge 部署延伸模組

# extension-description
source: Provides a notebook-based experience to deploy Azure SQL Edge
de: Bietet eine Notebook-basierte Oberfläche zum Bereitstellen von Azure SQL Edge
es: Proporciona una experiencia basada en cuadernos para implementar Azure SQL Edge
fr: Fournit une expérience de notebook pour déployer Azure SQL Edge
it: Offre un'esperienza basata su notebook per la distribuzione di SQL Edge di Azure
ja: Azure SQL Edge をデプロイするためのノートブック ベースのエクスペリエンスを提供します
ko: Azure SQL Edge를 배포하기 위한 Notebook 기반 환경을 제공합니다.
pt_br: Fornece uma experiência baseada em bloco de anotações para implantar o SQL do Azure no Edge
ru: Обеспечивает развертывание SQL Azure для пограничных вычислений на основе записных книжек
zh_hans: 提供部署 Microsoft SQL Server 的基于笔记本的体验
zh_hant: 提供部署 Azure SQL Edge 的筆記本式體驗

# docker-container-name-field
source: Container name
es: Nombre del contenedor
fr: Nom de conteneur
it: Nome del contenitore
ja: コンテナー名
ko: 컨테이너 이름
pt_br: Nome do contêiner
ru: Имя контейнера
zh_hans: 容器名称
zh_hant: 容器名稱

# docker-sql-password-field
source: Azure SQL Edge instance (sa) password
de: Azure SQL Edge-Instanzkennwort (SA)
es: Contraseña de las instancias de Azure SQL Edge
fr: Mot de passe de l’instance Azure SQL Edge (sa)
it: Password (sa) dell'istanza di SQL Edge di Azure
ja: Azure SQL Edge インスタンス (sa) のパスワード
ko: Azure SQL Edge 인스턴스(sa) 암호
pt_br: Senha do SQL do Azure no Edge (sa)
ru: Пароль экземпляра SQL Azure для пограничных вычислений (SA)
zh_hans: Azure SQL Edge 实例(sa)密码
zh_hant: Azure SQL Edge 執行個體 (sa) 密碼

# docker-confirm-sql-password-field
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтвердить пароль
zh_hans: 确认密码
zh_hant: 確認密碼

# docker-sql-port-field
source: Azure SQL Edge Port
es: Puerto de Azure SQL Edge
fr: Port Azure SQL Edge
it: Porta di SQL Edge di Azure
ko: Azure SQL Edge 포트
pt_br: Porta do SQL do Azure no Edge
ru: Порт SQL Azure для пограничных вычислений
zh_hans: Azure SQL Edge 端口
zh_hant: Azure SQL Edge 連接埠

source: Microsoft Privacy Statement
de: Microsoft-Datenschutzbestimmungen
es: Declaración de privacidad de Microsoft
fr: Déclaration de confidentialité Microsoft
it: Informativa sulla privacy di Microsoft
ja: Microsoft プライバシー ステートメント
ko: Microsoft 개인정보처리방침
pt_br: Política de Privacidade da Microsoft
ru: Заявление о конфиденциальности корпорации Майкрософт
zh_hans: Microsoft 隐私声明
zh_hant: Microsoft 隱私權聲明

# resource-type-sql-edge-display-name
source: Azure SQL Edge
it: SQL Edge di Azure
pt_br: SQL do Azure no Edge
ru: SQL Azure для пограничных вычислений

# resource-type-sql-edge-description
source: Azure SQL Edge (Preview) is an optimized relational database engine geared for IoT and IoT Edge deployments.
de: Azure SQL Edge (Vorschau) ist eine optimierte relationale Datenbank-Engine, die für IoT- und IoT Edge-Bereitstellungen gedacht ist.
es: Azure SQL Edge (versión preliminar) es un motor de base de datos relacional optimizado orientado a las implementaciones de IoT y IoT Edge.
fr: Azure SQL Edge (préversion) est un moteur de base de données relationnelle optimisé conçu pour les déploiements IoT et IoT Edge.
it: SQL Edge di Azure (anteprima) è un motore di database relazionale ottimizzato progettato per le distribuzioni di IoT e IoT Edge.
ja: Azure SQL Edge (プレビュー) は、IoT と IoT Edge のデプロイ用に最適化されたリレーショナル データベース エンジンです。
ko: Azure SQL Edge(미리 보기)는 IoT 및 IoT Edge 배포를 위한 최적화된 관계형 데이터베이스 엔진입니다.
pt_br: O SQL do Azure no Edge (versão prévia) é um mecanismo de banco de dados relacional otimizado voltado para implantações de IoT e IoT Edge.
ru: SQL Azure для пограничных вычислений (предварительная версия) — это оптимизированное ядро реляционной СУБД, предназначенное для развертываний Интернета вещей и IoT Edge.
zh_hans: Azure SQL Edge (预览)是一个适合 IoT 和 IoT Edge 部署的优化关系数据库引擎。
zh_hant: Azure SQL Edge (預覽) 是專為 IoT 及 IoT Edge 部署而最佳化的關聯式資料庫引擎。

# sql-edge-type-display-name
source: Deployment target
de: Bereitstellungsziel
es: Destino de implementación
fr: Cible de déploiement
it: Destinazione di distribuzione
ja: デプロイ ターゲット
ko: 배포 대상
pt_br: Destino de implantação
ru: Целевой объект развертывания
zh_hans: 部署目标
zh_hant: 部署目標

# sql-edge-local-display-name
source: Local container instance
de: Lokale Containerinstanz
es: Instancia de contenedor local
fr: Instance de conteneur locale
it: Istanza di contenitore locale
ja: ローカル コンテナー インスタンス
ko: 로컬 컨테이너 인스턴스
pt_br: Instância de contêiner local
ru: Экземпляр локального контейнера
zh_hans: 本地容器实例
zh_hant: 本地容器執行個體

# sql-edge-remote-display-name
source: Remote container instance
de: Remotecontainerinstanz
es: Instancia de contenedor remoto
fr: Instance de conteneur distante
it: Istanza di contenitore remota
ja: リモート コンテナー インスタンス
ko: 원격 컨테이너 인스턴스
pt_br: Instância de contêiner remoto
ru: Удаленный экземпляр контейнера
zh_hans: 远程容器实例
zh_hant: 遠端容器執行個體

# sql-edge-local-title
source: Deploy Azure SQL Edge container instance on local machine
de: Azure SQL Edge-Containerinstanz auf lokalem Computer bereitstellen
es: Implementar instancia de contenedor de Azure SQL Edge en la máquina local
fr: Déployer l’instance de conteneur Azure SQL Edge sur l’ordinateur local
it: Distribuisci istanza di contenitore di SQL Edge di Azure nel computer locale
ja: ローカル コンピューターに Azure SQL Edge コンテナー インスタンスをデプロイします
ko: 로컬 컴퓨터에 Azure SQL Edge 컨테이너 인스턴스 배포
pt_br: Implantar instância de contêiner do SQL do Azure no Edge no computador local
ru: Развертывание экземпляра контейнера SQL Azure для пограничных вычислений на локальном компьютере
zh_hans: 在本地计算机上部署 Azure SQL Edge 容器实例
zh_hant: 在本地電腦上部署 Azure SQL Edge 容器執行個體

# docker-settings-section-title
source: Docker settings
de: Docker-Einstellungen
es: Configuración de Docker
fr: Paramètres Docker
it: Impostazioni di Docker
ja: Docker 設定
ko: Docker 설정
pt_br: Configurações do Docker
ru: Параметры Docker
zh_hans: Docker 设置
zh_hant: Docker 設定

# docker-registry-field
source: Registry
de: Registrierung
es: Registro
fr: Registre
it: Registro
ja: レジストリ
ko: 레지스트리
pt_br: Registro
ru: Реестр
zh_hans: 注册表
zh_hant: 登錄

# docker-repository-field
source: Repository
es: Repositorio
fr: Dépôt
ja: リポジトリ
ko: 리포지토리
pt_br: Repositório
ru: Репозиторий
zh_hans: 存储库
zh_hant: 存放庫

# docker-imagetag-field
source: Image tag
es: Etiqueta de imagen
fr: Balise d'image
it: Tag dell'immagine
ja: イメージ タグ
ko: 이미지 태그
pt_br: Marca de imagem
ru: Тег изображения
zh_hans: 图像标记
zh_hant: 映像標籤

# docker-username-field
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# docker-password-field
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# edge-agreement
source: I accept {0} and {1}.
de: Ich akzeptiere die {0} und die {1}.
es: Acepto {0} y {1}.
fr: J'accepte {0} et {1}.
it: Accetto {0} e {1}.
ja: {0} および {1} に同意します。
ko: {0} 및 {1}에 동의합니다.
pt_br: Aceito {0} e {1}.
ru: Я принимаю {0} и {1}.
zh_hans: 我接受 {0} 和 {1}。
zh_hant: 我接受 {0} 和 {1}。

# edge-eula
source: Microsoft Azure SQL Edge License Agreement
de: Microsoft Azure SQL Edge-Lizenzvertrag
es: Contrato de licencia de Microsoft Azure SQL Edge
fr: Contrat de licence Microsoft Azure SQL Edge
it: Contratto di licenza di SQL Edge di Microsoft Azure
ko: Microsoft Azure SQL Edge 사용권 계약
pt_br: Contrato de licença do SQL do Microsoft Azure no Edge
ru: Лицензионное соглашение SQL Microsoft Azure для пограничных вычислений
zh_hans: Microsoft Azure SQL Edge 许可协议
zh_hant: Microsoft Azure SQL Edge 授權合約

# sql-edge-remote-title
source: Deploy Azure SQL Edge container instance on remote machine
de: Azure SQL Edge-Containerinstanz auf Remotecomputer bereitstellen
es: Implementar instancia de contenedor de Azure SQL Edge en la máquina remota
fr: Déployer l’instance de conteneur Azure SQL Edge sur l’ordinateur distant
it: Distribuisci istanza di contenitore di SQL Edge di Azure nel computer remoto
ja: リモートコンピューターに Azure SQL Edge コンテナー インスタンスをデプロイします
ko: 원격 컴퓨터에 Azure SQL Edge 컨테이너 인스턴스 배포
pt_br: Implantar instância de contêiner do SQL do Azure no Edge no computador remoto
ru: Развертывание экземпляра контейнера SQL Azure для пограничных вычислений на удаленном компьютере
zh_hans: 在远程计算机上部署 Azure SQL Edge 容器实例
zh_hant: 在遠端電腦上部署 Azure SQL Edge 容器執行個體

# remote-info-section-title
source: Target machine information
de: Zielcomputerinformationen
es: Información de la máquina de destino
fr: Informations sur l'ordinateur cible
it: Informazioni computer di destinazione
ja: 対象コンピューターの情報
ko: 대상 컴퓨터 정보
pt_br: Informações do computador de destino
ru: Сведения о целевом компьютере
zh_hans: 目标计算机信息
zh_hant: 目標電腦資訊

# edge-remote-target-field
source: Name or IP address
de: Name oder IP-Adresse
es: Nombre o dirección IP
fr: Nom ou adresse IP
it: Nome o indirizzo IP
ja: 名前または IP アドレス
ko: 이름 또는 IP 주소
pt_br: Nome ou Endereço IP
ru: Имя или IP-адрес
zh_hans: 名称或 IP 地址
zh_hant: 名稱或 IP 位址

# edge-remote-username-field
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# edge-remote-password-field
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# sql-edge-azure-display-name
source: New Azure IoT Hub and VM (password authentication)
de: Neue Azure IoT Hub und VM (Kennwortauthentifizierung)
es: Nuevo Azure IoT Hub y VM (autenticación de contraseña)
fr: Nouveau Azure IoT Hub et machine virtuelle (authentification par mot de passe)
it: Nuovi hub IoT di Azure e macchina virtuale (autenticazione della password)
ja: 新しい Azure IoT Hub と VM (パスワード認証)
ko: 새 Azure IoT Hub 및 VM(암호 인증)
pt_br: Novo Hub IoT do Azure e VM (autenticação de senha)
ru: Новый Центр Интернета вещей Azure и ВМ (проверка пароля)
zh_hans: 新建 Azure IoT 中心和虚拟机(密码身份验证)
zh_hant: 新的 Azure IoT 中樞和 VM (密碼驗證)

# sql-edge-azure-sshkey-display-name
source: New Azure IoT Hub and VM (ssh public key authentication)
de: Neuer Azure IoT Hub und VM (Authentifizierung mit öffentlichem SSH-Schlüssel)
es: Nuevo Azure IoT Hub y VM (autenticación de clave pública SSH)
fr: Nouvelle Azure IoT Hub et machine virtuelle (authentification par clé publique SSH)
it: Nuovi hub IoT di Azure e macchina virtuale (autenticazione chiave pubblica SSH)
ja: 新しい Azure IoT Hub と VM (ssh 公開キー認証)
ko: 새 Azure IoT Hub 및 VM(ssh 공개 키 인증)
pt_br: Novo Hub IoT do Azure e VM (autenticação de chave pública SSH)
ru: Новый Центр Интернета вещей Azure и ВМ (проверка подлинности открытого ключа SSH)
zh_hans: 新建 Azure IoT 中心和虚拟机(ssh 公钥身份验证)
zh_hant: 新的 Azure IoT 中樞和 VM (ssh 公開金鑰驗證)

# sql-edge-azure-title
source: Deploy Azure SQL Edge to a new Azure VM via IoT hub
de: Azure SQL Edge auf einer neuen Azure-VM über IoT Hub bereitstellen
es: Implementar Azure SQL Edge en una VM de Azure nueva a través de IoT Hub
fr: Déployer Azure SQL Edge sur une nouvelle machine virtuelle Azure via IoT Hub
it: Distribuisci SQL Edge di Azure in una nuova macchina virtuale di Azure tramite l'hub IoT
ja: IoT hub を使用して Azure SQL Edge を新しい Azure VM にデプロイします
ko: IoT Hub를 통해 Azure SQL Edge를 새 Azure VM에 배포
pt_br: Implantar o SQL do Azure no Edge em uma nova VM do Azure via hub IoT
ru: Развертывание SQL Azure для пограничных вычислений на новой виртуальной машине Azure через центр Интернета вещей
zh_hans: 通过 IoT 中心将 Azure SQL Edge 部署到新的 Azure VM
zh_hant: 透過 IoT 中樞將 Azure SQL Edge 部署到新的 Azure VM

# azure_subscription_id
source: Subscription id
de: Abonnement-ID
es: Id. de suscripción
fr: ID d'abonnement
it: ID sottoscrizione
ja: サブスクリプション ID
ko: 구독 ID
pt_br: ID da assinatura
ru: Идентификатор подписки
zh_hans: 订阅 ID
zh_hant: 訂用帳戶識別碼

# azure_resource_group
source: Resource group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# azure_location
source: Location
de: Standort
es: Ubicación
fr: Emplacement
it: Percorso
ja: 場所
ko: 위치
pt_br: Local
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# vm_admin
source: VM admin username
de: VM-Administratorbenutzername
es: Nombre de usuario administrador de VM
fr: Nom d'utilisateur de l'administrateur de machine virtuelle
it: Nome utente amministratore macchina virtuale
ja: VM 管理者のユーザー名
ko: VM 관리자 사용자 이름
pt_br: Nome de usuário do administrador da VM
ru: Имя администратора ВМ
zh_hans: 虚拟机管理员用户名
zh_hant: VM 系統管理員使用者名稱

# vm_password
source: VM admin password
de: VM-Administratorkennwort
es: Contraseña de administrador de VM
fr: Mot de passe administrateur de machine virtuelle
it: Password amministratore macchina virtuale
ja: VM 管理者パスワード
ko: VM 관리자 암호
pt_br: Senha de administrador da VM
ru: Пароль администратора ВМ
zh_hans: 虚拟机管理员密码
zh_hant: VM 系統管理員密碼

# vm_password_confirm
source: Confirm VM admin password
de: VM-Administratorkennwort bestätigen
es: Confirmación de la contraseña de administrador de VM
fr: Confirmer le mot de passe administrateur de machine virtuelle
it: Conferma password amministratore macchina virtuale
ja: VM 管理者パスワードの確認
ko: VM 관리자 암호 확인
pt_br: Confirmar senha de administrador de VM
ru: Подтвердить пароль администратора ВМ
zh_hans: 确认虚拟机管理员密码
zh_hant: 確認 VM 系統管理員密碼

# vm_password_validation_error_message
source: VM password must be 12 to 123 characters in length and consists of upper case characters, lower case characters, numbers and special characters.
de: Das VM-Kennwort muss zwischen 12 und 123 Zeichen lang sein und aus Großbuchstaben, Kleinbuchstaben, Ziffern und Sonderzeichen bestehen.
es: La contraseña de la VM debe tener entre 12 y 123 caracteres de longitud y se compone de caracteres en mayúsculas, minúsculas, números y caracteres especiales.
fr: Le mot de passe de la machine virtuelle doit comprendre entre 12 et 123 caractères, et contenir des caractères majuscules, des caractères minuscules, des chiffres et des caractères spéciaux.
it: La password della macchina virtuale deve avere una lunghezza compresa tra 12 e 123 caratteri e può essere costituita da caratteri maiuscoli, caratteri minuscoli, numeri e caratteri speciali.
ja: VM パスワードは、12 ~ 123 文字の長さで、大文字、小文字、数字、特殊文字で構成されている必要があります。
ko: VM 암호의 길이는 12~123자여야 하며 대문자, 소문자, 숫자 및 특수 문자로 구성되어야 합니다.
pt_br: A senha da VM deve ter de 12 a 123 caracteres de comprimento e consiste em caracteres maiúsculos, caracteres minúsculos, números e caracteres especiais.
ru: Пароль ВМ должен составлять в длину от 12 до 123 символов и включать символы верхнего регистра, нижнего регистра, цифры и специальные знаки.
zh_hans: VM 密码的长度必须为 12 到 123 个字符，且包含大写字符、小写字符、数字、特殊字符。
zh_hant: VM 密碼長度必須介於 12 到 123 個字元之間，且包含大寫字元、小寫字元、數字及特殊字元。

# package_path
source: Package file
de: Paketdatei
es: Archivo de paquete
fr: Fichier de package
it: File del pacchetto
ja: パッケージ ファイル
ko: 패키지 파일
pt_br: Arquivo de pacote
ru: Файл пакета
zh_hans: 包文件
zh_hant: 套件檔案

# package_path_description
source: Path of the SQL Server package file(dacpac, bacpac) or compressed package file.
de: Pfad der SQL Server-Paketdatei (DACPAC, BACPAC) oder der komprimierten Paketdatei.
es: Ruta de acceso del archivo de paquete de SQL Server (dacpac, bacpac) o archivo de paquete comprimido.
fr: Chemin d’accès du fichier de package SQL Server (dacpac, BacPac) ou du fichier de package compressé.
it: Percorso del file di pacchetto SQL Server (dacpac, bacpac) o file di pacchetto compresso.
ja: SQL Server パッケージ ファイル (dacpac、bacpac) または圧縮されたパッケージファイルのパス。
ko: SQL Server 패키지 파일(dacpac, bacpac) 또는 압축된 패키지 파일의 경로입니다.
pt_br: Caminho do arquivo de pacote do SQL Server (dacpac, bacpac) ou arquivo de pacote compactado.
ru: Путь к файлу пакета SQL Server (DACPAC, BACPAC) или сжатому файлу пакета.
zh_hans: SQL Server 包文件的路径(dacpac、bacpac)或压缩包文件。
zh_hant: SQL Server 套件檔案的路徑 (dacpac、bacpac) 或壓縮的套件檔案。

# azure-info-section-title
source: Azure information
de: Azure-Informationen
es: Información de Azure
fr: Informations Azure
it: Informazioni su Azure
ja: Azure 情報
ko: Azure 정보
pt_br: Informações do Azure
ru: Информация об Azure
zh_hans: Azure 信息
zh_hant: Azure 資訊

# sqlserver-info-section-title
source: Azure SQL Edge information
de: Azure SQL Edge-Informationen
es: Información de Azure SQL Edge
fr: Informations Azure SQL Edge
it: Informazioni su SQL Edge di Azure
ja: Azure SQL Edge 情報
ko: Azure SQL Edge 정보
pt_br: Informações do SQL do Azure no Edge
ru: Сведения об SQL Azure для пограничных вычислений
zh_hans: Azure SQL Edge 信息
zh_hant: Azure SQL Edge 資訊

# package-files
source: SQL Server Package files
de: SQL Server-Paketdateien
es: Archivos de paquete de SQL Server
fr: Fichiers de package SQL Server
it: File di pacchetto SQL Server
ja: パッケージ ファイルの SQL Server
ko: SQL Server 패키지 파일
pt_br: Arquivos do pacote SQL Server
ru: Файлы пакета SQL Server
zh_hans: SQL Server 包文件
zh_hant: SQL Server 套件檔案

# sql-edge-azure-single-device-display-name
source: Existing device of an Azure IoT Hub
de: Vorhandenes Gerät eines Azure IoT Hubs
es: Dispositivo existente de un Azure IoT Hub
fr: Appareil existant d’un Azure IoT Hub
it: Dispositivo esistente di un hub IoT di Azure
ja: Azure IoT Hub の既存のデバイス
ko: Azure IoT Hub의 기존 장치
pt_br: Dispositivo existente de uma Hub IoT do Azure
ru: Существующее устройство Центра Интернета вещей Azure
zh_hans: Azure IoT 中心的现有设备
zh_hant: Azure IoT 中樞的現有裝置

# sql-edge-azure-single-device-title
source: Deploy Azure SQL Edge to an existing device
de: Azure SQL Edge auf einem vorhandenen Gerät bereitstellen
es: Implementar Azure SQL Edge en un dispositivo existente
fr: Déployer Azure SQL Edge sur un appareil existant
it: Distribuisci SQL Edge di Azure in un dispositivo esistente
ja: Azure SQL Edge を既存のデバイスにデプロイします
ko: 기존 장치에 Azure SQL Edge 배포
pt_br: Implantar o SQL do Azure no Edge em um dispositivo existente
ru: Развертывание SQL Azure для пограничных вычислений на существующем устройстве
zh_hans: 将 Azure SQL Edge 部署到现有设备
zh_hant: 將 Azure SQL Edge 部署到現有的裝置

source: IoT Hub name
de: Name des IoT Hubs
es: Nombre de IoT Hub
fr: Nom du hub IoT
it: Nome dell'hub IoT
ja: IoT ハブ名
ko: IoT Hub 이름
pt_br: Nome do Hub IoT
ru: Имя центра Интернета вещей
zh_hans: IoT 中心名称
zh_hant: IoT 中樞名稱

source: Device ID
de: Geräte-ID
es: Id. de dispositivo
fr: ID d'appareil
it: ID dispositivo
ja: デバイス ID
ko: 장치 ID
pt_br: ID do Dispositivo
ru: ИД устройства
zh_hans: 设备 ID
zh_hant: 裝置識別碼

source: Device IP Address
de: Geräte-IP-Adresse
es: Dirección IP del dispositivo
fr: Adresse IP du périphérique
it: Indirizzo IP dispositivo
ja: デバイスの IP アドレス
ko: 장치 IP 주소
pt_br: Endereço IP do Dispositivo
ru: IP-адрес устройства
zh_hans: 设备 IP 地址
zh_hant: 裝置 IP 位址

# device-ip-address-description
source: Will be used to connect to the Azure SQL Edge instance after deployment
de: Wird verwendet, um nach der Bereitstellung eine Verbindung mit der Azure SQL Edge-Instanz herzustellen
es: Se usará para conectarse a la instancia de Azure SQL Edge después de la implementación
fr: Sera utilisé pour se connecter à l’instance Azure SQL Edge après le déploiement
it: Verrà utilizzato per connettersi all'istanza di SQL Edge di Azure dopo la distribuzione
ja: デプロイ後に Azure SQL Edge インスタンスに接続するために使用されます
ko: 배포 후 Azure SQL Edge 인스턴스에 연결하는 데 사용됩니다.
pt_br: Será usado para se conectar à instância do SQL do Azure no Edge após a implantação
ru: Будет использоваться для подключения к экземпляру SQL Azure для пограничных вычислений после развертывания
zh_hans: 将用于在部署后连接到 Azure SQL Edge 实例
zh_hant: 將用來在部署後連線到 Azure SQL Edge 執行個體

# sql-edge-azure-multi-device-display-name
source: Multiple devices of an Azure IoT Hub
de: Mehrere Geräte einer Azure IoT Hub
es: Varios dispositivos de un Azure IoT Hub
fr: Plusieurs appareils d’un Azure IoT Hub
it: Più dispositivi di un hub IoT di Azure
ja: Azure IoT Hub の複数のデバイス
ko: Azure IoT Hub의 여러 장치
pt_br: Vários dispositivos de um Hub IoT do Azure
ru: Несколько устройств Центра Интернета вещей Azure
zh_hans: Azure IoT 中心的多个设备
zh_hant: Azure IoT 中樞的多個裝置

# sql-edge-azure-multi-device-title
source: Deploy Azure SQL Edge to multiple Azure IoT devices
de: Azure SQL Edge für mehrere Azure IoT-Geräte bereitstellen
es: Implementar Azure SQL Edge en varios dispositivos de Azure IoT
fr: Déployer Azure SQL Edge sur plusieurs appareils Azure IoT
it: Distribuisci SQL Edge di Azure in più dispositivi Azure ioT
ja: Azure SQL Edge を複数の Azure IoT デバイスにデプロイする
ko: Azure SQL Edge를 여러 Azure IoT 장치에 배포
pt_br: Implantar o SQL do Azure no Edge em vários dispositivos IoT do Azure
ru: Развертывание SQL Azure для пограничных вычислений для нескольких устройств Интернета вещей Azure
zh_hans: 将 Azure SQL Edge 部署到多个 Azure IoT 设备
zh_hant: 將 Azure SQL Edge 部署到多個 Azure IoT 裝置

# device-target-condition
source: Target condition
de: Zielbedingung
es: Condición de destino
fr: Condition cible
it: Condizione di destinazione
ja: ターゲットの条件
ko: 대상 조건
pt_br: Condição de destino
ru: Целевое условие
zh_hans: 目标条件
zh_hant: 目標條件

# device-target-condition-learn-more
source: Learn more about target condition
de: Weitere Informationen zu Zielbedingungen
es: Obtener más información sobre la condición de destino
fr: En savoir plus sur l'état des cibles
it: Altre informazioni sulla condizione di destinazione
ja: ターゲット条件についての詳細情報
ko: 대상 조건에 대한 자세한 정보
pt_br: Saiba mais sobre a condição de destino
ru: Дополнительные сведения о целевом условии
zh_hans: 详细了解目标状况。
zh_hant: 深入了解目標條件

# vm_ssh_public_key
source: SSH public key
de: Öffentlicher SSH-Schlüssel
es: Clave pública SSH
fr: Clé publique SSH
it: Chiave pubblica SSH
ja: SSH 公開キー
ko: SSH 공개 키
pt_br: Chave pública SSH
ru: Открытый ключ SSH
zh_hans: SSH 公钥
zh_hant: SSH 公用金鑰
