Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/azdata.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# azdata.displayName
source: Azure Data CLI
es: CLI de Azure Data
it: Interfaccia della riga di comando di Azure Data
pt_br: CLI de Dados do Azure

# azdata.description
source: Support for Azure Data CLI.
de: Unterstützung für Azure Data CLI.
es: Compatibilidad con la CLI Azure Data.
fr: Prise en charge d’Azure Data CLI.
it: Supporto per l’Interfaccia della riga di comando di Azure Data.
ja: Azure Data CLI 対応。
ko: Azure Data CLI에 대한 지원입니다.
pt_br: Suporte para a CLI de Dados do Azure.
ru: Поддержка Azure Data CLI.
zh_hans: 对 Azure Data CLI 的支持。
zh_hant: 支援 Azure Data CLI。

# azdata.config.title
source: Azure Data CLI Configuration
de: Azure Data CLI-Konfiguration
es: Configuración de la CLI Azure Data
fr: Configuration d’Azure Data CLI
it: Configurazione dell'interfaccia della riga di comando di Azure Data
ja: Azure Data CLI の構成
ko: Azure Data CLI 구성
pt_br: Configuração da CLI de Dados do Azure
ru: Конфигурация Azure Data CLI
zh_hans: Azure Data CLI 配置
zh_hant: Azure Data CLI 組態

# azdata.config.debug
source: Log debug info to the output channel for all executed azdata commands
de: Debuginformationen für alle ausgeführten azdata-Befehle im Ausgabekanal protokollieren
es: Registrar información de depuración en el canal de salida para todos los comandos azdata ejecutados
fr: Enregistrer les informations de débogage sur la chaîne de sortie pour toutes les commandes azdata exécutées
it: Registrare le informazioni di debug nel canale di output per tutti i comandi azdata eseguiti
ja: すべての実行済み azdata コマンドの出力チャネルにデバッグ情報を記録します
ko: 실행된 모든 azdata 명령에 대한 출력 채널에 디버그 정보 기록
pt_br: Registrar informações de depuração no canal de saída para todos os comandos azdata executados
ru: Записывать отладочную информацию в канал вывода для всех выполненных команд azdata
zh_hans: 将调试信息记录到所有已执行 azdata 命令的输出通道
zh_hant: 將偵錯資訊記錄到所有已執行 azdata 命令的輸出通道

# command.category
source: Azure Data CLI
es: CLI de Azure Data
it: Interfaccia della riga di comando di Azure Data
pt_br: CLI de Dados do Azure

# azdata.acceptEula.command.name
source: Accept Eula
de: Lizenzbedingungen akzeptieren
es: Aceptar CLUF
fr: Accepter le CLUF
it: Accetta le Condizioni di licenza
ja: マイクロソフト ソフトウェア ライセンス条項に同意
ko: EULA 동의
pt_br: Aceitar o EULA
ru: Принять лицензионное соглашение
zh_hans: 接受 EULA
zh_hant: 接受 EULA

# azdata.install.command.name
source: Install
de: Installieren
es: Instalar
fr: Installer
it: Installa
ja: インストール
ko: 설치
pt_br: Instalar
ru: Установить
zh_hans: 安装
zh_hant: 安裝

# azdata.update.command.name
source: Check for Update
de: Nach Updates suchen
es: Buscar actualización
fr: Rechercher la mise à jour
it: Controllare la disponibilità di aggiornamenti
ja: 更新の確認
ko: 업데이트 확인
pt_br: Verificar se há Atualizações
ru: Проверка на наличие обновления
zh_hans: 检查更新
zh_hant: 檢查更新

# azdata.category
source: Azure Data CLI
es: CLI de Azure Data
it: Interfaccia della riga di comando di Azure Data
pt_br: CLI de Dados do Azure

# azdata.acceptEula.description
source: Choose how acceptance of EULA for the Azure Data CLI is done
de: Entscheiden Sie, wie die Lizenzbedingungen für die Azure Data CLI akzeptiert werden sollen
es: Elija cómo se lleva a cabo la aceptación del CLUF de la CLI de Azure Data.
fr: Choisir le mode d’acceptation du CLUF pour Azure Data CLI
it: Scegliere l'operazione di accettazione del contratto di licenza per l'interfaccia della riga di comando di Azure Data
ja: Azure Data CLI の EULA への同意方法の選択が完了しました
ko: Azure Data CLI에 대한 EULA 동의 방법 선택
pt_br: Escolha como a aceitação do EULA para a CLI de Dados do Azure será feita
ru: Выберите способ принятия условий лицензионного соглашения для Azure Data CLI
zh_hans: 选择如何接受 Azure Data CLI 的 EULA
zh_hant: 選擇接受 Azure Data CLI 之 EULA 的方式

# azdata.acceptEula.prompt.description
source: The user will be prompted for acceptance of EULA for the Azure Data CLI
de: Der Benutzer wird aufgefordert, die Lizenzbedingungen für die Azure Data CLI zu akzeptieren
es: Se solicitará al usuario que acepte el CLUF para la CLI de Azure Data.
fr: L’utilisateur sera invité à accepter le CLUF pour Azure Data CLI
it: All'utente verrà richiesta l'accettazione del contratto di licenza per l'interfaccia della riga di comando di Azure Data
ja: ユーザーに Azure Data CLI の EULA への同意を促すダイアログが表示されます
ko: 사용자에게 Azure Data CLI에 대한 EULA에 동의하라는 메시지가 표시됩니다.
pt_br: O usuário será solicitado a aceitar o EULA para a CLI de Dados do Azure
ru: Пользователю будет предложено принять условия лицензионного соглашения для Azure Data CLI
zh_hans: 系统将提示用户接受 Azure 数据 CLI 的 EULA
zh_hant: 使用者將會收到接受 Azure Data CLI 之 EULA 的提示

# azdata.acceptEula.dontPrompt.description
source: The user will not be prompted for acceptance of EULA for the Azure Data CLI
de: Der Benutzer wird nicht aufgefordert, die Lizenzbedingungen für die Azure Data CLI zu akzeptieren
es: No se solicitará al usuario que acepte el CLUF para la CLI de Azure Data.
fr: L’utilisateur ne sera pas invité à accepter le CLUF pour Azure Data CLI
it: All'utente non verrà richiesta l'accettazione del contratto di licenza per l'interfaccia della riga di comando di Azure Data
ja: ユーザーに Azure Data CLI の EULA への同意を促すダイアログが表示されません
ko: 사용자에게 Azure Data CLI에 대한 EULA에 동의하라는 메시지가 표시되지 않습니다.
pt_br: O usuário não será solicitado a aceitar o EULA para a CLI de Dados do Azure
ru: Пользователю не будет предложено принять условия лицензионного соглашения для Azure Data CLI
zh_hans: 系统将不提示用户接受 Azure Data CLI 的 EULA
zh_hant: 使用者將不會收到接受 Azure Data CLI 之 EULA 的提示

# azdata.install.description
source: Choose how install of Azure Data CLI is done
de: Entscheiden Sie, wie Azure Data CLI installiert werden soll
es: Elija cómo se realizará la instalación de la CLI de Azure Data
fr: Choisir comment l’installation de l’interface Azure Data CLI est effectuée
it: Scegliere l'operazione di installazione dell'interfaccia della riga di comando di Azure Data
ja: Azure Data CLI のインストール方法の選択
ko: Azure Data CLI 설치 방법 선택
pt_br: Escolha como a instalação da CLI de Dados do Azure é feita
ru: Выберите способ установки Azure Data CLI
zh_hans: 选择如何完成 Azure Data CLI 的安装
zh_hant: 選擇安裝 Azure Data CLI 的方式

# azdata.install.prompt.description
source: The user will be prompted for installation of the Azure Data CLI
de: Der Benutzer wird aufgefordert, die Azure Data CLI zu installieren
es: Se solicitará al usuario que instale la CLI de Azure Data
fr: L'utilisateur sera invité à installer Azure Data CLI.
it: All'utente verrà richiesta l’installazione dell’interfaccia della riga di comando di Azure Data
ja: ユーザーに Azure Data CLI のインストールを促すダイアログが表示されます
ko: 사용자에게 Azure Data CLI를 설치하라는 메시지가 표시됩니다.
pt_br: O usuário será solicitado a instalar a CLI de Dados do Azure
ru: Пользователю будет выдаваться запрос на установку Azure Data CLI
zh_hans: 系统将提示用户安装 Azure Data CLI
zh_hant: 使用者將會收到 Azure Data CLI 安裝的提示

# azdata.install.dontPrompt.description
source: The user will not be prompted for installation of the Azure Data CLI
de: Der Benutzer wird nicht aufgefordert, die Azure Data CLI zu installieren
es: No se solicitará al usuario que instale la CLI de Azure Data
fr: L’utilisateur ne sera pas invité à installer Azure Data CLI
it: All'utente non verrà richiesta l’installazione dell’interfaccia della riga di comando di Azure Data
ja: ユーザーに Azure Data CLI のインストールを促すダイアログが表示されません
ko: 사용자에게 Azure Data CLI를 설치하라는 메시지가 표시되지 않습니다.
pt_br: O usuário não será solicitado a instalar a CLI de Dados do Azure
ru: Пользователю не будет выдаваться запрос на установку Azure Data CLI
zh_hans: 系统将不会提示用户安装 Azure Data CLI
zh_hant: 使用者將不會收到 Azure Data CLI 安裝的提示

# azdata.update.description
source: Choose whether you will be prompted when an update of the Azure Data CLI is available.
de: Entscheiden Sie, ob Sie zur Aktualisierung aufgefordert werden wollen, wenn ein Update für Azure Data CLI verfügbar ist.
es: Elija si desea que se le pregunte cuando haya una actualización de la CLI de Azure Data disponible.
fr: Indiquez si une mise à jour de l’interface de ligne de commande Azure Data CLI est disponible.
it: Consente di scegliere se verrà richiesto quando è disponibile un aggiornamento dell'interfaccia della riga di comando di Azure Data.
ja: Azure Data CLI が更新可能になった場合にダイアログを表示するかどうかを選択します。
ko: Azure Data CLI 업데이트를 사용할 수 있는 경우 메시지를 표시할지 여부를 선택합니다.
pt_br: Escolha se você será solicitado quando uma atualização da CLI de Dados do Azure estiver disponível.
ru: Выберите, будет ли отображаться запрос, когда станет доступно обновление Azure Data CLI.
zh_hans: 选择当 Azure Data CLI 更新可用时系统是否向你发出提示。
zh_hant: 選擇當 Azure Data CLI 有更新時是否提示您。

# azdata.requiredUpdate.description
source: Choose whether you will be prompted when a required update of the Azure Data CLI is available.
de: Entscheiden Sie, ob Sie zur Aktualisierung aufgefordert werden wollen, wenn ein erforderliches Update für Azure Data CLI verfügbar ist.
es: Elija si desea que se le pregunte cuando esté disponible una actualización necesaria de la CLI de Azure Data.
fr: Indiquez si une mise à jour obligatoire de l’interface de ligne de commande Azure Data CLI est disponible.
it: Consente di scegliere se verrà richiesto quando è disponibile l’aggiornamento richiesto dell'interfaccia della riga di comando di Azure Data.
ja: 利用可能な Azure Data CLI の更新が必要な場合にダイアログを表示するかどうかを選択します。
ko: Azure Data CLI의 필수 업데이트를 사용할 수 있을 경우 메시지를 표시할지 여부를 선택합니다.
pt_br: Escolha se você será solicitado quando uma atualização necessária da CLI de Dados do Azure estiver disponível.
ru: Выберите, будет ли отображаться запрос, когда станет доступно обязательное обновление Azure Data CLI.
zh_hans: 选择当 Azure Data CLI 必需更新可用时系统是否向你发出提示。
zh_hant: 選擇當 Azure Data CLI 有必要更新時是否提示您。

# azdata.update.prompt.description
source: The user will be prompted for update of the Azure Data CLI
de: Der Benutzer wird aufgefordert, die Azure Data CLI zu aktualisieren
es: Se solicitará al usuario que actualice la CLI de Azure Data.
fr: L’utilisateur est invité à effectuer une mise à jour d’Azure Data CLI
it: All'utente verrà richiesto l'aggiornamento dell’interfaccia della riga di comando di Azure Data
ja: ユーザーに Azure Data CLI の更新を促すダイアログが表示されます
ko: 사용자에게 Azure Data CLI를 업데이트하라는 메시지가 표시됩니다.
pt_br: O usuário será solicitado a atualizar a CLI de Dados do Azure
ru: Пользователю будет выдаваться запрос на обновление Azure Data CLI
zh_hans: 系统将提示用户更新 Azure Data CLI
zh_hant: 使用者將會收到 Azure Data CLI 更新的提示

# azdata.update.dontPrompt.description
source: The user will not be prompted for update of the Azure Data CLI
de: Der Benutzer wird nicht aufgefordert, die Azure Data CLI zu aktualisieren
es: No se preguntará al usuario si desea actualizar la CLI de Azure Data.
fr: L’utilisateur ne sera pas invité à effectuer la mise à jour d’Azure Data
it: All'utente non verrà richiesto l'aggiornamento dell’interfaccia della riga di comando di Azure Data
ja: ユーザーに Azure Data CLI の更新を促すダイアログが表示されません
ko: 사용자에게 Azure Data CLI를 업데이트하라는 메시지가 표시되지 않습니다.
pt_br: O usuário não será solicitado a atualizar a CLI de Dados do Azure
ru: Пользователю не будет выдаваться запрос на обновление Azure Data CLI
zh_hans: 系统将不会提示用户更新 Azure Data CLI
zh_hant: 使用者將不會收到 Azure Data CLI 更新的提示

# azdata.azdata
source: Azure Data CLI
es: CLI de Azure Data
it: Interfaccia della riga di comando di Azure Data
pt_br: CLI de Dados do Azure

# azdata.searchingForAzdata
source: Searching for existing Azure Data CLI installation...
de: Es wird nach einer vorhandenen Azure Data CLI-Installation gesucht...
es: Buscando la instalación existente de la CLI de Azure Data...
fr: Recherche de l’installation existante d’Azure Data CLI...
it: Ricerca dell'installazione dell’interfaccia della riga di comando di Azure Data esistente in corso...
ja: 既存の Azure Data CLI のインストールを検索しています...
ko: 기존 Azure Data CLI 설치를 검색하는 중...
pt_br: Procurando instalação existente da CLI de Dados do Azure...
ru: Поиск существующей установки Azure Data CLI...
zh_hans: 正在搜索现有 Azure Data CLI 安装...
zh_hant: 正在搜尋現有的 Azure Data CLI 安裝...

# azdata.foundExistingAzdata
source: Found existing Azure Data CLI installation of version (v{0}) at path:{1}
de: Es wurde eine vorhandene Azure Data CLI-Installation der Version (v{0}) unter Pfad {1} gefunden
es: Se encontró una instalación existente de la versión (v{0}) de la CLI de Azure Data en la ruta de acceso:{1}
fr: Installation d’Azure Data CLI existante de la version (v{0}) trouvée dans le chemin d’accès : {1}
it: È stata trovata un'installazione della versione dell’interfaccia della riga di comando di Azure Data (v{0}) nel percorso: {1}
ja: バージョン (v{0}) の既存の Azure Data CLI のインストールが、パス {1} で見つかりました。
ko: 버전(v{0})의 기존 Azure Data CLI 설치를 경로: {1}에서 찾았습니다.
pt_br: Foi encontrada uma instalação existente da CLI de Dados do Azure da versão (v{0}) no caminho: {1}
ru: Найдена существующая установка Azure Data CLI версии (v{0}) в пути:{1}
zh_hans: 在路径: {1} 处找到版本(v{0}) 的现有 Azure Data CLI 安装
zh_hant: 找到現有的 Azure Data CLI 安裝版本 (v{0})，路徑: {1}

# azdata.downloadingProgressMb
source: Downloading ({0} / {1} MB)
de: ({0} / {1} MB) wird heruntergeladen
es: Descargando ({0} / {1} MB)
fr: Téléchargement ({0} / {1} Mo)
it: Downloading di ({0}/{1}MB)
ja: ダウンロード中 ({0} / {1} MB)
ko: 다운로드 중({0}/{1}MB)
pt_br: Baixando ({0} / {1} MB)
ru: Выполняется скачивание ({0} / {1} МБ)
zh_hans: 正在下载({0} / {1} MB)
zh_hant: 正在下載 ({0} / {1} MB)

# azdata.downloadFinished
source: Download finished
de: Download abgeschlossen
es: Descarga finalizada
fr: Téléchargement terminé
it: Download completato
ja: ダウンロードが完了しました
ko: 다운로드 마침
pt_br: Download concluído
ru: Загрузка завершена
zh_hans: 已完成下载
zh_hant: 下載完成

# azdata.installingAzdata
source: Installing Azure Data CLI...
de: Azure Data CLI wird installiert...
es: Se está instalando la CLI de Azure Data
fr: Installation d’Azure Data CLI...
it: Installazione dell'interfaccia della riga di comando di Azure Data...
ja: Azure Data CLI をインストールしています...
ko: Azure Data CLI를 설치하는 중...
pt_br: Instalando a CLI de Dados do Azure...
ru: Идет установка Azure Data CLI...
zh_hans: 正在安装 Azure Data CLI...
zh_hant: 正在安裝 Azure Data CLI...

# azdata.updatingAzdata
source: Updating Azure Data CLI...
de: Azure Data CLI wird aktualisiert...
es: Actualizando la CLI de Azure Data...
fr: Mise à jour d’Azure Data CLI...
it: Aggiornamento interfaccia della riga di comando di Azure Data...
ja: Azure Data CLI を更新しています...
ko: Azure Data CLI를 업데이트하는 중...
pt_br: Atualizando a CLI de Dados do Azure...
ru: Обновление Azure Data CLI...
zh_hans: 正在更新 Azure Data CLI...
zh_hant: 正在更新 Azure Data CLI...

# azdata.azdataInstalled
source: Azure Data CLI was successfully installed. Restarting Azure Data Studio is required to complete configuration - features will not be activated until this is done.
de: Azure Data CLI wurde erfolgreich installiert. Azure Data Studio muss neugestartet werden, um die Konfiguration abzuschließen. Die Funktionen werden erst danach aktiviert.
es: La CLI de Azure Data se instaló correctamente. Es necesario reiniciar Azure Data Studio para completar la configuración: las características no se activarán hasta que se haya realizado esta operación.
fr: Azure Data CLI a été installé avec succès. Le redémarrage d’Azure Data Studio est requis pour terminer la configuration : les fonctionnalités ne seront pas activées tant que cela n’est pas fait.
it: L'installazione dell’interfaccia della riga di comando di Azure Data è stata completata. Il riavvio di Azure Data Studio è necessario per completare la configurazione: le funzionalità non verranno attivate finché non viene completata.
ja: Azure Data CLI が正常にインストールされました。構成を完了するには、Azure Data Studio を再起動する必要があります。この操作が完了するまで、機能はアクティブ化されません。
ko: Azure Data CLI를 설치했습니다. 구성을 완료하려면 Azure Data Studio를 다시 시작해야 합니다. 이 작업이 완료될 때까지 기능이 활성화되지 않습니다.
pt_br: A CLI de Dados do Azure foi instalada com êxito. A reinicialização do Azure Data Studio é necessária para concluir a configuração. Os recursos não serão ativados até que isso seja feito.
ru: Служба Azure Data CLI успешно установлена. Перезапуск Azure Data Studio необходим для завершения настройки — функции не будут активированы, пока это не будет сделано.
zh_hans: Azure Data CLI 已成功安装。需要重启 Azure Data Studio 才能完成配置 - 在此操作完成之前，将不会激活功能。
zh_hant: 已成功安裝 Azure Data CLI。需要重新啟動 Azure Data Studio 才能完成設定 - 除非完成此作業，否則功能將不會啟用。

# azdata.azdataUpdated
source: Azure Data CLI was successfully updated to version: {0}.
de: Azure Data CLI wurde erfolgreich auf Version {0} aktualisiert.
es: La CLI de Azure Data se actualizó correctamente a la versión: {0}.
fr: Azure Data CLI a été mis à jour avec la version : {0}.
it: L'interfaccia della riga di comando di Azure Data è stata aggiornata alla versione: {0}.
ja: Azure Data CLI がバージョン {0} に正常に更新されました
ko: Azure Data CLI가 버전: {0}(으)로 업데이트되었습니다.
pt_br: A CLI de Dados do Azure foi atualizada com êxito para a versão: {0}.
ru: Служба Azure Data CLI успешно обновлена до версии: {0}.
zh_hans: 已成功将 Azure Data CLI 更新到版本: {0}。
zh_hant: Azure Data CLI 已成功更新為版本: {0}。

# azdata.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# azdata.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# azdata.accept
source: Accept
de: Akzeptieren
es: Aceptar
fr: Accepter
it: Accetto
ja: 承諾する
ko: 동의
pt_br: Aceitar
ru: Принять
zh_hans: 接受
zh_hant: 接受

# azdata.decline
source: Decline
de: Ablehnen
es: Rechazar
fr: Refuser
it: Rifiuta
ja: 同意しない
ko: 거부
pt_br: Recusar
ru: Отклонить
zh_hans: 拒绝
zh_hant: 拒絕

# azdata.doNotAskAgain
source: Don't Ask Again
de: Nicht mehr fragen
es: No volver a preguntar
fr: Ne plus me poser la question
it: Non chiedere più
ja: 今後このメッセージを表示しない
ko: 다시 묻지 않음
pt_br: Não perguntar novamente
ru: Больше не спрашивать
zh_hans: 不再询问
zh_hant: 不要再詢問

# azdata.askLater
source: Ask Later
de: Später fragen
es: Preguntar más tarde
fr: Demander plus tard
it: Chiedi più tardi
ja: 後で依頼する
ko: 나중에 물어보기
pt_br: Perguntar mais tarde
ru: Спросить позже
zh_hans: 稍后询问
zh_hant: 稍後再問我

# azdata.downloadingTo
source: Downloading {0} from {1} to {2}
de: {0} von {1} wird nach {2} heruntergeladen
es: Descargando {0} de {1} a {2}
fr: Téléchargement de {0} à partir de {1} vers {2}
it: Downloading {0} da {1} a {2} in corso
ja: {0} を {1} から {2} にダウンロードしています
ko: {0}을 {1}에서 {2}(으)로 다운로드하는 중
pt_br: Baixando {0} de {1} para {2}
ru: Идет скачивание {0} из {1} в {2}
zh_hans: 正在将 {0} 从 {1} 下载到 {2}
zh_hant: 正在將 {0} 從 {1} 下載到 {2}

# azdata.executingCommand
source: Executing command: '{0} {1}'
de: Der Befehl „{0} {1}“ wird ausgeführt
es: Ejecutando el comando: “{0} {1}”
fr: Exécution de la commande : « {0} {1} »
it: Esecuzione del comando: '{0} {1}‘
ja: コマンドの実行中: '{0} {1}'
ko: 명령 실행 중: '{0} {1}'
pt_br: Executando comando: '{0}{1}'
ru: Выполнение команды: "{0} {1}"
zh_hans: 正在执行命令:“{0} {1}”
zh_hant: 正在執行命令: '{0} {1}'

# azdata.checkingLatestAzdataVersion
source: Checking for latest available version of Azure Data CLI
de: Es wird nach der neuesten verfügbaren Version von Azure Data CLI gesucht
es: Buscando la última versión disponible de la CLI de Azure Data
fr: Vérification de la dernière version disponible d'Azure Data CLI
it: Verifica della versione più recente disponibile dell'interfaccia della riga di comando di Azure Data
ja: Azure Data CLI の使用可能な最新バージョンを確認しています
ko: 사용 가능한 최신 버전의 Azure Data CLI를 확인하는 중
pt_br: Verificando a versão mais recente disponível da CLI de Dados do Azure
ru: Проверка последней доступной версии Azure Data CLI
zh_hans: 正在检查 Azure Data CLI 的最新可用版本
zh_hant: 正在檢查 Azure Data CLI 最新可用的版本

# azdata.gettingTextContentsOfUrl
source: Getting text contents of resource at URL {0}
de: Textinhalte der Ressource werden unter URL {0} abgerufen
es: Obteniendo el contenido de texto del recurso en la dirección URL {0}
fr: Obtention du contenu textuel de la ressource à l’URL {0}
it: Recupero dei contenuti di testo della risorsa all'URL {0}
ja: URL {0} でリソースのテキスト コンテンツを取得しています
ko: URL {0}에서 리소스의 텍스트 콘텐츠를 가져오고 있습니다.
pt_br: Obtendo conteúdo de texto do recurso em URL {0}
ru: Получение текстового содержимого ресурса по URL-адресу {0}
zh_hans: 正在获取位于 URL {0} 的资源的文本内容
zh_hant: 正在取得位於 URL {0} 之資源的文字內容

# azdata.versionForUpdate
source: Found version: {0} that Azure Data CLI can be updated to from current version: {1}.
de: Gefundene Version: {0}, auf die Azure Data CLI von der aktuellen Version {1} aktualisiert werden kann.
es: Versión encontrada: {0} en la que se puede actualizar la CLI de Azure Data a partir de la versión actual: {1}.
fr: Version trouvée : {0} vers laquelle Azure Data CLI peut être mis à jour à partir de la version actuelle : {1}.
it: Versione trovata: {0} è quindi possibile aggiornare l’interfaccia della riga di comando di Azure Data dalla versione corrente: {1}.
ja: バージョン {0} が見つかりました。Azure Data CLI は、現在のバージョンから {1} を更新できます。
ko: 찾은 버전: 현재 버전 {1}에서 Azure Data CLI를 업데이트할 수 있는 버전: {0}
pt_br: Versão encontrada: {0} a CLI de Dados do Azure pode ser atualizada da versão atual: {1}.
ru: Найденная версия: {0}, до которой можно обновить Azure Data CLI с текущей версии: {1}.
zh_hans: 找到 Azure Data CLI 可以从当前版本: {1} 更新到的版本: {0}。
zh_hant: 找到 Azure Data CLI 可從目前版本: {1} 更新的版本: {0}。

# azdata.latestAzdataVersionAvailable
source: Latest available Azure Data CLI version: {0}.
de: Neueste verfügbare Version von Azure Data CLI: {0}.
es: Última versión disponible de CLI de Azure Data: {0}.
fr: Dernière version disponible de l’interface Azure Data CLI : {0}.
it: Versione più recente disponibile dell’interfaccia della riga di comando di Azure Data: {0}.
ja: Azure Data CLI の最新バージョン: {0}。
ko: 사용 가능한 최신 Azure Data CLI 버전: {0}.
pt_br: Versão mais recente da CLI de Dados do Azure: {0}.
ru: Последняя доступная версия Azure Data CLI: {0}.
zh_hans: 最新可用的 Azure Data CLI 版本: {0}。
zh_hant: 最新可用的 Azure Data CLI 版本: {0}。

# azdata.couldNotFindAzdata
source: Could not find Azure Data CLI. Error: {0}
de: Azure Data CLI wurde nicht gefunden. Fehler: {0}
es: No se pudo encontrar la CLI de Azure Data. Error: {0}
fr: Impossible de trouver l’interface Azure Data CLI. Erreur : {0}
it: Non è stato possibile trovare l’interfaccia della riga di comando di Azure Data. Errore: {0}
ja: Azure Data CLI が見つかりませんでした。エラー: {0}
ko: Azure Data CLI를 찾을 수 없습니다. 오류: {0}
pt_br: Não foi possível localizar a CLI de Dados do Azure. Erro: {0}
ru: Не удалось найти Azure Data CLI. Ошибка: {0}
zh_hans: 找不到 Azure Data CLI。错误: {0}
zh_hant: 找不到 Azure Data CLI。錯誤: {0}

# azdata.currentlyInstalledVersionIsLatest
source: Currently installed version of Azure Data CLI: {0} is same or newer than any other version available
de: Aktuell installierte Version von Azure Data CLI: {0} ist gleich oder neuer als alle anderen verfügbaren Versionen
es: Versión de la CLI de Azure Data instalada actualmente: {0} es igual o más reciente que cualquier otra versión disponible
fr: Version actuellement installée d’Azure Data CLI : {0} est identique ou plus récente qu’une autre version disponible
it: La versione attualmente installata dell'interfaccia della riga di comando di Azure Data: {0} è uguale o successiva a qualsiasi altra versione disponibile
ja: 現在インストールされている Azure Data CL {0} は、使用可能な他のバージョンと同じか、それより新しいバージョンです
ko: 현재 설치된 Azure Data CLI 버전: {0}은(는) 사용 가능한 다른 버전과 동일하거나 최신 버전입니다.
pt_br: Versão atualmente instalada da CLI de Dados do Azure: {0} é igual ou mais recente do que qualquer outra versão disponível
ru: Установленная в настоящее время версия Azure Data CLI: {0} или более новая, чем любая другая доступная версия
zh_hans: 当前安装的 Azure Data CLI 版本: {0} 与任何其他可用版本相同或更高
zh_hant: 目前安裝的 Azure Data CLI 版本: {0} 與其他可用版本相同或更新
