Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/azdata.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# azdata.userResponseInstall
source: User Response on prompt to install Azure Data CLI: {0}
de: Benutzerantwort auf die Aufforderung zur Installation von Azure Data CLI: {0}
es: Respuesta del usuario al mensaje para instalar la CLI de Azure Data: {0}
fr: Réponse de l’utilisateur à l’invite d’installation d’Azure Data CLI : {0}
it: Risposta dell'utente alla richiesta di installazione dell'interfaccia della riga di comando di Azure Data: {0}
ja: Azure Data CLI のインストールを促すダイアログの表示でのユーザー応答: {0}
ko: Azure Data CLI 설치 프롬프트에 대한 사용자 응답: {0}
pt_br: Resposta do usuário no prompt para instalar a CLI de Dados do Azure: {0}
ru: Ответ пользователя при запросе на установку Azure Data CLI: {0}
zh_hans: 收到安装 Azure Data CLI 的提示时的用户响应: {0}
zh_hant: 提示安裝 Azure Data CLI 時的使用者回應: {0}

# azdata.userResponseUpdate
source: User Response on prompt to update Azure Data CLI: {0}
de: Benutzerantwort auf die Aufforderung zum Aktualisieren von Azure Data CLI: {0}
es: Respuesta del usuario en el mensaje de actualización de la CLI de Azure Data: {0}
fr: Réponse de l’utilisateur à l’invite pour mettre à jour Azure Data CLI : {0}
it: Risposta dell'utente alla richiesta di aggiornamento dell'interfaccia della riga di comando di Azure Data: {0}
ja: Azure Data CLI の更新を促すダイアログの表示でのユーザー応答: {0}
ko: Azure Data CLI 업데이트 프롬프트에 대한 사용자 응답: {0}
pt_br: Resposta do usuário no prompt para atualizar a CLI de Dados do Azure: {0}
ru: Ответ пользователя при запросе на обновление Azure Data CLI: {0}
zh_hans: 提示更新 Azure Data CLI 时的用户响应: {0}
zh_hant: 提示更新 Azure Data CLI 時的使用者回應: {0}

# azdata.userRequestedInstall
source: User requested to install Azure Data CLI using 'Azure Data CLI: Install' command
de: Der Benutzer hat die Installation von Azure Data CLI mithilfe des Befehls „Azure Data CLI: Installieren“ angefordert
es: El usuario solicitó instalar la CLI de Azure Data a través del comando “CLI de Azure: instalar”
fr: L'utilisateur a demandé à installer Azure Data CLI à l'aide de la commande « Azure Data CLI : Installer ».
it: L'utente ha richiesto di installare l’interfaccia della riga di comando di Azure Data usando il comando ' Azure Data CLI: install '
ja: ユーザーが 'Azure Data CLI: Install' コマンドを使用して Azure Data CLI のインストールを要求しました
ko: 사용자가 'Azure Data CLI: 설치' 명령을 사용하여 Azure Data CLI를 설치하도록 요청했습니다.
pt_br: O usuário solicitou a instalação da CLI de Dados do Azure usando o comando 'CLI de Dados do Azure: Instalar'
ru: Пользователь запросил установку Azure Data CLI с помощью команды "Azure Data CLI: установка"
zh_hans: 用户已请求使用“Azure Data CLI: 安装”命令来安装 Azure Data CLI
zh_hant: 使用者要求使用「Azure Data CLI: 安裝」命令安裝 Azure Data CLI

# azdata.userRequestedUpdate
source: User requested to update Azure Data CLI using 'Azure Data CLI: Check for Update' command
de: Der Benutzer hat die Aktualisierung der Azure Data CLI mit dem Befehl „Azure Data CLI: Nach Update suchen“ angefordert
es: El usuario solicitó la actualización de CLI de Azure Data con el comando “CLI de Azure Data: buscar actualizaciones”
fr: L’utilisateur a demandé la mise à jour de CLI Azure Data à l’aide de la commande « Azure Data CLI : rechercher une mise à jour »
it: L'utente ha richiesto di aggiornare l'interfaccia della riga di comando di Azure Data usando il comando ' Azure Data CLI: check for Update '
ja: ユーザーが 'Azure Data CLI: 更新の確認' コマンドを使用して Azure Data CLI の更新を要求しました
ko: 사용자가 'Azure Data CLI: 업데이트 확인' 명령을 사용하여 Azure Data CLI를 업데이트하도록 요청했습니다.
pt_br: O usuário solicitou a atualização da CLI de Dados do Azure usando o comando 'CLI de Dados do Azure: verificar se há atualização'
ru: Пользователь запросил обновление Azure CLI с помощью команды "Azure Data CLI: проверка на наличие обновления"
zh_hans: 用户已请求使用“Azure Data CLI: 检查更新”命令更新 Azure Data CLI
zh_hant: 使用者要求使用「Azure Data CLI: 檢查更新」命令更新 Azure Data CLI

# azdata.acceptEula
source: User requested to be prompted for accepting EULA by invoking 'Azure Data CLI: Accept EULA' command
de: Der Benutzer hat die Annahme der Lizenzbedingungen durch den Aufruf des Befehls „Azure Data CLI: Lizenzbedingungen akzeptieren“ angefordert
es: El usuario solicitó que se le pregunte al aceptar el CLUF invocando el comando "CLI de Azure Data: aceptar CLUF"
fr: L'utilisateur a demandé à être invité à accepter le CLUF en appelant la commande « Azure Data CLI : accepter le CLUF »
it: L'utente ha richiesto che gli venga inviata la richiesta di accettare il contratto di licenza richiamando il comando 'Azure Data CLI: Accept EULA '
ja: ユーザーが 'Azure Data CLI: EULA の承諾' コマンドを呼び出して EULA を承諾するダイアログの表示を要求しました
ko: 사용자가 'Azure Data CLI: EULA 동의' 명령을 호출하여 EULA 동의를 묻는 메시지가 표시되도록 요청했습니다.
pt_br: O usuário solicitou a aceitação do EULA invocando o comando 'CLI de Dados do Azure: Aceitar EULA'
ru: Пользователю требуется запросить принятие лицензионного соглашения, вызвав команду "Azure Data CLI: принять условия лицензионного соглашения"
zh_hans: 用户已请求通过调用“Azure Data CLI: 接受 EULA”命令收到接受 EULA 的提示
zh_hant: 使用者要求收到透過叫用「Azure Data CLI: 接受 EULA」命令接受 EULA 的提示

# azdata.updateCheckSkipped
source: No check for new Azure Data CLI version availability performed as Azure Data CLI was not found to be installed
de: Es wurde nicht nach neuen verfügbaren Versionen von Azure Data CLI gesucht, da Azure Data CLI nicht für die Installation gefunden wurde
es: No se encontró ninguna comprobación de la disponibilidad de la nueva versión de la CLI de Azure Data que se ha realizado como CLI de Azure Data para instalarse
fr: Aucune vérification de la disponibilité de la nouvelle version d’Azure Data CLI effectuée car Azure Data CLI n’a pas été trouvée pour être installée
it: Non è stato trovato alcun controllo per la nuova disponibilità della versione dell'interfaccia della riga di comando di Azure Data per l'installazione
ja: Azure Data CLI がインストールされていないことが判明したため、新しい Azure Data CLI バージョンの可用性のチェックが実行されませんでした。
ko: Azure Data CLI가 설치되어 있지 않아 수행된 새 Azure Data CLI 버전 가용성을 확인하지 못했습니다.
pt_br: Nenhuma verificação para a nova disponibilidade de versão da CLI de Dados do Azure foi executada, pois a CLI de Dados do Azure não foi encontrada para ser instalada
ru: Проверка доступности новой версии Azure Data CLI не выполнена, так как не удалось установить Azure Data CLI
zh_hans: 未检查新的 Azure Data CLI 版本可用性，因为未找到要安装的 Azure Data CLI
zh_hant: 因為找不到要安裝的 Azure Data CLI，所以未執行新的 Azure Data CLI 版本可用性檢查

# azdata.eulaNotAccepted
source: Microsoft Privacy statement and Azure Data CLI license terms have not been accepted. Execute the command: [Azure Data CLI: Accept EULA](command:azdata.acceptEula) to accept EULA to enable the features that requires Azure Data CLI.
de: Die Microsoft-Datenschutzerklärung und die Azure Data CLI-Lizenzbedingungen wurden nicht akzeptiert. Führen Sie den Befehl „[Azure Data CLI: Lizenzbedingungen akzeptieren](Befehl: azdata.acceptEula)“ aus, um die Lizenzbedingungen zu akzeptieren und die Features zu aktivieren, für die Azure Data CLI erforderlich ist.
es: No se han aceptado la declaración de privacidad de Microsoft ni los términos de licencia de la CLI de Azure Data. Ejecutar el comando: [CLI de Azure Data: aceptar CLUF] (comando: azdata.acceptEula) para aceptar el CLUF con el fin de habilitar las características que requieren la CLI de Azure Data.
fr: La déclaration de confidentialité de Microsoft et les termes de la licence Azure Data CLI n'ont pas été acceptés. Exécutez la commande : [Azure Data CLI : Accept EULA](command:azdata.acceptEula) pour accepter le CLUF afin d'activer les fonctions qui nécessitent Azure Data CLI.
it: L'informativa sulla privacy Microsoft e le condizioni di licenza dell’interfaccia della riga di comando di Azure Data non sono state accettate. Eseguire il comando: [Azure Data CLI: Accept EULA] (comando: azdata. acceptEula) per accettare il contratto di licenza per abilitare le funzionalità che richiedono l’interfaccia della riga di comando di Azure Data.
ja: Microsoft のプライバシーに関する声明と Azure Data CLI ライセンス条項が承諾されていません。コマンド [Azure Data CLI: Accept EULA] (コマンド: azdata.acceptEula) を実行して EULA に同意し、Azure Data CLI を必要とする機能を有効化します。
ko: Microsoft 개인정보처리방침 및 Azure Data CLI 사용 조건에 동의하지 않았습니다. [Azure Data CLI: EULA 동의](command:azdata.acceptEula) 명령을 실행하여 EULA에 동의하여 Azure Data CLI에서 필요한 기능을 사용하도록 설정합니다.
pt_br: A Política de Privacidade da Microsoft e os termos de licença da CLI de Dados do Azure não foram aceitos. Execute o comando: [CLI de Dados do Azure: Aceitar EULA](command:azdata.acceptEula) para aceitar o EULA e habilitar os recursos que exigem a CLI de Dados do Azure.
ru: Заявление о конфиденциальности Майкрософт и условия лицензии Azure Data CLI не приняты. Выполните команду: [Azure Data CLI: принять условия лицензионного соглашения](command:azdata.acceptEula), чтобы принять условия лицензионного соглашения для включения функций, требующих Azure Data CLI.
zh_hans: 未接受 Microsoft 隐私声明和 Azure Data CLI 许可条款。执行命令: [Azure Data CLI: 接受 EULA](command:azdata.acceptEula)接受 EULA，以启用需要 Azure Data CLI 的功能。
zh_hant: 尚未接受 Microsoft 隱私權聲明及 Azure Data CLI 授權條款。請執行命令: [Azure Data CLI: 接受 EULA](command:azdata.acceptEula) 接受 EULA 以啟用需要 Azure Data CLI 的功能。

# azdata.promptForEula
source: It is required to accept the [Microsoft Privacy Statement]({0}) and the [Azure Data CLI license terms]({1}) to use this extension. Declining this will result in some features not working.
de: Die [Microsoft-Datenschutzbestimmungen]({0}) und die [Azure Data CLI-Lizenzbedingungen]({1}) müssen akzeptiert werden, um diese Erweiterung zu verwenden. Wenn Sie sie ablehnen, funktionieren einige Features nicht.
es: Es necesario aceptar la [Declaración de privacidad de Microsoft] ({0}) y los [Términos de licencia de la CLI de Azure Data] ({1}) para usar esta extensión. Si esto se rechaza, algunas características no funcionarán.
fr: Il est nécessaire d’accepter le [Déclaration de confidentialité Microsoft] ({0}) et le [Termes du contrat de licence Azure Data CLI] ({1}) pour utiliser cette extension. Si vous refusez cela, certaines fonctionnalités ne fonctionneront pas.
it: Per usare questa estensione, è necessario accettare [Microsoft Privacy Statement] ({0}) e [Azure Data CLI license terms] ({1}). Se questi criteri non vengono accettati, le funzionalità non verranno attivate.
ja: この拡張機能を使用するには、[Microsoft プライバシーに関する声明] ({0}) および [Azure Data CLI ライセンス条項] ({1}) に同意する必要があります。これを拒否すると、一部の機能が動作しなくなります。
ko: 이 확장을 사용하려면 [Microsoft 개인정보처리방침]({0}) 및 [Azure Data CLI 사용 조건]({1})에 동의해야 합니다. 이를 거부하면 일부 기능이 작동하지 않습니다.
pt_br: É necessário aceitar a [Política de Privacidade da Microsoft]({0}) e os [termos de licença da CLI de Dados do Azure]({1}) para usar esta extensão. Recusar isso fará com que alguns recursos não funcionem.
ru: Для использования этого расширения необходимо принять [Заявление о конфиденциальности Майкрософт]({0}) и [условия лицензии Azure Data CLI] ({1}). Отказ от этого приведет к тому, что некоторые функции не будут работать.
zh_hans: 要使用此扩展，需要接受 [Microsoft 隐私声明] ({0})和 [Azure Data CLI 许可条款] ({1})。拒绝此操作将导致一些功能无法工作。
zh_hant: 必須接受 [Microsoft 隱私權聲明]({0})，以及 [Azure Data CLI 授權條款]({1}) 才能使用此延伸模組。如果拒絕會導致某些功能無法運作。

# azdata.promptForEulaResponse
source: User response to EULA prompt: {0}
de: Benutzerantwort auf Lizenzbedingung-Eingabeaufforderung: {0}
es: Respuesta del usuario a la solicitud de CLUF: {0}
fr: Réponse de l’utilisateur à l’invite du CLUF : {0}
it: Risposta dell'utente alla richiesta di EULA: {0}
ja: EULA プロンプトに対するユーザーの応答: {0}
ko: EULA 프롬프트에 대한 사용자 응답: {0}
pt_br: Resposta do usuário ao prompt do EULA: {0}
ru: Ответ пользователя на запрос лицензионного соглашения: {0}
zh_hans: 用户对 EULA 提示的响应: {0}
zh_hant: 使用者對 EULA 提示的回應: {0}

# azdata.eulaAcceptedStateOnStartup
source: 'EULA Accepted' state on startup: {0}
de: Status „Lizenzbedingungen akzeptiert“ beim Start: {0}
es: Estado "CLUF aceptado" en el inicio: {0}
fr: État « CLUF accepté » au démarrage : {0}
it: Stato ' EULA accettato ' all'avvio: {0}
ja: スタートアップ時の 'EULA 承諾済み' 状態: {0}
ko: 시작 시의 ' EULA 동의함 ' 상태: {0}
pt_br: Estado 'EULA Aceito' na inicialização: {0}
ru: Состояние "Лицензионное соглашение принято" при запуске: {0}
zh_hans: 启动时的“已接受 EULA”状态: {0}
zh_hant: 啟動時的「EULA 已接受」狀態: {0}

# azdata.endpointOrNamespaceRequired
source: Either an endpoint or a namespace must be specified
de: Es muss entweder ein Endpunkt oder ein Namespace angegeben werden
es: Se debe especificar un punto de conexión o un espacio de nombres
fr: Un point de terminaison ou un espace de noms doit être spécifié
it: È necessario specificare un endpoint o uno spazio dei nomi
ja: エンドポイントまたは名前空間のいずれかを指定しなければなりません
ko: 엔드포인트 또는 네임스페이스를 지정해야 합니다.
pt_br: Um ponto de extremidade ou um namespace deve ser especificado
ru: Необходимо указать конечную точку или пространство имен
zh_hans: 必须指定终结点或命名空间
zh_hant: 必須指定端點或命名空間
