Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/azdata.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# azdata.promptLog
source: Prompting the user to accept the following: {0}
de: Der Benutzer wird aufgefordert, Folgendes zu akzeptieren: {0}
es: Se pide al usuario que acepte lo siguiente: {0}
fr: Demande à l’utilisateur d’accepter les éléments suivants : {0}
it: Verrà richiesto all'utente di accettare quanto segue: {0}
ja: ユーザーが次に同意するよう促すダイアログの表示: {0}
ko: 사용자에게 다음을 수락하도록 요청하는 중: {0}
pt_br: Solicitando que o usuário aceite o seguinte: {0}
ru: Пользователю будет предложено принять следующее: {0}
zh_hans: 正在提示用户接受以下内容: {0}
zh_hant: 提示使用者接受下列內容: {0}

# azdata.couldNotFindAzdataWithPrompt
source: Could not find Azure Data CLI, install it now? If not then some features will not be able to function.
de: Azure Data CLI wurde nicht gefunden. Möchten Sie es jetzt installieren? Wenn nicht, könnten einige Features nicht funktionieren.
es: No se pudo encontrar la CLI de Azure Data, ¿desea instalarla ahora? De lo contrario, algunas características no podrán funcionar.
fr: Impossible de trouver Azure Data CLI pour l’installer maintenant ? Si ce n’est pas le cas, certaines fonctionnalités ne seront pas en mesure de fonctionner.
it: Non è stato possibile trovare l’Interfaccia della riga di comando di Azure Data, installarla adesso? In caso contrario, alcune funzionalità non saranno in grado di funzionare.
ja: Azure Data CLI が見つかりませんでした。今すぐインストールしますか? そうでない場合は、一部の機能が動作しない可能性があります。
ko: Azure Data CLI를 찾을 수 없습니다. 지금 설치하시겠습니까? 그렇지 않으면 일부 기능이 작동하지 않습니다.
pt_br: Não foi possível localizar a CLI de Dados do Azure, deseja instalar agora? Caso contrário, alguns recursos não poderão funcionar.
ru: Не удалось найти Azure Data CLI, установить сейчас? Если нет, то некоторые функции не смогут работать.
zh_hans: 找不到 Azure Data CLI，是否立即安装? 如果不安装，则某些功能将无法正常工作。
zh_hant: 找不到 Azure Data CLI，要立即安裝嗎? 否則，某些功能將無法運作。

# azdata.promptForAzdataUpdate
source: A new version of Azure Data CLI ( {0} ) is available, do you wish to update to it now?
de: Es ist eine neue Version von Azure Data CLI ({0}) verfügbar. Möchten Sie jetzt auf diese aktualisieren?
es: Hay disponible una nueva versión de CLI de Azure Data ({0}), ¿desea actualizarla ahora?
fr: Une nouvelle version de Azure Data CLI ({0}) est disponible, souhaitez-vous la mettre à jour maintenant ?
it: È disponibile una nuova versione dell’interfaccia della riga di comando di Azure Data ({0}), aggiornarla adesso?
ja: Azure Data CLI の新しいバージョン ( {0} ) が利用できます。今すぐ更新しますか?
ko: 새 버전의 Azure Data CLI({0})를 사용할 수 있습니다. 지금 업데이트하시겠습니까?
pt_br: Uma nova versão da CLI de Dados do Azure ({0}) está disponível. Deseja atualizá-la agora?
ru: Доступна новая версия Azure Data CLI ({0}). Обновить ее сейчас?
zh_hans: 新版本的 Azure Data CLI ({0}) 已可用，是否要立即更新到该版本?
zh_hant: 有新版的 Azure Data CLI ( {0} )，您要立即更新嗎?

# azdata.promptForRequiredAzdataUpdate
source: This extension requires Azure Data CLI >= {0} to be installed, do you wish to update to the latest version ({1}) now? If you do not then some functionality may not work.
de: Für diese Erweiterung muss Azure Data CLI >= {0} installiert werden. Möchten Sie jetzt auf die neueste Version ({1}) aktualisieren? Wenn nicht, funktionieren einige Funktionen möglicherweise nicht.
es: Esta extensión requiere que la CLI de Azure Data sea >= {0} para instalarse, ¿desea actualizar a la última versión ({1}) ahora? Si no es así, es posible que algunas funcionalidades no funcionen.
fr: Cette extension nécessite l’installation d’Azure Data CLI >= {0}, souhaitez-vous effectuer une mise à jour vers la dernière version ({1}) maintenant ? Si vous ne pouvez pas faire partie d’une fonctionnalité, il est possible que certaines fonctionnalités ne fonctionnent pas.
it: Questa estensione richiede l'installazione dell’interfaccia della riga di comando di Azure Data >= {0} eseguire l'aggiornamento alla versione più recente ({1}) adesso? In caso contrario, alcune funzionalità potrebbero non funzionare.
ja: この拡張機能を使用するには、Azure Data CLI >= {0} がインストールされている必要がありますが、今すぐ最新バージョン ({1}) に更新しますか? 更新しない場合、一部の機能が動作しない可能性があります。
ko: 이 확장을 사용하려면 Azure Data CLI >= {0}을(를) 설치해야 합니다. 지금 최신 버전({1})으로 업데이트하시겠습니까? 그렇지 않으면 일부 기능이 작동하지 않을 수 있습니다.
pt_br: Esta extensão requer que a CLI de Dados do Azure >= seja{0} instalada. Deseja atualizar para a versão mais recente ({1}) agora? Se você não fizer isso, algumas funcionalidades poderão não funcionar.
ru: Для этого расширения требуется установить Azure Data CLI >= {0}, чтобы выполнить обновление до последней версии ({1}) сейчас? В противном случае некоторые функции могут не работать.
zh_hans: 此扩展需要 Azure Data CLI >= {0} 才能安装，是否要立即更新到最新版本({1})? 如果不安装，则某些功能可能不起作用。
zh_hant: 此延伸模組需要安裝 >= {0} 的 Azure Data CLI，您要立即更新至最新版本 ({1}) 嗎? 否則，某些功能可能無法運作。

# azdata.requiredVersionNotAvailable
source: This extension requires Azure Data CLI >= {0} to be installed, but the current version available is only {1}. Install the correct version manually from [here](https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata) and then restart Azure Data Studio.
de: Für diese Erweiterung ist die Installation von Azure Data CLI >= {0} erforderlich. Die aktuell verfügbare Version ist jedoch nur {1}. Die richtige Version finden Sie [hier] (https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata). Installieren Sie sie manuell und starten Sie dann Azure Data Studio neu.
es: Esta extensión requiere que la CLI de Azure Data sea >= {0} para instalarse, pero la versión actual disponible solo es {1}. Instale la versión correcta manualmente desde [aquí] (https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata) y, a continuación, reinicie Azure Data Studio.
fr: Cette extension nécessite l’installation d’Azure Data CLI >= {0}, mais la version actuelle disponible est uniquement {1}. Installez la version appropriée manuellement à partir de [here] (https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata) puis redémarrez Azure Data Studio.
it: Questa estensione richiede l'installazione dell'interfaccia della riga di comando di Azure Data >= {0}, ma la versione corrente disponibile è solo {1}. Installare manualmente la versione corretta da [here] (https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata), quindi riavviare Azure Data Studio.
ja: この拡張機能を使用するには、Azure Data CLI >= {0} がインストールされている必要がありますが、現在利用可能なバージョンは {1} のみです。正しいバージョンを [こちら](https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata) で手動でインストールしてから、Azure Data Studio を再起動します。
ko: 이 확장을 사용하려면 Azure Data CLI >= {0}을(를) 설치해야 하지만 사용 가능한 현재 버전은 {1}입니다. [여기](https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata)에서 올바른 버전을 수동으로 설치한 다음 Azure Data Studio를 다시 시작하세요.
pt_br: Essa extensão requer que a CLI de Dados do Azure >= {0} seja instalada, mas a versão atual disponível é apenas {1}. Instale a versão correta manualmente [aqui](https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata) e reinicie o Azure Data Studio.
ru: Для этого расширения требуется установка Azure Data CLI >= {0}, однако доступна только текущая версия {1}. Установите правильную версию вручную [отсюда](https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata), а затем перезапустите Azure Data Studio.
zh_hans: 此扩展需要 Azure Data CLI >= {0} 才能安装，但当前可用的版本仅有 {1}。请从[此处] (https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata)手动安装正确版本，然后重启 Azure Data Studio。
zh_hant: 此延伸模組需要安裝 >= {0} 的 Azure Data CLI，但目前只有版本 {1}。請從[此處](https://docs.microsoft.com/sql/azdata/install/deploy-install-azdata)手動安裝正確的版本，然後重新啟動 Azure Data Studio。

# azdata.missingRequiredVersion
source: Azure Data CLI >= {0} is required for this feature. Run the 'Azure Data CLI: Check for Update' command to install this and then try again.
de: Azure Data CLI >= {0} ist für diese Funktion erforderlich. Führen Sie den Befehl „Azure Data CLI: Nach Updates suchen“ aus, um sie zu installieren, und wiederholen Sie dann den Vorgang.
es: Se requiere que la CLI de Azure Data sea >= {0} para esta característica. Ejecute el comando “CLI de Azure Data: buscar actualización” para instalarla y vuelva a intentarlo.
fr: Azure Data CLI >= {0} est requis pour cette fonctionnalité. Exécutez la commande « Azure Data CLI : Rechercher une mise à jour » pour l’installer, puis réessayez.
it: Per questa funzionalità è necessario il >di Azure Data CLI = {0}. Eseguire il comando ' Azure Data CLI: check for Update ' per installare questo comando, quindi riprovare.
ja: この機能には、Azure Data CLI >= {0} が必要です。'Azure Data CLI: Check for Update' コマンドを実行してからこれをインストールして、もう一度お試しください。
ko: 이 기능에는 Azure Data CLI >= {0}이(가) 필요합니다. 'Azure Data CLI: 업데이트 확인' 명령을 실행하여 설치한 후 다시 시도하세요.
pt_br: A CLI de Dados do Azure >= {0} é necessária para esse recurso. Execute o comando 'CLI de Dados do Azure: verificar se há atualização' para instalá-lo e tente novamente.
ru: Для этой функции требуется Azure Data CLI >= {0}. Запустите команду "Azure Data CLI: проверка на наличие обновления", чтобы установить ее, а затем повторите попытку.
zh_hans: 此功能需要 Azure Data CLI >= {0}。请运行“Azure Data CLI: 检查更新”命令以安装此项，然后重试。
zh_hant: 此功能需要 >= {0} 的 Azure Data CLI。請執行「Azure Data CLI: 檢查更新」命令安裝它，然後再試一次。

# azdata.downloadError
source: Error while downloading
de: Fehler beim Herunterladen
es: Error durante la descarga
fr: Erreur lors du téléchargement
it: Si è verificato un errore durante il download
ja: ダウンロード中のエラー
ko: 다운로드하는 동안 오류 발생
pt_br: Erro ao baixar
ru: Ошибка при скачивании
zh_hans: 下载时出错
zh_hant: 下載時發生錯誤

# azdata.installError
source: Error installing Azure Data CLI: {0}
de: Fehler beim Installieren der Azure Data CLI: {0}
es: Error al instalar la CLI de Azure Data: {0}
fr: Erreur lors de l’installation d’Azure Data CLI : {0}
it: Errore durante l'installazione dell'interfaccia della riga di comando di Azure Data: {0}
ja: Azure Data CLI のインストール中にエラー {0} が発生しました
ko: Azure Data CLI 설치 중 오류 발생: {0}
pt_br: Erro ao instalar a CLI de Dados do Azure: {0}
ru: Ошибка при установке Azure Data CLI: {0}
zh_hans: 安装 Azure Data CLI 时出错: {0}
zh_hant: 安裝 Azure Data CLI 時發生錯誤: {0}

# azdata.updateError
source: Error updating Azure Data CLI: {0}
de: Fehler beim Aktualisieren der Azure Data CLI: {0}
es: Error al actualizar CLI de Azure Data: {0}
fr: Erreur lors de la mise à jour d’Azure Data CLI : {0}
it: Errore durante l'aggiornamento dell'interfaccia della riga di comando di Dati di Azure: {0}
ja: Azure Data CLI を更新中に発生したエラー: {0}
ko: Azure Data CLI 업데이트 중 오류 발생: {0}
pt_br: Erro ao atualizar a CLI de Dados do Azure: {0}
ru: Ошибка при обновлении Azure Data CLI: {0}
zh_hans: 更新 Azure Data CLI 时出错: {0}
zh_hant: 更新 Azure Data CLI 時發生錯誤: {0}

# azdata.platformUnsupported
source: Platform '{0}' is currently unsupported
de: Die Plattform „{0}“ wird zurzeit nicht unterstützt
es: La plataforma "{0}" no se admite actualmente
fr: La plateforme « {0} » n’est pas prise en charge actuellement
it: La piattaforma '{0}' non è attualmente supportata
ja: プラットフォーム '{0}' は現在サポート外です
ko: '{0}' 플랫폼은 현재 지원되지 않습니다.
pt_br: A plataforma '{0}' não tem suporte no momento
ru: Платформа "{0}" сейчас не поддерживается
zh_hans: 平台“{0}”当前不受支持
zh_hant: 目前不支援平台 '{0}'

# azdata.unexpectedCommandError
source: Unexpected error executing command: {0}
de: Unerwarteter Fehler beim Ausführen des Befehls: {0}
es: Error inesperado al ejecutar el comando: {0}
fr: Erreur inattendue lors de l’exécution de la commande : {0}
it: Errore imprevisto durante l'esecuzione del comando: {0}
ja: コマンド {0} の実行中に予期しないエラーが発生しました
ko: 명령 실행 중 예기치 않은 오류 발생: {0}
pt_br: Erro inesperado ao executar o comando: {0}
ru: Непредвиденная ошибка при выполнении команды: {0}
zh_hans: 执行命令时出现意外错误: {0}
zh_hant: 執行命令時發生未預期的錯誤: {0}

# azdata.unexpectedExitCode
source: Unexpected exit code from command: {1} ({0})
de: Unerwarteter Exitcode von Befehl: {1} ({0})
es: Código de salida inesperado desde el comando: {1} ({0})
fr: Code de sortie inattendu de la commande : {1} ({0})
it: Codice di uscita imprevisto dal comando: {1} ({0})
ja: コマンドからの予期しない終了コード: {1} ({0})
ko: 명령에서 예기치 않은 종료 코드: {1}({0})
pt_br: Código de saída inesperado do comando: {1}({0})
ru: Непредвиденный код выхода из команды: {1} ({0})
zh_hans: 命令中出现意外的退出代码: {1} ({0})
zh_hant: 命令中未預期的結束代碼: {1} ({0})

# azdata.noAzdata
source: No Azure Data CLI is available, run the command 'Azure Data CLI: Install' to enable the features that require it.
de: Es ist keine Azure Data CLI verfügbar. Führen Sie den Befehl „Azure Data CLI: Installieren“ aus, um die Funktionen zu aktivieren, die dies erfordern.
es: No hay disponible ninguna instancia de CLI de Azure Data, ejecute el comando “CLI de Azure Data: instalar” para habilitar las características que lo requieren.
fr: Aucun Azure Data CLI n’est disponible. Exécutez la commande « Azure Data CLI : Installer » pour activer les fonctionnalités qui en ont besoin.
it: Non è disponibile alcuna interfaccia della riga di comando di Azure Data, eseguire il comando 'Azure Data CLI: Install' per abilitare le funzionalità che lo richiedono.
ja: 使用可能な Azure Data CLI がありません。コマンド 'Azure Data CLI: Install' を実行し、それを必要とする機能を有効にします。
ko: Azure Data CLI를 사용할 수 없습니다. 'Azure Data CLI: 설치' 명령을 실행하여 필요한 기능을 사용하도록 설정합니다.
pt_br: Nenhuma CLI de Dados do Azure está disponível. Execute o comando 'CLI de Dados do Azure: Instalar' para habilitar os recursos que a exigem.
ru: Служба Azure Data CLI недоступна, запустите команду "Azure Data CLI: установить", чтобы включить необходимые функции.
zh_hans: 没有可用的 Azure 数据 CLI，请运行命令“Azure Data CLI: 安装”以启用需要它的功能。
zh_hant: 沒有 Azure Data CLI 可用，請執行命令「Azure Data CLI: 安裝」以啟用需要它的功能。

# azdata.noAzdataWithLink
source: No Azure Data CLI is available, [install the Azure Data CLI](command:azdata.install) to enable the features that require it.
de: Es ist keine Azure Data CLI verfügbar. [Installieren Sie die Azure Data CLI](Befehl:azdata.Install), um die Funktionen zu aktivieren, die dies erfordern.
es: No hay disponible ninguna instancia de CLI de Azure Data, [instalar la CLI de Azure Data](command:azdata.install) para habilitar las características que lo requieren.
fr: Impossible d’accéder à Azure Data CLI, [install the Azure Data CLI] (command:azdata.install) pour activer les fonctionnalités qui le requièrent.
it: Non è disponibile alcuna interfaccia della riga di comando di Azure Data, [install the Azure Data CLI] (comando: azdata. Install) per abilitare le funzionalità che lo richiedono.
ja: 使用可能な Azure Data CLI がありません。[Azure Data CLI の更新] (コマンド: azdata. install) を行い、それを必要とする機能を有効にします。
ko: Azure Data CLI를 사용할 수 없습니다. 필요한 기능을 사용하도록 설정하려면 [Azure Data CLI를 설치](command:azdata.install)하세요.
pt_br: Nenhuma CLI de Dados do Azure está disponível, [instale a CLI de Dados do Azure](command:azdata.install) para habilitar os recursos que a exigem.
ru: Служба Azure Data CLI недоступна, [установите Azure Data CLI](command:azdata.install), чтобы включить необходимые функции.
zh_hans: 没有可用的 Azure Data CLI，[安装 Azure Data CLI](command:azdata.install)以启用需要它的功能。
zh_hant: 沒有 Azure Data CLI 可用，請[安裝 Azure Data CLI](command:azdata.install) 以啟用需要它的功能。

# azdata.skipInstall
source: Skipping installation of Azure Data CLI, since the operation was not user requested and config option: {0}.{1} is {2}
de: Die Installation von Azure Data CLI wird übersprungen, da der Vorgang nicht vom Benutzer angefordert wurde und die Konfigurationsoption lautet: {0}.{1} ist {2}
es: Se va a omitir la instalación de CLI de Azure Data, ya que el usuario no solicitó la operación y la opción de configuración: {0}.{1} es {2}
fr: L’installation d’Azure Data CLI est ignorée, car l’opération n’a pas été demandée par l’utilisateur et l’option de configuration : {0}.{1} est {2}
it: L'installazione dell’interfaccia della riga di comando di Azure Data verrà ignorata perché l'operazione non è richiesta dall'utente e l'opzione di configurazione: {0}. {1} è {2}
ja: この操作はユーザーが要求したものではなく、構成オプション {0} でもないため、Azure Data CLI のインストールをスキップします。{1} は {2} です
ko: 사용자가 작업을 요청하지 않았고 구성 옵션: {0}이므로 Azure Data CLI 설치를 건너뛰는 중.{1}은(는) {2}입니다.
pt_br: Ignorando a instalação da CLI de Dados do Azure, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1} é {2}
ru: Пропущена установка Azure Data CLI, так как операция не была запрошена пользователем, а параметр конфигурации: {0}. {1} — {2}
zh_hans: 正在跳过 Azure Data CLI 的安装，因为该操作不是由用户请求的，且配置选项为 {0}。{1} 为 {2}
zh_hant: 略過 Azure Data CLI 的安裝，因為此作業不是使用者要求的，且組態選項: {0}.{1} 是 {2}

# azdata.skipUpdate
source: Skipping update of Azure Data CLI, since the operation was not user requested and config option: {0}.{1} is {2}
de: Das Update von Azure Data CLI wird übersprungen, da der Vorgang nicht vom Benutzer angefordert wurde und die Konfigurationsoption lautet: {0}.{1} ist {2}
es: Se omitirá la actualización de la CLI de Azure Data, ya que la operación no la solicitó el usuario y la opción de configuración: {0}.{1} es {2}
fr: La mise à jour d’Azure Data CLI est ignorée, car l’opération n’a pas été demandée par l’utilisateur et l’option de configuration : {0}.{1} est {2}
it: L’aggiornamento dell’interfaccia della riga di comando di Azure Data verrà ignorata perché l'operazione non è richiesta dall'utente e l'opzione di configurazione: {0}. {1} è {2}
ja: この操作はユーザーが要求したものではなく、構成オプション {0} でもないため、Azure Data CLI の更新をスキップします。{1} は {2} です
ko: 사용자가 작업을 요청하지 않았고 구성 옵션: {0}이므로 Azure Data CLI 업데이트를 건너뛰는 중.{1}은(는) {2}입니다.
pt_br: Ignorando a atualização da CLI de Dados do Azure, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1}é {2}
ru: Пропущено обновление Azure Data CLI, так как операция не была запрошена пользователем, а параметр конфигурации: {0}. {1} — {2}
zh_hans: 正在跳过 Azure Data CLI 的更新，因为该操作不是由用户请求的，且配置选项为 {0}。{1} 为 {2}
zh_hant: 略過 Azure Data CLI 的更新，因為此作業不是使用者要求的，且組態選項: {0}.{1} 是 {2}

# azdata.skipRequiredUpdate
source: Skipping required update of Azure Data CLI, since the operation was not user requested and config option: {0}.{1} is {2}
de: Das erforderliche Update von Azure Data CLI wird übersprungen, da der Vorgang nicht vom Benutzer angefordert wurde und die Konfigurationsoption lautet: {0}.{1} ist {2}
es: Se omitirá la actualización necesaria de la CLI de Azure Data, ya que la operación no la solicitó el usuario y la opción de configuración: {0}.{1} es {2}
fr: La mise à jour requise d’Azure Data CLI est ignorée, car l’opération n’a pas été demandée par l’utilisateur et l’option de configuration : {0}.{1} est {2}
it: L’aggiornamento richiesto dell’interfaccia della riga di comando di Azure Data verrà ignorata perché l'operazione non è richiesta dall'utente e l'opzione di configurazione: {0}. {1} è {2}
ja: この操作はユーザーが要求したものではなく、構成オプション {0} でもないため、Azure Data CLI の更新をスキップします。{1} は {2} です
ko: 사용자가 작업을 요청하지 않았고 구성 옵션: {0}이므로 Azure Data CLI 필수 업데이트를 건너뛰는 중.{1}은(는) {2}입니다.
pt_br: Ignorando a atualização necessária da CLI de Dados do Azure, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1}é {2}
ru: Пропущено необходимое обновление Azure Data CLI, так как операция не была запрошена пользователем, а параметр конфигурации: {0}. {1} — {2}
zh_hans: 正在跳过 Azure Data CLI 的必需更新，因为该操作不是由用户请求的，且配置选项为 {0}。{1} 为 {2}
zh_hant: 略過 Azure Data CLI 的必要更新，因為此作業不是使用者要求的，且組態選項: {0}.{1} 是 {2}

# azdata.noReleaseVersion
source: No release version available for platform '{0}' Release info: ${1}
de: Für die Plattform „{0}“ ist keine Releaseversion verfügbar, Versionsinformationen: ${1}
es: No hay ninguna versión de lanzamiento disponible para la plataforma “{0}” Información de la versión: ${1}
fr: Aucune version de mise en production disponible pour la plateforme « {0} » Informations de mise en production : ${1}
it: Nessuna versione release disponibile per la piattaforma '{0}' Informazioni sulla versione: ${1}
ja: プラットフォーム '{0}' リリース情報に利用可能なリリース バージョンがありません: ${1}
ko: 플랫폼 '{0}' 릴리스 정보: ${1}에 사용할 수 있는 릴리스 버전이 없습니다.
pt_br: Nenhuma versão de lançamento disponível para a plataforma ' {0} ' Informações sobre a versão: ${1}
ru: Нет доступной версии выпуска для платформы "{0}" Версия выпуска: ${1}
zh_hans: 没有适用于平台“{0}”的发布版本 发布信息: ${1}
zh_hant: 平台 '{0}' 沒有發行版本 發行資訊: ${1}

# azdata.noDownloadLink
source: No download link available for platform '{0}' Release info: ${1}
de: Für Plattform „{0}“ ist kein Downloadlink verfügbar, Versionsinformationen: ${1}
es: No hay ningún vínculo de descarga disponible para la plataforma “{0}" Información de la versión: ${1}
fr: Aucun lien de téléchargement disponible pour la plateforme « {0} » Informations de mise en production : ${1}
it: Nessun collegamento di download disponibile per la piattaforma '{0}' Informazioni sulla versione: ${1}
ja: プラットフォーム '{0}' リリース情報に利用可能なダウンロード リンクがありません: ${1}
ko: 플랫폼 '{0}' 릴리스 정보: ${1}에 사용할 수 있는 다운로드 링크가 없습니다.
pt_br: Nenhum link de download disponível para a plataforma ' {0} ' Informações sobre a versão: ${1}
ru: Нет доступной ссылки для скачивания для платформы "{0}" Версия выпуска: ${1}
zh_hans: 没有适用于平台“{0}”的下载链接 发布信息: ${1}
zh_hant: 平台 '{0}' 沒有可用的下載連結 發行資訊: ${1}

# azdata.failedToParseReleaseInfo
source: Failed to parse the JSON of contents at: {0}. File contents: {1} Error: {2}
de: Fehler beim Analysieren der JSON-Inhalte unter: {0}. Dateiinhalte: {1} Fehler: {2}
es: No se pudo analizar el JSON del contenido en: {0}. Contenido del archivo: {1} Error: {2}
fr: Échec de l’analyse du contenu JSON sur : {0}. Contenu du fichier : {1} Erreur : {2}
it: Non è stato possibile analizzare il JSON dei contenuti in: {0}. Contenuti file: {1} Errore: {2}
ja: {0} でコンテンツの JSON を解析できませんでした。 ファイル コンテンツ: {1} エラー: {2}
ko: {0}에서 콘텐츠의 JSON을 구문 분석하지 못했습니다. 파일 내용: {1} 오류: {2}
pt_br: Falha ao analisar o JSON de conteúdo em: {0}. Conteúdo do arquivo: {1} Erro: {2}
ru: Не удалось проанализировать JSON содержимого: в {0}. Содержимое файла: {1} Ошибка: {2}
zh_hans: 未能分析 {0} 处内容的 JSON。 文件内容: {1} 错误: {2}
zh_hant: 無法剖析位於: {0} 的內容 JSON。 檔案內容: {1} 錯誤: {2}

# azdata.azdataUserSettingReadLog
source: Azure Data CLI user setting: {0}.{1} read, value: {2}
de: Benutzereinstellung für Azure Data CLI: {0}.{1} lesen, Wert: {2}
es: Configuración de usuario de la CLI de Azure Data: {0}.{1} lectura, valor: {2}
fr: Paramètre utilisateur d’Azure Data CLI : {0}.{1} lire, valeur : {2}
it: Configurazione utente dell'interfaccia della riga di comando di Azure Data: {0}. {1} lettura, valore: {2}
ja: Azure Data CLI のユーザー設定: {0}。{1} が読み取られ、値: {2}
ko: Azure Data CLI 사용자 설정: {0}. {1} 읽기, 값: {2}
pt_br: Configuração do usuário da CLI de Dados do Azure: {0}.{1}leitura, valor: {2}
ru: Пользовательский параметр Azure Data CLI: {0}.{1} чтение, значение: {2}
zh_hans: Azure 数据 CLI 用户设置: {0}。{1} 读取，值: {2}
zh_hant: Azure Data CLI 使用者設定: {0}.{1} 讀取，值: {2}

# azdata.azdataUserSettingUpdatedLog
source: Azure Data CLI user setting: {0}.{1} updated, newValue: {2}
de: Benutzereinstellung für Azure Data CLI: {0}.{1} aktualisiert, neuer Wert: {2}
es: Configuración de usuario de CLI de Azure Data: {0}.{1} actualizado, newValue: {2}
fr: Paramètre utilisateur Azure Data CLI : {0}.{1} mis à jour, newValue : {2}
it: Configurazione utente dell’interfaccia della riga di comando di Azure Data: {0}. {1} aggiornata, newValue: {2}
ja: Azure Data CLI のユーザー設定: {0}。{1} が更新され、newValue: {2}
ko: Azure Data CLI 사용자 설정: {0}. {1} 업데이트됨, newValue: {2}
pt_br: Configuração do usuário da CLI de Dados do Azure: {0}.{1}updated, newValue: {2}
ru: Пользовательский параметр Azure Data CLI: {0}. {1} обновлено, newValue: {2}
zh_hans: Azure Data CLI 用户设置: {0}。已更新 {1}，newValue: {2}
zh_hant: Azure Data CLI 使用者設定: {0}.{1} 已更新，新值: {2}
