Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/azurecore.*.xlf
Languages: es, fr, it, ko

# azure.accessTokenEmpty
source: No access token returned from Microsoft OAuth
es: No se ha devuelto ningún token de acceso desde Microsoft OAuth.
fr: Aucun jeton d'accès n'a été renvoyé par Microsoft OAuth
it: Nessun token di accesso restituito da Microsoft OAuth
ko: Microsoft OAuth에서 반환된 액세스 토큰 없음

# azure.cacheErrorAdd
source: Error when adding your account to the cache.
es: Error al agregar la cuenta a la memoria caché.
fr: Erreur pendant l'ajout de votre compte au cache.
it: Si è verificato un errore durante l'aggiunta dell'account alla cache.
ko: 계정을 캐시에 추가하는 동안 오류가 발생했습니다.

# azure.cacheErrorGet
source: Error when getting your account from the cache
es: Error al obtener la cuenta de la memoria caché.
fr: Erreur pendant l'obtention de votre compte à partir du cache
it: Si è verificato un errore durante il recupero dell'account dalla cache
ko: 캐시에서 계정을 가져올 때 오류 발생

# azure.cacheErrorParse
source: Error when parsing your account from the cache
es: Error al analizar la cuenta desde la memoria caché.
fr: Erreur pendant l'analyse de votre compte à partir du cache
it: Si è verificato un errore durante l'analisi dell'account dalla cache
ko: 캐시에서 계정을 구문 분석하는 동안 오류 발생

# azure.cacheErrrorRemove
source: Error when removing your account from the cache.
es: Error al quitar la cuenta de la memoria caché.
fr: Erreur pendant la suppression de votre compte du cache.
it: Si è verificato un errore durante la rimozione dell'account dalla cache.
ko: 캐시에서 계정을 제거하는 동안 오류가 발생했습니다.

# azure.microsoftAccountDisplayName
source: Microsoft Account
es: Cuenta de Microsoft
fr: Compte Microsoft
it: Account Microsoft
ko: Microsoft 계정

# azure.noBaseToken
source: Something failed with the authentication, or your tokens have been deleted from the system. Please try adding your account to Azure Data Studio again.
es: Ha habido algún error problema con la autenticación, o bien los tokens se han eliminado del sistema. Pruebe a volver a agregar la cuenta de Azure Data Studio.
fr: Une erreur s'est produite pendant l'authentification ou vos jetons ont été supprimés du système. Essayez de rajouter votre compte à Azure Data Studio.
it: Si è verificato un errore durante l'autenticazione oppure i token sono stati eliminati dal sistema. Provare ad aggiungere di nuovo l'account ad Azure Data Studio.
ko: 인증 관련 오류가 발생했거나 토큰이 시스템에서 삭제되었습니다. 계정을 다시 Azure Data Studio에 추가해 보세요.

# azure.noUniqueIdentifier
source: The user had no unique identifier within AAD
es: El usuario no tenía ningún identificador único en AAD.
fr: L'utilisateur n'a pas d'identificateur unique dans AAD
it: L'utente non ha un identificatore univoco in AAD
ko: 해당 사용자는 AAD 내에 고유 식별자가 없습니다.

# azure.responseError
source: Token retrieval failed with an error. [Open developer tools]({0}) for more details.
ko: 오류로 인해 토큰 검색에 실패했습니다. 자세한 내용은 [개발자 도구 열기]({0})를 참조하세요.

# azure.tenantNotFound
source: Specified tenant with ID '{0}' not found.
es: No se encuentra el inquilino especificado con el id. "{0}".
fr: Le locataire spécifié avec l'ID « {0} » est introuvable.
it: Il tenant specificato con ID '{0}' non è stato trovato.
ko: ID가 '{0}'인 지정된 테넌트를 찾을 수 없습니다.

# azureAuth.unidentifiedError
source: Unidentified error with azure authentication
es: Error no identificado con la autenticación de Azure.
fr: Erreur non identifiée avec l'authentification Azure
it: Errore non identificato con l'autenticazione di Azure
ko: Azure 인증에서 식별되지 않은 오류 발생

# azureWorkAccountDisplayName
source: Work or school account
es: Cuenta profesional o educativa
fr: Compte professionnel ou scolaire
it: Account aziendale o dell'istituto di istruzione
ko: 회사 또는 학교 계정

# azurecore.consentDialog.body
source: Your tenant '{0} ({1})' requires you to re-authenticate again to access {2} resources. Press Open to start the authentication process.
es: El inquilino "{0} ({1})" requiere que vuelva a autenticarse para acceder a {2} recursos. Presione Abrir para iniciar el proceso de autenticación.
fr: Votre locataire « {0} ({1}) » exige une nouvelle authentification pour accéder aux ressources {2}. Appuyez sur Ouvrir pour démarrer le processus d'authentification.
it: Il tenant '{0} ({1})' richiede una nuova autenticazione per accedere alle risorse {2}. Premere Apri per avviare il processo di autenticazione.
ko: '{0}({1})' 테넌트에서는 {2} 리소스에 액세스하려면 다시 재인증해야 합니다. [열기]를 눌러 인증 프로세스를 시작합니다.

# azurecore.consentDialog.cancel
source: Cancel
es: Cancelar
fr: Annuler
it: Annulla
ko: 취소

# azurecore.consentDialog.ignore
source: Ignore Tenant
es: Omitir inquilino
fr: Ignorer le locataire
it: Ignora tenant
ko: 테넌트 무시

# azurecore.consentDialog.open
source: Open
es: Abrir
fr: Ouvrir
it: Apri
ko: 열기

# azure.azureAuthCodeGrantName
source: Azure Auth Code Grant
es: Concesión de código de autenticación de Azure
fr: Octroi de code d'authentification Azure
it: Concessione codice di autenticazione di Azure
ko: Azure 인증 코드 부여

# azure.serverCouldNotStart
source: Server could not start. This could be a permissions error or an incompatibility on your system. You can try enabling device code authentication from settings.
es: No se puede iniciar el servidor. Puede tratarse de un error de permisos o una incompatibilidad en el sistema. Puede intentar habilitar la autenticación del dispositivo mediante código en la configuración.
fr: Le serveur n'a pas pu démarrer. Il peut s'agir d'une erreur d'autorisation ou d'une incompatibilité sur votre système. Vous pouvez essayer d'activer l'authentification du code d'appareil dans les paramètres.
it: Non è stato possibile avviare il server. Questo problema potrebbe essere dovuto a un errore di autorizzazioni o a un'incompatibilità nel sistema. È possibile provare ad abilitare l'autenticazione del codice del dispositivo dalle impostazioni.
ko: 서버를 시작할 수 없습니다. 시스템의 권한 오류 또는 비호환성 문제일 수 있습니다. 설정에서 디바이스 코드 인증을 사용하도록 설정할 수 있습니다.

# azureAuth.nonceError
source: Authentication failed due to a nonce mismatch, please close Azure Data Studio and try again.
es: Error de autenticación debido a una discrepancia de nonce. Cierre Azure Data Studio y vuelva a intentarlo.
fr: L'authentification a échoué en raison d'une incompatibilité de nonce, fermez Azure Data Studio et réessayez.
it: L'autenticazione non è riuscita a causa di una mancata corrispondenza dei nonce. Chiudere Azure Data Studio e riprovare.
ko: nonce 불일치로 인해 인증에 실패했습니다. Azure Data Studio를 닫고 다시 시도하세요.

# azureAuth.stateError
source: Authentication failed due to a state mismatch, please close ADS and try again.
es: Error de autenticación debido a una discrepancia de estados. Cierre ADS y vuelva a intentarlo.
fr: L'authentification a échoué en raison d'une incompatibilité d'état, fermez ADS et réessayez.
it: L'autenticazione non è riuscita a causa di una mancata corrispondenza degli stati. Chiudere ADS e riprovare.
ko: 상태 불일치로 인해 인증에 실패했습니다. ADS를 닫고 다시 시도하세요.

# addAccount
source: Add {0} account
es: Agregar cuenta de {0}
fr: Ajouter le compte {0}
it: Aggiungi l'account {0}
ko: {0} 계정 추가

# azure.azureDeviceCodeAuth
source: Azure Device Code
es: Código de dispositivo de Azure
fr: Code d'appareil Azure
it: Codice dispositivo di Azure
ko: Azure 디바이스 코드

# azure.deviceCodeCheckFail
source: Error encountered when trying to check for login results
es: Se ha encontrado un error al intentar comprobar los resultados del inicio de sesión.
fr: Erreur pendant la tentative de vérification des résultats de connexion
it: Si è verificato un errore durante il tentativo di verificare la presenza di risultati di accesso
ko: 로그인 결과를 확인하는 동안 오류가 발생했습니다.

# azure.timeoutDeviceCode
source: Timed out when waiting for device code login.
es: Se ha agotado el tiempo de espera para el inicio de sesión del código del dispositivo.
fr: Expiration du délai d'attente de la connexion du code d'appareil.
it: Timeout durante l'attesa dell'accesso al codice del dispositivo.
ko: 디바이스 코드 로그인을 기다리는 동안 시간이 초과되었습니다.

# azure.NoAuthMethod.Available
source: No Azure auth method available. You must enable the auth methods in ADS configuration.
es: No hay ningún método de autenticación de Azure disponible. Debe habilitar los métodos de autenticación en la configuración de ADS.
fr: Aucune méthode d'authentification Azure disponible. Vous devez activer les méthodes d'authentification dans la configuration ADS.
it: Nessun metodo di autenticazione di Azure disponibile. È necessario abilitare i metodi di autenticazione nella configurazione di ADS.
ko: 사용 가능한 Azure 인증 방법이 없습니다. ADS 구성에서 인증 방법을 사용하도록 설정해야 합니다.

# azure.NoAuthMethod.Selected
source: No Azure auth method selected. You must select what method of authentication you want to use.
es: No se ha seleccionado ningún método de autenticación de Azure. Debe seleccionar el método de autenticación que quiera usar.
fr: Aucune méthode d'authentification Azure sélectionnée. Vous devez sélectionner la méthode d'authentification à utiliser.
it: Non è stato selezionato alcun metodo di autenticazione di Azure. È necessario selezionare il metodo di autenticazione che si vuole usare.
ko: Azure 인증 방법이 선택되지 않았습니다. 사용할 인증 방법을 선택해야 합니다.

# azure.deprecatedGetSecurityToken
source: A call was made to azdata.accounts.getSecurityToken, this method is deprecated and will be removed in future releases. Please use getAccountSecurityToken instead.
es: Se ha realizado una llamada a azdata.accounts.getSecurityToken. Este método está en desuso y se quitará en versiones futuras. En su lugar, use getAccountSecurityToken.
fr: Un appel a été effectué à azdata.accounts.getSecurityToken, cette méthode est dépréciée et sera supprimée dans les mises en production futures. Utilisez getAccountSecurityToken à la place.
it: È stata effettuata una chiamata ad azdata.accounts.getSecurityToken. Questo metodo è deprecato e verrà rimosso nelle versioni future. Usare getAccountSecurityToken.
ko: azdata.accounts.getSecurityToken이 호출되었습니다. 이 메서드는 사용되지 않으며 향후 릴리스에서 제거됩니다. 대신 getAccountSecurityToken을 사용하세요.

# clearTokenCacheFailure
source: Failed to clear token cache
es: No se pudo borrar la memoria caché de tokens
fr: L'effacement du cache de jetons a échoué
it: Non è stato possibile cancellare la cache dei token
ko: 토큰 캐시를 지우지 못했습니다.

# clearTokenCacheSuccess
source: Token cache successfully cleared
es: La memoria caché de tokens se ha borrado correctamente
fr: Cache de jetons effacé
it: La cache dei token è stata cancellata
ko: 토큰 캐시를 지웠습니다.

# chinaCloudDisplayName
source: Azure (China)
fr: Azure (Chine)
it: Azure (Cina)
ko: Azure(중국)

# germanyCloud
source: Azure (Germany)
es: Azure (Alemania)
fr: Azure (Allemagne)
it: Azure (Germania)
ko: Azure(독일)

# usGovCloudDisplayName
source: Azure (US Government)
es: Azure (Gobierno de EE. UU.)
ko: Azure(미국 정부)

# usNatCloudDisplayName
source: Azure (US National)
es: Azure (Nacional de EE. UU.)
ko: Azure(미국 국가)

# azure.accountNotSelectedError
source: You must select an Azure account for this feature to work.
es: Debe seleccionar una cuenta de Azure para que esta característica funcione.
fr: Vous devez sélectionner un compte Azure pour que cette fonctionnalité fonctionne.
it: Per usare questa funzionalità, è necessario selezionare un account Azure.
ko: 이 기능이 작동하려면 Azure 계정을 선택해야 합니다.

# azure.cloudTerminalPreview
source: You must enable preview features in order to use Azure Cloud Shell.
es: Debe habilitar las características en versión preliminar para usar Azure Cloud Shell.
fr: Vous devez activer les fonctionnalités en préversion pour utiliser Azure Cloud Shell.
it: Per usare Azure Cloud Shell, è necessario abilitare le funzionalità di anteprima.
ko: Azure Cloud Shell을 사용하려면 미리 보기 기능을 사용하도록 설정해야 합니다.

# azure.mustPickTenant
source: You must select a tenant for this feature to work.
es: Debe seleccionar un inquilino para que esta característica funcione.
fr: Vous devez sélectionner un locataire pour que cette fonctionnalité fonctionne.
it: Per usare questa funzionalità, è necessario selezionare un tenant.
ko: 이 기능이 작동하려면 테넌트를 선택해야 합니다.

# azure.noAccountError
source: You are not currently signed into any Azure accounts, Please sign in and then try again.
es: Actualmente no tiene la sesión iniciada en ninguna cuenta de Azure. Inicie sesión y vuelva a intentarlo.
fr: Vous n'êtes pas connecté à un compte Azure, connectez-vous et réessayez.
it: Non è stato al momento eseguito l'accesso ad alcun account Azure. Eseguire l'accesso e quindi riprovare.
ko: 현재 Azure 계정에 로그인되어 있지 않습니다. 로그인한 후 다시 시도하세요.

# azure.noTenants
source: A tenant is required for this feature. Your Azure subscription seems to have no tenants.
es: Se necesita un inquilino para esta característica. Parece que su suscripción de Azure no tiene ningún inquilino.
fr: Un locataire est nécessaire pour cette fonctionnalité. Apparemment, votre abonnement Azure n'a pas de locataire.
it: Per questa funzionalità è necessario un tenant. La sottoscrizione di Azure in uso non sembra avere tenant.
ko: 이 기능에는 테넌트가 필요합니다. Azure 구독에 테넌트가 없는 것 같습니다.

# azure.pickAnAzureAccount
source: Select an Azure account
es: Seleccionar una cuenta de Azure
fr: Sélectionner un compte Azure
it: Seleziona un account Azure
ko: Azure 계정 선택

# azure.signIn
source: Sign in
es: Iniciar sesión
fr: Se connecter
it: Accedi
ko: 로그인

# azure.startingCloudShell
source: Starting cloud shell…
es: Se está iniciando el shell de la nube...
fr: Démarrage de Cloud Shell...
it: Avvio di Cloud Shell…
ko: Cloud Shell을 시작하는 중...

# azure.subscriptionError
source: Failed to get subscriptions for account {0}. Please refresh the account.
fr: Échec de l’obtention des abonnements pour le compte {0}. Actualisez le compte.
ko: 계정 {0}에 대한 구독을 가져오지 못했습니다. 계정을 새로 고치세요.

# azure.resource.providers.AzureMonitorContainerLabel
source: Log Analytics workspace
fr: Espace de travail Log Analytics
it: Area di lavoro Log Analytics
ko: Log Analytics 작업 영역

# azure.resource.providers.database.treeDataProvider.databaseContainerLabel
source: SQL database
es: Base de datos SQL
fr: Base de données SQL
it: Database SQL
ko: SQL 데이터베이스

source: SQL server
fr: Serveur SQL
ko: SQL 서버

# azure.resource.providers.KustoContainerLabel
source: Azure Data Explorer Cluster
es: Clúster de Azure Data Explorer
fr: Cluster Azure Data Explorer
it: Cluster di Esplora dati di Azure
ko: Azure 데이터 탐색기 클러스터

source: PostgreSQL Hyperscale – Azure Arc
es: Hiperescala de PostgreSQL: Azure Arc
ko: PostgreSQL 하이퍼스케일 - Azure Arc

source: Azure Database for PostgreSQL server
es: Servidor de Azure Database for PostgreSQL
fr: Serveur Azure Database pour PostgreSQL
it: Server di Database di Azure per PostgreSQL
ko: Azure Database for PostgreSQL 서버

# azure.resource.providers.sqlInstanceContainerLabel
source: Azure SQL DB managed instance
es: Instancia administrada de Azure SQL Database
fr: Instance managée Azure SQL DB
it: Istanza gestita di database SQL di Azure
ko: Azure SQL DB 관리형 인스턴스

# azure.resource.providers.sqlInstanceArcContainerLabel
source: SQL managed instance – Azure Arc
es: Instancia administrada de SQL: Azure Arc
fr: Instance managée SQL - Azure Arc
it: Istanza gestita di SQL - Azure Arc
ko: SQL 관리형 인스턴스 - Azure Arc

# azure.resource.resourceTreeNode.noResourcesLabel
source: No Resources found
es: No se han encontrado recursos
fr: Aucune ressource
it: Non sono state trovate risorse
ko: 리소스를 찾을 수 없음

# azure.resource.tenantSubscriptionsError
source: Failed to get subscriptions for account {0} (tenant '{1}'). {2}
fr: Échec de l’obtention des abonnements pour les {0} de compte (locataire «{1}»). {2}
ko: 계정 {0}(테넌트 '{1}')에 대한 구독을 가져오지 못했습니다. {2}

# azure.cloudShell
source: Azure Cloud Shell (Preview) {0} ({1})
es: Azure Cloud Shell (versión preliminar) {0} ({1})
fr: Azure Cloud Shell (préversion) {0} ({1})
it: Azure Cloud Shell (anteprima) {0} ({1})
ko: Azure Cloud Shell(미리 보기) {0}({1})

# azure.cloudTerminal.ok
source: OK
es: Aceptar
ko: 확인

# azure.cloudTerminal.openAzureShell
source: Open Azure Shell
es: Abrir Azure Shell
fr: Ouvrir le shell Azure
it: Apri Azure Shell
ko: Azure Shell 열기

# azure.coudTerminal.neverUsed
source: If you have not launched Azure Cloud Shell from this account before, please visit https://shell.azure.com/ to get started. Once you are set up, you can use AzureCloud Shell directly in Azure Data Studio.
es: Si no ha iniciado Azure Cloud Shell en esta cuenta antes, visite https://shell.azure.com/ para empezar. Una vez realizada la configuración, podrá usar Azure Cloud Shell directamente en Azure Data Studio.
fr: Si vous n'avez jamais lancé Azure Cloud Shell à partir de ce compte, accédez à https://shell.azure.com/ pour démarrer. Après la configuration, vous pouvez utiliser Azure Cloud Shell directement dans Azure Data Studio.
it: Se Azure Cloud Shell non è stato ancora avviato da questo account, vedere https://shell.azure.com/ per iniziare. Dopo la configurazione, è possibile usare Azure Cloud Shell direttamente in Azure Data Studio.
ko: 이전에 이 계정에서 Azure Cloud Shell을 시작하지 않은 경우 https://shell.azure.com/을 방문하여 시작하세요. 설정된 후 Azure Data Studio에서 직접 Azure Cloud Shell을 사용할 수 있습니다.

# azure.selectShellType
source: Select Bash or PowerShell for Azure Cloud Shell
es: Seleccionar Bash o PowerShell para Azure Cloud Shell
fr: Sélectionner Bash ou PowerShell pour Azure Cloud Shell
it: Seleziona Bash o PowerShell per Azure Cloud Shell
ko: Azure Cloud Shell용 Bash 또는 PowerShell 선택

# azure.shellClosed
source: Shell closed.
es: El shell se ha cerrado.
fr: Shell fermé.
it: Shell chiusa.
ko: 셸이 닫혔습니다.

# azure.shellTypeRequired
source: You must pick a shell type
es: Debe elegir un tipo de shell.
fr: Vous devez choisir un type de shell
it: È necessario selezionare un tipo di shell
ko: 셸 유형을 선택해야 합니다.

# azure.resource.tree.accountNotSignedInTreeNode.signInLabel
source: Sign in to Azure...
es: Inicie sesión en Azure...
fr: Connectez-vous à Azure...
it: Accedi ad Azure...
ko: Azure에 로그인...

# azure.resource.tree.accountTreeNode.noSubscriptionsLabel
source: No Subscriptions found.
es: No se han encontrado suscripciones.
fr: Aucun abonnement.
it: Non sono state trovate sottoscrizioni.
ko: 구독을 찾을 수 없습니다.

# azure.unableToAccessSubscription
source: Unable to access subscription {0} ({1}). Please [refresh the account](command:azure.resource.signin) to try again. {2}
fr: Impossible d’accéder à l’abonnement{0} ({1}). Veuillez [actualiser le compte](command:azure.resource.signin) pour réessayer. {2}
ko: 구독 {0}({1})에 액세스할 수 없습니다. 다시 시도하려면 [계정을 새로 고침](command:azure.resource.signin)하세요. {2}

# azure.resource.tree.treeProvider.accountLoadError
source: Failed to load some Azure accounts. {0}
es: No se pudieron cargar alguna cuentas de Azure. {0}
fr: Le chargement de certains comptes Azure a échoué. {0}
it: Non è stato possibile caricare alcuni account Azure. {0}
ko: 일부 Azure 계정을 로드하지 못했습니다. {0}

# azure.resource.tree.treeProvider.loadingLabel
source: Loading ...
es: Cargando...
fr: Chargement...
it: Caricamento...
ko: 로드하는 중...

# azure.resource.tree.treeProvider.openAccountsDialog
source: Show Azure accounts
es: Mostrar cuentas de Azure
fr: Afficher les comptes Azure
it: Mostra account Azure
ko: Azure 계정 표시

# azure.resource.throttleerror
source: Requests from this account have been throttled. To retry, please select a smaller number of subscriptions.
es: Las solicitudes de esta cuenta se han acelerado Para volver a intentarlo, seleccione un número menor de suscripciones.
fr: Les demandes de ce compte ont été limitées. Pour réessayer, sélectionnez un nombre plus petit d’abonnements.
it: Le richieste da questo account sono state limitate. Per riprovare, selezionare un numero inferiore di sottoscrizioni.
ko: 이 계정의 요청은 제한되었습니다. 다시 시도하려면 더 적은 수의 구독을 선택하세요.

# azure.resource.tree.accountTreeNode.title
source: {0} ({1}/{2} subscriptions)
es: {0} ({1} de {2} suscripciones)
fr: {0} (abonnements {1}/{2})
it: {0} ({1}/{2} sottoscrizioni)
ko: {0}({1}/{2}개 구독)

# azure.resource.tree.accountTreeNode.titleLoading
source: {0} - Loading...
es: {0}: carga en curso...
fr: {0} - Chargement...
it: {0} - Caricamento...
ko: {0} - 로드 중...

# azure.resource.tree.loadresourceerror
source: An error occurred while loading Azure resources: {0}
fr: Une erreur s’est produite lors du chargement des ressources Azure : {0}
ko: Azure 리소스를 로드하는 동안 오류가 발생했습니다. {0}

# azure.resource.tree.subscriptionTreeNode.noResourcesLabel
source: No Resources found.
es: No se han encontrado recursos.
fr: Aucune ressource.
it: Non sono state trovate risorse.
ko: 리소스를 찾을 수 없습니다.

# azure.accounts.getLocations.queryError
source: Error fetching locations for account {0} ({1}) subscription {2} ({3}) tenant {4} : {5}
es: Error al capturar ubicaciones para la cuenta {0} ({1}), suscripción {2} ({3}), inquilino {4}: {5}.
fr: Erreur de récupération des emplacements pour le compte {0} ({1}), abonnement {2} ({3}), locataire {4} : {5}
it: Errore durante il recupero delle posizioni per l'account {0} ({1}) sottoscrizione {2} ({3}) tenant {4} : {5}
ko: 계정 {0}({1}) 구독 {2}({3}) 테넌트 {4}의 위치를 가져오는 동안 오류 발생: {5}

# azure.accounts.getResourceGroups.queryError
source: Error fetching resource groups for account {0} ({1}) subscription {2} ({3}) tenant {4} : {5}
es: Error al obtener los grupos de recursos para la cuenta {0} ({1}), suscripción {2} ({3}), inquilino {4}: {5}.
fr: Erreur de récupération des groupes de ressources pour le compte {0} ({1}), abonnement {2} ({3}), locataire {4} : {5}
it: Errore durante il recupero dei gruppi di risorse per l'account {0} ({1}) sottoscrizione {2} ({3}) tenant {4}: {5}
ko: 계정 {0}({1}) 구독 {2}({3}) 테넌트 {4}의 리소스 그룹을 가져오는 동안 오류 발생: {5}

# azure.accounts.getSelectedSubscriptions.queryError
source: Error fetching subscriptions for account {0} : {1}
es: Error al recuperar las suscripciones de la cuenta {0}: {1}.
fr: Erreur de récupération des abonnements pour le compte {0} : {1}
it: Errore durante il recupero delle sottoscrizioni per l'account {0}: {1}
ko: {0} 계정의 구독을 가져오는 동안 오류 발생: {1}

# azure.accounts.getSubscriptions.queryError
source: Error fetching subscriptions for account {0} tenant {1} : {2}
es: Error al obtener las suscripciones de la cuenta {0}, inquilino {1}: {2}.
fr: Erreur de récupération des abonnements pour le compte {0}, locataire {1} : {2}
it: Errore durante il recupero delle sottoscrizioni per l'account {0} tenant {1}: {2}
ko: 계정 {0} 테넌트 {1}의 구독을 가져오는 동안 오류 발생: {2}

# azure.accounts.runResourceQuery.errors.invalidQuery
source: Invalid query
es: Consulta no válida
fr: Requête non valide
it: Query non valida
ko: 잘못된 쿼리

# azure.resource.error
source: Error: {0}
fr: Erreur : {0}
it: Errore: {0}
ko: 오류: {0}

# azure.azureResourcesGridTitle
source: Azure Resources (Preview)
es: Recursos de Azure (versión preliminar)
fr: Ressources Azure (préversion)
it: Risorse di Azure (anteprima)
ko: Azure 리소스(미리 보기)

# azure.unableToOpenAzureLink
source: Unable to open link, missing required values
es: No se puede abrir el vínculo; faltan valores necesarios.
fr: Impossible d'ouvrir le lien, valeurs obligatoires manquantes
it: Non è possibile aprire il collegamento, mancano i valori richiesti
ko: 링크를 열 수 없음, 필요한 값이 없음

# azurecore.australiacentral
source: Australia Central
es: Centro de Australia
fr: Australie Centre
it: Australia centrale
ko: 오스트레일리아 중부

# azurecore.australiacentral2
source: Australia Central 2
es: Centro de Australia 2
fr: Australie Centre 2
it: Australia centrale 2
ko: 오스트레일리아 중부 2

# azurecore.australiaeast
source: Australia East
es: Este de Australia
fr: Australie Est
it: Australia orientale
ko: 오스트레일리아 동부

# azurecore.australiasoutheast
source: Australia Southeast
es: Sudeste de Australia
fr: Australie Sud-Est
it: Australia sud-orientale
ko: 오스트레일리아 남동부

# azurecore.azureArcPostgres
source: Azure Arc-enabled PostgreSQL Hyperscale
es: Hiperescala de PostgreSQL habilitada para Azure Arc
fr: PostgreSQL Hyperscale avec Azure Arc
it: PostgreSQL Hyperscale abilitato per Azure Arc
ko: Azure Arc 지원 PostgreSQL 하이퍼스케일
