Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/azurecore.*.xlf
Languages: es, fr, it, ko

# azurecore.azureArcsqlManagedInstance
source: SQL managed instance - Azure Arc
es: Instancia administrada de SQL: Azure Arc
fr: Instance managée SQL - Azure Arc
it: Istanza gestita di SQL- Azure Arc
ko: SQL 관리형 인스턴스 - Azure Arc

# azurecore.brazilsouth
source: Brazil South
es: Sur de Brasil
fr: Brésil Sud
it: Brasile meridionale
ko: 브라질 남부

# azurecore.brazilsoutheast
source: Brazil Southeast
es: Sudeste de Brasil
fr: Brésil Sud-Est
it: Brasile sud-orientale
ko: 브라질 남동부

# azurecore.canadacentral
source: Canada Central
es: Centro de Canadá
fr: Canada Centre
it: Canada centrale
ko: 캐나다 중부

# azurecore.canadaeast
source: Canada East
es: Este de Canadá
fr: Canada Est
it: Canada orientale
ko: 캐나다 동부

# azurecore.centralindia
source: Central India
es: Centro de la India
fr: Inde Centre
it: India centrale
ko: 인도 중부

# azurecore.centralus
source: Central US
es: Centro de EE. UU.
fr: USA Centre
it: Stati Uniti centrali
ko: 미국 중부

# azurecore.centraluseuap
source: Central US EUAP
es: EUAP del centro de EE. UU.
fr: USA Centre EUAP
it: Stati Uniti centrali EUAP
ko: 미국 중부 EUAP

# azurecore.eastasia
source: East Asia
es: Este de Asia
fr: Asie Est
it: Asia orientale
ko: 동아시아

# azurecore.eastus
source: East US
es: Este de EE. UU.
fr: USA Est
it: Stati Uniti orientali
ko: 미국 동부

# azurecore.eastus2
source: East US 2
es: Este de EE. UU. 2
fr: USA Est 2
it: Stati Uniti orientali 2
ko: 미국 동부 2

# azurecore.eastus2euap
source: East US 2 EUAP
es: EUAP de este de EE. UU. 2
fr: USA Est 2 - EUAP
it: Stati Uniti orientali 2 EUAP
ko: 미국 동부 2 EUAP

# azurecore.extensionName
source: Azure Accounts
es: Cuentas de Azure
fr: Comptes Azure
it: Account Azure
ko: Azure 계정

# azurecore.francecentral
source: France Central
es: Centro de Francia
fr: France Centre
it: Francia centrale
ko: 프랑스 중부

# azurecore.francesouth
source: France South
es: Sur de Francia
fr: France Sud
it: Francia meridionale
ko: 프랑스 남부

# azurecore.germanynorth
source: Germany North
es: Norte de Alemania
fr: Allemagne Nord
it: Germania settentrionale
ko: 독일 북부

# azurecore.germanywestcentral
source: Germany West Central
es: Centro-oeste de Alemania
fr: Allemagne Centre-Ouest
it: Germania centro-occidentale
ko: 독일 중서부

# azurecore.invalidAzureAccount
source: Invalid account
es: Cuenta no válida
fr: Compte non valide
it: Account non valido
ko: 잘못된 계정

# azurecore.invalidTenant
source: Invalid tenant for subscription
es: Inquilino no válido para la suscripción
fr: Locataire non valide pour l'abonnement
it: Tenant non valido per la sottoscrizione
ko: 구독의 잘못된 테넌트

# azurecore.japaneast
source: Japan East
es: Japón Oriental
fr: Japon Est
it: Giappone orientale
ko: 일본 동부

# azurecore.japanwest
source: Japan West
es: Japón Occidental
fr: Japon Ouest
it: Giappone occidentale
ko: 일본 서부

# azurecore.koreacentral
source: Korea Central
es: Centro de Corea del Sur
fr: Corée Centre
it: Corea centrale
ko: 한국 중부

# azurecore.koreasouth
source: Korea South
es: Sur de Corea del Sur
fr: Corée Sud
it: Corea meridionale
ko: 한국 남부

# azurecore.location
source: Location
es: Ubicación
fr: Localisation
it: Posizione
ko: 위치

# azurecore.name
source: Name
es: Nombre
fr: Nom
it: Nome
ko: 이름

# azurecore.northcentralus
source: North Central US
es: Centro-norte de EE. UU.
fr: USA Centre Nord
it: Stati Uniti centro-settentrionali
ko: 미국 중북부

# azurecore.northeurope
source: North Europe
es: Norte de Europa
fr: Europe Nord
it: Europa settentrionale
ko: 북유럽

# azurecore.norwayeast
source: Norway East
es: Este de Noruega
fr: Norvège Est
it: Norvegia orientale
ko: 노르웨이 동부

# azurecore.norwaywest
source: Norway West
es: Oeste de Noruega
fr: Norvège Ouest
it: Norvegia occidentale
ko: 노르웨이 서부

# azurecore.postgresServer
source: Azure Database for PostgreSQL server
es: Servidor de Azure Database for PostgreSQL
fr: Serveur Azure Database pour PostgreSQL
it: Server di Database di Azure per PostgreSQL
ko: Azure Database for PostgreSQL 서버

# azurecore.reload
source: Reload
es: Recargar
fr: Recharger
it: Ricarica
ko: 다시 로드

# azurecore.requiresReload
source: Modifying this setting requires reloading the window for all changes to take effect.
es: La modificación de esta configuración requiere volver a cargar la ventana para que se apliquen todos los cambios.
fr: La modification de ce paramètre nécessite le rechargement de la fenêtre pour appliquer tous les changements.
it: Se si modifica questa impostazione, è necessario ricaricare la finestra per rendere effettive tutte le modifiche.
ko: 이 설정을 수정하려면 모든 변경 내용이 적용되도록 창을 다시 로드해야 합니다.

# azurecore.resourceGroup
source: Resource group
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ko: 리소스 그룹

# azurecore.resourceType
source: Resource type
es: Tipo de recurso
fr: Type de ressource
it: Tipo di risorsa
ko: 리소스 종류

# azurecore.southafricanorth
source: South Africa North
es: Norte de Sudáfrica
fr: Afrique du Sud Nord
it: Sudafrica settentrionale
ko: 남아프리카 북부

# azurecore.southafricawest
source: South Africa West
es: Oeste de Sudáfrica
fr: Afrique du Sud Ouest
it: Sudafrica occidentale
ko: 남아프리카 서부

# azurecore.southcentralus
source: South Central US
es: Centro-sur de EE. UU.
fr: USA Centre Sud
it: Stati Uniti centro-meridionali
ko: 미국 중남부

# azurecore.southeastasia
source: Southeast Asia
es: Sudeste Asiático
fr: Sud-Est asiatique
it: Asia sud-orientale
ko: 동남 아시아

# azurecore.southindia
source: South India
es: Sur de la India
fr: Inde du Sud
it: India meridionale
ko: 인도 남부

# azurecore.sqlDatabase
source: SQL database
es: Base de datos SQL
fr: Base de données SQL
it: Database SQL
ko: SQL 데이터베이스

# azurecore.sqlManagedInstance
source: SQL managed instance
es: Instancia administrada de SQL
fr: Instance managée SQL
it: Istanza gestita di SQL
ko: SQL 관리형 인스턴스

# azurecore.sqlServer
source: SQL server
fr: Serveur SQL
ko: SQL 서버

# azurecore.subscription
source: Subscription
es: Suscripción
fr: Abonnement
it: Sottoscrizione
ko: 구독

# azurecore.switzerlandnorth
source: Switzerland North
es: Norte de Suiza
fr: Suisse Nord
it: Svizzera settentrionale
ko: 스위스 북부

# azurecore.switzerlandwest
source: Switzerland West
es: Oeste de Suiza
fr: Suisse Ouest
it: Svizzera occidentale
ko: 스위스 서부

# azurecore.typeIcon
source: Type Icon
es: Icono de tipo
fr: Icône de type
it: Icona tipo
ko: 형식 아이콘

# azurecore.uaecentral
source: UAE Central
es: Centro de Emiratos Árabes Unidos
fr: Émirats arabes unis Centre
it: Emirati Arabi Uniti centrali
ko: 아랍에미리트 중부

# azurecore.uaenorth
source: UAE North
es: Norte de Emiratos Árabes Unidos
fr: Émirats arabes unis Nord
it: Emirati Arabi Uniti settentrionali
ko: 아랍에미리트 북부

# azurecore.uksouth
source: UK South
es: Sur de Reino Unido
fr: Royaume-Uni Sud
it: Regno Unito meridionale
ko: 영국 남부

# azurecore.ukwest
source: UK West
es: Oeste de Reino Unido
fr: Royaume-Uni Ouest
it: Regno Unito occidentale
ko: 영국 서부

# azurecore.unableToFetchToken
source: Unable to get token for tenant {0}
es: No se puede obtener el token para el inquilino {0}.
fr: Impossible d'obtenir un jeton pour le locataire {0}
it: Non è possibile ottenere il token per il tenant {0}
ko: {0} 테넌트의 토큰을 가져올 수 없음

# azurecore.westcentralus
source: West Central US
es: Centro-oeste de EE. UU.
fr: USA Centre-Ouest
it: Stati Uniti centro-occidentali
ko: 미국 중서부

# azurecore.westeurope
source: West Europe
es: Oeste de Europa
fr: Europe Ouest
it: Europa occidentale
ko: 서유럽

# azurecore.westindia
source: West India
es: Oeste de la India
fr: Inde Ouest
it: India occidentale
ko: 인도 서부

# azurecore.westus
source: West US
es: Oeste de EE. UU.
fr: USA Ouest
it: Stati Uniti occidentali
ko: 미국 서부

# azurecore.westus2
source: West US 2
es: Oeste de EE. UU. 2
fr: USA Ouest 2
it: Stati Uniti occidentali 2
ko: 미국 서부 2

# accounts.clearTokenCache
source: Clear Azure Account Token Cache
es: Borrar la memoria caché de tokens de cuentas de Azure
fr: Effacer le cache de jetons du compte Azure
it: Cancella la cache dei token dell'account Azure
ko: Azure 계정 토큰 캐시 지우기

# azure.description
source: Browse and work with Azure resources
es: Examinar y trabajar con recursos de Azure
fr: Parcourir et utiliser des ressources Azure
it: Consente di sfogliare e usare le risorse di Azure
ko: Azure 리소스 찾아보기 및 사용

# azure.openInAzurePortal.title
source: Open in Azure Portal
es: Abrir en Azure Portal
fr: Ouvrir dans le portail Azure
it: Apri nel portale di Azure
ko: Azure Portal에서 열기

# azure.resource.config.filter.description
source: The resource filter, each element is an account id, a subscription id and name separated by a slash
es: Filtro de recursos. Cada elemento es un id. de cuenta, un id. de suscripción y un nombre separados por una barra diagonal
fr: Filtre de ressources, chaque élément est un ID de compte, un ID d'abonnement et un nom séparés par une barre oblique
it: Filtro delle risorse. Ogni elemento è costituito da un ID account, un ID sottoscrizione e un nome separati da una barra
ko: 리소스 필터, 각 요소는 계정 ID임, 구독 ID와 이름은 슬래시로 구분됨

# azure.resource.config.title
source: Azure Resource Configuration
es: Configuración de recursos de Azure
fr: Configuration des ressources Azure
it: Configurazione risorse di Azure
ko: Azure 리소스 구성

# azure.resource.connectsqldb.title
source: Add to Servers
es: Añadir a servidores
fr: Ajouter aux serveurs
it: Aggiungi ai server
ko: 서버에 추가

# azure.resource.connectsqlserver.title
source: Connect
es: Conectar
fr: Connecter
it: Connetti
ko: 연결

# azure.resource.refresh.title
source: Refresh
es: Actualizar
fr: Actualiser
it: Aggiorna
ko: 새로 고침

# azure.resource.refreshall.title
source: Azure: Refresh All Accounts
es: Azure: actualizar todas las cuentas
fr: Azure : Actualiser tous les comptes
it: Azure: Aggiorna tutti gli account
ko: Azure: 모든 계정 새로 고침

# azure.resource.selectsubscriptions.title
source: Select Subscriptions
es: Seleccionar suscripciones
fr: Sélectionner des abonnements
it: Seleziona sottoscrizioni
ko: 구독 선택

# azure.resource.signin.title
source: Azure: Sign In
es: Azure: iniciar sesión
fr: Azure : Se connecter
it: Azure: Accedi
ko: Azure: 로그인

# azure.resource.startterminal.title
source: Start Cloud Shell
es: Inicio de Cloud Shell
fr: Démarrer Cloud Shell
it: Avvia Cloud Shell
ko: Cloud Shell 시작

# azure.resource.view.title
source: Azure (Preview)
es: Azure (versión preliminar)
fr: Azure (préversion)
it: Azure (anteprima)
ko: Azure(미리 보기)

# azure.tenant.config.filter.description
source: The list of tenant IDs to ignore when querying azure resources. Each element is a tenant id.
es: Lista de id. de inquilino para ignorar al realizar una consultar relativa a recursos de Azure. Cada elemento es un id. de inquilino.
fr: Liste des ID de locataire à ignorer pendant l'interrogation des ressources Azure. Chaque élément est un ID de locataire.
it: Elenco di ID tenant da ignorare durante l'esecuzione di query sulle risorse di Azure. Ogni elemento è un ID tenant.
ko: Azure 리소스를 쿼리할 때 무시할 테넌트 ID 목록입니다. 각 요소는 테넌트 ID입니다.

# config.azureAccountConfigurationSection
source: Azure Account Configuration
es: Configuración de la cuenta de Azure
fr: Configuration du compte Azure
it: Configurazione dell'account Azure
ko: Azure 계정 구성

# config.azureAuthMethodConfigurationSection
source: Azure Authentication Method
es: Método de autenticación de Azure
fr: Méthode d'authentification Azure
it: Metodo di autenticazione di Azure
ko: Azure 인증 방법

# config.azureCodeGrantMethod
source: Code Grant Method
es: Método de concesión de código
fr: Méthode d'octroi de code
it: Metodo di concessione codice
ko: 코드 부여 방법

# config.azureDeviceCodeMethod
source: Device Code Method
es: Método de código del dispositivo
fr: Méthode de code d'appareil
it: Metodo del codice del dispositivo
ko: 디바이스 코드 메서드

# config.enableChinaCloudDescription
source: Should Azure China integration be enabled
es: Si debería habilitarse la integración de Azure China
fr: Spécifie si l'intégration d'Azure Chine doit être activée
it: Consente di indicare se l'integrazione di Azure Cina deve essere abilitata
ko: Azure 중국 통합을 사용하도록 설정한 경우

# config.enableGermanyCloudDescription
source: Should Azure Germany integration be enabled
es: Si debería habilitarse la integración de Azure Alemania
fr: Spécifie si l'intégration d'Azure Allemagne doit être activée
it: Consente di indicare se l'integrazione di Azure Germania deve essere abilitata
ko: Azure 독일 통합을 사용하도록 설정한 경우

# config.enablePublicCloudDescription
source: Should Azure public cloud integration be enabled
es: Si debería habilitarse la integración de la nube pública de Azure
fr: Spécifie si l'intégration du cloud Azure public doit être activée
it: Consente di indicare se l'integrazione del cloud pubblico di Azure deve essere abilitata
ko: Azure 퍼블릭 클라우드 통합을 사용하도록 설정한 경우

# config.enableUsGovCloudDescription
source: Should US Government Azure cloud (Fairfax) integration be enabled
es: Si debería habilitarse la integración de la nube de US Government Azure
fr: Spécifie si l'intégration du cloud Azure US Government (Fairfax) doit être activée
it: Consente di indicare se l'integrazione del cloud US Government Azure (Fairfax) deve essere abilitata
ko: US Government Azure 클라우드(Fairfax) 통합을 사용하도록 설정한 경우

# config.enableUsNatCloudDescription
source: Should US National Azure cloud integration be enabled
es: Indica si se debe habilitar la integración de la nube de Azure nacional de EE. UU.
fr: Spécifie si l'intégration du cloud Azure US National doit être activée
it: Consente di indicare se l'integrazione del cloud Azure US National deve essere abilitata
ko: 미국 국가 Azure 클라우드 통합이 사용되는지 여부

# config.loggingLevel
source: [Optional] The verbosity of logging for the Azure Accounts extension.
ko: [선택 사항] Azure 계정 확장에 대한 로깅의 자세한 정도입니다.

# config.noSystemKeychain
source: Disable system keychain integration. Credentials will be stored in a flat file in the user's home directory.
es: Deshabilite la integración de las cadenas de claves del sistema. Las credenciales se almacenarán en un archivo plano en el directorio principal del usuario.
fr: Désactivez l'intégration du trousseau système. Les informations d'identification sont stockées dans un fichier plat dans le dossier de base de l'utilisateur.
it: Disabilitare l'integrazione del keychain di sistema. Le credenziali verranno archiviate in un file flat nella home directory dell'utente.
ko: 시스템 키 집합 통합을 사용하지 않도록 설정합니다. 자격 증명은 사용자의 홈 디렉터리에서 플랫 파일에 저장됩니다.

# config.piiLogging
source: Should Personally Identifiable Information (PII) be logged in the Azure Accounts output channel and the output channel log file.
ko: 개인 식별 정보(PII)는 Azure 계정 출력 채널 및 출력 채널 로그 파일에 기록되어야 합니다.

# azure.responseError
source: Token retrieval failed with an error. Open developer tools to view the error
es: Error al recuperar el token. Abra las herramientas de desarrollo para ver el error.
fr: La récupération du jeton a échoué avec une erreur. Ouvrir les outils de développement pour voir l'erreur
it: Il recupero del token non è riuscito con un errore. Aprire gli strumenti di sviluppo per visualizzare l'errore

# azurecore.azureArcService
source: Data Service - Azure Arc
es: Servicio de datos: Azure Arc
fr: Service de données - Azure Arc
it: Servizio dati - Azure Arc

# config.piiLogging
source: Should Personally Identifiable Information (PII) be logged in the console view locally
es: Indica si se debe registrar la información de identificación personal (PII) en la vista de la consola de forma local.
fr: Les informations d'identification personnelle (PII) doivent-elles être journalisées localement dans la vue de console
it: Indicare se le informazioni personali devono essere registrate nella visualizzazione della console in locale

# azure.resource.tree.accountTreeNode.credentialError
source: Failed to get credential for account {0}. Please refresh the account.
es: No se pudieron obtener las credenciales de la cuenta {0}. Actualice la cuenta.

# azure.resource.tree.accountTreeNode.credentialError
source: Failed to get credential for account {0}. Please go to the accounts dialog and refresh the account.
es: No se pudieron obtener las credenciales de la cuenta {0}. Vaya al cuadro de diálogo de las cuentas y actualice la cuenta.

# azure.resource.tree.loadresourceerror
source: An error occured while loading Azure resources: {0}
es: Se ha producido un error al cargar los recursos de Azure: {0}

# azure.resource.selectsubscriptions.credentialError
source: Failed to get credential for account {0}. Please refresh the account.
es: No se pudieron obtener las credenciales de la cuenta {0}. Actualice la cuenta.
