Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/big-data-cluster.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hant

# mount.task.complete
source: Mounting HDFS folder is complete
de: Das Einbinden des HDFS-Ordners ist abgeschlossen.
es: El montaje de la carpeta HDFS se ha completado
fr: Le montage du dossier HDFS est terminé
it: Il montaggio della cartella HDFS è stato completato
ja: HDFS フォルダーのマウントが完了しました
ko: HDFS 폴더 탑재가 완료되었습니다.
pt_br: A montagem da pasta do HDFS está concluída
ru: Подключение папки HDFS выполнено
zh_hant: 裝載 HDFS 資料夾已完成

# mount.task.error
source: Error mounting folder: {0}
de: Fehler beim Einbinden des Ordners: {0}
es: Error al montar la carpeta: {0}
fr: Erreur de montage du dossier {0}
it: Si è verificato un errore durante il montaggio della cartella: {0}
ja: フォルダーのマウントでエラーが発生しました: {0}
ko: 폴더 탑재 오류: {0}
pt_br: Erro na montagem da pasta: {0}
ru: Ошибка при подключении папки: {0}
zh_hant: 裝載資料夾時發生錯誤: {0}

# mount.task.inprogress
source: Mounting is likely to complete, check back later to verify
de: Der Einbindungsvorgang wird wahrscheinlich abgeschlossen. Überprüfen Sie dies später.
es: Es probable que el montaje se complete, compruébelo de nuevo más tarde
fr: Le montage va probablement être effectué, revenez vérifier plus tard
it: Il montaggio verrà probabilmente completato. Per verificare, controllare più tardi
ja: マウントが完了しようとしています。後でご確認ください
ko: 탑재가 완료될 수 있습니다. 나중에 다시 확인하세요.
pt_br: A montagem provavelmente será concluída. Volte mais tarde para verificar
ru: Подключение, скорее всего, завершено, проверьте это позднее
zh_hant: 裝載即將完成，請稍後再返回確認

# mount.task.name
source: Mounting HDFS folder on path {0}
de: Der HDFS-Ordner wird im Pfad "{0}" eingebunden.
es: Montaje de la carpeta HDFS en la ruta de acceso {0}
fr: Montage du dossier HDFS sur le chemin {0}
it: Montaggio della cartella HDFS nel percorso {0}
ja: パス {0} 上に HDFS フォルダーをマウントしています
ko: 경로 {0}에 HDFS 폴더를 탑재하는 중
pt_br: Montando a pasta do HDFS no caminho {0}
ru: Подключение папки HDFS по пути {0}
zh_hant: 正在路徑 {0} 上裝載 HDFS 資料夾

# mount.task.submitted
source: Mount creation has started
de: Die Erstellung des eingebundenen Volumes wurde gestartet.
es: La creación del montaje ha comenzado
fr: La création du montage a commencé
it: La creazione del montaggio è stata avviata
ja: マウントの作成が開始されました
ko: 탑재 만들기를 시작했습니다.
pt_br: A criação da montagem foi iniciada
ru: Было запущено создание подключения
zh_hant: 已啟動裝載建立

source: OK
es: Aceptar
ko: 확인
zh_hant: 確定

source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hant: 密碼

# refreshmount.dialog.title
source: Refresh Mount
de: Einbindung aktualisieren
es: Actualización del montaje
fr: Actualiser le montage
it: Aggiorna montaggio
ja: マウントの更新
ko: 탑재 새로 고침
pt_br: Atualizar Montagem
ru: Обновление подключения
zh_hant: 重新整理裝載

# refreshmount.task.name
source: Refreshing HDFS Mount on path {0}
de: Das eingebundene HDFS-Volume im Pfad "{0}" wird aktualisiert.
es: Actualizando el montaje de HDFS en la ruta de acceso {0}
fr: Actualisation du montage HDFS sur le chemin {0}
it: Aggiornamento del montaggio HDFS nel percorso {0}
ja: パス {0} 上の HDFS マウントを更新しています
ko: 경로 {0}에서 HDFS 탑재를 새로 고치는 중
pt_br: Atualizando a Montagem do HDFS no caminho {0}
ru: Обновление подключения HDFS по пути {0}
zh_hant: 正在重新整理路徑 {0} 上的 HDFS 裝載

# refreshmount.task.submitted
source: Refresh mount request submitted
de: Die Anforderung zum Aktualisieren des eingebundenen Volumes wurde übermittelt.
es: Solicitud de actualización de montaje enviada
fr: Demande d'actualisation du montage envoyée
it: Richiesta di aggiornamento montaggio inviata
ja: マウントの更新要求が送信されました
ko: 탑재 새로 고침 요청이 제출됨
pt_br: Solicitação de atualização de montagem enviada
ru: Запрос на обновление подключения отправлен
zh_hant: 已提交重新整理裝載要求

source: Remember Password
de: Kennwort speichern
es: Recordar contraseña
fr: Se souvenir du mot de passe
it: Memorizza password
ja: パスワードを記憶する
ko: 암호 저장
pt_br: Lembrar Senha
ru: Запомнить пароль
zh_hant: 記住密碼

# textAuthCapital
source: Authentication type
de: Authentifizierungstyp
es: Tipo de autenticación
fr: Type d'authentification
it: Tipo di autenticazione
ja: 認証の種類
ko: 인증 유형
pt_br: Tipo de autenticação
ru: Тип проверки подлинности
zh_hant: 驗證類型

source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hant: 使用者名稱

# bdc.controllerTreeDataProvider.error
source: Unexpected error loading saved controllers: {0}
de: Unerwarteter Fehler beim Laden gespeicherter Controller: {0}
es: Error inesperado al cargar los controladores guardados: {0}.
fr: Erreur inattendue pendant chargement des contrôleurs enregistrés : {0}
it: Errore imprevisto durante il caricamento dei controller salvati: {0}
ja: 保存されたコントローラーの読み込み中に予期しないエラーが発生しました: {0}
ko: 저장된 컨트롤러를 로드하는 동안 예기치 않은 오류 발생: {0}
pt_br: Erro inesperado ao carregar os controladores salvos: {0}
ru: Непредвиденная ошибка при загрузке сохраненных контроллеров: {0}
zh_hant: 載入儲存的控制器時發生未預期錯誤: {0}

# bdc.healthy
source: Healthy
de: Fehlerfrei
es: En buen estado
fr: Sain
it: Integri
ja: 正常
ko: 정상
pt_br: Íntegro
ru: Исправна
zh_hant: 狀況良好

# bdc.unhealthy
source: Unhealthy
de: Fehlerhaft
es: En mal estado
fr: Non sain
it: Non integri
ja: 異常
ko: 비정상
pt_br: Não íntegro
ru: Неработоспособный
zh_hant: 狀況不良

# endpoint.appproxy
source: Application Proxy
de: Anwendungsproxy
es: Proxy de aplicación
fr: Proxy d'application
it: Proxy dell'applicazione
ja: アプリケーション プロキシ
ko: 애플리케이션 프록시
pt_br: Proxy de Aplicativo
ru: Прокси приложения
zh_hant: 應用程式 Proxy

# endpoint.controller
source: Cluster Management Service
de: Clusterverwaltungsdienst
es: Servicio de administración de clústeres
fr: Service de gestion de cluster
it: Servizio di gestione cluster
ja: クラスター管理サービス
ko: 클러스터 관리 서비스
pt_br: Serviço de Gerenciamento de Cluster
ru: Служба управления кластерами
zh_hant: 叢集管理服務

# endpoint.gateway
source: Gateway to access HDFS files, Spark
de: Gateway für den Zugriff auf HDFS-Dateien, Spark
es: Puerta de enlace para acceder a archivos HDFS, Spark
fr: Passerelle d'accès aux fichiers HDFS, à Spark
it: Gateway per l'accesso ai file HDFS, Spark
ja: HDFS ファイルにアクセスするためのゲートウェイ、Spark
ko: HDFS 파일에 액세스하기 위한 게이트웨이, Spark
pt_br: Gateway para acessar arquivos HDFS, Spark
ru: Шлюз для доступа к файлам HDFS, Spark
zh_hant: 用來存取 HDFS 檔案的閘道，Spark

# endpoint.grafana
source: Metrics Dashboard
de: Metrikdashboard
es: Panel de métricas
fr: Tableau de bord des métriques
it: Dashboard di metriche
ja: メトリック ダッシュボード
ko: 메트릭 대시보드
pt_br: Painel de Métricas
ru: Панель мониторинга метрик
zh_hant: 計量儀表板

# endpoint.kibana
source: Log Search Dashboard
de: Dashboard für Protokollsuche
es: Panel de búsqueda de registros
fr: Tableau de bord de recherche dans les journaux
it: Dashboard di ricerca log
ja: ログ検索ダッシュボード
ko: 로그 검색 대시보드
pt_br: Painel de Pesquisa de Logs
ru: Панель мониторинга поиска по журналам
zh_hant: 記錄搜尋儀表板

# endpoint.livy
source: Proxy for running Spark statements, jobs, applications
de: Proxy zum Ausführen von Spark-Anweisungen, -Aufträgen und -Anwendungen
es: Proxy para ejecutar instrucciones, trabajos, aplicaciones de Spark
fr: Proxy pour exécuter les instructions, travaux, applications Spark
it: Proxy per l'esecuzione di istruzioni, processi e applicazioni Spark
ja: Spark ステートメント、ジョブ、アプリケーションを実行するためのプロキシ
ko: Spark 문, 작업, 애플리케이션 실행을 위한 프록시
pt_br: Proxy para a execução de instruções, trabalhos, aplicativos do Spark
ru: Прокси-сервер для выполнения инструкций, заданий и приложений Spark
zh_hant: 用來執行 Spark 陳述式、作業、應用程式的 Proxy

# endpoint.managementproxy
source: Management Proxy
de: Verwaltungsproxy
es: Proxy de administración
fr: Proxy de gestion
it: Proxy di gestione
ja: 管理プロキシ
ko: 관리 프록시
pt_br: Proxy de Gerenciamento
ru: Прокси-сервер управления
zh_hant: 管理 Proxy

# endpoint.mgmtproxy
source: Management Proxy
de: Verwaltungsproxy
es: Proxy de administración
fr: Proxy de gestion
it: Proxy di gestione
ja: 管理プロキシ
ko: 관리 프록시
pt_br: Proxy de Gerenciamento
ru: Прокси-сервер управления
zh_hant: 管理 Proxy

# endpoint.sparkHistory
source: Spark Jobs Management and Monitoring Dashboard
de: Dashboard zum Verwalten und Überwachen von Spark-Aufträgen
es: Panel de supervisión y administración de trabajos de Spark
fr: Tableau de bord de gestion et de supervision de travaux Spark
it: Dashboard di gestione processi e monitoraggio di Spark
ja: Spark ジョブの管理と監視ダッシュボード
ko: Spark 작업 관리 및 모니터링 대시보드
pt_br: Painel de Gerenciamento e Monitoramento de Trabalhos do Spark
ru: Панель мониторинга для отслеживания заданий Spark и управления ими
zh_hant: Spark 作業管理與監視儀表板

# endpoint.sqlServerEndpoint
source: SQL Server Master Instance Front-End
de: Front-End der SQL Server-Masterinstanz
es: Front-end de instancia maestra de SQL Server
fr: Front-end de l'instance maître SQL Server
it: Front-end dell'istanza master di SQL Server
ja: SQL Server マスター インスタンス フロントエンド
ko: SQL Server 마스터 인스턴스 프런트 엔드
pt_br: Front-end da Instância Mestra do SQL Server
ru: Интерфейс главного экземпляра SQL Server
zh_hant: SQL Server 主要執行個體前端

# endpoint.webhdfs
source: HDFS File System Proxy
de: HDFS-Dateisystemproxy
es: Proxy de sistema de archivos HDFS
fr: Proxy du système de fichiers HDFS
it: Proxy del file system HDFS
ja: HDFS ファイル システム プロキシ
ko: HDFS 파일 시스템 프록시
pt_br: Proxy do Sistema de Arquivos HDFS
ru: Прокси-сервер файловой системы HDFS
zh_hant: HDFS 檔案系統 Proxy

# endpoint.yarnHistory
source: Spark Diagnostics and Monitoring Dashboard
de: Dashboard zur Spark-Diagnose und -Überwachung
es: Panel de diagnóstico y supervisión de Spark
fr: Tableau de bord de diagnostic et de supervision Spark
it: Dashboard di diagnostica e monitoraggio di Spark
ja: Spark 診断と監視ダッシュボード
ko: Spark 진단 및 모니터링 대시보드
pt_br: Painel de Monitoramento e Diagnóstico do Spark
ru: Панель мониторинга для отслеживания и диагностики Spark
zh_hant: Spark 診斷與監視儀表板

# service.app
source: App
es: Aplicación
fr: Application
ja: アプリ
ko: 앱
pt_br: Aplicativo
ru: Приложение
zh_hant: 應用程式

# service.control
source: Control
de: Steuerelement
fr: Contrôle
it: Controllo
ja: コントロール
ko: 컨트롤
pt_br: Controle
ru: Управление

# service.gateway
source: Gateway
es: Puerta de enlace
fr: Passerelle
ja: ゲートウェイ
ko: 게이트웨이
ru: Шлюз
zh_hant: 閘道

# state.applyingUpgrade
source: Applying Upgrade
de: Upgrade wird angewendet
es: Aplicando actualización
fr: Application de la mise à niveau
it: Applicazione dell'aggiornamento
ja: アップグレードの適用中
ko: 업그레이드를 적용하는 중
pt_br: Aplicando Atualização
ru: Применение обновления
zh_hant: 正在套用升級

# state.applyingmanagedupgrade
source: Applying Managed Upgrade
de: Verwaltetes Upgrade wird angewendet
es: Aplicando la actualización administrada
fr: Application de la mise à niveau gérée
it: Applicazione dell'aggiornamento gestito
ja: マネージド アップグレードの適用中
ko: 관리형 업그레이드를 적용하는 중
pt_br: Aplicando Atualização Gerenciada
ru: Применение управляемого обновления
zh_hant: 正在套用受控升級

# state.creating
source: Creating
de: Wird erstellt
es: Creando
fr: Création
it: In fase di creazione
ja: 作成中
ko: 만드는 중
pt_br: Criando
ru: Создание
zh_hant: 正在建立

# state.creatingGroups
source: Creating Groups
de: Gruppen werden erstellt
es: Creando grupos
fr: Création de groupes
it: Creazione dei gruppi
ja: グループの作成中
ko: 그룹을 만드는 중
pt_br: Criando Grupos
ru: Создание групп
zh_hant: 正在建立群組

# state.creatingKerberosDelegationSetup
source: Creating Kerberos Delegation Setup
de: Setup für Kerberos-Delegierung wird erstellt
es: Creación de la configuración de la delegación Kerberos
fr: Création de la configuration de délégation Kerberos
it: Creazione della configurazione per la delega Kerberos
ja: Kerberos 委任セットアップの作成中
ko: Kerberos 위임 설정을 만드는 중
pt_br: Criando Configuração de Delegação do Kerberos
ru: Создание настройки делегирования Kerberos
zh_hant: 正在建立 Kerberos 委派設定

# state.creatingResources
source: Creating Resources
de: Ressourcen werden erstellt
es: Creando recursos
fr: Création de ressources
it: Creazione delle risorse
ja: リソースの作成中
ko: 리소스를 만드는 중
pt_br: Criando Recursos
ru: Создание ресурсов
zh_hant: 正在建立資源

# state.creatingSecrets
source: Creating Secrets
de: Geheimnisse werden erstellt
es: Creando secretos
fr: Création de secrets
it: Creazione dei segreti
ja: シークレットの作成中
ko: 비밀을 만드는 중
pt_br: Criando Segredos
ru: Создание секретов
zh_hant: 正在建立祕密

# state.deleted
source: Deleted
de: Gelöscht
es: Eliminado
fr: Supprimé
it: Eliminato
ja: 削除済み
ko: 삭제
pt_br: Excluído
ru: Удалить
zh_hant: 已刪除

# state.deleting
source: Deleting
de: Wird gelöscht
es: Eliminando
fr: Suppression
it: In fase di eliminazione
ja: 削除中
ko: 삭제하는 중
pt_br: Excluindo
ru: Удаление
zh_hant: 正在刪除

# state.error
source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pt_br: Erro
ru: Ошибка
zh_hant: 錯誤

# state.managedUpgrading
source: Managed Upgrading
de: Verwaltetes Upgrade wird durchgeführt
es: Actualización administrada
fr: Mise à niveau gérée
it: Aggiornamento gestito
ja: マネージド アップグレード中
ko: 관리형 업그레이드
pt_br: Atualização Gerenciada
ru: Управляемое обновление
zh_hant: 受控升級

# state.ready
source: Ready
de: Bereit
es: Listo
fr: Prêt
it: Pronto
ja: 準備完了
ko: 준비 완료
pt_br: Pronto
ru: Готово
zh_hant: 就緒

# state.rollback
source: Rollback
es: Reversión
fr: Restaurer
ja: ロールバック
ko: 롤백
pt_br: Reverter
ru: Откат
zh_hant: 復原

# state.rollbackComplete
source: Rollback Complete
de: Rollback abgeschlossen
es: Reversión finalizada
fr: Restauration effectuée
it: Rollback completato
ja: ロールバックの完了
ko: 롤백 완료
pt_br: Reversão Concluída
ru: Откат завершен
zh_hant: 復原完成

# state.rollbackInProgress
source: Rollback In Progress
de: Rollback wird ausgeführt
es: Reversión en curso
fr: Restauration en cours
it: Rollback in corso
ja: ロールバックが進行中
ko: 롤백 진행 중
pt_br: Reversão Em Andamento
ru: Выполняется откат
zh_hant: 正在復原

# state.running
source: Running
de: Wird ausgeführt
es: En ejecución
fr: En cours d'exécution
it: In esecuzione
ja: 実行中
ko: 실행하는 중
pt_br: Executando
ru: Работает
zh_hant: 正在執行

# state.upgradePaused
source: Upgrade Paused
de: Upgrade angehalten
es: Actualización en pausa
fr: Mise à niveau suspendue
it: Aggiornamento sospeso
ja: アップグレードが一時停止しました
ko: 업그레이드를 일시 중지함
pt_br: Atualização em Pausa
ru: Обновление приостановлено
zh_hant: 升級已暫停

# state.upgrading
source: Upgrading
de: Upgrade wird durchgeführt
es: Actualizando
fr: Mise à niveau
it: In fase di aggiornamento
ja: アップグレード中
ko: 업그레이드하는 중
pt_br: Atualizando
ru: Идет обновление
zh_hant: 正在升級

# state.waiting
source: Waiting
de: Warten
es: Esperando
fr: En attente
it: In attesa
ja: 待機中
ko: 기다리는 중
pt_br: Aguardando
ru: Ожидание
zh_hant: 正在等候

# state.waitingForDeletion
source: Waiting For Deletion
de: Warten auf Löschung
es: Esperando la eliminación
fr: En attente de suppression
it: In attesa dell'eliminazione
ja: 削除の待機中
ko: 삭제를 대기하는 중
pt_br: Aguardando Exclusão
ru: Ожидание удаления
zh_hant: 正在等待刪除

# state.waitingForGroups
source: Waiting For Groups
de: Auf Gruppen warten
es: Esperando grupos
fr: Attente de groupes
it: In attesa dei gruppi
ja: グループの待機中
ko: 그룹을 대기하는 중
pt_br: Aguardando Grupos
ru: Ожидание групп
zh_hant: 正在等待群組

# state.waitingForKerberosDelegationSetup
source: Waiting For Kerberos Delegation Setup
de: Auf Setup der Kerberos-Delegierung warten
es: Esperando la configuración de la delegación Kerberos
fr: En attente de la configuration de la délégation Kerberos
it: In attesa della configurazione per la delega Kerberos
ja: Kerberos 委任のセットアップの待機中
ko: Kerberos 위임 설정을 대기하는 중
pt_br: Aguardando Configuração de Delegação do Kerberos
ru: Ожидание настройки делегирования Kerberos
zh_hant: 正在等待 Kerberos 委派設定

# state.waitingForResources
source: Waiting For Resources
de: Auf Ressourcen warten
es: Esperando recursos
fr: En attente de ressources
it: In attesa delle risorse
ja: リソースの待機中
ko: 리소스를 대기하는 중
pt_br: Esperando Recursos
ru: Ожидание ресурсов
zh_hant: 正在等待資源

# state.waitingForSecrets
source: Waiting For Secrets
de: Auf Geheimnisse warten
es: Esperando secretos
fr: En attente des secrets
it: In attesa dei segreti
ja: シークレットの待機中
ko: 비밀을 기다리는 중
pt_br: Esperando Os Segredos
ru: Ожидание секретов
zh_hant: 正在等待秘密

# state.waitingForUpgrade
source: Waiting For Upgrade
de: Warten auf Upgrade
es: Esperando la actualización
fr: En attente de mise à niveau
it: In attesa dell'aggiornamento
ja: アップグレードの待機中
ko: 업그레이드를 대기하는 중
pt_br: Aguardando Upgrade
ru: Ожидание обновления
zh_hant: 正在等待升級

# bdc.dashboard.title
source: Big Data Cluster Dashboard -
es: Panel del clúster de macrodatos:
fr: Tableau de bord de cluster Big Data -
it: Dashboard di Cluster Big Data -
ja: ビッグ データ クラスター ダッシュボード -
ko: 빅 데이터 클러스터 대시보드 -
pt_br: Painel do Cluster de Big Data –
ru: Панель мониторинга кластера больших данных —
zh_hant: 巨量資料叢集儀表板 -

# mount.error.endpointNotFound
source: Controller endpoint information was not found
de: Es wurden keine Informationen zum Controllerendpunkt gefunden.
es: No se encontró información del punto de conexión del controlador
fr: Informations de point de terminaison du contrôleur introuvables
it: Le informazioni sull'endpoint del controller non sono state trovate
ja: コントローラー エンドポイント情報が見つかりませんでした
ko: 컨트롤러 엔드포인트 정보를 찾을 수 없음
pt_br: As informações do ponto de extremidade do controlador não foram encontradas
ru: Информация о конечных точках контроллера не найдена
zh_hant: 找不到控制器端點資訊

# textConfirmRemoveController
source: Are you sure you want to remove '{0}'?
de: Möchten Sie "{0}" entfernen?
es: ¿Seguro que quiere quitar "{0}"?
fr: Voulez-vous vraiment supprimer '{0}' ?
it: Rimuovere '{0}'?
ja: '{0}' を削除してよろしいですか?
ko: '{0}'을(를) 제거하시겠습니까?
pt_br: Tem certeza de que deseja remover '{0}'?
ru: Вы действительно хотите удалить "{0}"?
zh_hant: 您確定要移除 '{0}' 嗎?

# textNo
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hant: 否

# textYes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hant: 是

# bdc-agreement
source: I accept {0}, {1} and {2}.
de: Ich akzeptiere {0}, {1} und {2}.
es: Acepto {0}, {1} y {2}.
fr: J'accepte {0}, {1} et {2}.
it: Accetto {0}, {1} e {2}.
ja: {0}、{1}、{2} に同意します。
ko: {0}, {1} 및 {2}에 동의합니다.
pt_br: Aceito {0}, {1} e {2}.
ru: Я принимаю {0}, {1} и {2}.
zh_hant: 我接受 {0}、{1} 和 {2}。

# bdc-agreement-azdata-eula
source: azdata License Terms
de: azdata-Lizenzbedingungen
es: Términos de licencia de azdata
fr: Termes du contrat de licence azdata
it: Condizioni di licenza di azdata
ja: azdata ライセンス条項
ko: azdata 사용 조건
pt_br: Termos de Licença do azdata
ru: Условия лицензии azdata
zh_hant: azdata 授權條款

# bdc-agreement-bdc-eula
source: SQL Server License Terms
de: SQL Server-Lizenzbedingungen
es: Términos de licencia de SQL Server
fr: Termes du contrat de licence SQL Server
it: Condizioni di licenza di SQL Server
ja: SQL Server ライセンス条項
ko: SQL Server 사용 조건
pt_br: Termos de Licença do SQL Server
ru: Условия лицензии SQL Server
zh_hant: SQL Server 授權條款

# bdc-azure-aks-name-field
source: AKS cluster name
de: Name des AKS-Clusters
es: Nombre del clúster de AKS
fr: Nom du cluster AKS
it: Nome del cluster del servizio Azure Kubernetes
ja: AKS クラスター名
ko: AKS 클러스터 이름
pt_br: Nome do cluster do AKS
ru: Имя кластера AKS
zh_hant: AKS 叢集名稱

# bdc-azure-region-field
source: Region
es: Región
fr: Région
it: Area
ja: リージョン
ko: 지역
pt_br: Região
ru: Регион
zh_hant: 區域

# bdc-azure-resource-group-field
source: Resource group name
de: Ressourcengruppenname
es: Nombre del grupo de recursos
fr: Nom de groupe de ressources
it: Nome del gruppo di risorse
ja: リソース グループ名
ko: 리소스 그룹 이름
pt_br: Nome do grupo de recursos
ru: Имя группы ресурсов
zh_hant: 資源群組名稱

# bdc-azure-settings-section-title
source: Azure settings
de: Azure-Einstellungen
es: Configuración de Azure
fr: Paramètres Azure
it: Impostazioni di Azure
ja: Azure の設定
ko: Azure 설정
pt_br: Configurações do Azure
ru: Параметры Azure
zh_hant: Azure 設定

# bdc-azure-subscription-id-field
source: Subscription id
de: Abonnement-ID
es: Identificador de suscripción
fr: ID d'abonnement
it: ID sottoscrizione
ja: サブスクリプション ID
ko: 구독 ID
pt_br: ID da assinatura
ru: Идентификатор подписки
zh_hant: 訂用帳戶識別碼

# bdc-azure-subscription-id-placeholder
source: Use my default Azure subscription
de: Mein Azure-Standardabonnement verwenden
es: Usar mi suscripción predeterminada de Azure
fr: Utiliser mon abonnement Azure par défaut
it: Usa la sottoscrizione di Azure predefinita personale
ja: 既定の Azure サブスクリプションを使用する
ko: 내 기본 Azure 구독 사용
pt_br: Usar minha assinatura padrão do Azure
ru: Использовать мою подписку Azure по умолчанию
zh_hant: 使用我的預設 Azure 訂用帳戶

# bdc-azure-vm-count-field
source: VM count
de: VM-Anzahl
es: Recuento de máquinas virtuales
fr: Nombre de machines virtuelles
it: Numero di macchine virtuali
ja: VM 数
ko: VM 수
pt_br: Contagem de VMs
ru: Число виртуальных машин
zh_hant: VM 計數

# bdc-azure-vm-size-field
source: VM size
de: VM-Größe
es: Tamaño de la máquina virtual
fr: Taille de machine virtuelle
it: Dimensioni della macchina virtuale
ja: VM サイズ
ko: VM 크기
pt_br: Tamanho da VM
ru: Размер виртуальной машины
zh_hant: VM 大小

# bdc-cluster-name-field
source: Cluster name
es: Nombre del clúster
fr: Nom de cluster
it: Nome del cluster
ja: クラスター名
ko: 클러스터 이름
pt_br: Nome do cluster
ru: Имя кластера
zh_hant: 叢集名稱

# bdc-cluster-settings-section-title
source: SQL Server Big Data Cluster settings
de: Einstellungen für SQL Server-Big-Data-Cluster
es: Configuración del clúster de macrodatos de SQL Server
fr: Paramètres de cluster Big Data SQL Server
it: Impostazioni del cluster Big Data di SQL Server
ja: SQL Server ビッグ データ クラスターの設定
ko: SQL Server 빅 데이터 클러스터 설정
pt_br: Configurações do cluster de Big Data do SQL Server
ru: Параметры кластера больших данных SQL Server
zh_hant: SQL Server 巨量資料叢集設定

# bdc-confirm-password-field
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hant: 確認密碼

# bdc-controller-username-field
source: Controller username
de: Benutzername für Controller
es: Nombre de usuario del controlador
fr: Nom d'utilisateur du contrôleur
it: Nome utente del controller
ja: コントローラーのユーザー名
ko: 컨트롤러 사용자 이름
pt_br: Nome de usuário do controlador
ru: Имя пользователя контроллера
zh_hant: 控制器使用者名稱

# bdc-data-size-field
source: Capacity for data (GB)
de: Kapazität für Daten (GB)
es: Capacidad para datos (GB)
fr: Capacité de données (Go)
it: Capacità per i dati (GB)
ja: データの容量 (GB)
ko: 데이터 용량(GB)
pt_br: Capacidade de dados (GB)
ru: Емкость данных (ГБ)
zh_hant: 資料的容量 (GB)

# bdc-deployment-target
source: Deployment target
de: Bereitstellungsziel
es: Destino de implementación
fr: Cible de déploiement
it: Destinazione di distribuzione
ja: デプロイ ターゲット
ko: 배포 대상
pt_br: Destino de implantação
ru: Целевой объект развертывания
zh_hant: 部署目標

# bdc-deployment-target-existing-aks
source: Existing Azure Kubernetes Service Cluster
de: Vorhandener Azure Kubernetes Service-Cluster
es: Clúster de Azure Kubernetes Service existente
fr: Cluster Azure Kubernetes Service existant
it: Cluster esistente del servizio Azure Kubernetes
ja: 既存の Azure Kubernetes Service クラスター
ko: 기존 Azure Kubernetes Service 클러스터
pt_br: Cluster do Serviço de Kubernetes do Azure existente
ru: Существующий кластер Службы Azure Kubernetes
zh_hant: 現有的 Azure Kubernetes 服務叢集

# bdc-deployment-target-existing-aro
source: Existing Azure Red Hat OpenShift cluster
de: Vorhandener Azure Red Hat OpenShift-Cluster
es: Clúster de Red Hat OpenShift en Azure existente
fr: Cluster Azure Red Hat OpenShift existant
it: Cluster Azure Red Hat OpenShift esistente
ja: 既存の Azure Red Hat OpenShift クラスター
ko: 기존 Azure Red Hat OpenShift 클러스터
pt_br: Cluster do Red Hat OpenShift no Azure existente
ru: Существующий кластер Azure Red Hat OpenShift
zh_hant: 現有的 Azure Red Hat OpenShift 叢集
