Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/big-data-cluster.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hant

# bdc.error.deleteHdfs
source: Error deleting mount
de: Fehler beim Löschen des eingebundenen Volumes.
es: Error al eliminar el montaje
fr: Erreur de suppression du montage
it: Si è verificato un errore durante l'eliminazione del montaggio
ja: マウントの削除エラー
ko: 탑재를 삭제하는 중 오류 발생
pt_br: Erro ao excluir a montagem
ru: Ошибка при удалении подключения
zh_hant: 刪除裝載時發生錯誤

# bdc.error.getBdcStatus
source: Error retrieving BDC status from {0}
de: Fehler beim Abrufen des BDC-Status von "{0}".
es: Error al recuperar el estado de BDC desde {0}
fr: Erreur de récupération de l'état BDC de {0}
it: Si è verificato un errore durante il recupero dello stato del cluster Big Data da {0}
ja: {0} から BDC ステータスを取得する操作でエラーが発生しました
ko: {0}에서 BDC 상태 검색 중 오류 발생
pt_br: Erro ao recuperar o status do BDC de {0}
ru: Ошибка при получении состояния модели подключения к бизнес-данным из {0}
zh_hant: 從 {0} 擷取 BDC 狀態時發生錯誤

# bdc.error.getClusterConfig
source: Error retrieving cluster config from {0}
de: Fehler beim Abrufen der Clusterkonfiguration aus "{0}".
es: Error al recuperar la configuración del clúster de {0}.
fr: Erreur de récupération de la configuration de cluster à partir de {0}
it: Errore durante il recupero della configurazione del cluster da {0}
ja: {0} からのクラスター構成の取得でエラーが発生しました
ko: {0}에서 클러스터 구성을 검색하는 동안 오류 발생
pt_br: Erro ao recuperar a configuração do cluster do {0}
ru: Ошибка при получении конфигурации кластера из {0}
zh_hant: 從 {0} 擷取叢集組態時發生錯誤

# bdc.error.getEndPoints
source: Error retrieving endpoints from {0}
de: Fehler beim Abrufen von Endpunkten von "{0}".
es: Error al recuperar los puntos de conexión desde {0}
fr: Erreur de récupération des points de terminaison de {0}
it: Si è verificato un errore durante il recupero degli endpoint da {0}
ja: {0} からのエンドポイントの取得でエラーが発生しました
ko: {0}에서 엔드포인트 검색 중 오류 발생
pt_br: Erro ao recuperar os pontos de extremidade de {0}
ru: Ошибка при извлечении конечных точек из {0}
zh_hant: 從 {0} 擷取端點時發生錯誤

# bdc.error.mountHdfs
source: Error creating mount
de: Fehler beim Erstellen des eingebundenen Volumes.
es: Error al crear el montaje
fr: Erreur de création du montage
it: Si è verificato un errore durante la creazione del montaggio
ja: マウントの作成でエラーが発生しました
ko: 탑재를 만드는 중 오류 발생
pt_br: Erro ao criar a montagem
ru: Ошибка при создании подключения
zh_hant: 建立裝載時發生錯誤

# bdc.error.refreshHdfs
source: Error refreshing mount
de: Fehler beim Aktualisieren des eingebundenen Volumes.
es: Error al actualizar el montaje
fr: Erreur d'actualisation du montage
it: Si è verificato un errore durante l'aggiornamento del montaggio
ja: マウントの更新エラー
ko: 탑재를 새로 고치는 중 오류 발생
pt_br: Erro ao atualizar a montagem
ru: Ошибка при обновлении подключения
zh_hant: 重新整理裝載時發生錯誤

# bdc.error.statusHdfs
source: Error getting mount status
de: Fehler beim Abrufen des Einbindungsstatus.
es: Error al obtener el estado del montaje.
fr: Erreur d'obtention de l'état de montage
it: Errore durante il recupero dello stato di montaggio
ja: マウント状態の取得エラー
ko: 탑재 상태를 가져오는 동안 오류 발생
pt_br: Erro ao obter o status de montagem
ru: Ошибка при получении состояния подключения
zh_hant: 取得裝載狀態時發生錯誤

# bdc.error.tokenPost
source: Error during authentication
de: Fehler während der Authentifizierung.
es: Error durante la autenticación
fr: Erreur pendant l'authentification
it: Si è verificato un errore durante l'autenticazione
ja: 認証中のエラー
ko: 인증 오류
pt_br: Erro durante a autenticação
ru: Ошибка при проверке подлинности
zh_hant: 驗證期間發生錯誤

# bdc.error.unauthorized
source: You do not have permission to log into this cluster using Windows Authentication
de: Sie sind nicht berechtigt, sich unter Verwendung der Windows-Authentifizierung bei diesem Cluster anzumelden.
es: No tiene permiso para iniciar sesión en este clúster mediante la autenticación de Windows
fr: Vous n'avez pas l'autorisation de vous connecter à ce cluster à l'aide de l'authentification Windows
it: Non si è autorizzati ad accedere a questo cluster con Autenticazione di Windows
ja: Windows 認証を使用してこのクラスターにログインするアクセス許可がありません
ko: Windows 인증을 사용하여 이 클러스터에 로그인할 수 있는 권한이 없습니다.
pt_br: Você não tem permissão para fazer logon nesse cluster usando a autenticação do Windows
ru: У вас нет разрешения на вход в этот кластер с использованием проверки подлинности Windows
zh_hant: 您無權使用 Windows 驗證登入此叢集

# error.no.activedirectory
source: This cluster does not support Windows authentication
de: Dieser Cluster unterstützt die Windows-Authentifizierung nicht.
es: Este clúster no admite la autenticación de Windows
fr: Ce cluster ne prend pas en charge l'authentification Windows
it: Questo cluster non supporta l'autenticazione di Windows
ja: このクラスターは Windows 認証をサポートしていません
ko: 이 클러스터는 Windows 인증을 지원하지 않습니다.
pt_br: Este cluster não dá suporte à autenticação do Windows
ru: Этот кластер не поддерживает проверку подлинности Windows
zh_hant: 此叢集不支援 Windows 驗證

source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
it: Aggiungi
ja: 追加
ko: 추가
pt_br: Adicionar
ru: Добавить
zh_hant: 新增

source: Add New Controller
de: Neuen Controller hinzufügen
es: Agregar nuevo controlador
fr: Ajouter un nouveau contrôleur
it: Aggiungi nuovo controller
ja: 新しいコントローラーの追加
ko: 새 컨트롤러 추가
pt_br: Adicionar Novo Controlador
ru: Добавление нового контроллера
zh_hant: 新增控制器

# basicAuthName
source: Basic
de: Standard
es: Básico
fr: De base
it: Di base
ja: 基本
ko: 기본
pt_br: Básico
ru: Базовое
zh_hant: 基本

# bdc.dashboard.bdcOverview
source: Big Data Cluster overview
de: Überblick über Big Data-Cluster
es: Información general del clúster de macrodatos
fr: Vue d'ensemble du cluster Big Data
it: Panoramica di Cluster Big Data
ja: ビッグ データ クラスターの概要
ko: 빅 데이터 클러스터 개요
pt_br: Visão geral do cluster de Big Data
ru: Обзор кластера больших данных
zh_hant: 巨量資料叢集概觀

# bdc.dashboard.clusterDetails
source: Cluster Details
es: Detalles del clúster
fr: Détails du cluster
it: Dettagli del cluster
ja: クラスターの詳細
ko: 클러스터 세부 정보
pt_br: Detalhes do Cluster
ru: Подробная информация о кластере
zh_hant: 叢集詳細資料

# bdc.dashboard.clusterOverview
source: Cluster Overview
de: Clusterübersicht
es: Información general del clúster
fr: Vue d'ensemble du cluster
it: Panoramica del cluster
ja: クラスターの概要
ko: 클러스터 개요
pt_br: Visão Geral do Cluster
ru: Обзор кластера
zh_hant: 叢集概觀

# bdc.dashboard.clusterProperties
source: Cluster Properties
de: Clustereigenschaften
es: Propiedades del clúster
fr: Propriétés du cluster
it: Proprietà del cluster
ja: クラスターのプロパティ
ko: 클러스터 속성
pt_br: Propriedades do Cluster
ru: Свойства кластера
zh_hant: 叢集屬性

# bdc.dashboard.clusterState
source: Cluster State
de: Clusterstatus
es: Estado del clúster
fr: État du cluster
it: Stato del cluster
ja: クラスターの状態
ko: 클러스터 상태
pt_br: Estado do Cluster
ru: Состояние кластера
zh_hant: 叢集狀態

# bdc.dashboard.copy
source: Copy
de: Kopieren
es: Copiar
fr: Copier
it: Copia
ja: コピー
ko: 복사
pt_br: Copiar
ru: Копировать
zh_hant: 複製

# bdc.dashboard.endpoint
source: Endpoint
de: Endpunkt
es: Punto de conexión
fr: Point de terminaison
ja: エンドポイント
ko: 엔드포인트
pt_br: Ponto de Extremidade
ru: Конечная точка
zh_hant: 端點

# bdc.dashboard.healthStatus
source: Health Status
de: Integritätsstatus
es: Estado de mantenimiento
fr: État d'intégrité
it: Stato integrità
ja: 正常性状態
ko: 상태
pt_br: Status da Integridade
ru: Состояние работоспособности
zh_hant: 健全狀態

# bdc.dashboard.healthStatusDetails
source: Health Status Details
de: Details zum Integritätsstatus
es: Detalles del estado de mantenimiento
fr: Détails de l'état d'intégrité
it: Dettagli sullo stato integrità
ja: 正常性状態の詳細
ko: 상태 세부 정보
pt_br: Detalhes do Status da Integridade
ru: Сведения о состоянии работоспособности
zh_hant: 健全狀態詳細資料

# bdc.dashboard.instance
source: Instance
de: Instanz
es: Instancia
it: Istanza
ja: インスタンス
ko: 인스턴스
pt_br: Instância
ru: Экземпляр
zh_hant: 執行個體

# bdc.dashboard.lastUpdated
source: Last Updated : {0}
de: Zuletzt aktualisiert: {0}
es: Ultima actualización: {0}
fr: Dernière mise à jour : {0}
it: Ultimo aggiornamento: {0}
ja: 最終更新日: {0}
ko: 마지막으로 업데이트한 날짜: {0}
pt_br: Última Atualização: {0}
ru: Последнее обновление: {0}
zh_hant: 上次更新日期: {0}

# bdc.dashboard.loadingClusterStateCompleted
source: Loading cluster state completed
de: Der Clusterzustand wurde vollständig geladen.
es: La carga del estado del clúster se ha completado.
fr: L'état de cluster a été chargé
it: Caricamento dello stato del cluster completato
ja: クラスター状態の読み込みが完了しました
ko: 클러스터 상태 로드 완료
pt_br: Carregamento do estado do cluster concluído
ru: Загрузка состояния кластера завершена
zh_hant: 載入叢集狀態已完成

# bdc.dashboard.loadingHealthStatusCompleted
source: Loading health status completed
de: Der Integritätsstatus wurde vollständig geladen.
es: La carga del estado de mantenimiento se ha completado.
fr: L'état d'intégrité a été chargé
it: Caricamento dello stato integrità completato
ja: 正常性状態の読み込みが完了しました
ko: 상태 로드 완료
pt_br: Carregamento do status da integridade concluído
ru: Загрузка состояния работоспособности завершена
zh_hant: 載入健全狀態已完成

# bdc.dashboard.logs
source: Logs
de: Protokolle
es: Registros
fr: Journaux
it: Log
ja: ログ
ko: 로그
ru: Журналы
zh_hant: 記錄

# bdc.dashboard.metricsAndLogs
source: Metrics and Logs
de: Metriken und Protokolle
es: Métricas y registros
fr: Métriques et journaux
it: Metriche e log
ja: メトリックとログ
ko: 메트릭 및 로그
pt_br: Métricas e Logs
ru: Метрики и журналы
zh_hant: 計量與記錄

# bdc.dashboard.noConnection
source: The dashboard requires a connection. Please click retry to enter your credentials.
de: Das Dashboard erfordert eine Verbindung. Klicken Sie auf "Wiederholen", um Ihre Anmeldeinformationen einzugeben.
es: El panel requiere una conexión. Haga clic en Reintentar para escribir sus credenciales.
fr: Le tableau de bord nécessite une connexion. Cliquez sur Réessayer pour entrer vos informations d'identification.
it: Il dashboard richiede una connessione. Fare clic su Riprova per immettere le credenziali.
ja: ダッシュボードには接続が必要です。[再試行] をクリックして資格情報を入力してください。
ko: 대시보드에 연결이 필요합니다. 자격 증명을 입력하려면 다시 시도를 클릭하세요.
pt_br: O painel requer uma conexão. Clique em tentar novamente para inserir suas credenciais.
ru: Необходимо указать параметры подключения для панели мониторинга. Нажмите "Повторить", чтобы ввести свои учетные данные.
zh_hant: 儀表板需要連線。請按一下 [重試]，以輸入您的認證。

# bdc.dashboard.nodeMetrics
source: Node Metrics
de: Knotenmetriken
es: Métricas de nodo
fr: Métriques de nœud
it: Metriche del nodo
ja: ノード メトリック
ko: 노드 메트릭
pt_br: Métricas do Node
ru: Метрики узла
zh_hant: 節點計量

# bdc.dashboard.notAvailable
source: N/A
de: N/V
es: N/D
it: N/D
ja: 該当なし
ko: 해당 없음
pt_br: N/D
ru: Н/Д

# bdc.dashboard.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hant: 重新整理

# bdc.dashboard.service
source: Service
de: Dienst
es: Servicio
it: Servizio
ja: サービス
ko: 서비스
pt_br: Serviço
ru: Служба
zh_hant: 服務

# bdc.dashboard.serviceEndpoints
source: Service Endpoints
de: Dienstendpunkte
es: Puntos de conexión del servicio
fr: Points de terminaison de service
it: Endpoint servizio
ja: サービス エンドポイント
ko: 서비스 엔드포인트
pt_br: Pontos de Extremidade de Serviço
ru: Конечные точки службы
zh_hant: 服務端點

# bdc.dashboard.serviceName
source: Service Name
de: Dienstname
es: Nombre del servicio
fr: Nom du service
it: Nome servizio
ja: サービス名
ko: 서비스 이름
pt_br: Nome do Serviço
ru: Имя службы
zh_hant: 服務名稱

# bdc.dashboard.sqlMetrics
source: SQL Metrics
de: SQL-Metriken
es: Métricas de SQL
fr: Métriques SQL
it: Metriche di SQL
ja: SQL メトリック
ko: SQL 메트릭
pt_br: Métricas do SQL
ru: Метрики SQL
zh_hant: SQL 計量

# bdc.dashboard.state
source: State
de: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
pt_br: Estado
ru: Состояние
zh_hant: 狀態

# bdc.dashboard.status
source: Status Icon
de: Statussymbol
es: Icono de estado
fr: Icône d'état
it: Icona stato
ja: 状態アイコン
ko: 상태 아이콘
pt_br: Ícone de Status
ru: Значок состояния
zh_hant: 狀態圖示

# bdc.dashboard.troubleshoot
source: Troubleshoot
de: Problembehandlung
es: Solucionar problemas
fr: Résoudre les problèmes
it: Risoluzione dei problemi
ja: トラブルシューティング
ko: 문제 해결
pt_br: Solucionar problemas
ru: Устранение неполадок
zh_hant: 疑難排解

# bdc.dashboard.unexpectedError
source: Unexpected error occurred: {0}
de: Unerwarteter Fehler: {0}
es: Error inesperado: {0}
fr: Erreur inattendue : {0}
it: Si è verificato un errore imprevisto: {0}
ja: 予期しないエラーが発生しました: {0}
ko: 예기치 않은 오류가 발생했습니다. {0}
pt_br: Erro inesperado: {0}
ru: Произошла неожиданная ошибка: {0}
zh_hant: 發生未預期的錯誤: {0}

# bdc.dashboard.view
source: View
de: Ansicht
es: Ver
fr: Voir
it: Visualizza
ja: 表示
ko: 보기
pt_br: Exibir
ru: Вид
zh_hant: 檢視

# bdc.dashboard.viewDetails
source: View Details
de: Details anzeigen
es: Ver detalles
fr: Voir les détails
it: Visualizza dettagli
ja: 詳細の表示
ko: 세부 정보 보기
pt_br: Exibir Detalhes
ru: Посмотреть подробную информацию
zh_hant: 檢視詳細資料

# bdc.dashboard.viewErrorDetails
source: View Error Details
de: Fehlerdetails anzeigen
es: Ver detalles del error
fr: Voir les détails de l'erreur
it: Visualizza dettagli dell'errore
ja: エラーの詳細の表示
ko: 오류 세부 정보 보기
pt_br: Exibir Detalhes do Erro
ru: Просмотреть сведения об ошибке
zh_hant: 檢視錯誤詳細資料

# bdc.dashboard.viewLogs
source: View Kibana Logs {0}
de: Kibana-Protokolle anzeigen {0}
es: Ver registros de Kibana {0}
fr: Voir les journaux Kibana {0}
it: Visualizza log di Kibana {0}
ja: Kibana ログ {0} の表示
ko: Kibana 로그 {0} 보기
pt_br: Exibir os Logs do Kibana {0}
ru: Просмотреть журналы Kibana {0}
zh_hant: 檢視 Kibana 記錄 {0}

# bdc.dashboard.viewNodeMetrics
source: View Node Metrics {0}
de: Knotenmetriken anzeigen {0}
es: Ver métricas del nodo {0}
fr: Voir les métriques de nœud {0}
it: Visualizza metriche del nodo {0}
ja: ノード メトリック {0} の表示
ko: 노드 메트릭 {0} 보기
pt_br: Exibir Métricas do Node {0}
ru: Просмотреть метрики узла {0}
zh_hant: 檢視節點計量 {0}

# bdc.dashboard.viewSqlMetrics
source: View SQL Metrics {0}
de: SQL-Metriken anzeigen {0}
es: Ver métricas SQL {0}
fr: Voir les métriques SQL {0}
it: Visualizza metriche di SQL {0}
ja: SQL メトリック {0} の表示
ko: SQL 메트릭 {0} 보기
pt_br: Exibir Métricas do SQL {0}
ru: Просмотреть метрики SQL {0}
zh_hant: 檢視 SQL 計量 {0}

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hant: 取消

source: Cluster Management URL
de: Clusterverwaltungs-URL
es: Dirección URL de administración del clúster
fr: URL de gestion de cluster
it: URL di gestione cluster
ja: クラスター管理の URL
ko: 클러스터 관리 URL
pt_br: URL de Gerenciamento de Cluster
ru: URL-адрес управления кластером
zh_hant: 叢集管理 URL

# connectController.dialog.title
source: Connect to Controller
de: Verbindung mit Controller herstellen
es: Conexión con el controlador
fr: Se connecter au contrôleur
it: Connetti al controller
ja: コントローラーに接続する
ko: 컨트롤러에 연결
pt_br: Conectar ao Controlador
ru: Подключение к контроллеру
zh_hant: 連線至控制器

# copiedEndpoint
source: Endpoint '{0}' copied to clipboard
de: Endpunkt "{0}" in Zwischenablage kopiert
es: Punto de conexión "{0}" copiado en el Portapapeles
fr: Point de terminaison '{0}' copié dans le Presse-papiers
it: L'endpoint '{0}' è stato copiato negli Appunti
ja: エンドポイント '{0}' がクリップボードにコピーされました
ko: 엔드포인트 '{0}'이(가) 클립보드에 복사됨
pt_br: Ponto de extremidade '{0}' copiado para a área de transferência
ru: Конечная точка "{0}" скопирована в буфер обмена
zh_hant: 已將端點 "{0}" 複製到剪貼簿

# deleteMount.dialog.title
source: Delete Mount
de: Einbindung löschen
es: Eliminación de un montaje
fr: Supprimer le montage
it: Elimina montaggio
ja: マウントの削除
ko: 탑재 삭제
pt_br: Excluir Montagem
ru: Удаление подключения
zh_hant: 刪除裝載

# deletemount.task.name
source: Deleting HDFS Mount on path {0}
de: Das eingebundene HDFS-Volume im Pfad "{0}" wird gelöscht.
es: Eliminando el montaje de HDFS en la ruta de acceso {0}
fr: Suppression du montage HDFS sur le chemin {0}
it: Eliminazione del montaggio HDFS nel percorso {0}
ja: パス {0} 上の HDFS マウントを削除しています
ko: 경로 {0}에서 HDFS 탑재를 삭제하는 중
pt_br: Excluindo a Montagem do HDFS no caminho {0}
ru: Удаление подключения HDFS по пути {0}
zh_hant: 正在刪除路徑 {0} 上的 HDFS 裝載

# deletemount.task.submitted
source: Delete mount request submitted
de: Die Anforderung zum Löschen des eingebundenen Volumes wurde übermittelt.
es: Solicitud de eliminación de montaje enviada
fr: Supprimer la demande de montage envoyée
it: Richiesta di eliminazione montaggio inviata
ja: マウントの削除要求が送信されました
ko: 탑재 삭제 요청이 제출됨
pt_br: Solicitação de exclusão de montagem enviada
ru: Запрос на удаление подключения отправлен
zh_hant: 已提交刪除裝載要求

# endpointsError
source: Unexpected error retrieving BDC Endpoints: {0}
de: Unerwarteter Fehler beim Abrufen von BDC-Endpunkten: {0}
es: Error inesperado al recuperar puntos de conexión de BDC: {0}
fr: Erreur inattendue pendant la récupération des points de terminaison BDC : {0}
it: Si è verificato un errore imprevisto durante il recupero degli endpoint BDC: {0}
ja: BDC エンドポイントの取得中に予期しないエラーが発生しました: {0}
ko: BDC 엔드포인트를 검색하는 동안 예기치 않은 오류 발생: {0}
pt_br: Erro inesperado ao recuperar os pontos de Extremidade do BDC: {0}
ru: При получении конечных точек модели подключения к бизнес-данным возникла неожиданная ошибка: {0}
zh_hant: 擷取 BDC 端點時，發生未預期的的錯誤: {0}

# err.controller.password.required
source: Password is required
de: Kennwort erforderlich
es: Se necesita la contraseña.
fr: Mot de passe obligatoire
it: La password è obbligatoria
ja: パスワードが必須です
ko: 암호는 필수입니다.
pt_br: A senha é obrigatória
ru: Требуется пароль
zh_hant: 需要密碼

# err.controller.username.required
source: Username is required
de: Benutzername erforderlich
es: Es necesario especificar el nombre de usuario.
fr: Nom d'utilisateur obligatoire
it: Il nome utente è obbligatorio
ja: ユーザー名が必須です
ko: 사용자 이름이 필요합니다.
pt_br: O nome de usuário é obrigatório
ru: Требуется имя пользователя
zh_hant: 需要使用者名稱

# hdsf.dialog.connection.section
source: Cluster Connection
de: Clusterverbindung
es: Conexión del clúster
fr: Connexion du cluster
it: Connessione cluster
ja: クラスター接続
ko: 클러스터 연결
pt_br: Conexão de Cluster
ru: Подключение к кластеру
zh_hant: 叢集連線

# integratedAuthName
source: Windows Authentication
de: Windows-Authentifizierung
es: Autenticación de Windows
fr: Authentification Windows
it: Autenticazione di Windows
ja: Windows 認証
ko: Windows 인증
pt_br: Autenticação do Windows
ru: Проверка подлинности Windows
zh_hant: Windows 驗證

# mount.credentials.info
source: Mount credentials for authentication to remote data source for reads
de: Anmeldeinformationen zur Authentifizierung des eingebundenen Volumes bei der Remotedatenquelle, um Lesevorgänge auszuführen
es: Credenciales de montaje para la autenticación en el origen de datos remoto para lecturas
fr: Informations d'identification de montage pour l'authentification auprès de la source de données distante pour les lectures
it: Credenziali di montaggio per l'autenticazione all'origine dati remota per operazioni di lettura
ja: 認証用の資格情報をリモート データ ソースにマウントして読み取りを行う
ko: 읽기 위해 원격 데이터 원본에 인증용 자격 증명 탑재
pt_br: Montar as credenciais para autenticação na fonte de dados remota para leituras
ru: Учетные данные подключения для проверки подлинности для чтения удаленного источника данных
zh_hant: 將驗證用認證掛接至遠端資料來源以供讀取

# mount.credentials.title
source: Credentials
de: Anmeldeinformationen
es: Credenciales
fr: Informations d'identification
it: Credenziali
ja: 資格情報
ko: 자격 증명
pt_br: Credenciais
ru: Учетные данные
zh_hant: 認證

# mount.dialog.title
source: Mount HDFS Folder
de: HDFS-Ordner einbinden
es: Montaje de carpetas HDFS
fr: Monter le dossier HDFS
it: Monta cartella HDFS
ja: HDFS フォルダーのマウント
ko: HDFS 폴더 탑재
pt_br: Montar a Pasta do HDFS
ru: Подключение папки HDFS
zh_hant: 裝載 HDFS 資料夾

# mount.err.formatting
source: Bad formatting of credentials at {0}
de: Fehlerhafte Formatierung von Anmeldeinformationen in "{0}".
es: Formato incorrecto de las credenciales en {0}
fr: Mise en forme incorrecte des informations d'identification sur {0}
it: Formattazione non valida delle credenziali alla posizione {0}
ja: {0} での資格情報の書式設定が正しくありません
ko: {0}에 있는 자격 증명 형식이 잘못됨
pt_br: Formatação incorreta de credenciais em {0}
ru: Неправильное форматирование учетных данных в {0}
zh_hant: 位於 {0} 的認證格式錯誤

# mount.error.unknown
source: Unknown error occurred during the mount process
de: Unbekannter Fehler während des Einbindungsvorgangs.
es: Error desconocido durante el proceso de montaje
fr: Une erreur inconnue s'est produite pendant le processus de montage
it: Si è verificato un errore sconosciuto durante il processo di montaggio
ja: マウント プロセス中に不明なエラーが発生しました
ko: 탑재 프로세스 중에 알 수 없는 오류가 발생했습니다.
pt_br: Erro desconhecido durante o processo de montagem
ru: Неизвестная ошибка в процессе подключения
zh_hant: 裝載過程中發生未知錯誤

# mount.hdfs.loginerror1
source: Login to controller failed
de: Fehler bei der Anmeldung beim Controller.
es: Error al iniciar sesión en el controlador
fr: La connexion au contrôleur a échoué
it: Accesso al controller non riuscito
ja: コントローラーへのログインに失敗しました
ko: 컨트롤러에 로그인하지 못함
pt_br: Falha ao entrar no controlador
ru: Не удалось войти на контроллер
zh_hant: 無法登入控制器

# mount.hdfs.loginerror2
source: Login to controller failed: {0}
de: Fehler bei der Anmeldung beim Controller: {0}
es: Error al iniciar sesión en el controlador: {0}
fr: La connexion au contrôleur a échoué : {0}
it: Accesso al controller non riuscito: {0}
ja: コントローラーへのログインに失敗しました: {0}
ko: 컨트롤러에 로그인하지 못함: {0}
pt_br: Falha ao entrar no controlador: {0}
ru: Ошибка входа на контроллер: {0}
zh_hant: 無法登入控制器: {0}

# mount.hdfsPath.info
source: Path to a new (non-existing) directory which you want to associate with the mount
de: Pfad zu einem neuen (nicht vorhandenen) Verzeichnis, das Sie dem eingebundenen Volume zuordnen möchten
es: Ruta de acceso a un nuevo directorio (no existente) que desea asociar al montaje
fr: Chemin d'un nouveau répertoire (non existant) à associer au montage
it: Percorso di una nuova directory non esistente da associare al montaggio
ja: マウントに関連付ける新しい (存在しない) ディレクトリへのパス
ko: 탑재와 연결하려는 새(기존 항목 아님) 디렉터리의 경로
pt_br: Caminho para um novo diretório (não existente) que você deseja associar com a montagem
ru: Путь к новому (несуществующему) каталогу, который вы хотите связать с точкой подключения
zh_hant: 要連結到掛接之新 (不存在) 目錄的路徑

# mount.hdfsPath.title
source: HDFS Path
de: HDFS-Pfad
es: Ruta HDFS
fr: Chemin HDFS
it: Percorso HDFS
ja: HDFS パス
ko: HDFS 경로
pt_br: Caminho do HDFS
ru: Путь HDFS
zh_hant: HDFS 路徑

# mount.main.section
source: Mount Configuration
de: Einbindungskonfiguration
es: Configuración del montaje
fr: Configuration du montage
it: Configurazione montaggio
ja: マウント構成
ko: 탑재 구성
pt_br: Configuração da Montagem
ru: Конфигурация подключения
zh_hant: 裝載組態

# mount.remoteUri.info
source: The URI to the remote data source. Example for ADLS: abfs://fs@saccount.dfs.core.windows.net/
de: Der URI zur Remotedatenquelle, Beispiel für ADLS: abfs://fs@saccount.dfs.core.windows.net/
es: El URI del origen de datos remoto. Ejemplo de ADLS: abfs://fs@saccount.dfs.core.windows.net/
fr: URI de la source de données distante. Exemple pour ADLS : abfs://fs@saccount.dfs.core.windows.net/
it: URI dell'origine dati remota. Esempio per ADLS: abfs://fs@saccount.dfs.core.windows.net/
ja: リモート データ ソースへの URI。ADLS の例: abfs://fs@saccount.dfs.core.windows.net/
ko: 원격 데이터 원본에 대한 URI입니다. ADLS의 예: abfs://fs@saccount.dfs.core.windows.net/
pt_br: O URI da fonte de dados remota. Exemplo para o ADLS: abfs://fs@saccount.dfs.core.windows.net/
ru: URI удаленного источника данных. Например, для ADLS: abfs://fs@saccount.dfs.core.windows.net/
zh_hant: 遠端資料來源的 URI。ADLS 範例: abfs://fs@saccount.dfs.core.windows.net/

# mount.remoteUri.title
source: Remote URI
es: URI remoto
fr: URI distant
it: URI del repository remoto
ja: リモート URI
ko: 원격 URI
pt_br: URI remoto
ru: Удаленный URI
zh_hant: 遠端 URI
