Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/big-data-cluster.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hant

# bdc-deployment-target-existing-kubeadm
source: Existing Kubernetes Cluster (kubeadm)
de: Vorhandener Kubernetes-Cluster (kubeadm)
es: Clúster Kubernetes existente (kubeadm)
fr: Cluster Kubernetes existant (kubeadm)
it: Cluster Kubernetes esistente (kubeadm)
ja: 既存の Kubernetes クラスター (kubeadm)
ko: 기존 Kubernetes 클러스터(kubeadm)
pt_br: Cluster do Kubernetes existente (kubeadm)
ru: Существующий кластер Kubernetes (kubeadm)
zh_hant: 現有的 Kubernetes 叢集 (kubeadm)

# bdc-deployment-target-existing-openshift
source: Existing OpenShift cluster
de: Vorhandener OpenShift-Cluster
es: Clúster de OpenShift existente
fr: Cluster OpenShift existant
it: Cluster OpenShift esistente
ja: 既存の OpenShift クラスター
ko: 기존 OpenShift 클러스터
pt_br: Cluster do OpenShift existente
ru: Существующий кластер OpenShift
zh_hant: 現有的 OpenShift 叢集

# bdc-deployment-target-new-aks
source: New Azure Kubernetes Service Cluster
de: Neuer Azure Kubernetes Service-Cluster
es: Nuevo clúster de Azure Kubernetes Service
fr: Nouveau cluster Azure Kubernetes Service
it: Nuovo cluster del servizio Azure Kubernetes
ja: 新しい Azure Kubernetes Service クラスター
ko: 새 Azure Kubernetes Service 클러스터
pt_br: Novo Cluster do Serviço de Kubernetes do Azure
ru: Новый кластер Службы Azure Kubernetes
zh_hant: 新增 Azure Kubernetes Service 叢集

# bdc-log-size-field
source: Capacity for logs (GB)
de: Kapazität für Protokolle (GB)
es: Capacidad para registros (GB)
fr: Capacité des journaux (Go)
it: Capacità per i log (GB)
ja: ログの容量 (GB)
ko: 로그 용량(GB)
pt_br: Capacidade de logs (GB)
ru: Емкость для журналов (ГБ)
zh_hant: 記錄的容量 (GB)

# bdc-password-field
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hant: 密碼

# bdc-storage-class-field
source: Storage class name
de: Name der Speicherklasse
es: Nombre de la clase de almacenamiento
fr: Nom de la classe de stockage
it: Nome della classe di archiviazione
ja: ストレージ クラス名
ko: 스토리지 클래스 이름
pt_br: Nome da classe de armazenamento
ru: Имя класса хранения
zh_hant: 儲存類別名稱

# bdc.configuration.title
source: Big Data Cluster
es: Clúster de macrodatos
fr: Cluster Big Data
it: Cluster Big Data
ja: ビッグ データ クラスター
ko: 빅 데이터 클러스터
pt_br: Cluster de Big Data
ru: Кластер больших данных
zh_hant: 巨量資料叢集

# bdc.ignoreSslVerification.desc
source: Ignore SSL verification errors against SQL Server Big Data Cluster endpoints such as HDFS, Spark, and Controller if true
de: Bei Festlegung auf TRUE werden SSL-Überprüfungsfehler für SQL Server-Big Data Cluster-Endpunkte wie HDFS, Spark und Controller ignoriert.
es: Ignorar los errores de verificación SSL en los puntos de conexión del clúster de macrodatos de SQL Server, como HDFS, Spark y Controller, si es true
fr: Ignorer les erreurs de vérification SSL sur les points de terminaison de cluster Big Data SQL Server de type HDFS, Spark et Contrôleur si la valeur est true
it: Se è true, ignora gli errori di verifica SSL in endpoint del cluster Big Data di SQL Server come HDFS, Spark e Controller
ja: HDFS、Spark、コントローラーなどの SQL Server ビッグ データ クラスター エンドポイントに対する SSL 検証エラーを無視する (true の場合)
ko: True인 경우 HDFS, Spark 및 Controller와 같은 SQL Server 빅 데이터 클러스터 엔드포인트를 대상으로 SSL 확인 오류 무시
pt_br: Ignorar os erros de verificação do SSL em relação aos pontos de extremidade do Cluster de Big Data do SQL Server, como o HDFS, o Spark e o Controlador, se for true
ru: Если этот параметр имеет значение TRUE, игнорировать ошибки проверки SSL в отношении конечных точек кластера больших данных SQL Server, таких как HDFS, Spark и Controller
zh_hant: 若為 True，則忽略對 SQL Server 巨量資料叢集端點 (例如 HDFS、Spark 及控制器) 所產生的 SSL 驗證錯誤

# bdc.view.welcome.connect
source: No SQL Big Data Cluster controllers registered. [Learn More](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [Connect Controller](command:bigDataClusters.command.connectController)
de: Es sind keine Big Data-Cluster-Controller für SQL registriert. [Weitere Informationen](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [Controller verbinden](command:bigDataClusters.command.connectController)
es: No se ha registrado ningún controlador del clúster de macrodatos de SQL. [Más información](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [Conexión de un controlador](command:bigDataClusters.command.connectController)
fr: Aucun contrôleur de cluster Big Data SQL n'est inscrit. [En savoir plus](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [Connecter un contrôleur](command:bigDataClusters.command.connectController)
it: Non sono stati registrati controller del cluster Big Data di SQL. [Altre informazioni](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [Connetti controller](command:bigDataClusters.command.connectController)
ja: SQL ビッグ データ クラスター コントローラーが登録されていません。[詳細] (https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [接続コントローラー] (command:bigDataClusters.command.connectController)
ko: 등록된 SQL 빅 데이터 클러스터 컨트롤러가 없습니다. [자세한 정보](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [컨트롤러 연결](command:bigDataClusters.command.connectController)
pt_br: Nenhum controlador do Cluster de Big Data do SQL registrado. [Saiba Mais](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [Conectar Controlador](command:bigDataClusters.command.connectController)
ru: Контроллеры кластера больших данных SQL не зарегистрированы. [Дополнительные сведения](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [Connect Controller](command:bigDataClusters.command.connectController)
zh_hant: 未註冊任何 SQL 巨量資料叢集控制器。[深入了解](https://docs.microsoft.com/sql/big-data-cluster/big-data-cluster-overview) [連線控制器](command:bigDataClusters.command.connectController)

# bdc.view.welcome.loading
source: Loading controllers...
de: Controller werden geladen...
es: Se están cargando los controladores...
fr: Chargement des contrôleurs...
it: Caricamento controller...
ja: コントローラーを読み込んでいます...
ko: 컨트롤러를 로드하는 중...
pt_br: Carregando controladores...
ru: Загрузка контроллеров…
zh_hant: 正在載入控制器...

# command.connectController.title
source: Connect to Existing Controller
de: Verbindung mit vorhandenem Controller herstellen
es: Conexión con el controlador existente
fr: Se connecter au contrôleur existant
it: Connetti al controller esistente
ja: 既存のコントローラーに接続する
ko: 기존 컨트롤러에 연결
pt_br: Conectar-se ao Controlador Existente
ru: Подключение к существующему контроллеру
zh_hant: 連線至現有的控制器

# command.createController.title
source: Create New Controller
de: Neuen Controller erstellen
es: Creación de un nuevo controlador
fr: Créer un contrôleur
it: Crea nuovo controller
ja: 新しいコントローラーの作成
ko: 새 컨트롤러 만들기
pt_br: Criar Controlador
ru: Создание нового контроллера
zh_hant: 建立新控制器

# command.deletemount.title
source: Delete Mount
de: Eingebundenes Volume löschen
es: Eliminar montaje
fr: Supprimer le montage
it: Elimina montaggio
ja: マウントの削除
ko: 탑재 삭제
pt_br: Excluir Montagem
ru: Удалить подключение
zh_hant: 刪除裝載

# command.manageController.title
source: Manage
de: Verwalten
es: Administrar
fr: Gérer
it: Gestisci
ja: 管理
ko: 관리
pt_br: Gerenciar
ru: Управление
zh_hant: 管理

# command.mount.title
source: Mount HDFS
de: HDFS einbinden
es: Montar HDFS
fr: Monter HDFS
it: Monta HDFS
ja: HDFS のマウント
ko: HDFS 탑재
pt_br: Montar o HDFS
ru: Подключение HDFS
zh_hant: 裝載 HDFS

# command.refreshController.title
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hant: 重新整理

# command.refreshmount.title
source: Refresh Mount
de: Eingebundenes Volume aktualisieren
es: Actualizar montaje
fr: Actualiser le montage
it: Aggiorna montaggio
ja: マウントの更新
ko: 탑재 새로 고침
pt_br: Atualizar Montagem
ru: Обновить подключение
zh_hant: 重新整理裝載

# command.removeController.title
source: Remove Controller
de: Controller entfernen
es: Eliminación de un controlador
fr: Supprimer le contrôleur
it: Rimuovi controller
ja: コントローラーの削除
ko: 컨트롤러 제거
pt_br: Remover Controlador
ru: Удаление контроллера
zh_hant: 移除控制器

# description
source: Support for managing SQL Server Big Data Clusters
de: Unterstützung für die Verwaltung von SQL Server-Big Data-Clustern
es: Compatibilidad con la administración de clústeres de macrodatos de SQL Server
fr: Prise en charge de la gestion des clusters Big Data SQL Server
it: Supporto per la gestione di cluster Big Data di SQL Server
ja: SQL Server ビッグ データ クラスターの管理をサポート
ko: SQL Server 빅 데이터 클러스터 관리 지원
pt_br: Suporte para gerenciar clusters de Big Data do SQL Server
ru: Поддержка управления кластерами больших данных SQL Server
zh_hant: 管理 SQL Server 巨量資料叢集的支援

source: Microsoft Privacy Statement
de: Microsoft-Datenschutzbestimmungen
es: Declaración de privacidad de Microsoft
fr: Déclaration de confidentialité Microsoft
it: Informativa sulla privacy di Microsoft
ja: Microsoft プライバシー ステートメント
ko: Microsoft 개인정보처리방침
pt_br: Política de Privacidade da Microsoft
ru: Заявление о конфиденциальности корпорации Майкрософт
zh_hant: Microsoft 隱私權聲明

# resource-type-sql-bdc-description
source: SQL Server Big Data Cluster allows you to deploy scalable clusters of SQL Server, Spark, and HDFS containers running on Kubernetes
de: Mit dem Big Data-Cluster von SQL Server können Sie skalierbare Cluster aus SQL Server-, Spark- und HDFS-Containern bereitstellen, die in Kubernetes ausgeführt werden.
es: El clúster de macrodatos de SQL Server le permite implementar clústeres escalables de contenedores de SQL Server, Spark y HDFS que se ejecutan en Kubernetes
fr: Le cluster Big Data SQL Server vous permet de déployer des clusters scalables de conteneurs SQL Server, Spark et HDFS s'exécutant sur Kubernetes
it: Il cluster Big Data di SQL Server consente di distribuire cluster scalabili di contenitori SQL Server, Spark e HDFS in esecuzione in Kubernetes
ja: SQL Server ビッグ データ クラスターを使用すると、Kubernetes で実行されている SQL Server、Spark、および HDFS のコンテナーのスケーラブルなクラスターをデプロイできます。
ko: SQL Server 빅 데이터 클러스터를 사용하면 Kubernetes에서 실행되는 SQL Server, Spark 및 HDFS 컨테이너의 확장 가능한 클러스터를 배포할 수 있습니다.
pt_br: O Cluster de Big Data do SQL Server permite implantar clusters escalonáveis de contêineres do SQL Server, do Spark e do HDFS em execução no Kubernetes
ru: Кластер больших данных SQL Server позволяет развертывать масштабируемые кластеры контейнеров SQL Server, Spark и HDFS, работающие на базе Kubernetes
zh_hant: SQL Server 巨量資料叢集，可讓您部署於 Kubernetes 上執行且可調整的 SQL Server、Spark 和 HDFS 容器叢集

# resource-type-sql-bdc-display-name
source: SQL Server Big Data Cluster
es: Clúster de macrodatos de SQL Server
fr: Cluster Big Data SQL Server
it: Cluster Big Data di SQL Server
ja: SQL Server ビッグ データ クラスター
ko: SQL Server 빅 데이터 클러스터
pt_br: Cluster de Big Data do SQL Server
ru: Кластер больших данных SQL Server
zh_hant: SQL Server 巨量資料叢集

# text.sqlServerBigDataClusters
source: SQL Server Big Data Clusters
de: SQL Server-Big Data-Cluster
es: Clústeres de macrodatos de SQL Server
fr: Clusters Big Data SQL Server
it: Cluster Big Data di SQL Server
ja: SQL Server ビッグ データ クラスター
ko: SQL Server 빅 데이터 클러스터
pt_br: Clusters de Big Data do SQL Server
ru: Кластеры больших данных SQL Server
zh_hant: SQL Server 巨量資料叢集

# version-display-name
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hant: 版本

source: URL
es: Dirección URL
ru: URL-адрес

# service.sql
source: SQL Server
fr: Serveur SQL
