Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/dacpac.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hant

# dacfx.undefinedFilenameErrorMessage
source: Undefined name
pt_br: Nome indefinido
ru: Не определено имя

# dacfx.value
source: Value
pt_br: Valor
ru: Значение

# dacfx.version
source: Version
pt_br: Versão
ru: Версия

# dacfx.whitespaceFilenameErrorMessage
source: File name cannot be whitespace
pt_br: O nome do arquivo não pode ser espaço em branco
ru: Имя файла не может быть пробелом

# dacfx.wizardTitle
source: Data-tier Application Wizard
pt_br: Assistente de Aplicativo em Camada de Dados
ru: Мастер приложений уровня данных

# dacFx.defaultSaveLocation
source: Full path to folder where .DACPAC and .BACPAC files are saved by default
pt_br: Caminho completo para a pasta em que se encontram os arquivos .DACPAC e .BACPAC são salvos por padrão
ru: Полный путь к папке, в которой по умолчанию сохраняются файлы DACPAC и BACPAC

# dacFx.startTitle
source: Data-tier Application Wizard
pt_br: Assistente de Aplicativo em Camada de Dados
ru: Мастер приложений уровня данных
