Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/dacpac.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hant

# dacFx.deployRadioButtonLabel
source: Deploy a data-tier application .dacpac file to an instance of SQL Server [Deploy Dacpac]
de: DACPAC-Datei einer Datenschichtanwendung für eine SQL Server-Instanz bereitstellen [DACPAC bereitstellen]
es: Implementar un archivo .dacpac de una aplicación de la capa de datos en una instancia de SQL Server [Implementar Dacpac]
it: Distribuisci un file con estensione dacpac dell'applicazione livello dati in un'istanza di SQL Server [Distribuisci DACPAC]
ja: データ層アプリケーションの .dacpac ファイルを SQL Server インスタンスにデプロイします [Dacpac のデプロイ]
ko: 데이터 계층 애플리케이션 .dacpac 파일을 SQL Server의 인스턴스에 배포[Dacpac 배포]
zh_hant: 將資料層應用程式 .dacpac 檔案部署到 SQL Server 的執行個體 [部署 Dacpac]

# dacFx.extractRadioButtonLabel
source: Extract a data-tier application from an instance of SQL Server to a .dacpac file [Extract Dacpac]
de: Datenschichtanwendung aus einer SQL Server-Instanz in eine DACPAC-Datei extrahieren [DACPAC extrahieren]
es: Extraer una aplicación de la capa de datos de una instancia de SQL Server a un archivo .dacpac [Extraer Dacpac]
it: Estrai un'applicazione livello dati da un'istanza di SQL Server in un file con estensione dacpac [Estrai DACPAC]
ja: SQL Server インスタンスのデータ層アプリケーションを .dacpac ファイルに抽出します [Dacpac の抽出]
ko: SQL Server의 인스턴스에서 데이터 계층 애플리케이션을 .dacpac 파일로 추출[Dacpac 추출]
zh_hant: 從 SQL Server 的執行個體將資料層應用程式擷取為 .dacpac 檔案 [擷取 Dacpac]

# dacFx.importRadioButtonLabel
source: Create a database from a .bacpac file [Import Bacpac]
de: Datenbank aus einer BACPAC-Datei erstellen [BACPAC importieren]
es: Crear una base de datos a partir de un archivo .bacpac [Importar Bacpac]
it: Crea un database da un file con estensione bacpac [Importa BACPAC]
ja: .bacpac ファイルからデータベースを作成します [Bacpac のインポート]
ko: .bacpac 파일에서 데이터베이스 만들기[Bacpac 가져오기]
zh_hant: 從 .bacpac 檔案建立資料庫 [匯入 Bacpac]

# dacFx.exportRadioButtonLabel
source: Export the schema and data from a database to the logical .bacpac file format [Export Bacpac]
de: Schema und Daten aus einer Datenbank in das logische BACPAC-Dateiformat exportieren [BACPAC exportieren]
es: Exportar el esquema y los datos de una base de datos al formato de archivo lógico .bacpac [Exportar Bacpac]
it: Esporta lo schema e i dati da un database nel formato di file logico con estensione bacpac [Esporta BACPAC]
ja: データベースのスキーマとデータを論理 .bacpac ファイル形式にエクスポートします [Bacpac のエクスポート]
ko: 데이터베이스의 스키마 및 데이터를 논리적 .bacpac 파일 형식으로 내보내기[Bacpac 내보내기]
zh_hant: 從資料庫將結構描述和資料匯出為邏輯 .bacpac 檔案格式 [匯出 Bacpac]

# dacFxImport.openFile
source: Open
de: Öffnen
es: Abrir
it: Apri
ja: 開く
ko: 열기
zh_hant: 開啟

# dacFxImport.fileTextboxTitle
source: File Location
de: Dateispeicherort
es: Ubicación de archivos
it: Percorso file
ja: ファイルの場所
ko: 파일 위치
zh_hant: 檔案位置

# dacfxExtract.saveFile
source: Save
de: Speichern
es: Guardar
it: Salva
ja: 保存
ko: 저장
zh_hant: 儲存

# dacFxExtract.fileTextboxTitle
source: File Location
de: Dateispeicherort
es: Ubicación de archivos
it: Percorso file
ja: ファイルの場所
ko: 파일 위치
zh_hant: 檔案位置

# dacFxExtract.versionTextboxTitle
source: Version (use x.x.x.x where x is a number)
de: Version (Verwenden Sie x.x.x.x, wobei x für eine Zahl steht)
es: Versión (use x.x.x.x, donde x es un número)
it: Versione (usare x.x.x.x dove x è un numero)
ja: バージョン (形式は x.x.x.x。x は数字)
ko: 버전(x.x.x.x 사용, x는 숫자임)
zh_hant: 版本 (使用 x.x.x.x，其中 x 是號碼)

# dacfxExport.saveFile
source: Save
de: Speichern
es: Guardar
it: Salva
ja: 保存
ko: 저장
zh_hant: 儲存

# dacFxExport.fileTextboxTitle
source: File Location
de: Dateispeicherort
es: Ubicación de archivos
it: Percorso file
ja: ファイルの場所
ko: 파일 위치
zh_hant: 檔案位置

# dacfx.dataLossTextWithCount
source: {0} of the deploy actions listed may result in data loss. Please ensure you have a backup or snapshot available in the event of an issue with the deployment.
de: {0} der aufgeführten Bereitstellungsaktionen können zu einem Datenverlust führen. Stellen Sie sicher, dass eine Sicherung oder eine Momentaufnahme vorhanden ist, falls Probleme mit der Bereitstellung auftreten.
es: {0} de las acciones de implementación enumeradas pueden dar lugar a la pérdida de datos. Asegúrese de que tiene una copia de seguridad o una instantánea por si hay algún problema con la implementación.
it: {0} delle azioni di distribuzione elencate potrebbero causare la perdita di dati. Assicurarsi di avere a disposizione un backup o uno snapshot in caso di problemi con la distribuzione.
ja: リストされている {0} のデプロイ操作によってデータが失われる可能性があります。デプロイで生じる問題に備えて、バックアップまたはスナップショットが使用可能であることを確認してください。
ko: 나열된 배포 작업의 {0}(으)로 인해 데이터가 손실될 수 있습니다. 배포 관련 문제가 발생하는 경우 사용할 수 있는 백업 또는 스냅샷이 있는지 확인하세요.
pt_br: {0} das ações de implantação listadas podem resultar em perda de dados. Verifique se você tem um backup ou instantâneo disponível no caso de um problema com a implantação.
ru: {0} из указанных действий развертывания может привести к потере данных. Убедитесь в наличии резервной копии или моментального снимка на случай проблем с развертыванием.
zh_hant: 所列出的 {0} 部署動作可能會導致資料遺失。請確認當部署發生問題時，您有備份或快照集可使用。

# dacFx.dataLossCheckbox
source: Proceed despite possible data loss
de: Vorgang trotz möglicher Datenverluste fortsetzen
es: Continuar a pesar de la posible pérdida de datos
it: Procedi nonostante la possibile perdita di dati
ja: データ損失の可能性にかかわらず続行します
ko: 데이터가 손실되더라도 계속 진행
zh_hant: 儘管可能遺失資料，仍要繼續

# dacfx.noDataLossText
source: No data loss will occur from the listed deploy actions.
de: Die aufgeführten Bereitstellungsaktionen führen zu keinem Datenverlust.
es: Las acciones de implementación enumeradas no darán lugar a la pérdida de datos.
it: Non si verificherà alcuna perdita di dati dalle azioni di distribuzione elencate.
ja: リストされているデプロイ アクションによってデータ損失は生じません。
ko: 나열된 배포 작업에서 데이터 손실이 발생하지 않습니다.
zh_hant: 列出的部署動作不會導致資料遺失。

# dacfx.dataLossText
source: The deploy actions may result in data loss. Please ensure you have a backup or snapshot available in the event of an issue with the deployment.
de: Die Bereitstellungsaktionen können zu einem Datenverlust führen. Stellen Sie sicher, dass eine Sicherung oder eine Momentaufnahme vorhanden ist, falls Probleme mit der Bereitstellung auftreten.
es: Las acciones de implementación pueden dar lugar a la pérdida de datos. Asegúrese de que tiene una copia de seguridad o una instantánea por si hay algún problema con la implementación.
it: Le azioni di distribuzione potrebbero causare la perdita di dati. Assicurarsi di avere a disposizione un backup o uno snapshot in caso di problemi con la distribuzione.
ja: デプロイ操作によってデータが失われる可能性があります。デプロイで生じる問題に備えて、バックアップまたはスナップショットが使用可能であることを確認してください。
ko: 배포 작업으로 인해 데이터가 손실될 수 있습니다. 배포 관련 문제가 발생하는 경우 사용 가능한 백업 또는 스냅샷이 있는지 확인하세요.
pt_br: As ações de implantação podem resultar em perda de dados. Verifique se você tem um backup ou instantâneo disponível no caso de um problema com a implantação.
ru: Действия развертывания могут привести к потере данных. Убедитесь в наличии резервной копии или моментального снимка на случай проблем с развертыванием.
zh_hant: 此部署動作可能會導致資料遺失。請確認當部署發生問題時，您有備份或快照集可使用。

# dacfx.operationColumn
source: Operation
de: Vorgang
es: Operación
it: Operazione
ja: 操作
ko: 작업
zh_hant: 作業

# dacfx.operationTooltip
source: Operation(Create, Alter, Delete) that will occur during deployment
de: Vorgang (Erstellen, Ändern, Löschen), der während der Bereitstellung ausgeführt wird
es: Operación (crear, modificar, eliminar) que tendrá lugar durante la implementación
it: Operazione (Create, Alter, Delete) che verrà eseguita durante la distribuzione
ja: デプロイ中に発生する操作 (作成、変更、削除)
ko: 배포하는 동안 발생하는 작업(만들기, 변경, 삭제)
pt_br: Operação (Criação, Alteração, Exclusão) que ocorrerá durante a implantação
ru: Операция (Create, Alter, Delete), которая будет выполнена во время развертывания
zh_hant: 部署期間將會發生的作業 (建立、改變、刪除)

# dacfx.typeColumn
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
zh_hant: 類型

# dacfx.typeTooltip
source: Type of object that will be affected by deployment
de: Typ des von der Bereitstellung betroffenen Objekts
es: Tipo de objeto que se verá afectado por la implementación
it: Tipo di oggetto che sarà interessato dalla distribuzione
ja: デプロイによって影響を受けるオブジェクトの種類
ko: 배포의 영향을 받는 개체의 유형
pt_br: Tipo de objeto que será afetado pela implantação
ru: Тип объекта, который будет затронут развертыванием
zh_hant: 將受部署影響的物件類型

# dacfx.objectColumn
source: Object
de: Objekt
es: Objeto
it: Oggetto
ja: オブジェクト
ko: 개체
zh_hant: 物件

# dacfx.objecTooltip
source: Name of object that will be affected by deployment
de: Name des von der Bereitstellung betroffenen Objekts
es: Nombre del objeto que se verá afectado por la implementación
it: Nome dell'oggetto che sarà interessato dalla distribuzione
ja: デプロイによって影響を受けるオブジェクトの名前
ko: 배포의 영향을 받는 개체의 이름
pt_br: Nome do objeto que será afetado pela implantação
ru: Имя объекта, который будет затронут развертыванием
zh_hant: 將受部署影響的物件名稱

# dacfx.dataLossColumn
source: Data Loss
de: Datenverlust
es: Pérdida de datos
it: Perdita di dati
ja: データ損失
ko: 데이터 손실
zh_hant: 資料遺失

# dacfx.dataLossTooltip
source: Operations that may result in data loss are marked with a warning sign
de: Vorgänge, die zu Datenverlusten führen können, werden mit einem Warnhinweis gekennzeichnet.
es: Las operaciones que pueden dar lugar a la pérdida de datos se marcan con un signo de advertencia
it: Le operazioni che possono comportare la perdita di dati sono contrassegnate da un simbolo di avviso
ja: データが失われる可能性のある操作には警告サインが表示されます
ko: 데이터 손실이 발생할 수 있는 작업에는 경고 기호가 표시됩니다.
pt_br: Operações que podem resultar em perda de dados são marcadas com um sinal de aviso
ru: Операции, которые могут привести к потере данных, отмечены предупреждающим знаком
zh_hant: 可能造成資料遺失的作業標有警告符號

# dacFx.databaseNameTextBox
source: Database Name
de: Datenbankname
es: Nombre de la base de datos
it: Nome del database
ja: データベース名
ko: 데이터베이스 이름
zh_hant: 資料庫名稱

# dacFx.databaseNameDropdown
source: Database Name
de: Datenbankname
es: Nombre de la base de datos
it: Nome del database
ja: データベース名
ko: 데이터베이스 이름
zh_hant: 資料庫名稱

# dacFxDeploy.openFile
source: Open
de: Öffnen
es: Abrir
it: Apri
ja: 開く
ko: 열기
pt_br: Abrir
ru: Открыть
zh_hant: 開啟

# dacFxDeploy.fileTextboxTitle
source: File Location
de: Dateispeicherort
es: Ubicación de archivos
it: Percorso file
ja: ファイルの場所
ko: 파일 위치
zh_hant: 檔案位置

# dacFx.upgradeRadioButtonLabel
source: Upgrade Existing Database
de: Vorhandene Datenbank aktualisieren
es: Actualizar una base de datos existente
it: Aggiorna database esistente
ja: 既存のデータベースのアップグレード
ko: 기존 데이터베이스 업그레이드
zh_hant: 升級現有的資料庫

# dacFx.newRadioButtonLabel
source: New Database
de: Neue Datenbank
es: Nueva base de datos
it: Nuovo database
ja: 新しいデータベース
ko: 새 데이터베이스
zh_hant: 新增資料庫

# dacFx.targetDatabaseRadioButtonsTitle
source: Target Database
de: Zieldatenbank
es: Base de datos de destino
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
zh_hant: 目標資料庫

# dacFx.targetDatabaseDropdownTitle
source: Database Name
de: Datenbankname
es: Nombre de la base de datos
it: Nome del database
ja: データベース名
ko: 데이터베이스 이름
zh_hant: 資料庫名稱

# dacfx.targetServerName
source: Target Server
de: Zielserver
es: Servidor de destino
it: Server di destinazione
ja: ターゲット サーバー
ko: 대상 서버
zh_hant: 目標伺服器

# dacfx.targetDatabaseName
source: Target Database
de: Zieldatenbank
es: Base de datos de destino
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
zh_hant: 目標資料庫

# dacfx.sourceServerName
source: Source Server
de: Quellserver
es: Servidor de origen
it: Server di origine
ja: ソース サーバー
ko: 원본 서버
zh_hant: 來源伺服器

# dacfx.sourceDatabaseName
source: Source Database
de: Quelldatenbank
es: Base de datos de origen
it: Database di origine
ja: ソース データベース
ko: 원본 데이터베이스
zh_hant: 來源資料庫

# dacfx.fileLocation
source: File Location
de: Dateispeicherort
es: Ubicación de archivos
it: Percorso file
ja: ファイルの場所
ko: 파일 위치
pt_br: Localização do Arquivo
ru: Расположение файла
zh_hant: 檔案位置

# dacfxExtract.version
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
zh_hant: 版本

# dacfx.settingColumn
source: Setting
de: Einstellung
es: Parámetro
it: Impostazione
ja: 設定
ko: 설정
zh_hant: 設定

# dacfx.valueColumn
source: Value
de: Wert
es: Valor
it: Valore
ja: 値
ko: 값
zh_hant: 值

# dacFx.targetServerDropdownTitle
source: Target Server
de: Zielserver
es: Servidor de destino
it: Server di destinazione
ja: ターゲット サーバー
ko: 대상 서버
zh_hant: 目標伺服器

# dacFx.sourceServerDropdownTitle
source: Source Server
de: Quellserver
es: Servidor de origen
it: Server di origine
ja: ソース サーバー
ko: 원본 서버
zh_hant: 來源伺服器

# dacFx.databaseNameTextBox
source: Target Database
de: Zieldatenbank
es: Base de datos de destino
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
zh_hant: 目標資料庫

# dacFx.sourceDatabaseDropdownTitle
source: Source Database
de: Quelldatenbank
es: Base de datos de origen
it: Database di origine
ja: ソース データベース
ko: 원본 데이터베이스
zh_hant: 來源資料庫

# basePage.defaultUser
source: default
de: Standardeinstellung
es: predeterminado
it: predefinito
ja: 既定
ko: 기본값
zh_hant: 預設

# dacFx.selectOperationPageName
source: Select an Operation
de: Vorgang auswählen
es: Seleccione una operación
it: Seleziona un'operazione
ja: 操作を選択します
ko: 작업 선택
pt_br: Selecionar uma Operação
ru: Выберите операцию
zh_hant: 選取作業

# dacFx.deployConfigPageName
source: Select Deploy Dacpac Settings
de: Einstellungen für DACPAC-Bereitstellung auswählen
es: Seleccione la configuración de implementación de Dacpac
it: Seleziona impostazioni per Distribuisci DACPAC
ja: Dacpac のデプロイ設定を選択します
ko: Dacpac 배포 설정 선택
pt_br: Selecione Implantar Configurações do Dacpac
ru: Выберите параметры развертывания DACPAC
zh_hant: 選取部署 Dacpac 設定

# dacFx.deployPlanPage
source: Review the deploy plan
de: Bereitstellungsplan überprüfen
es: Revise el plan de implementación
it: Esamina il piano di distribuzione
ja: デプロイ計画を確認します
ko: 배포 플랜 검토
zh_hant: 檢閱部署計劃

# dacFx.summaryPageName
source: Summary
de: Zusammenfassung
es: Resumen
it: Riepilogo
ja: 概要
ko: 요약
pt_br: Resumo
ru: Сводка
zh_hant: 摘要

# dacFx.extractConfigPageName
source: Select Extract Dacpac Settings
de: Einstellungen für DACPAC-Extraktion auswählen
es: Seleccione la configuración de extracción de Dacpac
it: Seleziona impostazioni per Estrai DACPAC
ja: Dacpac の抽出設定を選択します
ko: Dacpac 추출 설정 선택
pt_br: Selecione Extrair Configurações do Dacpac
ru: Выберите параметры извлечения DACPAC
zh_hant: 選取擷取 Dacpac 設定

# dacFx.importConfigPageName
source: Select Import Bacpac Settings
de: Einstellungen für BACPAC-Import auswählen
es: Seleccione la configuración de importación de Bacpac
it: Seleziona impostazioni per Importa BACPAC
ja: Bacpac のインポート設定を選択します
ko: Bacpac 가져오기 설정 선택
pt_br: Selecione Importar Configurações do Bacpac
ru: Выберите параметры импорта BACPAC
zh_hant: 選取匯入 Bacpac 設定

# dacFx.exportConfigPageName
source: Select Export Bacpac Settings
de: Einstellungen für BACPAC-Export auswählen
es: Seleccione la configuración de exportación de Bacpac
it: Seleziona impostazioni per Esporta BACPAC
ja: Bacpac のエクスポート設定を選択します
ko: Bacpac 내보내기 설정 선택
pt_br: Selecione Exportar Configurações do Bacpac
ru: Выберите параметры экспорта BACPAC
zh_hant: 選取匯出 Bacpac 設定

# dacFx.deployButton
source: Deploy
de: Bereitstellen
es: Implementar
it: Distribuisci
ja: デプロイ
ko: 배포
pt_br: Implantar
ru: Развернуть
zh_hant: 部署

# dacFx.extractButton
source: Extract
de: Extrahieren
es: Extraer
it: Estrai
ja: 抽出
ko: 추출
zh_hant: 擷取

# dacFx.importButton
source: Import
de: Importieren
es: Importar
it: Importa
ja: インポート
ko: 가져오기
zh_hant: 匯入

# dacFx.exportButton
source: Export
de: Exportieren
es: Exportar
it: Esporta
ja: エクスポート
ko: 내보내기
zh_hant: 匯出

# dacFx.generateScriptButton
source: Generate Script
de: Skript generieren
es: Generar script
it: Genera script
ja: スクリプトの生成
ko: 스크립트 생성
pt_br: Gerar Script
ru: Создать сценарий
zh_hant: 產生指令碼

# alertData.deployErrorMessage
source: Deploy failed '{0}'
de: Fehler beim Bereitstellen: "{0}"
es: No se pudo implementar "{0}"
it: Distribuzione non riuscita: '{0}'
ja: デプロイに失敗しました '{0}'
ko: '{0}'을(를) 배포하지 못했습니다.
zh_hant: 部署失敗的 '{0}’

# alertData.extractErrorMessage
source: Extract failed '{0}'
de: Fehler beim Extrahieren: "{0}"
es: No se pudo extraer "{0}"
it: Estrazione non riuscita: '{0}'
ja: 抽出に失敗しました '{0}'
ko: '{0}'을(를) 추출하지 못했습니다.
zh_hant: 擷取失敗的 ‘{0}'

# alertData.exportErrorMessage
source: Export failed '{0}'
de: Fehler beim Exportieren von "{0}"
es: No se pudo exportar "{0}"
it: Esportazione non riuscita: '{0}'
ja: エクスポートに失敗しました '{0}'
ko: '{0}'을(를) 내보내지 못했습니다.
zh_hant: 匯出失敗的 ‘{0}’

# alertData.importErrorMessage
source: Import failed '{0}'
de: Fehler beim Importieren: "{0}"
es: No se pudo importar "{0}"
it: Importazione non riuscita: '{0}'
ja: インポートに失敗しました '{0}'
ko: '{0}'을(를) 가져오지 못했습니다.
zh_hant: 匯入失敗的 ‘{0}'

# dacfx.scriptGeneratingMessage
source: You can view the status of script generation in the Tasks View once the wizard is closed. The generated script will open when complete.
de: Sie können den Status der Skriptgenerierung in der Aufgabenansicht anzeigen, sobald der Assistent geschlossen ist. Das generierte Skript wird nach Abschluss des Vorgangs geöffnet.
es: Puede ver el estado de la generación de scripts en la vista de tareas una vez que se cierra el asistente. El script generado se abrirá cuando se complete.
it: È possibile visualizzare lo stato della generazione dello script nella visualizzazione attività dopo la chiusura della procedura guidata. Lo script generato verrà aperto dopo il completamento.
ja: ウィザードを閉じた後、タスク ビューでスクリプト生成の状態を表示できます。完了すると、生成されたスクリプトが開きます。
ko: 마법사가 닫히면 작업 보기에서 스크립트 생성 상태를 볼 수 있습니다. 완료되면 생성된 스크립트가 열립니다.
pt_br: Você pode exibir o status da geração de script na Exibição de Tarefas depois que o assistente for fechado. O script gerado será aberto quando concluído.
ru: Вы можете просмотреть состояние создания сценариев в представлении задач после закрытия мастера. После завершения созданный сценарий откроется.
zh_hant: 精靈關閉後，您可於工作檢視中檢視指令碼產生的狀態。產生的指令碼將於完成時開啟。

# alertData.deployPlanErrorMessage
source: Generating deploy plan failed '{0}'
de: Fehler beim Generieren des Bereitstellungsplans "{0}".
es: No se pudo generar el plan de implementación, "{0}"
it: La generazione del piano di distribuzione non è riuscita: '{0}'
ja: デプロイ計画の生成に失敗しました '{0}'
ko: 배포 플랜 '{0}'을(를) 생성하지 못했습니다.
zh_hant: 產生部署計劃時 ‘{0}’ 失敗

# dacFx.databaseName
source: Database Name
pt_br: Nome do Banco de Dados
ru: Имя базы данных

# dacFx.deployDescription
source: Deploy a data-tier application .dacpac file to an instance of SQL Server [Deploy Dacpac]
pt_br: Implantar um arquivo .dacpac de aplicativo de camada de dados em uma instância do SQL Server [implantar Dacpac]
ru: Развертывание файла DACPAC приложения уровня данных в экземпляре SQL Server [Развертывание DACPAC]

# dacFx.deployPlanPageName
source: Review the deploy plan
pt_br: Examine o plano de implantação
ru: Обзор плана развертывания

# dacFx.export
source: Export
pt_br: Exportar
ru: Экспортировать

# dacFx.exportDescription
source: Export the schema and data from a database to the logical .bacpac file format [Export Bacpac]
pt_br: Exportar o esquema e os dados de um banco de dados para o formato de arquivo lógico .bacpac [Exportar Bacpac]
ru: Экспорт схемы и данных из базы данных в логический формат файла BACPAC [Экспорт BACPAC]

# dacFx.extract
source: Extract
pt_br: Extrair
ru: Извлечь

# dacFx.extractDescription
source: Extract a data-tier application from an instance of SQL Server to a .dacpac file [Extract Dacpac]
pt_br: Extrair um aplicativo de camada de dados de uma instância do SQL Server para um arquivo .dacpac [Extrair Dacpac]
ru: Извлечение приложения уровня данных из экземпляра SQL Server в файл DACPAC [Извлечение DACPAC]

# dacFx.import
source: Import
pt_br: Importar
ru: Импортировать

# dacFx.importDescription
source: Create a database from a .bacpac file [Import Bacpac]
pt_br: Criar um banco de dados de um arquivo .bacpac [Importar Bacpac]
ru: Создание базы данных из файла BACPAC [Импорт BACPAC]

# dacFx.newDatabase
source: New Database
pt_br: Novo Banco de Dados
ru: Новая база данных

# dacFx.proceedDataLoss
source: Proceed despite possible data loss
pt_br: Prosseguir, apesar da possível perda de dados
ru: Продолжать, несмотря на возможную потерю данных

# dacFx.sourceDatabase
source: Source Database
pt_br: Banco de Dados de Origem
ru: База данных — источник

# dacFx.sourceServer
source: Source Server
pt_br: Servidor de Origem
ru: Исходный сервер

# dacFx.targetDatabase
source: Target Database
pt_br: Banco de Dados de Destino
ru: Целевая база данных

# dacFx.targetServer
source: Target Server
pt_br: Servidor de Destino
ru: Целевой сервер

# dacFx.upgradeExistingDatabase
source: Upgrade Existing Database
pt_br: Atualizar Banco de Dados Existente
ru: Обновление существующей базы данных

# dacFx.versionText
source: Version (use x.x.x.x where x is a number)
pt_br: Versão (use x.x.x.x, em que x é um número)
ru: Версия (используйте формат x.x.x.x, где x — это число)

# dacfx.dataLoss
source: Data Loss
pt_br: Perda de Dados
ru: Потеря данных

# dacfx.databaseNameExistsErrorMessage
source: A database with the same name already exists on the instance of SQL Server
pt_br: Já existe um banco de dados com o mesmo nome na instância do SQL Server.
ru: В этом экземпляре SQL Server уже существует база данных с таким именем.

# dacfx.default
source: default
pt_br: padrão
ru: по умолчанию

# dacfx.deployPlanErrorMessage
source: Generating deploy plan failed '{0}'
pt_br: Falha na geração do plano de implantação '{0}'
ru: Сбой при создании плана развертывания "{0}"

# dacfx.deployPlanTableTitle
source: Deploy plan operations
pt_br: Implantar plano de operações
ru: Операции плана развертывания

# dacfx.filenameEndingInPeriodErrorMessage
source: File name cannot end with a period
pt_br: O nome do arquivo não pode terminar com um ponto
ru: Имя не может заканчиваться точкой

# dacfx.generateDeployErrorMessage
source: Generating deploy script failed '{0}'
pt_br: Falha na geração do script de implantação '{0}'
ru: Сбой при создании сценария развертывания "{0}"

# dacfx.invalidFileCharsErrorMessage
source: Invalid file characters
pt_br: Caracteres de arquivo inválidos
ru: Недопустимые символы файла

# dacfx.noDataLoss
source: No data loss will occur from the listed deploy actions.
pt_br: Nenhuma perda de dados ocorrerá nas ações de implantação listadas.
ru: Указанные действия развертывания не приведут к потере данных.

# dacfx.object
source: Object
pt_br: Objeto
ru: Объект

# dacfx.operation
source: Operation
pt_br: Operação
ru: Операция

# dacfx.operationErrorMessage
source: {0} operation failed '{1}'
pt_br: Falha na operação {0} '{1}'
ru: Сбой операции {0} "{1}"

# dacfx.reservedValueErrorMessage
source: Reserved file name. Choose another name and try again
pt_br: Nome de arquivo reservado. Escolha outro nome e tente novamente
ru: Имя файла уже используется. Выберите другое имя и повторите попытку

# dacfx.reservedWindowsFilenameErrorMessage
source: This file name is reserved for use by Windows. Choose another name and try again
pt_br: Este nome de arquivo está reservado para ser usado pelo Windows. Escolha outro nome e tente novamente.
ru: Это имя файла зарезервировано для использования операционной системой. Выберите другое имя и повторите попытку

# dacfx.save
source: Save
pt_br: Salvar
ru: Сохранить

# dacfx.selectFile
source: Select file
pt_br: Selecionar arquivo
ru: Выберите файл

# dacfx.setting
source: Setting
pt_br: Configuração
ru: Параметр

# dacfx.summaryTableTitle
source: Summary of settings
pt_br: Resumo das configurações
ru: Итоговые настройки

# dacfx.tooLongFilenameErrorMessage
source: File name is over 255 characters
pt_br: O nome do arquivo tem mais de 255 caracteres
ru: Длина имени файла превышает 255 символов

# dacfx.trailingWhitespaceErrorMessage
source: File name cannot end with a whitespace
pt_br: O nome do arquivo não pode terminar com um espaço em branco
ru: Имя не может заканчиваться пробелом

# dacfx.type
source: Type
pt_br: Tipo
ru: Тип
