Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/data-workspace.*.xlf
Languages: pt_br, zh_hant

source: All Project Types
pt_br: Todos os tipos de projeto
zh_hant: 所有專案類型

# SelectProjectFileActionName
source: Select
pt_br: Selecionar
zh_hant: 選取

# UnknownProjectTypeError
source: No provider was found for project type with id: '{0}'
pt_br: Nenhum provedor foi encontrado para o tipo de projeto com ID: '{0}'
zh_hant: 找不到識別碼為 '{0}' 之專案類型的提供者

# UnknownProjectsError
source: No provider was found for the following projects: {0}
pt_br: Nenhum provedor foi encontrado para os seguintes projetos: {0}
zh_hant: 找不到下列專案的提供者: {0}

# activateExtensionFailed
source: Failed to load the project provider extension '{0}'. Error message: {1}
pt_br: Ocorreu um erro ao carregar a extensão do provedor do projeto '{0}'. Mensagem de erro: {1}
zh_hant: 無法載入專案提供者延伸模組 '{0}'。錯誤訊息: {1}

# dataworksapce.local
source: Local
zh_hant: 本機

# dataworksapce.refresh
source: Refresh
pt_br: Atualizar
zh_hant: 重新整理

# dataworkspace.NewProjectDialogTitle
source: Create new project
pt_br: Criar um novo projeto
zh_hant: 建立新專案

# dataworkspace.Type
source: Type
pt_br: Tipo
zh_hant: 類型

# dataworkspace.browse
source: Browse
pt_br: Procurar
zh_hant: 瀏覽

# dataworkspace.browseEllipsis
source: Browse...
pt_br: Procurar...
zh_hant: 瀏覽...

# dataworkspace.cloneParentDirectoryNotExistError
source: The selected clone path '{0}' does not exist or is not a directory.
pt_br: O caminho do clone selecionado '{0}' não existe ou não é um diretório.
zh_hant: 選取的複製路徑 '{0}' 不存在或不是目錄。

# dataworkspace.create
source: Create
pt_br: Criar
zh_hant: 建立

# dataworkspace.enterProjectName
source: Enter Project Name
pt_br: Inserir o nome do projeto
zh_hant: 輸入專案名稱

# dataworkspace.fileNotExistError
source: The selected {0} file '{1}' does not exist or is not a file.
pt_br: O arquivo {0} selecionado '{1}' não existe ou não é um arquivo.
zh_hant: 選取的 {0} 檔案 '{1}' 不存在或不是檔案。

# dataworkspace.gitRepoUrlPlaceholder
source: Enter remote git repository URL
pt_br: Insira a URL do repositório git remoto
zh_hant: 輸入遠端 git 存放庫 URL

# dataworkspace.gitRepoUrlTitle
source: Git repository URL
pt_br: URL do repositório git
zh_hant: Git 存放庫 URL

# dataworkspace.localClonePathPlaceholder
source: Select location to clone repository locally
pt_br: Selecione o local para clonar o repositório localmente
zh_hant: 選取要在本機複製存放庫的位置

# dataworkspace.localClonePathTitle
source: Local clone path
pt_br: Caminho do clone local
zh_hant: 本機複製路徑

# dataworkspace.locationSelectorTitle
source: Location
pt_br: Localização
zh_hant: 位置

# dataworkspace.nameCannotBeEmpty
source: Name cannot be empty
pt_br: O nome não pode estar vazio
zh_hant: 名稱不可為空白

# dataworkspace.ok
source: OK
zh_hant: 確定

# dataworkspace.open
source: Open
pt_br: Abrir
zh_hant: 開啟

# dataworkspace.openExistingDialogTitle
source: Open Existing Project
pt_br: Adicionar o projeto existente
zh_hant: 開啟現有專案

# dataworkspace.project
source: Project
pt_br: Projeto
zh_hant: 專案

# dataworkspace.projectAlreadyOpened
source: Project '{0}' is already opened.
pt_br: O projeto '{0}' já está aberto.
zh_hant: 專案 '{0}' 已經開啟。

# dataworkspace.projectDirectoryAlreadyExistError
source: There is already a directory named '{0}' in the selected location: '{1}'.
pt_br: Já existe um diretório com o nome '{0}' no local selecionado: '{1}'.
zh_hant: 選取的位置中已有名為 '{0}' 的目錄: '{1}'。

# dataworkspace.projectDirectoryAlreadyExistErrorShort
source: Directory '{0}' already exists in the selected location, please choose another
pt_br: O diretório '{0}' já existe no local selecionado; escolha outro
zh_hant: 選取的位置中已有目錄 '{0}'，請選擇另一個

# dataworkspace.projectFilePlaceholder
source: Select project file
pt_br: Selecionar o arquivo do projeto
zh_hant: 選取專案檔

# dataworkspace.projectLocationPlaceholder
source: Select location to create project
pt_br: Selecione o local para criar o projeto
zh_hant: 選取要建立專案的位置

# dataworkspace.projectLocationTitle
source: Location
pt_br: Localização
zh_hant: 位置

# dataworkspace.projectNamePlaceholder
source: Enter project name
pt_br: Inserir o nome do projeto
zh_hant: 輸入專案名稱

# dataworkspace.projectNameTitle
source: Name
pt_br: Nome
zh_hant: 名稱

# dataworkspace.projectParentDirectoryNotExistError
source: The selected project location '{0}' does not exist or is not a directory.
pt_br: O local do projeto selecionado '{0}' não existe ou não é um diretório.
zh_hant: 選取的專案位置 '{0}' 不存在或不是目錄。

# dataworkspace.projectsFailedToLoad
source: Some projects failed to load. To view more details, [open the developer console](command:workbench.action.toggleDevTools)
pt_br: Ocorreu um erro ao carregar alguns projetos. Para exibir mais detalhes, [abra o console do desenvolvedor](command:workbench.action.toggleDevTools)
zh_hant: 無法載入部分專案。若要檢視更多詳細資料，請[開啟開發人員主控台](command:workbench.action.toggleDevTools)

# dataworkspace.remoteGitRepo
source: Remote git repository
pt_br: Repositório git remoto
zh_hant: 遠端 Git 存放庫

# dataworkspace.restartConfirmation
source: Azure Data Studio needs to be restarted for the project to be created and added to the workspace, do this now?
pt_br: O Azure Data Studio precisa ser reiniciado para que o projeto seja criado e adicionado ao espaço de trabalho, fazer isso agora?
zh_hant: 必須將 Azure Data Studio 重新開機，才能建立專案並將其新增至工作區，立即執行此動作嗎?

# dataworkspace.select
source: Select
pt_br: Selecionar
zh_hant: 選取

# dataworkspace.selectProjectLocation
source: Select Project Location
pt_br: Selecionar o local do projeto
zh_hant: 選取專案位置

# dataworkspace.selectProjectType
source: Select Project Type
pt_br: Selecionar o tipo de projeto
zh_hant: 選取專案類型

# dataworkspace.targetPlatform
source: Target Platform
pt_br: Plataforma de Destino
zh_hant: 目標平台

# dataworkspace.workspacePlaceholder
source: Select workspace ({0}) file
pt_br: Selecionar o arquivo da ({0}) espaço de trabalho
zh_hant: 選取工作區 ({0}) 檔案

# fileDoesNotExist
source: File '{0}' doesn't exist
pt_br: O arquivo '{0}' não existe
zh_hant: 檔案 '{0}' 不存在

# gitCloneError
source: Error during git clone. View git output for more details
pt_br: Ocorreu um erro durante a clonagem do git. Exibir a saída do git para obter mais detalhes
zh_hant: Git 複製期間發生錯誤。如需更多詳細資料，請檢視 git 輸出

# gitCloneMessage
source: Cloning git repository '{0}'...
pt_br: Clonando o repositório git '{0}'...
zh_hant: 正在複製 Git 儲存庫 '{0}'...

# noPreviousData
source: Prior {0} for the current project will appear here, please run to see the results.
pt_br: Antes {0} para o projeto atual será exibido aqui, execute para visualizar os resultados.
zh_hant: 目前專案的先前 {0} 會顯示在這裡，請執行以查看結果。

# openedProjectsUndefinedAfterRefresh
source: List of opened projects should not be undefined after refresh from disk.
pt_br: A lista de projetos abertos não deve estar indefinida após a atualização do disco.
zh_hant: 從磁片重新整理之後，不應該取消定義已開啟專案的清單。

# projectNameNull
source: Project name is null
pt_br: O nome do projeto é nulo
zh_hant: 專案名稱為 Null

# close-workspace-command
source: Close Workspace
pt_br: Fechar espaço de trabalho
zh_hant: 關閉工作區

# data-workspace-view-container-name
source: Projects
pt_br: Projetos
zh_hant: 專案

# extension-description
source: Data workspace
pt_br: Espaço de trabalho de dados
zh_hant: 資料工作區

# extension-displayName
source: Data workspace
pt_br: Espaço de trabalho de dados
zh_hant: 資料工作區

# main-view-name
source: Projects
pt_br: Projetos
zh_hant: 專案

# manage-project-command
source: Manage
pt_br: Gerenciar
zh_hant: 管理

# new-command
source: New
pt_br: Novo
zh_hant: 新增

# open-existing-command
source: Open existing
pt_br: Abrir existente
zh_hant: 開啟現有項目

# projects-view-no-project-content
source: No projects open in current workspace. [Create new](command:projects.new) [Open existing](command:projects.openExisting) To learn more about projects [read our docs](https://aka.ms/azuredatastudio-projects).
pt_br: Não há projetos abertos no espaço de trabalho atual. [Criar novo](command:projects.new) [Abrir existente](command:projects.openExisting) Para saber mais sobre projetos [leia nossos documentos](https://aka.ms/azuredatastudio-projects).
zh_hant: 目前工作區未開啟任何專案。 [建立新的] (command:projects.new) [開啟現有的](command:projects.openExisting) 若要深入了解專案，請[閱讀我們的文件](https://aka.ms/azuredatastudio-projects)。

# projects-view-no-workspace-content
source: Create new or open existing to get started. [Create new](command:projects.new) [Open existing](command:projects.openExisting) To learn more about projects [read our docs](https://aka.ms/azuredatastudio-projects).
pt_br: Crie novos ou abra existentes para começar. [Criar novo](command:projects.new) [Abrir existente](command:projects.openExisting) Para saber mais sobre projetos [leia nossos documentos](https://aka.ms/azuredatastudio-projects).
zh_hant: 建立新的或開啟現有的以開始使用。 [建立新的] (command:projects.new) [開啟現有的](command:projects.openExisting) 若要深入了解專案，請[閱讀我們的文件](https://aka.ms/azuredatastudio-projects)。

# projects.defaultProjectSaveLocation
source: Full path to folder where new projects are saved by default.
pt_br: Caminho completo para a pasta em que novos projetos são salvos por padrão.
zh_hant: 預設儲存新專案之資料夾的完整路徑。

# projects.showNotAddedProjectsInWorkspacePrompt
source: Always show information message when the current workspace folders contain projects that have not been added to the workspace's projects.
pt_br: Sempre mostre a mensagem de informações quando as pastas do espaço de trabalho atuais contiverem projetos que não foram adicionados aos projetos do espaço de trabalho.
zh_hant: 當目前的工作區資料夾包含尚未新增到工作區專案的專案時，永遠顯示資訊訊息。

# refresh-workspace-command
source: Refresh
pt_br: Atualizar
zh_hant: 重新整理

# remove-project-command
source: Remove Project
pt_br: Remover projeto
zh_hant: 移除專案
