Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/git.*.xlf
Languages: es, fr, ko, ru, zh_hans

# not supported
source: Absolute paths not supported in 'git.scanRepositories' setting.
es: Rutas absolutas no admitidas en la configuración de \"git.scanRepositories\".
fr: Chemins d’accès absolus non supportés dans le paramètre 'git.scanRepositories'.
ko: 'git.scanRepositories' 설정에서는 절대 경로를 사용할 수 없습니다.
ru: Абсолютные пути в параметре \"git.scanRepositories\" не поддерживаются.
zh_hans: “git.scanRepositories” 设置不支持绝对路径。

# pick repo
source: Choose a repository
es: Elija un repositorio
fr: Choisir un dépôt
ko: 리포지토리 선택
ru: Выберите репозиторий
zh_hans: 选择存储库

# repoOnHomeDriveRootWarning
source: Unable to automatically open the git repository at '{0}'. To open that git repository, open it directly as a folder in VS Code.
es: No se puede abrir automáticamente el repositorio git en '{0}'. Para abrir ese repositorio git, ábralo directamente como carpeta en VS Code.
ko: '{0}'에서 Git 리포지토리를 자동으로 열 수 없습니다. 해당 Git 리포지토리를 열려면 VS Code 폴더로 직접 여세요.
ru: Невозможно автоматически открыть репозиторий git по адресу "{0}". Откройте его напрямую как папку в VS Code.

# too many submodules
source: The '{0}' repository has {1} submodules which won't be opened automatically. You can still open each one individually by opening a file within.
es: El repositorio ' {0} ' tiene {1} submódulos que no se abrirán automáticamente. Usted todavía puede abrir cada archivo individualmente.
fr: Le dépôt '{0}' a {1} sous-modules qui ne vont pas être ouverts automatiquement. Vous pouvez ouvrir chacun individuellement en ouvrant un fichier à l'intérieur.
ko: '{0}' 리포지토리에 자동으로 열리지 않는 {1}개의 하위 모듈이 있습니다. 모듈 내의 파일을 열러 각 모듈을 개별적으로 열 수는 있습니다.
ru: В репозитории '{0}' есть подмодули ({1}), которые не будут открыты автоматически. Вы можете открыть каждый подмодуль вручную, открыв соответствующий файл.
zh_hans: “{0}”存储库中的 {1} 个子模块将不会自动打开。您仍可以通过打开其中的文件来单独打开每个子模块。

# add known
source: Would you like to add '{0}' to .gitignore?
es: ¿Desea agregar \"{0}\" a .gitignore?
fr: Voulez-vous ajouter '{0}' à .gitignore ?
ko: '{0}'을(를) .gitignore에 추가하시겠어요?
ru: Вы хотите добавить \"{0}\" в GITIGNORE-файл?
zh_hans: 是否要将“{0}”添加到 .gitignore?

# added by them
source: Conflict: Added By Them
es: Conflicto: agregado por ellos
fr: Conflit : ajout de leur part
ko: 충돌: 타인이 추가
ru: Конфликт: добавлено ими
zh_hans: 冲突: 已由他们添加

# added by us
source: Conflict: Added By Us
es: Conflicto: agregado por nosotros
fr: Conflit : ajout de notre part
ko: 충돌: 자체 추가
ru: Конфликт: добавлено нами
zh_hans: 冲突: 已由我们添加

source: Always Pull
es: Extraer siempre
fr: Toujours tirer (pull)
ko: 항상 풀
ru: Всегда получать
zh_hans: 始终拉取

# both added
source: Conflict: Both Added
es: Conflicto: agregado por ambos
fr: Conflit : ajout de leur part et de notre part
ko: 충돌: 양쪽에서 추가
ru: Конфликт: оба добавили
zh_hans: 冲突: 两个都已添加

# both deleted
source: Conflict: Both Deleted
es: Conflicto: eliminado por ambos
fr: Conflit : suppression de leur part et de notre part
ko: 충돌: 양쪽에서 삭제
ru: Конфликт: оба удалили
zh_hans: 冲突: 两个都已删除

# both modified
source: Conflict: Both Modified
es: Conflicto: modificado por ambos
fr: Conflit : modification de leur part et de notre part
ko: 충돌: 양쪽에서 수정
ru: Конфликт: оба изменили
zh_hans: 冲突: 两个都已修改

source: Changes
es: Cambios
fr: Changements
ko: 변경 사항
ru: Изменения
zh_hans: 更改

source: Commit
es: Confirmar
fr: Commiter
ko: 커밋
ru: Зафиксировать
zh_hans: 提交

# commit in rebase
source: It's not possible to change the commit message in the middle of a rebase. Please complete the rebase operation and use interactive rebase instead.
es: No es posible cambiar el mensaje de confirmación en medio de un rebase. En su lugar, complete la operación rebase y utilice rebase interactivo.
fr: Il n’est pas possible de changer le message de validation au milieu d’un rebasage. Terminez l'opération de rebasage et utilisez le rebasage interactif à la place.
ko: 기준 주소를 다시 지정하는 중에는 커밋 메시지를 변경할 수 없습니다. 기준 주소 다시 지정 작업을 완료하고, 대신 대화형 기준 주소 다시 지정을 사용하세요.
ru: Невозможно изменить сообщение коммита во время перебазирования. Завершите операцию перебазирования и используйте взамен интерактивное перебазирование.
zh_hans: 无法在变基过程中修改提交消息。请完成变基操作，并改用交互式变基。

# commitMessage
source: Message ({0} to commit)
es: Mensaje ({0} para confirmar)
fr: Message ({0} à valider)
ko: 메시지(커밋할 {0})
ru: Сообщение ({0} для фиксации)
zh_hans: 消息({0} 待提交)

# commitMessageCountdown
source: {0} characters left in current line
es: quedan {0} caracteres en la línea actual
fr: {0} caractères restants sur la ligne actuelle
ko: 현재 줄에서 {0} 글자 남음
ru: В текущей строке остается {0} симв.
zh_hans: 当前行剩余 {0} 个字符

# commitMessageWarning
source: {0} characters over {1} in current line
es: {0} caracteres sobre {1} en la línea actual
fr: {0} caractères sur {1} sur la ligne actuelle
ko: 현재 줄에서 {0} 글자 초과 {1}
ru: На {0} симв. превышен предел {1} в текущей строке
zh_hans: 当前行比 {1} 超出 {0} 个字符

# commitMessageWhitespacesOnlyWarning
source: Current commit message only contains whitespace characters
es: El mensaje de confirmación actual solo contiene espacios en blanco.
fr: Le message de validation actuel contient uniquement des espaces
ko: 현재 커밋 메시지에는 공백 문자만 포함됩니다.
ru: Текущее сообщение коммита содержит только пробелы.
zh_hans: 当前提交消息仅包含空白字符

# commitMessageWithHeadLabel
source: Message ({0} to commit on '{1}')
es: Mensaje ({0} para confirmar en \"{1}\")
fr: Message ({0} à valider sur '{1}')
ko: 메시지('{1}'에서 커밋할 {0})
ru: Сообщение ({0} для фиксации в \"{1}\")
zh_hans: 消息({0} 在“{1}”提交)

source: Deleted
es: Eliminado
fr: Supprimé
ko: 삭제
ru: Удалить
zh_hans: 已删除

# deleted by them
source: Conflict: Deleted By Them
es: Conflicto: eliminado por ellos
fr: Conflit : suppression de leur part
ko: 충돌: 타인이 삭제
ru: Конфликт: удалено ими
zh_hans: 冲突: 已由他们删除

# deleted by us
source: Conflict: Deleted By Us
es: Conflicto: eliminado por nosotros
fr: Conflit : suppression de notre part
ko: 충돌: 자체 삭제
ru: Конфликт: удалено нами
zh_hans: 冲突: 已由我们删除

source: Don't Pull
es: No extraer
fr: Ne pas tirer (pull)
ko: 풀 안 함
ru: Не получать
zh_hans: 不拉取

# git.title.deleted
source: {0} (Deleted)
es: {0} (eliminado)
fr: {0} (supprimé)
ko: {0}(삭제됨)
ru: {0} (удалено)
zh_hans: {0} (已删除)

# git.title.ours
source: {0} (Ours)
es: {0} (Nuestro)
fr: {0} (à nous)
ko: {0}(우리의 변경 내용)
ru: {0} (наш)
zh_hans: {0} (我们的)

# git.title.theirs
source: {0} (Theirs)
es: {0} (el suyo)
fr: {0} (à eux)
ko: {0}(다른 사용자의 변경 내용)
ru: {0} (их)
zh_hans: {0} (他们的)

# git.title.untracked
source: {0} (Untracked)
es: {0} (Sin seguimiento)
fr: {0} (non suivi)
ko: {0}(추적되지 않음)
ru: {0} (не отслеживается)
zh_hans: {0} (未跟踪)

# huge
source: The git repository at '{0}' has too many active changes, only a subset of Git features will be enabled.
es: El repositorio Git '{0}' contiene muchos cambios activos, solamente un subconjunto de las características de Git serán habilitadas.
fr: Le dépôt Git dans '{0}' a trop de modifications actives, seul un sous-ensemble de fonctionnalités Git sera activé.
ko: '{0}'의 Git 리포지토리에 활성 변경 내용이 너무 많습니다. Git 기능의 하위 집합만 사용할 수 있도록 설정됩니다.
ru: Репозиторий git в '{0}' имеет очень много активных изменений, только часть функций Git будет доступна.
zh_hans: Git 存储库“{0}”中存在大量活动更改，将仅启用部分 Git 功能。

source: Ignored
es: Omitido
fr: Ignoré
ko: 무시됨
ru: Проигнорировано
zh_hans: 已忽略

source: Index Added
es: Índice añadido
fr: Index ajouté
ko: 인덱스 추가됨
ru: Добавлено в индексе
zh_hans: 已添加索引

source: Index Copied
es: Índice copiado
fr: Index copié
ko: 인덱스 복사됨
ru: Скопировано в индексе
zh_hans: 已复制索引

source: Index Deleted
es: Índice Eliminado
fr: Index supprimé
ko: 인덱스 삭제됨
ru: Удалено в индексе
zh_hans: 已删除索引

source: Index Modified
es: Índice modificado
fr: Index modifié
ko: 인덱스 수정됨
ru: Изменено в индексе
zh_hans: 已修改索引

source: Index Renamed
es: Nombre de Índice Cambiado
fr: Index renommé
ko: 인덱스 이름 변경됨
ru: Переименовано в индексе
zh_hans: 已重命名索引

source: Intent to Add
es: Intención de añadir
fr: Intention à ajouter
ko: 추가할 의도
ru: Добавляемое намерение
zh_hans: 打算添加

source: Merge Changes
es: Fusionar cambios mediante combinación
fr: Fusionner les changements
ko: 변경 사항 병합
ru: Изменения слияния
zh_hans: 合并更改

source: Modified
es: Modificado
fr: Modifié le
ko: 수정
ru: Изменен
zh_hans: 已修改

# neveragain
source: Don't Show Again
es: No mostrar de nuevo
fr: Ne plus afficher
ko: 다시 표시 안 함
ru: Больше не показывать
zh_hans: 不再显示

source: Open
es: Abrir
fr: Ouvrir
ko: 열기
ru: Открыто
zh_hans: 打开

source: Open Merge
ko: 병합 열기
ru: Открыть слияние

source: Pull
es: Extraer
fr: Tirer (pull)
ko: 풀
ru: Получать
zh_hans: 拉取

# pull branch maybe rebased
source: It looks like the current branch '{0}' might have been rebased. Are you sure you still want to pull into it?
es: Parece que la rama actual \"{0}\" podría haber sido reorganizada. ¿Está seguro de que todavía desea extraerla?
fr: Il semble que la branche actuelle '{0}' ait été rebasée. Voulez-vous vraiment effectuer un tirage (pull) dans celle-ci ?
ko: 현재 분기 '{0}'이(가) 다시 지정된 것 같습니다. 해당 분기로 풀하시겠습니까?
ru: Похоже, изменения из текущей ветви \"{0}\" перемещены в другую. Все равно выполнить в нее вытягивание?
zh_hans: 当前分支“{0}”似乎已变基。确定仍要拉取到其中吗?

# pull maybe rebased
source: It looks like the current branch might have been rebased. Are you sure you still want to pull into it?
es: Parece que la rama actual puede haber sido reorganizada. ¿Estás seguro de que todavía desea extraerla?
fr: Il semble que la branche actuelle ait été rebasée. Voulez-vous vraiment effectuer un tirage (pull) dans celle-ci ?
ko: 현재 분기가 다시 지정된 것 같습니다. 해당 분기로 풀하시겠습니까?
ru: Похоже, изменения из текущей ветви перемещены в другую. Все равно выполнить в нее вытягивание?
zh_hans: 当前分支似乎已变基。确定仍要拉取到其中吗?

# pull n
source: Pull {0} commits from {1}/{2}
es: Extraer {0} las confirmaciones de {1}/{2}
fr: Tirer (pull) {0} commits de {1}/{2}
ko: {1}/{2}에서 {0}개 커밋 풀
ru: Вытягивание фиксаций ({0}) из {1}/{2}
zh_hans: 从 {1}/{2} 拉取 {0} 个提交

# pull push n
source: Pull {0} and push {1} commits between {2}/{3}
es: Extraer {0} e insertar {1} confirmaciones entre {2}/{3}
fr: Tirer (pull) {0} et envoyer (push) {1} commits entre {2}/{3}
ko: {2}/{3} 간에 {0}개 커밋 풀 및 {1}개 커밋 푸시
ru: Вытягивание ({0}) и отправка ({1}) фиксаций между {2}/{3}
zh_hans: 在 {2}/{3} 之间拉取 {0} 个提交并推送 {1} 个提交

# push n
source: Push {0} commits to {1}/{2}
es: Insertar las confirmaciones {0} en {1}/{2}
fr: Envoyer (push) {0} commits à {1}/{2}
ko: {1}/{2}(으)로 {0}개 커밋 푸시
ru: Отправка фиксаций ({0}) в {1}/{2}
zh_hans: 将 {0} 个提交推送到 {1}/{2}

# push success
source: Successfully pushed.
es: Push realizado con éxito.
fr: Envoi (push) réussi.
ko: 성공적으로 푸시 되었습니다.
ru: Отправка выполнена успешно.
zh_hans: 已成功推送。

source: Staged Changes
es: Cambios preparados
fr: Changements indexés
ko: 스테이징된 변경 사항
ru: Промежуточные изменения
zh_hans: 暂存的更改

# sync changes
source: Synchronize Changes
es: Sincronizar cambios
fr: Synchroniser les changements
ko: 변경 내용 동기화
ru: Синхронизация изменений
zh_hans: 同步更改

# sync is unpredictable
source: Syncing. Cancelling may cause serious damages to the repository
es: Sincronizando. La cancelación puede provocar daños graves en el repositorio.
fr: Synchronisation. L'annulation peut endommager gravement le dépôt
ko: 동기화 중입니다. 취소하면 리포지토리가 손상될 수 있습니다.
ru: Выполняется синхронизация. Отмена может привести к серьезному повреждению репозитория
zh_hans: 正在同步。取消可能会导致存储库出现严重损坏

# tooManyChangesWarning
source: Too many changes were detected. Only the first {0} changes will be shown below.
es: Se detectaron demasiados cambios. A continuación solo se mostrarán los primeros {0} cambios.
fr: Trop de modifications ont été détectées. Seules les premières modifications {0} s’affichent ci-dessous.
ko: 너무 많은 변경 내용이 감지되었습니다. 첫 번째 {0} 변경 내용만 아래에 표시됩니다.
ru: Обнаружено слишком много изменений. Ниже будут отображаться только первые изменения {0}.
zh_hans: 检测到过多更改。下面将仅显示第一个 {0} 更改。

source: Untracked
es: Sin seguimiento
fr: Non suivi
ko: 추적되지 않음
ru: Не отслеживается
zh_hans: 未跟踪的

source: Untracked Changes
es: Cambios sin seguimiento
fr: Changements non suivis
ko: 추적되지 않은 변경 사항
ru: Неотслеживаемые изменения
zh_hans: 未跟踪的更改

# checkout
source: Checkout branch/tag...
es: Extraer del repositorio una rama o etiqueta...
fr: Extraire la branche/l'étiquette...
ko: 분기/태그 체크 아웃...
ru: Извлечение ветви/тега...
zh_hans: 签出分支/标记...

source: Publish Branch
es: Publicar rama
ko: 분기 게시
ru: Опубликовать ветвь

source: Publish to...
es: Publicar en...
fr: Publier sur...
ko: 다음에 게시...
ru: Опубликовать в…
zh_hans: 发布到...

source: Rebasing
es: Creando una nueva base
fr: Rebase en cours
ko: 기준 주소 다시 지정
ru: Перебазирование
zh_hans: 正在变基

# git.timeline.email
source: Email
es: Correo electrónico
ko: 전자 메일
ru: Электронная почта

# git.timeline.openComparison
source: Open Comparison
es: Abrir comparación
ko: 비교 열기
ru: Открыть сравнение

# git.timeline.source
source: Git History
es: Historia de Git
fr: Historique git
ko: Git 기록
ru: Журнал Git
zh_hans: Git 历史记录

# git.timeline.stagedChanges
source: Staged Changes
es: Cambios almacenados provisionalmente
fr: Modifications en zone de transit
ko: 스테이징된 변경 내용
ru: Промежуточно сохраненные изменения
zh_hans: 暂存的更改

# git.timeline.uncommitedChanges
source: Uncommitted Changes
es: Cambios pendientes de confirmación
fr: Changements non commités
ko: 커밋되지 않은 변경 내용
ru: Незафиксированные изменения
zh_hans: 未提交的更改

# git.timeline.you
source: You
es: Usted
fr: Vous
ko: 사용자
ru: Вы
zh_hans: 你

# colors.added
source: Color for added resources.
es: Color de los recursos agregados.
fr: Couleur des ressources ajoutées.
ko: 추가된 리소스의 색입니다.
ru: Цвет для добавленных ресурсов.
zh_hans: 已添加资源的颜色。

# colors.conflict
source: Color for resources with conflicts.
es: Color para los recursos con conflictos.
fr: Couleur pour les ressources avec des conflits.
ko: 충돌이 발생한 리소스의 색상입니다.
ru: Цвет ресурсов с конфликтами.
zh_hans: 存在冲突的资源的颜色。

# colors.deleted
source: Color for deleted resources.
es: Color para los recursos eliminados.
fr: Couleur des ressources supprimées.
ko: 삭제된 리소스의 색상입니다.
ru: Цвет удаленных ресурсов.
zh_hans: 已删除资源的颜色。

# colors.ignored
source: Color for ignored resources.
es: Color para los recursos ignorados.
fr: Couleur des ressources ignorées.
ko: 무시된 리소스의 색상입니다.
ru: Цвет игнорируемых ресурсов.
zh_hans: 已忽略资源的颜色。

# colors.modified
source: Color for modified resources.
es: Color para recursos modificados.
fr: Couleur pour les ressources modifiées.
ko: 수정된 리소스의 색상입니다.
ru: Цвет измененных ресурсов.
zh_hans: 已修改资源的颜色。

# colors.renamed
source: Color for renamed or copied resources.
es: Color para los recursos que se han cambiado de nombre o se han copiado.
fr: Couleur des ressources renommées ou copiées.
ko: 이름이 바뀌었거나 복사된 리소스의 색입니다.
ru: Цвет для переименованных или скопированных ресурсов.
zh_hans: 重命名或复制的资源的颜色。

# colors.stageDeleted
source: Color for deleted resources which have been staged.
es: Color de los recursos eliminados que se han almacenado provisionalmente.
fr: Couleur des ressources supprimées qui ont été indexées.
ko: 스테이징되어 있는 삭제된 리소스의 색입니다.
ru: Цвет для удаленных ресурсов, которые были помещены на промежуточное хранение.
zh_hans: 已暂存的已删除资源的颜色。

# colors.stageModified
source: Color for modified resources which have been staged.
es: Color de los recursos modificados que se han almacenado provisionalmente.
fr: Couleur des ressources modifiées qui ont été indexées.
ko: 스테이징되어 있는 수정된 리소스의 색입니다.
ru: Цвет для измененных ресурсов, которые были помещены на промежуточное хранение.
zh_hans: 已暂存的已修改资源的颜色。

# colors.submodule
source: Color for submodule resources.
es: Color para los recursos de submódulos.
fr: Couleur pour les ressources de sous-module.
ko: 서브모듈 자원의 색상
ru: Цвет ресурсов подмодуля.
zh_hans: 子模块资源的颜色。

# colors.untracked
source: Color for untracked resources.
es: Color para los recursos a los que no se les hace seguimiento.
fr: Couleur pour les ressources non tracées.
ko: 추적되지 않은 리소스의 색상입니다.
ru: Цвет неотслеживаемых ресурсов.
zh_hans: 未跟踪资源的颜色。

# command.addRemote
source: Add Remote...
es: Agregar remoto...
fr: Ajouter un dépôt distant...
ko: 원격 추가...
ru: Добавить удаленный репозиторий...
zh_hans: 添加远程存储库…

# command.api.getRemoteSources
source: Get Remote Sources
es: Obtener orígenes remotos
ko: 원격 원본 가져오기
ru: Получить удаленные источники

# command.api.getRepositories
source: Get Repositories
es: Obtener repositorios
ko: Git 리포지토리
ru: Получить репозитории

# command.api.getRepositoryState
source: Get Repository State
es: Obtener estado del repositorio
ko: 리포지토리 상태 가져오기
ru: Получить состояние репозитория

# command.branch
source: Create Branch...
es: Crear rama...
fr: Créer une branche...
ko: 분기 만들기...
ru: Создать ветвь...
zh_hans: 创建分支...

# command.branchFrom
source: Create Branch From...
es: Crear rama desde...
fr: Créer une branche à partir de...
ko: 분기를 만듭니다...
ru: Создать ветвь из...
zh_hans: 从现有来源创建新的分支...

# command.checkout
source: Checkout to...
es: Desproteger en...
fr: Extraire vers...
ko: 다음으로 체크 아웃...
ru: Извлечь в...
zh_hans: 签出到...

# command.checkoutDetached
source: Checkout to (Detached)...
es: Extraer del repositorio en (desasociado)...
fr: Extraire vers (mode détaché)...
ko: 체크 아웃(분리됨)...
ru: Извлечь в (отключено)...
zh_hans: 签出到(已分离)…

# command.cherryPick
source: Cherry Pick...
es: Selección exclusiva...
fr: Faire un cherry-pick...
ru: Выборочный отбор...
zh_hans: 挑拣…

# command.clean
source: Discard Changes
es: Descartar cambios
fr: Ignorer les modifications
ko: 변경 내용 취소
ru: Отменить изменения
zh_hans: 放弃更改

# command.cleanAll
source: Discard All Changes
es: Descartar todos los cambios
fr: Ignorer toutes les modifications
ko: 모든 변경 내용 취소
ru: Отменить все изменения
zh_hans: 放弃所有更改

# command.cleanAllTracked
source: Discard All Tracked Changes
es: Descartar todos los cambios a los que se les realiza seguimiento
fr: Ignorer tous les changements suivis
ko: 추적된 모든 변경 내용 취소
ru: Удалить все отслеживаемые изменения
zh_hans: 放弃所有跟踪的更改

# command.cleanAllUntracked
source: Discard All Untracked Changes
es: Descartar todos los cambios a los que no se está haciendo seguimiento
fr: Ignorer tous les changements non suivis
ko: 추적되지 않은 모든 변경 내용 취소
ru: Удалить все неотслеживаемые изменения
zh_hans: 放弃所有未跟踪的更改

# command.clone
source: Clone
es: Clonar
fr: Cloner
ko: 복제
ru: Клонировать
zh_hans: 克隆

# command.cloneRecursive
source: Clone (Recursive)
es: Clonar (recursivo)
fr: Cloner (récursif)
ko: 복제(재귀)
ru: Клонировать (рекурсивно)
zh_hans: 克隆(递归)

# command.close
source: Close Repository
es: Cerrar repositorio
fr: Fermer le dépôt
ko: 리포지토리 닫기
ru: Закрыть репозиторий
zh_hans: 关闭存储库

# command.closeAllDiffEditors
source: Close All Diff Editors
es: Cerrar todos los editores de diferencias
ko: 모든 diff 편집기 닫기
ru: Закрыть все редакторы несовпадений

# command.commit
source: Commit
es: Confirmar
fr: Activer
ko: 커밋
ru: Фиксация
zh_hans: 提交

# command.commitAll
source: Commit All
es: Confirmar todo
fr: Valider tout
ko: 모두 커밋
ru: Зафиксировать все
zh_hans: 全部提交

# command.commitAllAmend
source: Commit All (Amend)
es: Confirmar todo (modificar)
fr: Tout Valider (Modifier)
ko: 모두 커밋 (수정)
ru: Зафиксировать все (изменение)
zh_hans: 全部提交(修改)

# command.commitAllAmendNoVerify
source: Commit All (Amend, No Verify)
es: Confirmar todo (modificar, no comprobar)
fr: Tout commiter (modifier, aucune vérification)
ko: 모두 커밋(수정, 확인 안 함)
ru: Зафиксировать все (исправить, без проверки)
zh_hans: 全部提交(修正，不验证)

# command.commitAllNoVerify
source: Commit All (No Verify)
es: Confirmar todo (no comprobar)
fr: Tout commiter (aucune vérification)
ko: 모두 커밋(확인 안 함)
ru: Зафиксировать все (без проверки)
zh_hans: 全部提交(不验证)

# command.commitAllSigned
source: Commit All (Signed Off)
es: Confirmar todo (aprobado)
fr: Valider tout (signé)
ko: 모두 커밋(로그오프됨)
ru: Зафиксировать все (завершено)
zh_hans: 全部提交(已署名)

# command.commitAllSignedNoVerify
source: Commit All (Signed Off, No Verify)
es: Confirmar todo (aprobado, no comprobar)
fr: Tout commiter (signé, aucune vérification)
ko: 모두 커밋(로그오프됨, 확인 안 함)
ru: Зафиксировать все (завершено, без проверки)
zh_hans: 全部提交(已签收，不验证)

# command.commitEmpty
source: Commit Empty
es: Confirmar vacío
fr: Commit vide
ko: 빈 내용을 커밋합니다.
ru: Отправить пустую фиксацию
zh_hans: 创建空提交

# command.commitEmptyNoVerify
source: Commit Empty (No Verify)
es: Confirmar vacíos (no comprobar)
fr: Commiter le contenu vide (aucune vérification)
ko: 빈 상태로 커밋(확인 안 함)
ru: Зафиксировать пустые (без проверки)
zh_hans: 空提交(不验证)

# command.commitMessageAccept
source: Accept Commit Message
ko: 커밋 메시지 수락
ru: Принять сообщение о фиксации

# command.commitMessageDiscard
source: Discard Commit Message
ko: 커밋 메시지 삭제
ru: Отменить сообщение о фиксации

# command.commitNoVerify
source: Commit (No Verify)
es: Confirmar (no comprobar)
fr: Commiter (aucune vérification)
ko: 커밋(확인 안 함)
ru: Зафиксировать (без проверки)
zh_hans: 提交(不验证)

# command.commitStaged
source: Commit Staged
es: Confirmar elementos almacenados provisionalmente
fr: Valider le contenu en zone de transit
ko: 스테이징된 항목 커밋
ru: Зафиксировать промежуточно сохраненные изменения
zh_hans: 提交已暂存文件

# command.commitStagedAmend
source: Commit Staged (Amend)
es: Confirmar almacenados provisionalmente (modificar)
fr: Valider les modifications en attente (modifier)
ko: 스테이징된 항목 커밋(수정)
ru: Зафиксировать промежуточные (изменение)
zh_hans: 提交已暂存文件(修改)

# command.commitStagedAmendNoVerify
source: Commit Staged (Amend, No Verify)
es: Confirmar almacenados provisionalmente (modificar, no comprobar)
fr: Commiter l'index (modifier, aucune vérification)
ko: 커밋 스테이징됨(수정, 확인 안 함)
ru: Зафиксировать промежуточные (исправить, без проверки)
zh_hans: 提交已暂存内容(修正，不验证)

# command.commitStagedNoVerify
source: Commit Staged (No Verify)
es: Confirmar almacenados provisionalmente (no comprobar)
fr: Commiter l'index (aucune vérification)
ko: 커밋 스테이징됨(확인 안 함)
ru: Зафиксировать промежуточные (без проверки)
zh_hans: 提交已暂存内容(不验证)

# command.commitStagedSigned
source: Commit Staged (Signed Off)
es: Confirmar por etapas (Aprobado)
fr: Valider les modifications en attente (signé)
ko: 스테이징된 항목 커밋(로그오프됨)
ru: Зафиксировать промежуточные элементы (завершено)
zh_hans: 提交已暂存文件(已署名)

# command.commitStagedSignedNoVerify
source: Commit Staged (Signed Off, No Verify)
es: Confirmar almacenados provisionalmente (aprobado, no comprobar)
fr: Commiter l'index (signé, aucune vérification)
ko: 커밋 스테이징됨(로그오프됨, 확인 안 함)
ru: Зафиксировать промежуточные (завершено, без проверки)
zh_hans: 提交已暂存内容(已签收，不验证)

# command.createTag
source: Create Tag
es: Crear etiqueta
fr: Créer une balise
ko: 태그 만들기
ru: Создать Тег
zh_hans: 创建标记

# command.deleteBranch
source: Delete Branch...
es: Borrar rama...
fr: Supprimer la branche...
ko: 분기 삭제...
ru: Удалить ветвь...
zh_hans: 删除分支...

# command.deleteTag
source: Delete Tag
es: Eliminar etiqueta
fr: Supprimer l'étiquette
ko: 태그 삭제
ru: Удалить тег
zh_hans: 删除标签

# command.fetch
source: Fetch
es: Capturar
fr: Rappatrier
ko: 페치
ru: Забрать
zh_hans: 抓取

# command.fetchAll
source: Fetch From All Remotes
es: Capturar desde todos los remotos
fr: Récupérer depuis tous les Remotes
ko: 모든 원격에서 페치
ru: Забрать из всех удаленных репозиториев
zh_hans: 从所有远程存储库中拉取

# command.fetchPrune
source: Fetch (Prune)
es: Fetch (capturar)
fr: Récupérer (élaguer)
ko: 페치(정리)
ru: Получение (с обрезкой)
zh_hans: 获取 (删除)

# command.git.acceptMerge
source: Accept Merge
ko: 병합 수락
ru: Принять слияние

# command.ignore
source: Add to .gitignore
es: Añadir a .gitignore
fr: Ajouter à .gitignore
ko: .gitignore에 추가
ru: Добавить в GITIGNORE
zh_hans: 添加到 .gitignore

# command.init
source: Initialize Repository
es: Inicializar el repositorio
fr: Initialiser le dépôt
ko: 리포지토리 초기화
ru: Инициализировать репозиторий
zh_hans: 初始化存储库

# command.merge
source: Merge Branch...
es: Fusionar rama...
fr: Fusionner la branche...
ko: 분기 병합...
ru: Объединить ветвь...
zh_hans: 合并分支...

# command.openAllChanges
source: Open All Changes
es: Abrir todos los cambios
fr: Ouvrir tous les changements
ko: 모든 변경 내용 열기
ru: Открыть все изменения
zh_hans: 打开所有更改
