Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/git.*.xlf
Languages: es, fr, ko, ru, zh_hans

# local changes
source: Your local changes would be overwritten by checkout.
es: Los cambios locales se sobrescribirán al extraer del repositorio.
fr: Vos changements locaux vont être remplacés par l'extraction.
ko: 체크 아웃하면 로컬 변경 내용을 덮어씁니다.
ru: Локальные изменения будут перезаписаны при извлечении.
zh_hans: 签出会覆盖本地更改。

# merge commit
source: The last commit was a merge commit. Are you sure you want to undo it?
es: La última confirmación fue una confirmación de fusión mediante combinación. ¿Seguro que quiere deshacerla?
fr: Le dernier commit était un commit de fusion. Voulez-vous vraiment l'annuler ?
ko: 마지막 커밋은 병합 커밋이었습니다. 실행 취소하시겠습니까?
ru: Последняя фиксация была фиксацией слияния. Вы действительно хотите отменить ее?
zh_hans: 最后一个提交是合并提交。是否确实要撤消它？

# merge conflicts
source: There are merge conflicts. Resolve them before committing.
es: Hay conflictos de fusión. Resuelvalos antes de confirmar.
fr: Il existe des conflits de fusion. Corrigez-les avant la validation.
ko: 병합 충돌이 있습니다. 해결한 후 계속하세요.
ru: Обнаружены конфликты слияния. Устраните их перед фиксацией.
zh_hans: 存在合并冲突。请在提交之前解决这些冲突。

# missing user info
source: Make sure you configure your 'user.name' and 'user.email' in git.
es: Asegúrese de configurar su \"user.name\" y \"user.email\" en git.
fr: Assurez-vous de configurer votre 'user.name' et 'user.email' dans git.
ko: Git에서 'user.name' 및 'user.email'을 구성하세요.
ru: Убедитесь, что вы настроили параметры \"user.name\" и \"user.email\" в git.
zh_hans: 请确保已在 Git 中配置 “user.name” 和 “user.email”。

source: Never
es: Nunca
fr: Jamais
ko: 안 함
ru: Никогда
zh_hans: 从不

# never again
source: OK, Don't Show Again
es: No volver a mostrar
fr: OK, Ne plus afficher
ko: 다시 표시 안 함
ru: ОК, больше не показывать
zh_hans: 确定，且不再显示

# never ask again
source: OK, Don't Ask Again
es: De acuerdo, no volver a preguntar
fr: OK, Ne plus me demander à nouveau
ko: 네, 다시 표시 안 함
ru: ОК, больше не показывать
zh_hans: 确定，且不再询问

# no changes
source: There are no changes to commit.
es: No hay cambios para confirmar.
fr: Il n'existe aucun changement à valider.
ko: 커밋할 변경 내용이 없습니다.
ru: Нет изменений для фиксации.
zh_hans: 没有要提交的更改。

# no changes stash
source: There are no changes to stash.
es: No existen cambios para el guardado provisional.
fr: Aucune modification à remiser (stash).
ko: 스태시할 변경 내용이 없습니다.
ru: Отсутствуют изменения, которые необходимо спрятать.
zh_hans: 没有要储藏的更改。

# no more
source: Can't undo because HEAD doesn't point to any commit.
es: No se puede deshacer porque HEAD no apunta a ningún commit.
fr: Impossible d’annuler car HEAD ne pointe vers aucune validation.
ko: HEAD가 커밋을 가리키지 않으므로 실행 취소할 수 없습니다.
ru: Невозможно отменить операцию, так как HEAD не указывает ни на какой коммит.
zh_hans: 无法撤消，因为 HEAD 不指向任何提交。

# no rebase
source: No rebase in progress.
es: No se está realizando ningún reajuste.
fr: Pas de rebase en cours.
ko: 진행 중인 다시 지정이 없습니다.
ru: Перемещение изменений из одной ветви в другую не выполняется.
zh_hans: 没有正在进行的变基。

# no remotes added
source: Your repository has no remotes.
es: Su repositorio no tiene remotos.
fr: Votre dépôt n'a pas de dépôt distant.
ko: 리포지토리에 원격 항목이 없습니다.
ru: Ваш репозиторий не содержит удаленные репозитории.
zh_hans: 您的存储库中没有远程存储库。

# no remotes to fetch
source: This repository has no remotes configured to fetch from.
es: El repositorio no tiene remotos configurados de los que recuperar.
fr: Ce dépôt n'a aucun dépôt distant configuré pour rappatrier.
ko: 이 리포지토리에 페치할 원격 항목이 구성되어 있지 않습니다.
ru: Для этого репозитория не настроены удаленные репозитории для забора изменений.
zh_hans: 此存储库未配置可以从中抓取的远程存储库。

# no remotes to publish
source: Your repository has no remotes configured to publish to.
es: El repositorio no tiene remotos configurados en los que publicar.
fr: Votre dépôt n'a aucun dépôt distant configuré pour une publication.
ko: 리포지토리에 게시하도록 구성된 원격이 없습니다.
ru: Для вашего репозитория не настроены удаленные репозитории для публикации.
zh_hans: 存储库未配置任何要发布到的远程存储库。

# no remotes to pull
source: Your repository has no remotes configured to pull from.
es: El repositorio no tiene remotos configurados de los que extraer.
fr: Votre dépôt n'a aucun dépôt distant configuré pour un Pull.
ko: 리포지토리에 풀하도록 구성된 원격 항목이 없습니다.
ru: Для вашего репозитория не настроены удаленные репозитории для получения данных.
zh_hans: 存储库未配置任何从其中进行拉取的远程存储库。

# no remotes to push
source: Your repository has no remotes configured to push to.
es: El repositorio no tiene remotos configurados en los que insertar.
fr: Votre dépôt n'a aucun dépôt distant configuré pour un Push.
ko: 리포지토리에 푸시하도록 구성된 원격이 없습니다.
ru: Для вашего репозитория не настроены удаленные репозитории для отправки данных.
zh_hans: 存储库未配置任何要推送到的远程存储库。

# no staged changes
source: There are no staged changes to commit. Would you like to stage all your changes and commit them directly?
es: No hay cambios preparados para confirmar. ¿Desea poner en escena todos los cambios y confirmarlos directamente?
fr: Il n'existe aucun changement indexé à commiter. Voulez-vous indexer tous vos changements et les commiter directement ?
ko: 커밋할 스테이징된 변경 사항이 없습니다. 모든 변경 사항을 스테이징하고 직접 커밋하시겠습니까?
ru: Нет подготовленных изменений для фиксации. Хотите подготовить все свои изменения и зафиксировать их напрямую?
zh_hans: 没有可提交的暂存更改。 是否要暂存所有更改并直接提交?

# no stashes
source: There are no stashes in the repository.
es: No hay cambios guardados provisionalmente en el repositorio.
fr: Aucune remise (stash) à restaurer dans ce dépôt.
ko: 리포지토리에 스태시가 없습니다.
ru: В репозитории отсутствуют скрытые изменения.
zh_hans: 此存储库中没有储藏。

# no tags
source: This repository has no tags.
es: Este repositorio no tiene etiquetas.
fr: Ce dépôt n'a pas d'étiquette.
ko: 이 리포지토리에는 태그가 없습니다.
ru: У этого репозитория не было тегов.
zh_hans: 此存储库没有标记。

# no verify commit not allowed
source: Commits without verification are not allowed, please enable them with the 'git.allowNoVerifyCommit' setting.
es: Las confirmaciones sin verificación no están permitidas, habilítelas con el ajuste \"git.allowNoVerifyCommit\".
fr: Les commits sans vérification ne sont pas autorisés. Activez-les à l'aide du paramètre 'git.allowNoVerifyCommit'.
ko: 확인 없는 커밋은 허용되지 않습니다. 'git.allowNoVerifyCommit' 설정을 통해 사용하도록 설정하세요.
ru: Фиксации без проверки не допускаются, включите их с помощью параметра \"git.allowNoVerifyCommit\".
zh_hans: 不允许在未验证的情况下提交，请使用 “git.allowNoVerifyCommit” 设置启用这些提交。

# nobranch
source: Please check out a branch to push to a remote.
es: Extraiga del repositorio una rama para insertar un remoto.
fr: Vous devez extraire une branche dont vous souhaitez effectuer le Push vers un emplacement distant.
ko: 원격에 푸시할 분기를 체크 아웃하세요.
ru: Переключитесь на какую-либо ветвь, чтобы отправить изменения в удаленный репозиторий.
zh_hans: 请签出一个分支以推送到远程。

source: OK
es: Aceptar
ko: 확인
ru: ОК
zh_hans: 确定

source: Open Git Log
es: Abrir registro de GIT
fr: Ouvrir le journal Git
ko: Git 로그 열기
ru: Открыть журнал GIT
zh_hans: 打开 GIT 日志

# open repo
source: Open Repository
es: Abrir repositorio
fr: Ouvrir le dépôt
ko: 리포지토리 열기
ru: Открыть репозиторий
zh_hans: 打开存储库

# openrepo
source: Open
es: Abrir
fr: Ouvrir
ko: 열기
ru: Открыть
zh_hans: 打开

# openreponew
source: Open in New Window
es: Abrir en una ventana nueva
fr: Ouvrir dans une nouvelle fenêtre
ko: 새 창에서 열기
ru: Открыть в новом окне
zh_hans: 在新窗口中打开

# pick branch pull
source: Pick a branch to pull from
es: Seleccionar una rama de la que extraer
fr: Sélectionner une branche à partir de laquelle tirer (pull)
ko: 다음에서 가져올 분기 선택
ru: Выберите ветвь для извлечения
zh_hans: 选择拉取的来源分支

# pick provider
source: Pick a provider to publish the branch '{0}' to:
es: Elija un proveedor para publicar la rama \"{0}\" en:
fr: Choisissez un fournisseur sur lequel publier la branche '{0}' :
ko: '{0}' 분기를 다음에 게시할 공급자 선택:
ru: Выберите поставщика, в который необходимо опубликовать ветвь \"{0}\":
zh_hans: 选择一个提供程序以将分支“{0}”发布到:

# pick remote
source: Pick a remote to publish the branch '{0}' to:
es: Seleccionar un elemento remoto para publicar la rama '{0}':
fr: Choisissez un dépôt distant où publier la branche '{0}' :
ko: '{0}' 분기를 다음에 게시하려면 원격을 선택하세요:
ru: Выберите удаленный сервер, на котором нужно опубликовать ветвь \"{0}\":
zh_hans: 选取要将分支“{0}”发布到的远程:

# pick remote pull repo
source: Pick a remote to pull the branch from
es: Seleccione un origen remoto desde el que extraer la rama
fr: Choisir un dépôt distant duquel extraire la branche
ko: 분기를 가져올 원격 선택
ru: Выберите удаленный репозиторий, с которого нужно получить ветвь
zh_hans: 选择要从其拉取分支的远程位置

# pick stash to apply
source: Pick a stash to apply
es: Elegir un cambio guardado provisionalmente para aplicarlo
fr: Choisir une remise (stash) à appliquer
ko: 적용할 스태시 선택
ru: Выберите спрятанное изменение для применения
zh_hans: 选择要应用的储藏

# pick stash to drop
source: Pick a stash to drop
es: Escoja una copia intermedia para eliminar
fr: Choisir un remisage (stash) à supprimer
ko: 삭제할 스태시 선택
ru: Выберите спрятанные данные для удаления
zh_hans: 选择要删除的储藏

# pick stash to pop
source: Pick a stash to pop
es: Elija un cambio guardado provisionalmente para aplicarlo y quitarlo
fr: Choisir une remise (stash) à appliquer et supprimer
ko: 표시할 스태시 선택
ru: Выберите спрятанное изменение для отображения
zh_hans: 选择要弹出的储藏

# proposeopen
source: Would you like to open the cloned repository?
es: ¿Desea abrir el repositorio clonado?
fr: Voulez-vous ouvrir le dépôt cloné ?
ko: 복제된 리포지토리를 여시겠습니까?
ru: Вы хотите открыть клонированный репозиторий?
zh_hans: 是否要打开已克隆存储库?

# proposeopen init
source: Would you like to open the initialized repository?
es: ¿Desea abrir el repositorio inicializado?
fr: Voulez-vous ouvrir le dépôt initialisé ?
ko: 초기화된 리포지토리를 여시겠습니까?
ru: Вы хотите открыть инициализированный репозиторий?
zh_hans: 是否打开初始化的存储库?

# proposeopen2
source: Would you like to open the cloned repository, or add it to the current workspace?
es: ¿Desea abrir el repositorio clonado, o añadir al área de trabajo actual?
fr: Voulez-vous ouvrir le dépôt cloné ou l'ajouter à l'espace de travail actuel ?
ko: 복제된 리포지토리를 열거나 현재 작업 영역에 추가하시겠습니까?
ru: Вы хотите открыть клонированный репозиторий, или добавить его в текущую рабочую область?
zh_hans: 您是希望打开克隆的存储库，还是将其添加到当前工作区?

# proposeopen2 init
source: Would you like to open the initialized repository, or add it to the current workspace?
es: ¿Desea abrir el repositorio inicializado, o añadir al área de trabajo actual?
fr: Souhaitez-vous ouvrir le dépôt initialisé, ou l’ajouter à l’espace de travail actuel ?
ko: 초기화된 리포지토리를 열거나 현재 작업 영역에 추가하겠습니까?
ru: Вы хотите открыть инициализированный репозиторий, или добавить его в текущую рабочую область?
zh_hans: 您是希望打开初始化的存储库，还是将其添加到当前工作区?

# provide branch name
source: Please provide a new branch name
es: Proporcione un nuevo nombre de rama
fr: Fournissez un nouveau nom de branche
ko: 새 분기 이름을 제공하세요.
ru: Укажите новое имя ветви
zh_hans: 请提供新的分支名称

# provide commit hash
source: Please provide the commit hash
es: Proporcione el hash de la confirmación
fr: Indiquez le code de hachage du commit
ko: 커밋 해시를 제공하세요.
ru: Укажите хэш фиксации
zh_hans: 请提供提交哈希

# provide commit message
source: Please provide a commit message
es: Proporcione un mensaje de confirmación
fr: Indiquez un message de validation
ko: 커밋 메시지를 제공하세요.
ru: Введите сообщение фиксации.
zh_hans: 请提供提交消息

# provide remote name
source: Please provide a remote name
es: Proporcione un nombre de remoto
fr: Fournissez un nom de dépôt distant
ko: 원격 이름을 제공하세요.
ru: Укажите удаленное имя
zh_hans: 请提供远程存储库名称

# provide stash message
source: Optionally provide a stash message
es: Opcionalmente, proporcionar un mensaje para el guardado provisional
fr: Spécifier éventuellement un message pour la remise (stash)
ko: 필요한 경우 스태시 메시지를 입력하세요.
ru: Укажите сообщение о скрытии
zh_hans: 提供储藏消息(可选)

# provide tag message
source: Please provide a message to annotate the tag
es: Por favor, especifique un mensaje para anotar la etiqueta
fr: Spécifiez un message pour annoter la balise
ko: 태그에 주석을 달 메시지를 입력하세요.
ru: Укажите сообщение для аннотирования тега
zh_hans: 请提供消息以对标记进行注释

# provide tag name
source: Please provide a tag name
es: Por favor proporcione un nombre para la etiqueta
fr: Spécifiez un nom de balise
ko: 태그 이름을 입력하세요.
ru: Укажите имя тега
zh_hans: 已成功带标记进行推送。

# publish to
source: Publish to {0}
es: Publicar en {0}
fr: Publier sur {0}
ko: {0}에 게시
ru: Опубликовать в {0}
zh_hans: 发布到 {0}

# remote already exists
source: Remote '{0}' already exists.
es: El remoto \"{0}\" ya existe.
fr: Le dépôt distant '{0}' existe déjà.
ko: 원격 '{0}'이(가) 이미 존재합니다.
ru: Удаленный репозиторий \"{0}\" уже существует.
zh_hans: 远程存储库“{0}”已存在。

# remote branch at
source: Remote branch at {0}
es: Rama remota en {0}
fr: Branche distante à {0}
ko: {0}에서 원격 분기
ru: Удаленная ветвь в {0}
zh_hans: {0} 处的远程分支

source: Remote name
es: Nombre de remoto
fr: Nom du dépôt distant
ko: 원격 이름
ru: Удаленное имя
zh_hans: 远程存储库名称

source: Remote name format invalid
es: Formato de nombre de remoto no válido
fr: Format non valide du nom de dépôt distant
ko: 잘못된 원격 이름 형식
ru: Недопустимый формат имени удаленного репозитория
zh_hans: 远程仓库名称格式无效

# remove remote
source: Pick a remote to remove
es: Seleccione un remoto para quitar
fr: Choisir un dépôt distant à supprimer
ko: 제거할 원격 선택
ru: Выберите удаленный репозиторий для удаления
zh_hans: 选择要删除的远程库

# repourl
source: Clone from URL
es: Dirección URL de repositorio
fr: URL de dépôt
ko: 리포지토리 URL
ru: URL-адрес репозитория
zh_hans: 存储库 URL

source: Restore file
es: Restaurar archivo
fr: Restaurer le fichier
ko: 파일 복원
ru: Восстановить файл
zh_hans: 恢复文件

source: Restore files
es: Restaurar archivos
fr: Restaurer les fichiers
ko: 파일 복원
ru: Восстановить файлы
zh_hans: 恢复文件

# save and commit
source: Save All & Commit
es: Guardar todo y confirmar
fr: Tout enregistrer et valider
ko: 모두 저장 및 커밋
ru: Сохранить все и фиксировать
zh_hans: 全部保存并提交

# save and stash
source: Save All & Stash
es: Guardar y almacenar
fr: Tout enregistrer et faire un stash
ko: 모두 저장 및 스태시
ru: Сохранить все и спрятать
zh_hans: 全部保存并储藏

source: Select a branch to merge from
es: Seleccione una rama desde la que fusionar
fr: Sélectionner une branche à fusionner
ko: 병합할 분기 선택
ru: Выберите ветвь для слияния
zh_hans: 选择要从其合并的分支

source: Select a branch to rebase onto
es: Seleccione una rama para reorganizarla en
fr: Sélectionner une branche où rebaser
ko: 다시 지정할 대상 분기 선택
ru: Выберите ветвь для перемещения в нее изменений
zh_hans: 选择要变基到的分支

source: Select a ref to checkout
es: Seleccione una referencia para desproteger
fr: Sélectionner une référence à extraire
ko: 체크아웃할 참조 선택
ru: Выберите ссылку для переключения
zh_hans: 选择要签出的 ref

# select a ref to checkout detached
source: Select a ref to checkout in detached mode
es: Seleccionar una referencia para extraer del repositorio en modo desasociado
fr: Sélectionnez une référence à extraire en mode détaché
ko: 분리 모드에서 체크 아웃할 참조 선택
ru: Выберите ссылку для извлечения в отключенном режиме
zh_hans: 选择要在分离模式下签出的引用

# select a ref to create a new branch from
source: Select a ref to create the '{0}' branch from
es: Seleccione una referencia para crear la rama \"{0}\" de
fr: Sélectionner une référence à partir de laquelle créer la branche '{0}'
ko: ref를 선택하여 다음에서 '{0}' 분기를 만듭니다.
ru: Выберите ссылку для создания ветви \"{0}\" из
zh_hans: 选择一个 ref 以从中创建“{0}”分支

source: Select a tag to delete
es: Seleccione una etiqueta para eliminar
fr: Sélectionner une étiquette à supprimer
ko: 삭제할 태그 선택
ru: Выберите тег для удаления
zh_hans: 选择要删除的标记

# select branch to delete
source: Select a branch to delete
es: Seleccione una rama para borrar
fr: Sélectionner une branche à supprimer
ko: 삭제할 분기 선택
ru: Выберите ветвь для удаления
zh_hans: 选择要删除的分支

source: Select log level
es: Seleccionar nivel de log
fr: Sélectionner le niveau de journalisation (log)
ko: 로그 수준 선택
ru: Установите уровень ведения журнала
zh_hans: 选择日志级别

# selectFolder
source: Select Repository Location
es: Seleccione la ubicación del repositorio
fr: Sélectionner l'emplacement du dépôt
ko: 리포지토리 위치 선택
ru: Выбрать расположение репозитория
zh_hans: 选择存储库位置

source: Show Command Output
es: Mostrar salida del comando
fr: Afficher la sortie de commande
ko: 명령 출력 표시
ru: Показать выходные данные команды
zh_hans: 显示命令输出

# stash
source: Stash Anyway
es: Guardar provisionalmente de todos modos
fr: Faire un stash quand même
ko: 스태시
ru: Все равно спрятать
zh_hans: 仍要储藏

# stash merge conflicts
source: There were merge conflicts while applying the stash.
es: Hubo conflictos de fusión al aplicar el cambio provisional.
fr: Il y a eu des conflits de fusion en appliquant la remise (stash).
ko: 스태시를 적용하는 중 병합 충돌이 발생했습니다.
ru: Обнаружены конфликты слияния при применении скрытых изменений.
zh_hans: 在应用储藏时存在合并冲突。

source: Stash message
es: Mensaje para el guardado provisional
fr: Message pour la remise (stash)
ko: 스태시 메시지
ru: Сообщение к спрятанным изменениям
zh_hans: 储藏消息

source: Stash & Checkout
es: Guardar provisionalmente y extraer del repositorio
fr: Faire un stash et extraire
ko: 스태시 및 체크 아웃
ru: Спрятать и извлечь
zh_hans: 储藏并签出

# sure drop
source: Are you sure you want to drop the stash: {0}?
es: ¿Está seguro de que desea eliminar el intermedio: {0}?
fr: Voulez-vous vraiment annuler le stash : {0} ?
ko: 스태시 {0}을(를) 삭제하시겠습니까?
ru: Вы действительно хотите удалить спрятанные изменения: {0}?
zh_hans: 确定要删除储藏 {0} 吗?

# sync is unpredictable
source: This action will pull and push commits from and to '{0}/{1}'.
es: Esta acción extraerá e insertará confirmaciones desde y hacia '{0}/{1}'.
ko: 이 작업은 '{0}/{1}'에서 커밋을 가져오고 푸시합니다.
ru: Это действие получает и отправляет фиксации от и к "{0}/{1}".

# tag at
source: Tag at {0}
es: Etiqueta en {0}
fr: Balise sur {0}
ko: {0}의 태그
ru: Тег в {0}
zh_hans: {0} 处的标记

# tag message
source: Message
es: Mensaje
ko: 메시지
ru: Сообщение
zh_hans: 消息

source: Tag name
es: Nombre de etiqueta
fr: Nom de la balise
ko: 태그 이름
ru: Имя тега
zh_hans: 标记名称

# there are untracked files
source: There are {0} untracked files which will be DELETED FROM DISK if discarded.
es: Hay {0} archivos sin seguimiento que se ELIMINARÁN DEL DISCO si se descartan.
fr: {0} fichiers non suivis seront SUPPRIMÉS DU DISQUE s'ils sont ignorés.
ko: 취소하는 경우 {0}개의 추적되지 않은 파일이 디스크에서 삭제됩니다.
ru: Существует {0} неотслеживаемых файлов, которые будут удалены с диска в случае отмены изменений.
zh_hans: 若放弃 {0} 个未跟踪的文件，其将被从硬盘上删除。

# there are untracked files single
source: The following untracked file will be DELETED FROM DISK if discarded: {0}.
es: El siguiente archivo sin seguimiento se ELIMINARÁ DEL DISCO si se descarta: {0}.
fr: Le fichier non suivi suivant sera SUPPRIMÉ DU DISQUE s'il est ignoré : {0}.
ko: 취소한 경우 다음 추적되지 않은 파일이 디스크에서 삭제됩니다. {0}.
ru: При отмене изменений для этого неотслеживаемого файла этот файл будет удален с диска: {0}.
zh_hans: 若放弃下面未跟踪的文件，其将被从硬盘上删除: {0}。

# undo commit
source: Undo merge commit
es: Deshacer la confirmación de fusión mediante combinación
fr: Annuler le commit de fusion
ko: 병합 커밋 실행 취소
ru: Отменить фиксацию слияния
zh_hans: 撤消合并提交

# unsaved files
source: There are {0} unsaved files. Would you like to save them before committing?
es: Hay {0} archivos sin guardar ¿Quiere guardarlos antes de confirmar?
fr: Il existe {0} fichiers non enregistrés. Voulez-vous les enregistrer avant d'effectuer un commit ?
ko: 저장되지 않은 파일 {0}개가 있습니다. 커밋하기 전에 저장하시겠습니까?
ru: Некоторые файлы ({0}) не сохранены. Вы хотите сохранить их перед фиксацией?
zh_hans: 有 {0} 个文件尚未保存。 要在提交之前保存吗?

# unsaved files single
source: The following file has unsaved changes which won't be included in the commit if you proceed: {0}. Would you like to save it before committing?
es: El siguiente archivo tiene cambios no guardados que no se incluirán en la confirmación si continúa: {0}. ¿Desea guardarlos antes de confirmar?
fr: Le fichier suivant contient des changements non enregistrés qui ne seront pas inclus dans le commit si vous continuez : {0}. Voulez-vous l'enregistrer avant d'effectuer un commit ?
ko: 계속하는 경우 {0} 파일의 저장되지 않은 변경 내용이 커밋에 포함되지 않을 수 있습니다. 커밋하기 전에 저장하시겠습니까?
ru: В следующем файле есть несохраненные изменения, которые не будут включены в фиксацию, если вы захотите продолжить: {0}. Вы хотите сохранить этот файл перед фиксацией?
zh_hans: 以下文件具有未保存的更改；如果继续，则提交时不会包含这些更改: {0}。 要在提交之前保存吗?

# unsaved stash files
source: There are {0} unsaved files. Would you like to save them before stashing?
es: Hay {0} archivos sin guardar. ¿Desea guardarlos antes de almacenarlos?
fr: Il existe {0} fichiers non enregistrés. Voulez-vous les enregistrer avant de faire un stash ?
ko: 저장되지 않은 파일이 {0}개 있습니다. 스태시하기 전에 저장하시겠습니까?
ru: Некоторые файлы ({0}) не сохранены. Вы хотите сохранить их, прежде чем спрятать?
zh_hans: 有 {0} 个文件尚未保存。 要在储藏之前保存吗?

# unsaved stash files single
source: The following file has unsaved changes which won't be included in the stash if you proceed: {0}. Would you like to save it before stashing?
es: El siguiente archivo tiene cambios no guardados que no se incluirán en el intermedio si procede:{0}. ¿Quiere guardarlo antes de almacenarlo?
fr: Le fichier suivant contient des changements non enregistrés qui ne seront pas inclus dans le stash si vous continuez : {0}. Voulez-vous l'enregistrer avant de faire un stash ?
ko: 계속하는 경우 {0} 파일의 저장되지 않은 변경 내용이 스태시에 포함되지 않습니다. 스태시하기 전에 저장하시겠습니까?
ru: В следующем файле есть несохраненные изменения, которые не будут включены в спрятанные изменения, если вы захотите продолжить: {0}. Вы хотите сохранить этот файл, прежде чем спрятать?
zh_hans: 以下文件具有未保存的更改；如果继续，则储藏时不会包含这些更改: {0}。 要在储藏之前保存吗?

# warn untracked
source: This will DELETE {0} untracked files! This is IRREVERSIBLE! These files will be FOREVER LOST.
es: ¡Esto ELIMINARÁ {0} archivos sin seguimiento. Esta acción es IRREVERSIBLE. Estos archivos SE PERDERÁN PARA SIEMPRE.
fr: Cela va entraîner la SUPPRESSION de {0} fichiers non suivis ! Cette action est IRRÉVERSIBLE ! Ces fichiers seront DÉFINITIVEMENT PERDUS.
ko: 이렇게 하면 추적되지 않은 파일 {0}개가 삭제됩니다! 삭제 후에는 되돌릴 수 없습니다! 이 파일은 영구적으로 손실됩니다.
ru: Эта операция приведет к УДАЛЕНИЮ неотслеживаемых файлов ({0})! Она является НЕОБРАТИМОЙ! Восстановить эти файлы будет НЕВОЗМОЖНО.
zh_hans: 这将删除 {0} 个未跟踪的文件! 此操作不可撤消! 这些文件将永久丢失。

# yes discard tracked
source: Discard 1 Tracked File
es: Descartar un archivo con seguimiento
fr: Ignorer 1 fichier suivi
ko: 1개의 추적된 파일 취소
ru: Отменить изменения для одного отслеживаемого файла
zh_hans: 放弃 1 个已跟踪的文件

# yes discard tracked multiple
source: Discard {0} Tracked Files
es: Descartar {0} archivos con seguimiento
fr: Ignorer {0} fichiers suivis
ko: {0}개의 추적된 파일 취소
ru: Отменить изменения для отслеживаемых файлов ({0})
zh_hans: 放弃 {0} 个已跟踪的文件

# yes never again
source: Yes, Don't Show Again
es: Sí, no volver a mostrar
fr: Oui, Ne plus afficher
ko: 예, 다시 표시 안 함
ru: Да, больше не показывать
zh_hans: 确定，且不再显示

# gitLogLevel
source: Log level: {0}
ko: 로그 수준: {0}
ru: Уровень ведения журнала: {0}

# skipped
source: Skipped found git in: {0}
fr: Git ignoré trouvé dans : {0}
ko: 다음 위치에서 찾은 git 건너뛰기: {0}
ru: Пропущенный найденный Git в: {0}
zh_hans: 已跳过在以下位置中找到的 git: {0}

# using git
source: Using git {0} from {1}
fr: Utilisation de git {0} à partir de {1}
ko: {1}에서 git {0}을(를) 사용하는 중
ru: Используется git {0} из {1}
zh_hans: 将使用位于 {1} 的 Git {0}

# validating
source: Validating found git in: {0}
fr: Validation du git trouvé dans : {0}
ko: {0}에서 찾은 git 유효성을 검사하는 중
ru: Проверка найденного git в:{0}
zh_hans: 正在验证在以下位置中找到的 git: {0}

# no repositories
source: There are no available repositories
es: No hay repositorios disponibles
fr: Aucun dépôt disponible
ko: 사용 가능한 리포지토리가 없습니다.
ru: Доступные репозитории отсутствуют
zh_hans: 没有可用存储库
