Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/git.*.xlf
Languages: es, fr, ko, ru, zh_hans

# config.showInlineOpenFileAction
source: Controls whether to show an inline Open File action in the Git changes view.
es: Controla si se debe mostrar una acción de archivo abierto en la vista de cambios en Git
fr: Contrôle s’il faut afficher une action Ouvrir le fichier dans l’affichage des modifications de Git.
ko: Git 변경점 보기에서 파일 열기 동작 줄을 표시할지의 여부를 제어합니다.
ru: Определяет, должно ли отображаться интерактивное действие \"Открыть файл\" в представлении \"Изменения Git\".
zh_hans: 控制是否在 Git 更改视图中显示内联“打开文件”操作。

# config.showProgress
source: Controls whether git actions should show progress.
es: Controla si las acciones de git deben mostrar el progreso.
fr: Contrôle si les actions git doivent afficher la progression.
ko: Git 작업에서 진행률을 표시할지 여부를 제어합니다.
ru: Определяет, следует ли отображать ход выполнения для действий Git.
zh_hans: 控制 Git 操作是否显示进度提示。

# config.showPushSuccessNotification
source: Controls whether to show a notification when a push is successful.
es: Controla si se va a mostrar una notificación cuando un push es exitoso.
fr: Contrôle s’il faut afficher une notification en cas de réussite d'un envoi (push).
ko: 푸시가 성공했을 때 알림을 표시할지 여부를 제어합니다.
ru: Определяет, следует ли отображать уведомление об успешной отправке.
zh_hans: 控制在推送成功时是否显示通知。

# config.smartCommitChanges
source: Control which changes are automatically staged by Smart Commit.
es: Controle qué cambios se realizan automáticamente mediante Smart Commit.
fr: Contrôle les modifications organisées automatiquement par Smart Commit.
ko: 스마트 커밋에서 자동으로 스테이징되는 변경 사항을 제어합니다.
ru: Определяет, какие изменения автоматически размещаются при интеллектуальной фиксации.
zh_hans: 控制哪些更改由Smart Commit自动暂存。

# config.smartCommitChanges.all
source: Automatically stage all changes.
es: Almacenar automáticamente todos los cambios
fr: Organise automatiquement toutes les modifications.
ko: 모든 변경 사항을 자동으로 스테이징합니다.
ru: Автоматически размещать все изменения.
zh_hans: 自动暂存所有更改。

# config.smartCommitChanges.tracked
source: Automatically stage tracked changes only.
es: Almacenar automáticamente sólo los cambios supervisados.
fr: Organise automatiquement les modifications suivies uniquement.
ko: 추적된 변경 사항만 자동으로 스테이징했습니다.
ru: Только автоматически размещенные отслеживаемые изменения.
zh_hans: 仅自动暂存跟踪的更改。

# config.statusLimit
source: Controls how to limit the number of changes that can be parsed from Git status command. Can be set to 0 for no limit.
es: Controla cómo limitar el número de cambios que se pueden analizar desde el comando de estado de Git. Se puede establecer en 0 sin límite.
fr: Contrôle comment limiter le nombre de modifications qui peuvent être analysées à partir de la commande d’état Git. Peut être défini sur 0 sans limite.
ko: Git 상태 명령에서 구문 분석할 수 있는 변경 내용의 수를 제한하는 방법을 제어합니다. 제한이 없는 경우 0으로 설정할 수 있습니다.
ru: Определяет, как ограничить число изменений, которые можно проанализировать из команды состояния Git. Можно задать значение 0 без ограничений.
zh_hans: 控制如何限制可从 Git 状态命令分析的更改数。可以设置为 0 表示无限制。

# config.suggestSmartCommit
source: Suggests to enable smart commit (commit all changes when there are no staged changes).
es: Sugiere habilitar la confirmación inteligente (confirmar todos los cambios cuando no hay cambios preparados).
fr: Propose d'activer Smart Commit (valide toutes les modifications en l'absence de modifications organisées).
ko: 스마트 커밋을 사용하도록 제안합니다(스테이징된 변경 사항이 없는 경우 모든 변경 사항 커밋).
ru: Предлагает включить интеллектуальную фиксацию (отправка всех изменений даже при отсутствии промежуточных изменений).
zh_hans: 建议启用智能提交(在无暂存更改时提交所有更改)。

# config.supportCancellation
source: Controls whether a notification comes up when running the Sync action, which allows the user to cancel the operation.
es: Controla si aparece una notificación al ejecutar la acción Sincronizar, que permite al usuario cancelar la operación.
fr: Contrôle si une notification apparaît lors de l'exécution de l'action Sync, qui permet à l'utilisateur d'annuler l'opération.
ko: 동기화 작업을 실행할 때 사용자가 작업을 취소할 수 있도록 알림이 표시되는지 여부를 제어합니다.
ru: Определяет, выдается ли уведомление при запуске действия синхронизации. Это уведомление позволяет пользователю отменить операцию.
zh_hans: 控制在运行同步操作时是否出现通知，允许用户取消操作。

# config.terminalAuthentication
source: Controls whether to enable VS Code to be the authentication handler for git processes spawned in the integrated terminal. Note: terminals need to be restarted to pick up a change in this setting.
ko: 통합 터미널에서 생성된 git 프로세스의 인증 처리기로 VS Code를 사용할지 여부를 제어합니다. 참고: 이 설정의 변경 내용을 적용하려면 터미널을 다시 시작해야 합니다.
ru: Определяет, следует ли включить VS Code в качестве обработчика проверки подлинности для процессов Git, порожденных во встроенном терминале. Примечание. Для получения изменения в этом параметре необходимо перезапустить терминалы.

# config.terminalGitEditor
source: Controls whether to enable VS Code to be git editor for git processes spawned in the integrated terminal. Note: terminals need to be restarted to pick up a change in this setting.
ko: 통합 터미널에서 생성된 git 프로세스에 대한 git 편집기로 VS Code 사용할지 여부를 제어합니다. 참고: 이 설정에서 변경 사항을 선택하려면 터미널을 다시 시작해야 합니다.
ru: Определяет, следует ли включить VS Code в качестве редактора GIT для процессов GIT, порожденных во встроенном терминале. Примечание. Для получения изменения в этом параметре необходимо перезапустить терминалы.

# config.timeline.date
source: Controls which date to use for items in the Timeline view.
es: Controla la fecha que se va a usar para los elementos de la vista Escala de tiempo.
fr: Contrôle la date à utiliser pour les éléments de la vue Chronologie.
ko: 타임라인 보기에서 항목에 사용할 날짜를 제어합니다.
ru: Определяет, какую дату использовать для элементов в представлении временной шкалы.
zh_hans: 控制在日程表视图中项目使用的日期。

# config.timeline.date.authored
source: Use the authored date
es: Usar la fecha de creación
fr: Utiliser la date de création
ko: 작성 날짜 사용
ru: Использовать дату создания
zh_hans: 使用创作日期

# config.timeline.date.committed
source: Use the committed date
es: Usar la fecha de confirmación
fr: Utiliser la date de commit
ko: 커밋된 날짜 사용
ru: Использовать дату фиксации
zh_hans: 使用提交日期

# config.timeline.showAuthor
source: Controls whether to show the commit author in the Timeline view.
es: Controla si se muestra el autor de la confirmación en la vista de la línea de tiempo.
fr: Contrôle si l'auteur du commit doit être affiché dans la vue Chronologie.
ko: 타임라인 보기에 커밋 작성자를 표시할지를 제어합니다.
ru: Определяет, показывать ли автора фиксации в представлении временной шкалы.
zh_hans: 控制是否在日程表视图中显示提交作者。

# config.timeline.showUncommitted
source: Controls whether to show uncommitted changes in the Timeline view.
es: Controla si se van a mostrar los cambios no confirmados en la vista Escala de tiempo.
ko: 타임라인 보기에서 커밋되지 않은 변경 내용을 표시할지 여부를 제어합니다.
ru: Определяет, показывать ли незафиксированные изменения в представлении временной шкалы.

# config.untrackedChanges
source: Controls how untracked changes behave.
es: Controla el comportamiento de los cambios a los que no se hace seguimiento.
fr: Contrôle le comportement des changements non suivis.
ko: 추적되지 않은 변경 내용의 작동 방식을 제어합니다.
ru: Определяет поведение неотслеживаемых изменений.
zh_hans: 控制未跟踪的更改的行为。

# config.untrackedChanges.hidden
source: Untracked changes are hidden and excluded from several actions.
es: Los cambios a los que no se realiza seguimiento se ocultan y se excluyen de varias acciones.
fr: Les changements non suivis sont masqués et exclus de plusieurs actions.
ko: 추적되지 않은 변경 내용이 숨겨지고 여러 작업에서 제외됩니다.
ru: Неотслеживаемые изменения скрываются и исключаются из нескольких действий.
zh_hans: 未跟踪的更改被隐藏，并从多个操作中排除。

# config.untrackedChanges.mixed
source: All changes, tracked and untracked, appear together and behave equally.
es: Todos los cambios, rastreados y no rastreados, aparecen juntos y se comportan por igual.
fr: Tous les changements, suivis et non suivis, apparaissent ensemble et se comportent de la même manière.
ko: 추적 및 추적되지 않은 모든 변경 내용이 함께 표시되고 동일한 작업이 수행됩니다.
ru: Все изменения — отслеживаемые и неотслеживаемые — отображаются вместе и работают одинаково.
zh_hans: 所有更改，无论是跟踪的还是未跟踪的，都会一起出现并表现出相同的行为。

# config.untrackedChanges.separate
source: Untracked changes appear separately in the Source Control view. They are also excluded from several actions.
es: Los cambios sin seguimiento aparecen por separado en la vista de control de código fuente. También se excluyen de varias acciones.
fr: Les changements non suivis apparaissent séparément dans la vue Contrôle de code source. Ils sont également exclus de plusieurs actions.
ko: 추적되지 않은 변경 내용은 소스 제어 보기에 별도로 표시됩니다. 또한 여러 작업에서 제외됩니다.
ru: Неотслеживаемые изменения отображаются отдельно от представления исходного кода. Они также исключаются из нескольких действий.
zh_hans: 未跟踪的更改单独显示在“源代码管理”视图中。它们也被排除在几个操作之外。

# config.useCommitInputAsStashMessage
source: Controls whether to use the message from the commit input box as the default stash message.
es: Controla si se utiliza el mensaje del cuadro de entrada de la confirmación como mensaje de almacenamiento predeterminado.
fr: Détermine s'il est nécessaire d'utiliser le message de la zone d'entrée de commit en tant que message de stash par défaut.
ko: 커밋 입력 상자의 메시지를 기본 스태시 메시지로 사용할지 여부를 제어합니다.
ru: Определяет, следует ли использовать сообщение из поля входных данных фиксации в качестве сообщения о спрятанных изменениях по умолчанию.
zh_hans: 控制是否将提交输入框中的消息用作默认储藏消息。

# config.useEditorAsCommitInput
source: Controls whether a full text editor will be used to author commit messages, whenever no message is provided in the commit input box.
ko: 커밋 입력 상자에 메시지가 제공되지 않을 때마다 커밋 메시지를 작성하는 데 전체 텍스트 편집기를 사용할지 여부를 제어합니다.
ru: Управляет тем, будет ли использоваться полнотекстовый редактор для создания сообщений фиксации, если в поле ввода фиксации не указано сообщение.

# config.useForcePushWithLease
source: Controls whether force pushing uses the safer force-with-lease variant.
es: Controla si forzar envío de cambios usa variante de forzar con concesión, más segura.
fr: Contrôles si force push utilise la variante force-with-lease plus sûr.
ko: 강제 푸시가 좀 더 안전한 force-with-lease 변형을 사용하는지 여부를 제어합니다.
ru: Определяет, используется ли более безопасный вариант принудительной отправки с арендой.
zh_hans: 控制是否使用更安全的 force-with-lease 进行强制推送。

# config.useIntegratedAskPass
source: Controls whether GIT_ASKPASS should be overwritten to use the integrated version.
es: Controla si se debe sobrescribir GIT_ASKPASS para usar la versión integrada.
ko: 통합 버전을 사용하기 위해 GIT_ASKPASS를 덮어써야 하는지 여부를 제어합니다.
ru: Определяет, следует ли перезаписать GIT_ASKPASS для использования интегрированной версии.

# config.verboseCommit
source: Enable verbose output when `#git.useEditorAsCommitInput#` is enabled.
ko: '#git.useEditorAsCommitInput#'이 사용하도록 설정된 경우 자세한 정보 표시 출력을 사용하도록 설정합니다.
ru: Включить подробные выходные данные, если включен `#git.useEditorAsCommitInput#`.

# description
source: Git SCM Integration
es: Integración Git SCM
fr: Intégration Git SCM
ko: Git SCM 통합
ru: Интеграция системы контроля версий Git
zh_hans: Git 源代码管理集成

# submenu.branch
source: Branch
es: Rama
fr: Branche
ko: 분기
ru: Ветвь
zh_hans: 分支

# submenu.changes
source: Changes
es: Cambios
fr: Changements
ko: 변경 사항
ru: Изменения
zh_hans: 更改

# submenu.commit
source: Commit
es: Confirmar
fr: Valider
ko: 커밋
ru: Фиксация
zh_hans: 提交

# submenu.commit.amend
source: Amend
es: Rectificar
fr: Modifier
ko: 수정
ru: Исправить
zh_hans: 修改

# submenu.commit.signoff
source: Sign Off
es: Cerrar sesión
fr: Fermer la session
ko: 승인
ru: Выйти
zh_hans: 注销

# submenu.pullpush
source: Pull, Push
es: Extraer, insertar
fr: Tirer (pull), envoyer (push)
ko: 풀, 푸시
ru: Получение, отправка
zh_hans: 拉取，推送

# submenu.remotes
source: Remote
es: Remoto
fr: À distance
ko: 원격
ru: Удаленный
zh_hans: 远程

# submenu.stash
source: Stash
fr: Remiser (stash)
ko: 스태시
ru: Спрятать
zh_hans: 存储

# submenu.tags
source: Tags
es: Etiquetas
fr: Étiquettes
ko: 태그
ru: Теги
zh_hans: 标记

# view.workbench.cloneRepository
source: You can clone a repository locally. [Clone Repository](command:git.clone 'Clone a repository once the git extension has activated')
es: Puedes clonar un repositorio de forma local. [Clonar repositorio](command:git.clone \"Clonar un repositorio una vez activada la extensión git\")
fr: Vous pouvez cloner un dépôt localement. [Cloner un dépôt](command:git.clone 'Cloner un dépôt une fois l'extension Git activée')
ko: 리포지토리를 로컬에서 복제할 수 있습니다. [리포지토리 복제](command:git.clone 'Git 확장이 활성화되면 리포지토리 복제')
ru: Репозиторий можно клонировать локально. [Клонировать репозиторий](command:git.clone \"Клонировать репозиторий после активации расширения Git\")
zh_hans: 可以在本地克隆存储库。 [可控存储库](command:git.clone“启用 git 扩展后立即克隆存储库”)

# view.workbench.learnMore
source: To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
es: Para obtener más información sobre cómo utilizar git y el control de fuentes en Azure Data Studio [lea nuestra documentación](https://aka.ms/vscode-scm).
fr: Pour en savoir plus sur l’utilisation de git et du contrôle de code source dans Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
ko: Azure Data Studio에서 Git 및 소스 제어를 사용하는 방법에 대해 자세히 알아보려면 [Microsoft Docs](https://aka.ms/vscode-scm)를 참조하세요.
ru: Чтобы получить дополнительные сведения об использовании Git и системы управления версиями в Azure Data Studio, [изучите нашу документацию](https://aka.ms/vscode-scm).
zh_hans: 要详细了解如何在 Azure Data Studio 中使用 Git 和源代码管理，请 [阅读我们的文档](https://aka.ms/vscode-scm)。

# view.workbench.scm.disabled
source: If you would like to use git features, please enable git in your [settings](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). To learn more about how to use git and source control in VS Code [read our docs](https://aka.ms/vscode-scm).
es: Si desea utilizar las características de GIT, habilite GIT en su [configuración](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). Para obtener más información sobre cómo usar GIT y el control de código fuente en VS Code [lea nuestra documentación](https://aka.ms/vscode-scm).
ko: Git 기능을 사용하려면 [설정](command:workbench.action.openSettings?%5B%22git.enabled%22%5D)에서 Git을 사용하도록 설정하세요. VS Code에서 Git 및 소스 제어를 사용하는 방법에 대해 자세히 알아보려면 [Microsoft Docs](https://aka.ms/vscode-scm)를 참조하세요.
ru: Если вы хотите использовать возможности Git, включите Git в своих [параметрах](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). Чтобы получить дополнительные сведения об использовании Git и системы управления версиями в VS Code, [изучите нашу документацию](https://aka.ms/vscode-scm).

# view.workbench.scm.empty
source: In order to use git features, you can open a folder containing a git repository or clone from a URL. [Open Folder](command:vscode.openFolder) [Clone Repository](command:git.clone) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
es: Para utilizar las funciones de git, puede abrir una carpeta que contenga un repositorio git o clonar desde una URL. [Abrir carpeta](comando:vscode.openFolder) [Clonar repositorio](comando:git.clone) Para obtener más información sobre cómo utilizar git y el control de origen en Azure Data Studio [lea nuestra documentación](https://aka.ms/vscode-scm).
fr: Pour utiliser les fonctionnalités de git, vous pouvez ouvrir un dossier contenant un référentiel git ou cloner à partir d’une URL. [Open Folder](command:vscode.openFolder) [Clone Repository](command:git.clone) Pour en savoir plus sur l’utilisation de git et du contrôle de code source dans Azure Data Studio [lisez notre documentation](https://aka.ms /vscode-scm).
ko: Git 기능을 사용하려면 Git 리포지토리가 포함된 폴더를 열거나 URL에서 복제할 수 있습니다. [폴더 열기](command:vscode.openFolder) [리포지토리 복제](command:git.clone) Azure Data Studio에서 Git 및 소스 제어를 사용하는 방법에 대해 자세히 알아보려면 [관련 문서를 참조](https://aka.ms/vscode-scm)하세요.
ru: Чтобы использовать возможности Git, можно открыть папку, содержащую репозиторий Git, или клонировать из URL-адреса. [Открыть папку](command:vscode.openFolder) [Клонировать репозиторий](command:git.clone) Чтобы получить дополнительные сведения об использовании Git и системы управления версиями в Azure Data Studio, [изучите нашу документацию](https://aka.ms/vscode-scm).
zh_hans: 如果要使用 git 功能，可以打开包含 git 存储库的文件夹或从 URL 克隆。 [打开文件夹](command:vscode.openFolder) [克隆存储库](command:git.clone) 要详细了解如何在 Azure Data Studio 中使用 git 和源代码管理，请 [阅读我们的文档](https://aka.ms/vscode-scm)。

# view.workbench.scm.emptyWorkspace
source: The workspace currently open doesn't have any folders containing git repositories. [Add Folder to Workspace](command:workbench.action.addRootFolder) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
es: El espacio de trabajo actualmente abierto no tiene ninguna carpeta que contenga repositorios git. [Agregar carpeta al área de trabajo](command:workbench.action.addRootFolder) Para obtener más información sobre cómo utilizar git y el control de origen en Azure Data Studio [lea nuestra documentación](https://aka.ms/vscode-scm).
fr: L’espace de travail actuellement ouvert ne contient aucun dossier contenant des référentiels git. [Add Folder to Workspace](command:workbench.action.addRootFolder) Pour en savoir plus sur l’utilisation de git et du contrôle de code source dans Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
ko: 현재 열려 있는 작업 영역에 Git 리포지토리를 포함하는 폴더가 없습니다. [작업 영역에 폴더 추가](command:workbench.action.addRootFolder) Azure Data Studio에서 Git 및 소스 제어를 사용하는 방법에 대해 자세히 알아보려면 [관련 문서를 참조](https://aka.ms/vscode-scm)하세요.
ru: В открытой сейчас рабочей области нет папок, содержащих репозитории Git. [Добавить папку в рабочую область](command:workbench.action.addRootFolder) Чтобы получить дополнительные сведения об использовании Git и системы управления версиями в Azure Data Studio, [изучите нашу документацию](https://aka.ms/vscode-scm).
zh_hans: 当前打开的工作区没有任何包含 git 存储库的文件夹。 [将文件夹添加到工作区](command:workbench.action.addRootFolder) 要详细了解如何在 Azure Data Studio 中使用 Git 和源代码管理，请 [阅读我们的文档](https://aka.ms/vscode-scm)。

# view.workbench.scm.folder
source: The folder currently open doesn't have a git repository. You can initialize a repository which will enable source control features powered by git. [Initialize Repository](command:git.init?%5Btrue%5D) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
es: La carpeta actualmente abierta no tiene un repositorio git. Puede inicializar un repositorio que habilitará las características de control de origen impulsadas por git. [Inicializar repositorio](command:git.init?%5Btrue%5D) Para obtener más información sobre el uso de git y el control del código fuente en Azure Data Studio [lea nuestra documentación](https://aka.ms/vscode-scm).
fr: Le dossier actuellement ouvert n’a pas de référentiel git. Vous pouvez initialiser un référentiel qui activera les fonctionnalités de contrôle de source alimentées par git. [Initialize Repository](command:git.init?%5Btrue%5D) Pour en savoir plus sur l’utilisation de git et du contrôle de code source dans Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
ko: 현재 열린 폴더에 Git 리포지토리가 없습니다. Git에서 제공하는 소스 제어 기능을 사용하도록 설정할 리포지토리를 초기화할 수 있습니다. [리포지토리 초기화](command:git.init?%5Btrue%5D) Azure Data Studio에서 Git 및 소스 제어를 사용하는 방법에 대해 자세히 알아보려면 [Microsoft Docs](https://aka.ms/vscode-scm)를 읽어보세요.
ru: В открытой папке нет репозитория Git. Вы можете инициализировать репозиторий, что позволит получить доступ к возможностям системы управления версиями на платформе Git. [Инициализировать репозиторий](command:git.init?%5Btrue%5D) Чтобы получить дополнительные сведения об использовании Git и системы управления версиями в Azure Data Studio, [изучите нашу документацию](https://aka.ms/vscode-scm).
zh_hans: 当前打开的文件夹中没有 Git 存储库。可初始化一个存储库，它将弃用 Git 提供支持的源代码管理功能。 [初始化存储库](command:git.init?%5Btrue%5D) 要详细了解如何在 Azure Data Studio 中使用 Git 和源代码管理，请 [阅读我们的文档](https://aka.ms/vscode-scm)。

# view.workbench.scm.missing
source: Install Git, a popular source control system, to track code changes and collaborate with others. Learn more in our [Git guides](https://aka.ms/vscode-scm).
ko: 인기 있는 소스 제어 시스템인 Git을 설치하여 코드 변경 내용을 추적하고 다른 사용자와 공동 작업합니다. [Git 가이드](https://aka.ms/vscode-scm)에서 자세히 알아보세요.
ru: Установите Git, популярную систему управления версиями, чтобы отслеживать изменения кода и совместно работать с другими пользователями. Дополнительные сведения см. в [Git guides](https://aka.ms/vscode-scm).

# view.workbench.scm.missing.linux
source: Source control depends on Git being installed. [Download Git for Linux](https://git-scm.com/download/linux) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
ko: 소스 제어는 설치 중인 Git에 따라 달라집니다. [Linux용 Git 다운로드](https://git-scm.com/download/linux) 설치 후에는 [다시 로드하세요](command:workbench.action.reloadWindow)(또는 [문제를 해결하세요](command:git.showOutput)). 추가 원본 제어 공급자는 [Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22)에서 설치할 수 있습니다.
ru: Системе управления версиями требуется установка Git. [Скачать Git для Linux](https://git-scm.com/download/linux) После установки выполните [перезагрузку](command:workbench.action.reloadWindow) (или [устранение неполадок](command:git.showOutput)). Возможна установка дополнительных поставщиков управления версиями [из Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# view.workbench.scm.missing.mac
source: [Download Git for macOS](https://git-scm.com/download/mac) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
ko: [macOS용 GIT 다운로드](https://git-scm.com/download/mac) 설치 후에는 [다시 로드하세요](command:workbench.action.reloadWindow)(또는 [문제를 해결하세요](command:git.showOutput)). 추가 원본 제어 공급자는 [Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22)에서 설치할 수 있습니다.
ru: [Скачать Git для macOS](https://git-scm.com/download/mac) После установки выполните [перезагрузку](command:workbench.action.reloadWindow) (или [устранение неполадок](command:git.showOutput)). Возможна установка дополнительных поставщиков управления версиями [из Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# view.workbench.scm.missing.windows
source: [Download Git for Windows](https://git-scm.com/download/win) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
ko: [Windows용 GIT 다운로드](https://git-scm.com/download/win) 설치 후에 [다시 로드하세요](command:workbench.action.reloadWindow)(또는 [문제를 해결하세요](command:git.showOutput)). 추가 원본 제어 공급자는 [Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22)에서 설치할 수 있습니다.
ru: [Скачать Git для Windows](https://git-scm.com/download/win) После установки выполните [перезагрузку](command:workbench.action.reloadWindow) (или [устранение неполадок](command:git.showOutput)). Можно установить дополнительных поставщиков системы управления версиями [из Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
