Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/git.*.xlf
Languages: es, fr, ko, ru, zh_hans

# scm button commit and push title
source: {0} Commit & Push
ko: {0} 커밋 및 푸시
ru: Фиксация и отправка {0}

# scm button commit and push tooltip
source: Commit & Push Changes
ko: 변경 내용 커밋 및 푸시
ru: Зафиксировать и отправить изменения

# scm button commit and sync title
source: {0} Commit & Sync
ko: {0} 커밋 및 동기화
ru: Фиксация и синхронизация {0}

# scm button commit and sync tooltip
source: Commit & Sync Changes
ko: 변경 내용 커밋 및 동기화
ru: Зафиксировать и синхронизировать изменения

# scm button commit title
source: {0} Commit
ko: {0} 커밋
ru: Фиксация {0}

# scm button commit to new branch and push tooltip
source: Commit to New Branch & Push Changes
ko: 새 분기에 커밋 및 변경 내용 푸시
ru: Зафиксировать в новой ветви и отправить изменения

# scm button commit to new branch and sync tooltip
source: Commit to New Branch & Sync Changes
ko: 새 분기에 커밋 및 변경 내용 동기화
ru: Зафиксировать в новой ветви и синхронизировать изменения

# scm button commit to new branch tooltip
source: Commit Changes to New Branch
ko: 새 분기에 변경 내용 커밋
ru: Зафиксировать изменения в новой ветви

# scm button commit tooltip
source: Commit Changes
ko: 변경 내용 커밋
ru: Зафиксировать изменения

# scm button committing and pushing tooltip
source: Committing & Pushing Changes...
ko: 변경 내용 커밋 및 푸시 중...
ru: Фиксация и отправка изменений…

# scm button committing and synching tooltip
source: Committing & Synching Changes...
ko: 변경 내용 커밋 및 동기화 중...
ru: Фиксация и синхронизация изменений…

# scm button committing to new branch and pushing tooltip
source: Committing to New Branch & Pushing Changes...
ko: 새 분기에 대한 커밋 및 변경 내용 추진...
ru: Фиксация в новой ветви и отправка изменений...

# scm button committing to new branch and synching tooltip
source: Committing to New Branch & Synching Changes...
ko: 새 분기에 커밋하고 변경 내용을 동기화하는 중...
ru: Фиксация в новой ветви и синхронизация изменений...

# scm button committing to new branch tooltip
source: Committing Changes to New Branch...
ko: 새 분기에 변경 내용 커밋 중...
ru: Фиксация изменений в новой ветви...

# scm button committing tooltip
source: Committing Changes...
ko: 변경 내용 커밋 중...
ru: Фиксация изменений…

# scm button continue title
source: {0} Continue
ko: {0} 계속
ru: Продолжить {0}

# scm button continue tooltip
source: Continue Rebase
ko: 계속 기준 다시 지정
ru: Продолжить перемещение изменений из одной ветви в другую

# scm button continuing tooltip
source: Continuing Rebase...
ko: 기준 주소 다시 지정을 계속하는 중...
ru: Продолжается перемещение изменений из одной ветви в другую...

# scm button publish branch
source: Publish Branch
es: Publicar rama
ko: 게시 Branch
ru: Опубликовать Branch

# scm button publish branch running
source: Publishing Branch...
es: Publicando Branch...
ko: 게시 Branch...
ru: Публикация Branch...

# scm button sync description
source: {0} Sync Changes{1}{2}
ko: {0} 변경 내용 동기화 {1}{2}
ru: {0} Синхронизировать изменения{1}{2}

# scm publish branch action button title
source: {0} Publish Branch
ko: {0} Branch 게시
ru: {0} Опубликовать Branch

# scm secondary button commit
source: Commit
ko: 커밋
ru: Фиксация

# syncing changes
source: Synchronizing Changes...
es: Sincronizando cambios...
fr: Synchronisation des modifications...
ko: 변경 내용을 동기화하는 중...
ru: Синхронизация изменений...
zh_hans: 正在同步更改...

# missOrInvalid
source: Missing or invalid credentials.
es: Faltan las credenciales o no son válidas.
fr: Informations d'identification manquantes ou non valides.
ko: 자격 증명이 없거나 잘못되었습니다.
ru: Учетные данные отсутствуют или недопустимы.
zh_hans: 凭据丢失或无效。

source: No
fr: Non
ko: 아니요
ru: Нет
zh_hans: 否

# not now
source: Ask Me Later
es: Preguntarme luego
fr: Me demander plus tard
ko: 나중에 물어보기
ru: Спросить меня позже
zh_hans: 稍后询问

# suggest auto fetch
source: Would you like Azure Data Studio to [periodically run 'git fetch']({0})?
es: ¿Desea que Azure Data Studio [ejecute periódicamente 'git fetch']({0})?
fr: Souhaitez-vous qu’Azure Data Studio [exécute périodiquement 'git fetch']({0}) ?
ko: Azure Data Studio에서 [주기적으로 'git fetch'를 실행]({0})하시겠습니까?
ru: Вы хотите, чтобы средство Azure Data Studio [периодически запускало \"git fetch\"]({0})?
zh_hans: 是否希望 Azure Data Studio [定期运行 “git fetch”]({0})?

source: Yes
es: Sí
fr: Oui
ko: 예
ru: Да
zh_hans: 是

# HEAD not available
source: HEAD version of '{0}' is not available.
es: La versión HEAD de '{0}' no está disponible.
fr: La version HEAD de '{0}' n'est pas disponible.
ko: '{0}'의 HEAD 버전이 없습니다.
ru: Версия HEAD '{0}' недоступна.
zh_hans: “{0}”的 HEAD 版本不可用。

source: Theirs
ko: 다른 사용자들의 항목
ru: Их

source: Yours
ko: 사용자 버전
ru: Ваш

# add
source: Add to Workspace
es: Añadir al área de trabajo
fr: Ajouter à l'espace de travail
ko: 작업 영역에 추가
ru: Добавить в рабочую область
zh_hans: 添加到工作区

# add remote
source: Add a new remote...
es: Agregar un nuevo remoto...
fr: Ajoutez une nouvelle machine distante...
ko: 새 원격 추가...
ru: Добавить новый удаленный репозиторий...
zh_hans: 添加一个新远程...

# addFrom
source: Add remote from URL
es: Agregar remoto desde dirección URL
fr: Ajouter un dépôt distant à partir d'une URL
ko: URL에서 원격 추가
ru: Добавить удаленный репозиторий по URL-адресу
zh_hans: 从 URL 添加远程存储库

# addfrom
source: Add remote from {0}
es: Agregar remoto desde {0}
fr: Ajouter un dépôt distant à partir de {0}
ko: {0}에서 원격 추가
ru: Добавить удаленный репозиторий из {0}
zh_hans: 从 {0} 添加远程存储库

source: Add Remote
es: Agregar remoto
fr: Ajouter un dépôt distant
ko: 원격 추가
ru: Добавить удаленный репозиторий
zh_hans: 添加远程存储库

source: Always
es: Siempre
fr: Toujours
ko: 항상
ru: Всегда
zh_hans: 总是

# are you sure
source: This will create a Git repository in '{0}'. Are you sure you want to continue?
es: Esto creará un repositorio Git en '{0}'. ¿Está seguro de que desea continuar?
fr: Ceci va créer un dépôt Git dans '{0}'. Êtes-vous sûr de vouloir continuer ?
ko: '{0}'에서 Git 리포지토리가 만들어집니다. 계속하시겠습니까?
ru: В '{0}' будет создан репозиторий Git. Вы действительно хотите продолжить?
zh_hans: 将在“{0}”中创建 Git 存储库。确定要继续吗？

# auth failed
source: Failed to authenticate to git remote.
es: No se pudo autenticar en GIT remoto.
fr: Échec de l'authentification auprès de git remote.
ko: git remote에 인증하지 못했습니다.
ru: Не удалось выполнить проверку подлинности в удаленном Git.
zh_hans: 未能对 git remote 进行身份验证。

# auth failed specific
source: Failed to authenticate to git remote: {0}
es: No se pudo autenticar en GIT remoto: {0}
fr: Échec de l'authentification auprès du dépôt distant Git : {0}
ko: 원격 Git에 인증하지 못했습니다. {0}
ru: Не удалось выполнить проверку подлинности в удаленном репозитории Git: {0}
zh_hans: 未能对 git remote 进行身份验证: {0}

# branch already exists
source: A branch named '{0}' already exists
es: Ya existe una rama como '{0}'
fr: Une branche nommée '{0}' existe déjà
ko: 이름이 '{0}'인 분기가 이미 있습니다.
ru: Ветви с именем '{0}' уже существует
zh_hans: 已存在名为“{0}”的分支

source: Branch name
es: Nombre de rama
fr: Nom de la branche
ko: 분기 이름
ru: Имя ветви
zh_hans: 分支名称

# branch name does not match sanitized
source: The new branch will be '{0}'
ko: 새 브랜치는 '{0}'입니다.
ru: Новая ветвь будет "{0}"

# branch name format invalid
source: Branch name needs to match regex: {0}
es: El nombre de la rama debe coincidir con la regex: {0}
fr: Le nom de la branche doit correspondre à la regex : {0}
ko: 분기 이름은 regex {0}과(와) 일치해야 합니다.
ru: Имя ветви должно соответствовать регулярному выражению: {0}
zh_hans: 分支名称必须匹配正则表达式: {0}

# cant push
source: Can't push refs to remote. Try running 'Pull' first to integrate your changes.
es: No se pueden enviar referencias al remoto. Intenta ejecutar 'Pull' primero para integrar tus cambios.
fr: impossible de pousser les références vers la branche distante. Exécutez d'abord 'Récupérer' pour intégrer vos modifications.
ko: 참조를 원격에 푸시할 수 없습니다. 먼저 '풀'을 실행하여 변경 내용을 통합하세요.
ru: Не удается отправить ссылки в удаленный репозиторий. Сначала запустите операцию извлечения, чтобы интегрировать изменения.
zh_hans: 无法推送 refs 到远端。您可以试着运行“拉取”功能，整合您的更改。

source: Checkout detached...
es: Extracción del repositorio desasociada...
fr: Extraire en mode détaché...
ko: 체크 아웃 분리됨...
ru: Извлечение в отключенном режиме...
zh_hans: 签出已分离…

# choose
source: Choose Folder...
es: Elegir carpeta...
fr: Choisir un dossier...
ko: 폴더 선택...
ru: Выбрать папку...
zh_hans: 选择文件夹...

# clean repo
source: Please clean your repository working tree before checkout.
es: Limpie el árbol de trabajo del repositorio antes de la desprotección.
fr: Nettoyez l'arborescence de travail de votre dépôt avant l'extraction.
ko: 체크 아웃하기 전에 리포지토리 작업 트리를 정리하세요.
ru: Очистите рабочее дерево репозитория перед извлечением.
zh_hans: 在签出前，请清理存储库工作树。

# clonefrom
source: Clone from {0}
es: Clonar desde {0}
fr: Cloner à partir de {0}
ko: {0}에서 복제
ru: Клонировать из {0}
zh_hans: 从 {0} 克隆

# cloning
source: Cloning git repository '{0}'...
es: Clonando el repositorio git '{0}'...
fr: Clonage du dépôt Git '{0}'...
ko: Git 리포지토리 '{0}'을(를) 복제하는 중...
ru: Клонирование репозитория Git \"{0}\"...
zh_hans: 正在克隆 Git 存储库“{0}”...

# commit
source: Commit Staged Changes
es: Confirmar los cambios preparados
fr: Commiter les changements indexés
ko: 스테이징된 변경 사항 커밋
ru: Зафиксировать подготовленные изменения
zh_hans: 提交暂存更改

# commit anyway
source: Create Empty Commit
es: Crear una confirmación vacía
fr: Créer un commit vide
ko: 빈 커밋 만들기
ru: Создать пустую фиксацию
zh_hans: 创建空提交

# commit changes
source: Commit Anyway
ko: 커밋 진행
ru: Все равно зафиксировать

source: Commit Hash
es: Hash de confirmación
fr: Commiter le code de hachage
ko: 커밋 해시
ru: Хэш фиксации
zh_hans: 提交哈希

source: Commit message
es: Mensaje de confirmación
fr: Message de validation
ko: 커밋 메시지
ru: Сообщение о фиксации
zh_hans: 提交消息

# commit to branch
source: Commit to a New Branch
ko: 새 브랜치에 커밋
ru: Зафиксировать в новой ветви

# commitMessageWithHeadLabel2
source: Message (commit on '{0}')
es: Mensaje (confirmar en \"{0}\")
fr: Message (commit sur '{0}')
ko: 메시지('{0}'에서 커밋)
ru: Сообщение (фиксация: \"{0}\")
zh_hans: 消息(在“{0}”上提交)

# confirm branch protection commit
source: You are trying to commit to a protected branch and you might not have permission to push your commits to the remote. How would you like to proceed?
ko: 보호된 브랜치에 커밋하려고 하며 커밋을 원격으로 푸시할 수 있는 권한이 없을 수 있습니다. 어떻게 진행하시겠습니까?
ru: Вы пытаетесь выполнить фиксацию в защищенной ветви. Возможно, у вас нет разрешения на отправку фиксаций в удаленный репозиторий. Какое действие необходимо выполнить?

# confirm delete
source: Are you sure you want to DELETE {0}? This is IRREVERSIBLE! This file will be FOREVER LOST if you proceed.
es: ¿Seguro que quiere ELIMINAR {0}? Esta acción es IRREVERSIBLE. Si continúa, este archivo SE PERDERÁ PARA SIEMPRE.
fr: Voulez-vous vraiment SUPPRIMER {0} ? Cette action est IRRÉVERSIBLE ! Ce fichier sera DÉFINITIVEMENT PERDU si vous continuez.
ko: {0}을(를) 삭제하시겠습니까? 이 작업은 취소할 수 없습니다! 계속하면 이 파일이 영구적으로 손실됩니다.
ru: Вы действительно хотите удалить файл {0}? Эта операция является необратимой! Восстановить этот файл будет невозможно.
zh_hans: 确定要删除 {0} 吗? 此操作不可撤消! 如果继续操作，此文件将永久丢失。

# confirm delete multiple
source: Are you sure you want to DELETE {0} files? This is IRREVERSIBLE! These files will be FOREVER LOST if you proceed.
es: ¿Seguro que quiere ELIMINAR {0} archivos? Esta acción es IRREVERSIBLE. Si continúa, los archivos SE PERDERÁN PARA SIEMPRE.
fr: Voulez-vous vraiment SUPPRIMER {0} fichiers ? Cette action est IRRÉVERSIBLE ! Ces fichiers seront DÉFINITIVEMENT PERDUS si vous continuez.
ko: 파일 {0}개를 삭제하시겠습니까? 이 작업은 취소할 수 없습니다! 계속하면 해당 파일이 영구적으로 손실됩니다.
ru: Вы действительно хотите удалить файлы ({0})? Эта операция является необратимой! Восстановить эти файлы будет невозможно.
zh_hans: 确定要删除 {0} 个文件吗? 此操作不可撤消! 如果继续操作，这些文件将永久丢失。

# confirm discard
source: Are you sure you want to discard changes in {0}?
es: ¿Está seguro de que quiere descartar los cambios de {0}?
fr: Voulez-vous vraiment abandonner les changements apportés à {0} ?
ko: {0}의 변경 내용을 취소하시겠습니까?
ru: Вы действительно хотите отменить изменения в {0}?
zh_hans: 确定要放弃 {0} 中更改吗?

# confirm discard all
source: Are you sure you want to discard ALL changes in {0} files? This is IRREVERSIBLE! Your current working set will be FOREVER LOST if you proceed.
es: ¿Seguro que quiere descartar TODOS los cambios en {0} archivos? Esta acción es IRREVERSIBLE. Si continúa, su espacio de trabajo actual SE PERDERÁ PARA SIEMPRE.
fr: Voulez-vous vraiment abandonner TOUS les changements apportés à {0} fichiers ? Cette action est IRRÉVERSIBLE ! Votre plage de travail actuelle sera DÉFINITIVEMENT PERDUE si vous continuez.
ko: 파일 {0}개의 변경 내용을 모두 취소하시겠습니까? 이 작업은 취소할 수 없습니다! 계속하면 현재 작업 집합이 영구적으로 손실됩니다.
ru: Вы действительно хотите отменить все изменения в файлах ({0})? Эта операция является необратимой! Восстановить ваш текущий набор изменений будет невозможно.
zh_hans: 确定要放弃在 {0} 个文件中所作的全部更改吗? 此操作不可撤消! 如果继续操作，你当前的工作集将永久丢失。

# confirm discard all 2
source: {0} This is IRREVERSIBLE, your current working set will be FOREVER LOST.
es: {0} Esta acción es IRREVERSIBLE. Su espacio de trabajo actual SE PERDERÁ PARA SIEMPRE.
fr: {0} Cette action est IRRÉVERSIBLE, votre plage de travail actuelle sera DÉFINITIVEMENT PERDUE.
ko: {0} 이 작업은 되돌릴 수 없으며, 현재 작업 집합이 영구적으로 손실됩니다.
ru: {0} Отменить эту операцию будет НЕВОЗМОЖНО, ваш текущий рабочий набор БУДЕТ УТЕРЯН.
zh_hans: {0} 此操作不可撤消，你当前的工作集将永久丢失。

# confirm discard all single
source: Are you sure you want to discard changes in {0}?
es: ¿Está seguro de que quiere descartar los cambios de {0}?
fr: Voulez-vous vraiment abandonner les changements apportés à {0} ?
ko: {0}의 변경 내용을 취소하시겠습니까?
ru: Вы действительно хотите отменить изменения в {0}?
zh_hans: 确定要放弃 {0} 中更改吗?

# confirm discard multiple
source: Are you sure you want to discard changes in {0} files?
es: ¿Está seguro de que quiere descartar los cambios de {0} archivos?
fr: Voulez-vous vraiment abandonner les changements apportés à {0} fichiers ?
ko: {0}개 파일의 변경 내용을 취소하시겠습니까?
ru: Вы действительно хотите отменить изменения в файлах ({0})?
zh_hans: 是否确实要放弃 {0} 文件中的更改?

# confirm empty commit
source: Are you sure you want to create an empty commit?
ko: 빈 커밋을 만드시겠습니까?
ru: Вы действительно хотите создать пустую фиксацию?

# confirm force delete branch
source: The branch '{0}' is not fully merged. Delete anyway?
es: La rama '{0}' no está completamente fusionada. ¿Borrarla de todas formas?
fr: La branche '{0}' n'est pas complètement fusionnée. Supprimer quand même ?
ko: '{0}' 분기가 완벽히 병합되지 않았습니다. 그래도 삭제할까요?
ru: Ветвь '{0}' объединена не полностью. Удалить ее?
zh_hans: “{0}”分支未被完全合并。是否仍要删除？

# confirm force push
source: You are about to force push your changes, this can be destructive and could inadvertently overwrite changes made by others. Are you sure to continue?
es: Está a punto de forzar sus cambios, esto puede ser destructivo y podría sobrescribir inadvertidamente los cambios realizados por otros. ¿Está seguro de continuar?
fr: Vous êtes sur le point de forcer l'envoi (push) des changements que vous avez apportés. Cela peut être destructeur et remplacer par inadvertance les changements apportés par d'autres utilisateurs. Voulez-vous vraiment continuer ?
ko: 변경 내용을 강제로 푸시하려고 합니다. 이렇게 하면 다른 사람의 변경 내용을 무시하거나 의도하지 않게 덮어쓸 수 있습니다. 계속하시겠습니까?
ru: Вы собираетесь принудительно отправить ваши изменения. Это может привести к деструктивным изменениям и к непреднамеренной перезаписи изменений, внесенных другими пользователями. Вы действительно хотите продолжить?
zh_hans: 即将强制推送更改，此操作可能具有破坏性并可能在无意中覆盖其他人的更改。 确定要继续吗?

# confirm no verify commit
source: You are about to commit your changes without verification, this skips pre-commit hooks and can be undesirable. Are you sure to continue?
es: Está a punto de confirmar los cambios sin comprobación, lo que omite los enlaces previos a la confirmación y puede no ser deseable. ¿Seguro que quiere continuar?
fr: Vous êtes sur le point de commiter vos changements sans vérification. Cela signifie que les crochets pre-commit vont être ignorés, ce qui n'est peut-être pas souhaitable. Voulez-vous vraiment continuer ?
ko: 확인 없이 변경 내용을 커밋하려고 합니다. 그러면 pre-commit 후크를 건너뛰고 바람직하지 않을 수 있습니다. 계속하시겠습니까?
ru: Вы собираетесь зафиксировать изменения без проверки. Перехватчики перед фиксацией будут пропущены, что может быть нежелательным. Продолжить?
zh_hans: 你即将在未验证的情况下提交更改，这会跳过 pre-commit 挂钩，可能导致不理想的结果。 确定要继续吗?

# confirm publish branch
source: The branch '{0}' has no remote branch. Would you like to publish this branch?
es: La rama '{0}' no tiene ninguna rama remota. ¿Quiere publicar esta rama?
ko: '{0}' 분기에 원격 분기가 없습니다. 이 분기를 게시하시겠습니까?
ru: В ветви "{0}" отсутствует удаленная ветвь. Опубликовать эту ветвь?

# confirm restore
source: Are you sure you want to restore {0}?
es: ¿Está seguro de que desea restaurar {0}?
fr: Êtes-vous sûr de vouloir restaurer {0} ?
ko: {0}을(를) 복원하시겠습니까?
ru: Вы действительно хотите восстановить {0}?
zh_hans: 是否确实要还原 {0}?

# confirm restore multiple
source: Are you sure you want to restore {0} files?
es: ¿Está seguro de que desea restaurar {0} archivos?
fr: Êtes-vous sûr de vouloir restaurer les fichiers {0} ?
ko: {0}개 파일을 복원하겠습니까?
ru: Вы действительно хотите восстановить файлы ({0})?
zh_hans: 是否确定要还原 {0} 个文件?

# confirm stage file with merge conflicts
source: Are you sure you want to stage {0} with merge conflicts?
es: ¿Está seguro de que quiere hacer una copia intermedia de {0} con conflictos de fusión mediante combinación?
fr: Voulez-vous vraiment créer {0} avec des conflits de fusion ?
ko: 병합 충돌이 있는 {0}을(를) 스테이징하시겠습니까?
ru: Вы действительно хотите проиндексировать {0} с конфликтами слияния?
zh_hans: 确定要暂存含有合并冲突的 {0} 吗?

# confirm stage files with merge conflicts
source: Are you sure you want to stage {0} files with merge conflicts?
es: ¿Está seguro de que quiere hacer una copia intermedia de {0} archivos con conflictos de fusión mediante combinación?
fr: Voulez-vous vraiment créer {0} fichiers avec des conflits de fusion ?
ko: 병합 충돌이 있는 {0} 파일을 스테이징하시겠습니까?
ru: Вы действительно хотите проиндексировать файлы ({0}) с конфликтами слияния?
zh_hans: 确定要暂存含有合并冲突的 {0} 个文件吗?

# create branch
source: Create new branch...
es: Crear rama...
fr: Créez une branche...
ko: 새 분기 만들기...
ru: Создание новой ветви...
zh_hans: 正在创建新分支...

# create branch from
source: Create new branch from...
es: Crear rama a partir de...
fr: Créez une branche à partir de...
ko: 에서 새 분기 만들기...
ru: Создание новой ветви из...
zh_hans: 从...创建分支

# create repo
source: Initialize Repository
es: Inicializar el repositorio
fr: Initialiser le dépôt
ko: 리포지토리 초기화
ru: Инициализировать репозиторий
zh_hans: 初始化存储库

source: Current
es: Actual
fr: Actuelle
ko: 현재
ru: Текущая
zh_hans: 当前

source: Default
ko: 기본값
ru: По умолчанию

# delete
source: Delete File
es: Eliminar archivo
fr: Supprimer le fichier
ko: 파일 삭제
ru: Удалить файл
zh_hans: 删除文件

source: Delete Branch
es: Borrar rama
fr: Supprimer la branche
ko: 분기 삭제
ru: Удалить ветвь
zh_hans: 删除分支

source: Delete file
es: Eliminar archivo
fr: Supprimer le fichier
ko: 파일 삭제
ru: Удалить файл
zh_hans: 删除文件

source: Delete Files
es: Eliminar archivos
fr: Supprimer les fichiers
ko: 파일 삭제
ru: Удалить файлы
zh_hans: 删除文件

# deleted by them
source: File '{0}' was deleted by them and modified by us. What would you like to do?
es: El archivo \"{0}\" fue borrado por ellos y modificado por nosotros. ¿Qué desea hacer?
fr: Ils ont supprimé le fichier '{0}', et nous l'avons modifié. Que voulez-vous faire ?
ko: 다른 사용자가 삭제한 '{0}' 파일을 Microsoft에서 수정했습니다. 원하는 작업을 선택하세요.
ru: Файл \"{0}\" был удален ими и изменен нами. Что вы хотели бы сделать?
zh_hans: 文件“{0}”已被他们删除且已经过我们修改。 你想要执行什么操作?

# deleted by us
source: File '{0}' was deleted by us and modified by them. What would you like to do?
es: El archivo \"{0}\" fue borrado por nosotros y modificado por ellos. ¿Qué desea hacer?
fr: Nous avons supprimé le fichier '{0}', et ils l'ont supprimé. Que voulez-vous faire ?
ko: 본인이 '{0}' 파일을 삭제하고 타인이 수정했습니다. 수행하고 싶은 작업을 선택하세요.
ru: Файл \"{0}\" был удален нами и изменен ими. Что вы хотели бы сделать?
zh_hans: 文件“{0}”已被我们删除且已经过他们修改。 你想要执行什么操作?

# discard
source: Discard Changes
es: Descartar cambios
fr: Ignorer les modifications
ko: 변경 내용 취소
ru: Отменить изменения
zh_hans: 放弃更改

# discardAll
source: Discard All {0} Files
es: Descartar todos los archivos ({0})
fr: Ignorer les {0} fichiers
ko: {0}개 파일 모두 버리기
ru: Отменить изменения во всех файлах ({0})
zh_hans: 放弃所有 {0} 个文件

# discardAll multiple
source: Discard 1 File
es: Descartar un archivo
fr: Abandonner 1 fichier
ko: 1개 파일 취소
ru: Отменить изменения в одном файле
zh_hans: 放弃 1 个文件

# drop all stashes
source: Are you sure you want to drop ALL stashes? There are {0} stashes that will be subject to pruning, and MAY BE IMPOSSIBLE TO RECOVER.
es: ¿Está seguro de que quiere quitar TODOS los cambios guardados provisionalmente? Hay {0} cambios guardados provisionalmente que estarán sujetos a eliminación y PUEDEN SER IMPOSIBLES DE RECUPERAR.
ko: 모든 스태시를 삭제하시겠습니까? 정리 대상이 될 스태시가 {0}개 있으며 복구가 불가능할 수 있습니다.
ru: Вы действительно хотите удалить все спрятанные записи? Имеется {0} записей, которые будут удалены, и ИХ ВОССТАНОВЛЕНИЕ МОЖЕТ БЫТЬ НЕВОЗМОЖНО.

# drop one stash
source: Are you sure you want to drop ALL stashes? There is 1 stash that will be subject to pruning, and MAY BE IMPOSSIBLE TO RECOVER.
es: ¿Está seguro de que quiere quitar TODOS los cambios guardados provisionalmente? Hay 1 cambio guardado provisionalmente que estará sujeto a eliminación y PUEDE SER IMPOSIBLES DE RECUPERAR.
ko: 모든 스태시를 삭제하시겠습니까? 정리 대상이 될 스태시가 1개 있으며 복구가 불가능할 수 있습니다.
ru: Вы действительно хотите удалить все спрятанные записи? Имеется 1 запись, которая будут удалена, и ЕЕ ВОССТАНОВЛЕНИЕ МОЖЕТ БЫТЬ НЕВОЗМОЖНО.

# empty commit
source: Commit operation was cancelled due to empty commit message.
ko: 커밋 메시지가 비어 있어 커밋 작업이 취소되었습니다.
ru: Операция фиксации была отменена из-за пустого сообщения фиксации.

# force
source: Force Checkout
es: Forzar extracción del repositorio
fr: Forcer l'extraction
ko: 강제 체크 아웃
ru: Принудительное извлечение
zh_hans: 强制签出

# force push not allowed
source: Force push is not allowed, please enable it with the 'git.allowForcePush' setting.
es: No está permitida inserción forzosa, habilite esta opción con la opción \"git.allowForcePush\".
fr: Force push n’est pas autorisé, veuillez l’activer avec le paramètre 'git.allowForcePush'.
ko: 강제 푸시가 허용되지 않습니다. 'git.allowForcePush' 설정으로 사용하도록 설정하세요.
ru: Принудительная отправка не разрешена. Включите ее, установив параметр \"git.allowForcePush\".
zh_hans: 不允许强制推送，请启用 “git. allowForcePush” 设置。

source: Git error
es: Error de GIT
fr: Erreur Git
ko: Git 오류
ru: Ошибка Git
zh_hans: Git 错误

# git.timeline.openDiffCommand
source: Open Comparison
es: Abrir comparación
ko: 비교 열기
ru: Открыть сравнение

# git.title.index
source: {0} (Index)
es: {0} (índice)
ko: {0}(인덱스)
ru: {0} (индекс)
zh_hans: {0} (索引)

# git.title.workingTree
source: {0} (Working Tree)
es: {0} (árbol de trabajo)
fr: {0} (Arborescence de travail)
ko: {0}(작업 트리)
ru: {0} (Рабочее дерево)
zh_hans: {0} (工作树)

# init
source: Pick workspace folder to initialize git repo in
es: Seleccione una carpeta de área de trabajo en la que inicializar el repositorio de git
fr: Choisir le dossier d’espace de travail dans lequel initialiser le dépôt git
ko: Git 리포지토리를 초기화할 작업 영역 폴더 선택
ru: Выберите папку рабочей области для инициализации репозитория Git
zh_hans: 选择用于初始化 Git 储存库的工作区文件夹

# init repo
source: Initialize Repository
es: Inicializar el repositorio
fr: Initialiser le dépôt
ko: 리포지토리 초기화
ru: Инициализировать репозиторий
zh_hans: 初始化存储库

source: Invalid branch name
es: Nombre de rama no válido
fr: Nom de branche non valide
ko: 잘못된 분기 이름
ru: Недопустимое имя ветви
zh_hans: 分支名称无效

# keep ours
source: Keep Our Version
es: Mantener nuestra versión
fr: Conserver notre version
ko: 현재 버전 유지
ru: Сохранить нашу версию
zh_hans: 保留“我们”的版本

# keep theirs
source: Keep Their Version
es: Mantener la versión de ellos
fr: Conserver leur version
ko: 다른 사용자 버전 유지
ru: Сохранить их версию
zh_hans: 保留“他们”的版本

source: Learn More
es: Más información
fr: En savoir plus
ko: 자세한 정보
ru: Дополнительные сведения
zh_hans: 了解详细信息
