Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/git.*.xlf
Languages: es, fr, ko, ru, zh_hans

# config.countBadge.all
source: Count all changes.
es: Recuento de todos los cambios.
fr: Compter tous les changements.
ko: 모든 변경 내용을 계산합니다.
ru: Учитывать все изменения.
zh_hans: 对所有更改计数。

# config.countBadge.off
source: Turn off counter.
es: Desactive el contador.
fr: Désactivez le compteur.
ko: 카운터를 끕니다.
ru: Отключить счетчик.
zh_hans: 关闭计数器。

# config.countBadge.tracked
source: Count only tracked changes.
es: Recuento solo de los cambios de los que se ha realizado seguimiento.
fr: Compter uniquement les changements suivis.
ko: 추적된 변경 내용만 계산합니다.
ru: Учитывать только отслеживаемые изменения.
zh_hans: 仅对跟踪的更改计数。

# config.decorations.enabled
source: Controls whether Git contributes colors and badges to the Explorer and the Open Editors view.
es: Controla si GIT aporta colores y distintivos al explorador y a la vista Editores abiertos.
fr: Contrôle si Git contribue aux couleurs et aux badges de l'Explorateur et de la vue Éditeurs ouverts.
ko: Git에서 색과 배지를 탐색기와 열려 있는 편집기 뷰에 적용하는지 여부를 제어합니다.
ru: Управляет тем, используются ли цвета и эмблемы Git в Проводнике и в представлении открытых редакторов.
zh_hans: 控制 Git 是否在资源管理器和“打开编辑器”视图中添加颜色和小标。

# config.defaultCloneDirectory
source: The default location to clone a git repository.
es: La ubicación predeterminada en la que se clona un repositorio de GIT.
fr: Emplacement par défaut où cloner un dépôt git.
ko: Git 리포지토리를 복제할 기본 위치입니다.
ru: Расположение по умолчанию, в которое будет клонирован репозиторий Git.
zh_hans: 克隆 Git 存储库的默认位置。

# config.detectSubmodules
source: Controls whether to automatically detect git submodules.
es: Controla si se detectan automáticamente los submódulos Git.
fr: Contrôle s’il faut détecter automatiquement les sous-modules git.
ko: Git 하위 모듈을 자동으로 검색할지 여부를 제어합니다.
ru: Определяет, следует ли автоматически определять подмодули Git.
zh_hans: 控制是否自动检测 Git 子模块。

# config.detectSubmodulesLimit
source: Controls the limit of git submodules detected.
es: Controla el límite de submódulos de git detectados.
fr: Contrôle la limite de sous-modules git détectés.
ko: Git submodules 검출 개수의 제한을 제어합니다.
ru: Управляет ограничением на количество обнаруженных подмодулей Git.
zh_hans: 控制可检测到的 Git 子模块的限制。

# config.discardAllScope
source: Controls what changes are discarded by the `Discard all changes` command. `all` discards all changes. `tracked` discards only tracked files. `prompt` shows a prompt dialog every time the action is run.
es: Controla qué cambios son descartados por el comando 'Descartar todos los cambios'. 'all' descarta todos los cambios. 'tracked' descarta sólo los ficheros en seguimiento. 'prompt' muestra un cuadro de diálogo para confirmar cada vez la acción ejecutada.
fr: Contrôle les modifications ignorées par la commande 'Ignorer toutes les modifications'. 'all' ignore toutes les modifications. 'tracked' ignore uniquement les fichiers suivis. 'prompt' affiche un message d'invite chaque fois que l’action est exécutée.
ko: `모든 변경 내용 취소` 명령으로 취소되는 변경 내용을 제어합니다. `all`이면 모든 변경 내용을 취소합니다. `tracked`이면 추적된 파일만 취소합니다. `prompt`이면 작업을 실행할 때마다 프롬프트 대화 상자를 표시합니다.
ru: Определяет, какие изменения отменяются с помощью команды `Отменить все изменения`. При значении `all` отменяются все изменения, при значении `tracked` отменяются изменения только в отслеживаемых файлах, при значении `prompt` выдается запрос подтверждения каждый раз при выполнении действия.
zh_hans: 控制 `Discard all changes` 命命令将放弃哪些更改。`all` 放弃所有更改。`tracked` 仅放弃跟踪的文件。`prompt` 则在每次运行此操作时显示提示对话框。

# config.enableCommitSigning
source: Enables commit signing with GPG or X.509.
es: Habilita la firma de confirmaciones con GPG o X.509.
fr: Active la signature de commit avec GPG ou X.509.
ko: GPG 또는 X.509로 서명 커밋을 사용합니다.
ru: Разрешает подписывание фиксаций с использованием GPG или X.509.
zh_hans: 使用 GPG 或 x.509 启用提交签名。

# config.enableSmartCommit
source: Commit all changes when there are no staged changes.
es: Confirmar todos los cambios cuando no hay elementos almacenados provisionalmente.
fr: Validez toutes les modifications en l'absence de modifications en attente.
ko: 단계적 변경 사항이 없는 경우 모든 변경 사항을 저장합니다.
ru: Делать коммит из всех изменений, когда нет изменений в индексе.
zh_hans: 在没有暂存的更改时提交所有更改。

# config.enableStatusBarSync
source: Controls whether the Git Sync command appears in the status bar.
es: Controla si el comando Git Sync aparece en la barra de estado.
fr: Contrôle si la commande Git Sync apparaît dans la barre d'état.
ko: Git Sync 명령이 상태 표시줄에 표시되는지 여부를 제어합니다.
ru: Определяет, отображается ли команда синхронизации Git в строке состояния.
zh_hans: 控制Git Sync命令是否出现在状态栏中。

# config.enabled
source: Whether git is enabled.
es: Si GIT está habilitado.
fr: Indique si git est activé.
ko: Git을 사용하도록 설정했는지 여부입니다.
ru: Определяет, включен ли git.
zh_hans: 是否启用 Git。

# config.experimental.installGuide
source: Experimental improvements for the git setup flow.
es: Mejoras experimentales para el flujo de configuración de Git.
ko: Git 설정 흐름에 대한 실험적 개선 사항입니다.
ru: Экспериментальные улучшения для потока настройки Git.

# config.fetchOnPull
source: When enabled, fetch all branches when pulling. Otherwise, fetch just the current one.
es: Cuando esté activado, obtenga todas las ramas al insertar. De lo contrario, obtenga solo la actual.
fr: Si activé, récupère toutes les branches au tirage. Sinon, récupère seulement la branche actuelle.
ko: 사용하도록 설정하면 풀할 때 모든 분기를 페치합니다. 그렇지 않으면 현재 분기만 페치합니다.
ru: Если параметр включен, то при вытягивании получаются все ветви. В противном случае получается только текущая ветвь.
zh_hans: 启用后，在拉取时获取所有分支。否则，仅获取当前。

# config.followTagsWhenSync
source: Follow push all tags when running the sync command.
es: Siga las etiquetas insertar todas cuando ejecute el comando de sincronización.
fr: Suit l'envoi (push) de toutes les étiquettes au moment de l'exécution de la commande de synchronisation.
ko: 동기화 명령을 실행할 때 모든 푸시 태그를 팔로우합니다.
ru: Отправка всех тегов при выполнении команды синхронизации.
zh_hans: 遵循“运行同步命令时推送所有标记”。

# config.ignoreLegacyWarning
source: Ignores the legacy Git warning.
es: Ignora las advertencias hereradas de GIT.
fr: Ignore l'avertissement Git hérité.
ko: 레거시 Git 경고를 무시합니다.
ru: Игнорирует предупреждение об устаревшей версии Git.
zh_hans: 忽略“旧版 Git”警告。

# config.ignoreLimitWarning
source: Ignores the warning when there are too many changes in a repository.
es: Ignora la advertencia cuando hay demasiados cambios en un repositorio.
fr: Ignore l'avertissement en cas de changements trop nombreux dans un dépôt.
ko: 리포지토리에 변경 내용이 너무 많으면 경고를 무시합니다.
ru: Игнорирует предупреждение о том, что в репозитории слишком много изменений.
zh_hans: 忽略“存储库中存在大量更改”的警告。

# config.ignoreMissingGitWarning
source: Ignores the warning when Git is missing.
es: Ignora la advertencia cuando falta Git.
fr: Ignore l'avertissement quand Git est manquant.
ko: Git이 없으면 경고를 무시합니다.
ru: Игнорирует предупреждение об отсутствии Git.
zh_hans: 忽略“缺失 Git”的警告。

# config.ignoreRebaseWarning
source: Ignores the warning when it looks like the branch might have been rebased when pulling.
es: Ignora la advertencia cuando parece que la rama podría haber sido reorganizada al extraerla.
fr: Ignore l'avertissement quand il semble que la branche ait été rebasée au moment du tirage (pull).
ko: 풀할 때 분기가 다시 지정된 것 같은 경우 경고를 무시합니다.
ru: Пропускает предупреждение, если изменения ветви могли быть перемещены в другую ветвь при получении.
zh_hans: 忽略拉取时发出的分支似乎已变基的警告。

# config.ignoreSubmodules
source: Ignore modifications to submodules in the file tree.
es: Ignore las modificaciones de los submódulos en el árbol de archivos.
fr: Ignore les modifications apportées aux sous-modules dans l'arborescence de fichiers.
ko: 파일 트리의 하위 모듈 수정 내용을 무시합니다.
ru: Игнорировать изменения подмодулей в дереве файлов.
zh_hans: 忽略对文件树中子模块的修改。

# config.ignoreWindowsGit27Warning
source: Ignores the warning when Git 2.25 - 2.26 is installed on Windows.
es: Ignora la advertencia cuando Git 2.25 - 2.26 está instalado en Windows.
fr: Ignore l'avertissement lorsque Git 2.25 - 2.26 est installé sur Windows.
ko: Windows에 Git 2.25~007E;2.26이 설치되어 있는 경우 경고를 무시합니다.
ru: Игнорирует предупреждение, если в Windows установлен Git версий 2.25–2.26.
zh_hans: 如果 Windows 上安装了 Git 2.25 - 2.26，则忽略警告。

# config.ignoredRepositories
source: List of git repositories to ignore.
es: Lista de repositorios GIT que se van a ignorar.
fr: Liste des dépôts git à ignorer.
ko: 무시할 Git 리포지토리의 목록입니다.
ru: Список репозиториев Git, которые будут проигнорированы.
zh_hans: 要忽略的 Git 存储库列表。

# config.inputValidation
source: Controls when to show commit message input validation.
es: Controla cuándo mostrar el mensaje de validación de entrada en el contador de entrada.
fr: Contrôle quand afficher la validation de la saisie du message de commit.
ko: 커밋 메시지 입력 유효성 검사를 언제 표시할지 제어합니다.
ru: Определяет, как производить проверку введенного сообщения коммита.
zh_hans: 控制何时显示提交消息输入验证。

# config.inputValidationLength
source: Controls the commit message length threshold for showing a warning.
es: Controla el umbral de longitud de mensaje de confirmación para mostrar una advertencia.
fr: Contrôle le taille de la longueur de message de commit pour afficher un avertissement.
ko: 경고 표시를 위한 커밋 메시지 길이 임계값을 제어합니다.
ru: Определяет максимальную длину сообщения коммита, при превышении которой будет выдано предупреждение.
zh_hans: 控制显示提交消息长度警告的长度阈值。

# config.inputValidationSubjectLength
source: Controls the commit message subject length threshold for showing a warning. Unset it to inherit the value of `config.inputValidationLength`.
es: Controla el umbral de longitud del asunto del mensaje de confirmación para mostrar una advertencia. Desactívelo para heredar el valor de \"config.inputValidationLength\".
fr: Contrôle le seuil de longueur de l'objet du message de validation pour afficher un avertissement. Annulez pour hériter la valeur de 'config.inputValidationLength'.
ko: 경고 표시를 위한 커밋 메시지 제목 길이 임계값을 제어합니다. `config.inputValidationLength` 값을 상속하려면 이 임계값 설정을 해제하세요.
ru: Управляет максимальной допустимой длиной темы сообщения фиксации, при превышении которой будет выдано предупреждение. Удалите это значение, чтобы использовалось значение параметра \"config.inputValidationLength\".
zh_hans: 控制用于显示警告的提交消息主题长度阈值。请取消设置它以继承 “config.inputValidationLength” 的值。

# config.logLevel
source: Specifies how much information (if any) to log to the [git output](command:git.showOutput).
ko: [git output](command:git.showOutput)에 로그할 정보(있는 경우)를 지정합니다.
ru: Указывает объем данных (при наличии) для регистрации в [git output](command:git.showOutput).

# config.logLevel.critical
source: Log only critical information
ko: 중요한 정보만 로그
ru: Регистрировать только критическую информацию

# config.logLevel.debug
source: Log only debug, information, warning, error, and critical information
ko: 로그 전용 디버그, 정보, 경고, 오류 및 중요 정보
ru: Регистрировать только информацию об отладке, сведения, предупреждения, ошибки и критическую информацию

# config.logLevel.error
source: Log only error, and critical information
ko: 로그 전용 오류 및 중요 정보
ru: Регистрировать только ошибки и критическую информацию

# config.logLevel.info
source: Log only information, warning, error, and critical information
ko: 로그 전용 정보, 경고, 오류 및 중요 정보
ru: Регистрировать только сведения, предупреждения, ошибки и критическую информацию

# config.logLevel.off
source: Log nothing
ko: 아무 것도 로그하지 않음
ru: Ничего не регистрировать

# config.logLevel.trace
source: Log all information
ko: 모든 정보 로그
ru: Регистрировать все сведения

# config.logLevel.warn
source: Log only warning, error, and critical information
ko: 로그 전용 경고, 오류 및 중요 정보
ru: Регистрировать только предупреждения, ошибки и критическую информацию

# config.mergeEditor
source: Open the merge editor for files that are currently under conflict.
ko: 현재 충돌 된 파일의 병합 편집기를 엽니다.
ru: Откройте редактор объединения для файлов, которые сейчас конфликтуют.

# config.openAfterClone
source: Controls whether to open a repository automatically after cloning.
es: Controla si se va a abrir un repositorio de forma automática después de la clonación.
fr: Détermine s'il est nécessaire d'ouvrir un dépôt automatiquement après le clonage.
ko: 복제 후에 자동으로 리포지토리를 열지 여부를 제어합니다.
ru: Определяет, следует ли автоматически открывать репозиторий после клонирования.
zh_hans: 控制是否在克隆后自动打开存储库。

# config.openAfterClone.always
source: Always open in current window.
es: Abrir siempre en la ventana actual.
fr: Effectue toujours l'ouverture dans la fenêtre active.
ko: 항상 현재 창에서 엽니다.
ru: Всегда открывать в текущем окне.
zh_hans: 始终在当前窗口中打开。

# config.openAfterClone.alwaysNewWindow
source: Always open in a new window.
es: Abrir siempre en una ventana nueva.
fr: Effectue toujours l'ouverture dans une nouvelle fenêtre.
ko: 항상 새 창에서 엽니다.
ru: Всегда открывать в новом окне.
zh_hans: 始终在新窗口中打开。

# config.openAfterClone.prompt
source: Always prompt for action.
es: Solicitar siempre la acción.
fr: Demande toujours l'action à effectuer.
ko: 항상 동작을 확인합니다.
ru: Всегда запрашивать действие.
zh_hans: 始终提示操作。

# config.openAfterClone.whenNoFolderOpen
source: Only open in current window when no folder is opened.
es: Abrir solo en la ventana actual si no hay ninguna carpeta abierta.
fr: Effectue uniquement l'ouverture dans la fenêtre active quand aucun dossier n'est ouvert.
ko: 열려 있는 폴더가 없는 경우에만 현재 창에서 엽니다.
ru: Открывать в текущем окне только при отсутствии открытых папок.
zh_hans: 只有在没有打开任何文件夹时，才在当前窗口中打开。

# config.openDiffOnClick
source: Controls whether the diff editor should be opened when clicking a change. Otherwise the regular editor will be opened.
es: Controla si el editor diff debe abrirse al hacer clic en un cambio. De lo contrario se abrirá el editor normal.
fr: Contrôle si l'éditeur de diff doit être ouvert quand l'utilisateur clique sur un changement. Sinon, l'éditeur normal est ouvert.
ko: 변경을 클릭할 때 Diff 편집기가 열릴지 여부를 제어합니다. 그렇지 않으면 일반 편집기가 열립니다.
ru: Управляет тем, следует ли открыть редактор несовпадений при щелчке по изменению. Если этот параметр не установлен, будет открыт обычный редактор.
zh_hans: 控制单击更改时是否应打开差异编辑器。否则将打开常规编辑器。

# config.path
source: Path and filename of the git executable, e.g. `C:\Program Files\Git\bin\git.exe` (Windows). This can also be an array of string values containing multiple paths to look up.
es: Ruta y nombre de archivo del ejecutable de git, por ejemplo, \"C:\NArchivos de Programa\NGit\bin\git.exe\" (Windows). También puede ser un array de valores de cadena que contenga múltiples rutas a buscar.
fr: Chemin et nom de fichier de l'exécutable git. Exemple : 'C:\Program Files\Git\bin\git.exe' (Windows). Il peut s'agir également d'un tableau de valeurs de chaîne contenant plusieurs chemins de recherche.
ko: git 실행 파일의 경로 및 파일 이름입니다(예: `C:\Program Files\Git\bin\git.exe`(Windows)). 조회할 여러 경로를 포함하는 문자열 값의 배열일 수도 있습니다.
ru: Путь и имя исполняемого файла Git, например, \"C:\Program Files\Git\bin\git.exe\" (Windows). Это также может быть массив строковых значений, содержащий несколько путей для поиска.
zh_hans: Git 可执行文件的路径和文件名，例如 `C:\Program Files\Git\bin\git.exe` (Windows)。这也可以是一个包含多个要查找的路径的字符串值数组。

# config.postCommitCommand
source: Runs a git command after a successful commit.
es: Ejecuta un comando de git después de una confirmación correcta.
fr: Exécute une commande git après un commit réussi.
ko: 커밋 후 git 명령을 실행합니다.
ru: Запускает команду git после успешной фиксации.
zh_hans: 成功提交后运行 git 命令。

# config.postCommitCommand.none
source: Don't run any command after a commit.
es: No ejecutar ningún comando después de una confirmación.
fr: N'exécutez pas de commande après une validation.
ko: 커밋 후 명령을 실행하지 않습니다.
ru: Не выполнять никаких команд после успешной фиксации.
zh_hans: 提交后不要运行任何命令。

# config.postCommitCommand.push
source: Run 'Git Push' after a successful commit.
es: Ejecutar 'Git Push' después de una confirmación exitosa.
fr: Exécutez 'Git Push' après une validation réussie.
ko: 성공적인 커밋 후 'Git Push'를 실행합니다.
ru: Выполните \"Git Push\" после успешной фиксации.
zh_hans: 成功提交后运行'Git Push'。

# config.postCommitCommand.sync
source: Run 'Git Sync' after a successful commit.
es: Ejecutar 'Git Sync' después de una confirmación exitosa.
fr: Exécutez 'Git Sync' après une validation réussie.
ko: 성공적인 커밋 후 'Git Sync'를 실행합니다.
ru: Выполните \"Git Sync\" после успешной фиксации.
zh_hans: 成功提交后运行'Git Sync'。

# config.promptToSaveFilesBeforeCommit
source: Controls whether Git should check for unsaved files before committing.
es: Controla si Git debe comprobar los archivos no guardados antes de confirmar las actualizaciones.
fr: Contrôle si Git doit vérifier les fichiers non sauvegardés avant d'effectuer le commit.
ko: Git가 제출(commit)하기 전에 저장되지 않은 파일을 검사할지를 제어합니다.
ru: Определяет, должен ли Git проверять несохраненные файлы перед фиксацией.
zh_hans: 控制 Git 是否在提交之前检查未保存的文件。

# config.promptToSaveFilesBeforeCommit.always
source: Check for any unsaved files.
es: Compruebe si hay archivos sin guardar.
fr: Vérifiez les fichiers non enregistrés.
ko: 저장되지 않은 파일이 있는지 확인합니다.
ru: Проверить наличие несохраненных файлов.
zh_hans: 检查是否有任何未保存的文件。

# config.promptToSaveFilesBeforeCommit.never
source: Disable this check.
es: Desactive esta comprobación.
fr: Désactivez la vérification.
ko: 이 검사를 사용하지 않도록 설정합니다.
ru: Отключите эту проверку.
zh_hans: 禁用此检查。

# config.promptToSaveFilesBeforeCommit.staged
source: Check only for unsaved staged files.
es: Compruebe solo si hay archivos preconfigurados sin guardar.
fr: Vérifiez uniquement les fichiers organisés non enregistrés.
ko: 저장되지 않은 스테이징된 파일만 확인합니다.
ru: Проверять только наличие несохраненных промежуточных файлов.
zh_hans: 只检查未保存的已暂存文件。

# config.promptToSaveFilesBeforeStash
source: Controls whether Git should check for unsaved files before stashing changes.
es: Controla si Git debe buscar archivos no guardados antes de almacenar los cambios.
fr: Contrôle si Git doit rechercher les fichiers non enregistrés avant de faire un stash des changements.
ko: Git이 변경 사항을 스태시하기 전에 저장되지 않은 파일을 검사할지를 제어합니다.
ru: Определяет, должен ли GIT проверять несохраненные файлы прежде чем прятать изменения.
zh_hans: 控制 Git 是否在储藏更改之前检查未保存的文件。

# config.promptToSaveFilesBeforeStash.always
source: Check for any unsaved files.
es: Compruebe si hay archivos sin guardar.
fr: Vérifiez les fichiers non enregistrés.
ko: 저장되지 않은 파일이 있는지 확인합니다.
ru: Проверить наличие несохраненных файлов.
zh_hans: 检查是否有任何未保存的文件。

# config.promptToSaveFilesBeforeStash.never
source: Disable this check.
es: Desactive esta comprobación.
fr: Désactive cette vérification.
ko: 이 검사를 사용하지 않도록 설정합니다.
ru: Отключение этой проверки.
zh_hans: 禁用此检查。

# config.promptToSaveFilesBeforeStash.staged
source: Check only for unsaved staged files.
es: Compruebe solo si hay archivos preconfigurados sin guardar.
fr: Vérifiez uniquement les fichiers organisés non enregistrés.
ko: 저장되지 않은 스테이징된 파일만 확인합니다.
ru: Проверять только наличие несохраненных промежуточных файлов.
zh_hans: 只检查未保存的已暂存文件。

# config.pruneOnFetch
source: Prune when fetching.
es: Eliminar al capturar.
fr: Effectue un élagage au moment de la récupération.
ko: 페치할 때 정리합니다.
ru: Урезать при извлечении.
zh_hans: 提取时修剪。

# config.pullTags
source: Fetch all tags when pulling.
es: Recupere todas las etiquetas al insertar.
fr: Récupérez toutes les balises pendant le tirage.
ko: 풀할 때 모든 태그를 페치합니다.
ru: Получить все теги при извлечении.
zh_hans: 拉取时提取所有标签。

# config.rebaseWhenSync
source: Force git to use rebase when running the sync command.
es: Forzar que GIT utilice la fusión mediante cambio de base cuando se ejecute el comando de sincronización.
fr: Forcez git à utiliser rebase pendant l'exécution de la commande sync.
ko: 동기화 명령을 실행할 때 Git에서 다시 지정을 사용하게 합니다.
ru: Принудительно использовать перемещение изменений из одной ветви в другую вместо слияния при запуске команды sync в Git.
zh_hans: 在运行“同步”命令时，强制 Git 使用“变基”。

# config.repositoryScanIgnoredFolders
source: List of folders that are ignored while scanning for Git repositories when `#git.autoRepositoryDetection#` is set to `true` or `subFolders`.
es: Lista de carpetas que se ignoran al buscar repositorios Git cuando `#git.autoRepositoryDetection#` se establece como `true` o `subFolders`.
ko: `#git.autoRepositoryDetection#`이 `true` 또는 `subFolders`로 설정된 경우 Git 리포지토리를 검색하는 동안 무시되는 폴더 목록입니다.
ru: Список папок, которые игнорируются при сканировании репозиториев Git, когда для параметра "#git.autoRepositoryDetection#" задано значение "true" или "subFolders".

# config.repositoryScanMaxDepth
source: Controls the depth used when scanning workspace folders for Git repositories when `#git.autoRepositoryDetection#` is set to `true` or `subFolders`. Can be set to `-1` for no limit.
es: Controla la profundidad usada al examinar las carpetas del área de trabajo en busca de repositorios Git cuando "#git.autoRepositoryDetection#" está establecido en "true" o "subFolders". Se puede establecer en "-1" para que no haya límite.
ko: `#git.autoRepositoryDetection#`이 `true` 또는 `subFolders`로 설정된 경우 Git 리포지토리에 대한 작업 영역 간 폴더를 스캔할 때 사용되는 깊이를 제어합니다. 제한 없이 '-1'로 설정할 수 있습니다.
ru: Определяет глубину, используемую при сканировании папок рабочей области для репозиториев Git, если для #git.autoRepositoryDetection# задано значение true или subFolders. Можно задать значение "-1" для снятия ограничений.

# config.requireGitUserConfig
source: Controls whether to require explicit Git user configuration or allow Git to guess if missing.
es: Controla si se va a requerir una configuración de usuario de GIT explícita o se va a permitir a GIT que la adivine si falta.
fr: Contrôle si une configuration utilisateur Git explicite est nécessaire ou si elle peut être devinée par Git quand elle est manquante.
ko: 명시적 Git 사용자 구성을 요구할지 또는 누락된 경우 Git에서 추측하도록 허용할지를 제어합니다.
ru: Позволяет определить, требовать ли явной настройки пользователя Git или разрешить Git использовать предположения, если пользователь не указан.
zh_hans: 控制在是要求进行显式 Git 用户配置，还是允许 Git 在缺少配置时进行猜测。

# config.scanRepositories
source: List of paths to search for git repositories in.
es: Lista de rutas en las que buscar repositorios de git.
fr: Liste des chemins d’accès pour rechercher des dépôts git.
ko: Git 리포지토리를 검색할 경로의 목록입니다.
ru: Список путей для поиска репозиториев Git.
zh_hans: 在其中搜索 Git 存储库的路径的列表。

# config.showActionButton
source: Controls whether an action button is shown in the Source Control view.
ko: 작업 단추가 원본 제어 뷰에 표시되는지 여부를 제어합니다.
ru: Определяет, отображается ли кнопка действия в представлении системы управления версиями.

# config.showActionButton.commit
source: Show an action button to commit changes when the local branch has modified files ready to be committed.
ko: 로컬 분기에서 커밋할 준비가 된 파일을 수정한 경우 변경 내용을 커밋하는 작업 단추를 표시합니다.
ru: Показывать кнопку действия для фиксации изменений, когда локальной ветви есть готовые к фиксации измененные файлы.

# config.showActionButton.publish
source: Show an action button to publish the local branch when it does not have a tracking remote branch.
ko: 추적 원격 분기가 없는 경우 로컬 분기를 게시하는 작업 단추를 표시합니다.
ru: Показывать кнопку действия для публикации локальной ветви, если у нее нет удаленной ветви отслеживания.

# config.showActionButton.sync
source: Show an action button to synchronize changes when the local branch is either ahead or behind the remote branch.
ko: 로컬 분기가 원격 분기 앞이나 뒤에 있을 때 변경 내용을 동기화하는 작업 단추를 표시합니다.
ru: Показывать кнопку действия для синхронизации изменений, когда локализованная ветвь находится за удаленной ветвью или перед ней.

# config.showCommitInput
source: Controls whether to show the commit input in the Git source control panel.
es: Controla si se va a mostrar la entrada de confirmación en el panel de control de código fuente de GIT.
fr: Détermine si l'entrée de commit doit être affichée dans le panneau de contrôle de code source Git.
ko: Git 소스 제어판에 커밋 입력을 표시할지 여부를 제어합니다.
ru: Определяет, отображаются ли входные данные фиксации на панели управления исходным кодом Git.
zh_hans: 控制是否在 Git 源控制面板中显示提交输入。
