Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/git.*.xlf
Languages: es, fr, ko, ru, zh_hans

# view.workbench.scm.workspace
source: The workspace currently open doesn't have any folders containing git repositories. You can initialize a repository on a folder which will enable source control features powered by git. [Initialize Repository](command:git.init) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
es: El espacio de trabajo actualmente abierto no tiene ninguna carpeta que contenga repositorios git. Puede inicializar un repositorio en una carpeta que habilitará las características de control de origen impulsadas por git. [Inicializar repositorio](command:git.init) Para saber más sobre cómo usar git y el control de origen en Azure Data Studio [lea nuestra documentación](https://aka.ms/vscode-scm).
fr: L’espace de travail actuellement ouvert ne contient aucun dossier contenant des référentiels git. Vous pouvez initialiser un référentiel sur un dossier qui activera les fonctionnalités de contrôle de source alimentées par git. [Initialize Repository](command:git.init) Pour en savoir plus sur l’utilisation de git et du contrôle de code source dans Azure Data Studio [lisez notre documentation](https://aka.ms/vscode-scm).
ko: 현재 열린 작업 영역에 Git 리포지토리가 포함된 폴더가 없습니다. Git에서 제공하는 소스 제어 기능을 사용하도록 설정할 폴더의 리포지토리를 초기화할 수 있습니다. [리포지토리 초기화](command:git.init) Azure Data Studio에서 Git 및 소스 제어를 사용하는 방법에 대해 자세히 알아보려면 [Microsoft Docs](https://aka.ms/vscode-scm)를 읽어보세요.
ru: В открытой рабочей области нет папок, содержащих репозитории Git. Вы можете инициализировать репозиторий в папке, что позволит получить доступ к возможностям системы управления версиями на платформе Git. [Инициализировать репозиторий](command:git.init) Чтобы получить дополнительные сведения об использовании Git и системы управления версиями в Azure Data Studio, [изучите нашу документацию](https://aka.ms/vscode-scm).
zh_hans: 当前打开的工作区没有任何包含 git 存储库的文件夹。可以初始化文件夹上将启用由 git 支持的源代码管理功能的存储库。 [初始化存储库](command: git.init) 要详细了解如何在 Azure Data Studio 中使用 git 和源代码管理，请 [阅读我们的文档](https://aka.ms/vscode-scm)。

# scm button publish title
source: $(cloud-upload) Publish Branch
es: $(cloud-upload) Publicar rama

# scm button sync description
source: {0} Sync Changes {1}{2}
es: {0} Sincronizar cambios {1}{2}

# changed
source: {0} Log level changed to: {1}
es: {0} Se ha cambiado el nivel de registro a: {1}

# confirm emtpy commit
source: Are you sure you want to create an empty commit?
es: ¿Seguro que desea crear una confirmación vacía?
fr: Êtes-vous sûr d vouloir créer un commit vide ?
zh_hans: 是否确定要创建空提交?

# skipped
source: {0} Skipped found git in: {1}
es: {0} Se omitió GIT encontrado en: {1}

# using git
source: {0} Using git {1} from {2}
es: {0} Usando GIT {1} de {2}

# validating
source: {0} Validating found git in: {1}
es: {0} La validación encontró GIT en: {1}

# config.branchWhitespaceChar
source: The character to replace whitespace in new branch names.
es: El carácter para reemplazar espacios en blanco en nuevos nombres de rama.
fr: Le caractère pour remplacer les espaces dans les nouveaux noms de branche.
zh_hans: 在新分支名称中替换空白字符的字符。

# config.showUnpublishedCommitsButton
source: Controls whether to show an action button to sync or publish, if there are unpublished commits.
es: Controla si se muestra un botón de acción para sincronizar o publicar, si hay confirmaciones no publicadas.
fr: Contrôle s’il faut afficher un bouton d’action pour synchroniser ou publier, s’il existe des validations non publiées.
zh_hans: 控制是否显示要同步或发布的操作按钮(如果存在未发布的提交)。

# config.showUnpublishedCommitsButton.always
source: Always shows the action button, if there are unpublished commits.
es: Mostrar siempre el botón de acción, si hay confirmaciones sin publicar.
fr: Affiche toujours le bouton d’action, s’il existe des validations non publiées.
zh_hans: 如果存在未发布的提交，则始终显示操作按钮。

# config.showUnpublishedCommitsButton.never
source: Never shows the action button.
es: No mostrar nunca el botón de acción.
fr: N’affiche jamais le bouton d’action.
zh_hans: 从不显示操作按钮。

# config.showUnpublishedCommitsButton.whenEmpty
source: Only shows the action button if there are no other changes and there are unpublished commits.
es: Solo muestra el botón de acción si no hay otros cambios y hay confirmaciones no publicadas.
fr: Affiche uniquement le bouton d’action s’il n’y a pas d’autres modifications et s’il existe des validations non publiées.
zh_hans: 只有当无其他更改且存在未发布的提交时，才显示操作按钮。

# config.terminalAuthentication
source: Controls whether to enable Azure Data Studio to be the authentication handler for git processes spawned in the integrated terminal. Note: terminals need to be restarted to pick up a change in this setting.
es: Controla si se permite que Azure Data Studio sea el controlador de autenticación para los procesos git generados en el terminal integrado. Nota: los terminales deben reiniciarse para recoger un cambio en esta configuración.
fr: Contrôle s’il faut activer Azure Data Studio comme gestionnaire d’authentification pour les processus git générés dans le terminal intégré. Remarque : les terminaux doivent être redémarrés pour prendre en compte une modification de ce paramètre.
zh_hans: 控制是否使 Azure Data Studio 成为集成终端中产生的 git 进程的身份验证处理程序。请注意: 需要重启终端才能选择此设置中的更改。

# view.workbench.scm.missing
source: A valid git installation was not detected, more details can be found in the [git output](command:git.showOutput). Please [install git](https://git-scm.com/), or learn more about how to use git and source control in Azure Data Studio in [our docs](https://aka.ms/vscode-scm). If you're using a different version control system, you can [search the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) for additional extensions.
es: No se ha detectado una instalación válida de git, se pueden encontrar más detalles en la [salida de git](command:git.showOutput). [instale git](https://git-scm.com/), u obtenga más información sobre cómo usar git y el control de fuentes en Azure Data Studio en [nuestros documentos](https://aka.ms/vscode-scm). Si usa un sistema de control de versiones diferente, puede [buscar en el Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) extensiones adicionales.
fr: Une installation git valide n’a pas été détectée, plus de détails peuvent être trouvés dans la [git output] (commande : git.showOutput). Veuillez [install git](https://git-scm.com/), ou découvrez comment utiliser git et le contrôle de source dans Azure Data Studio dans [our docs](https://aka.ms/vscode-scm ). Si vous utilisez un système de contrôle de version différent, vous pouvez [search the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) pour des extensions supplémentaires.
zh_hans: 未检测到有效的 git 安装。要了解详细信息，请访问 [git 输出](command:git.showOutput)。 请 [安装 git](https://git-scm.com/)，或在 [我们的文档](https://aka.ms/vscode-scm)中详细了解如何在 Azure Data Studio 中使用 Git 和源代码管理。 如果使用的是其他版本的控制系统，则可以 [搜索市场](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22)以获取其他扩展。

# view.workbench.scm.missing.guide
source: Install Git, a popular source control system, to track code changes and collaborate with others. Learn more in our [Git guides](https://aka.ms/vscode-scm).
es: Instale Git, un conocido sistema de control de código fuente, para realizar un seguimiento de los cambios de código y colaborar con otros usuarios. Obtenga más información en nuestras [guías Git](https://aka.ms/vscode-scm).

# view.workbench.scm.missing.guide.linux
source: Source control depends on Git being installed. [Download Git for Linux](https://git-scm.com/download/linux) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
es: El control de código fuente depende de la instalación de Git. [Descargar Git para Linux](https://git-scm.com/download/linux) Después de la instalación, [recargue](command:workbench.action.reloadWindow) (o [solucione los problemas](command:git.showOutput)). Se pueden instalar proveedores de control de código fuente adicionales [desde Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# view.workbench.scm.missing.guide.mac
source: [Download Git for macOS](https://git-scm.com/download/mac) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
es: [Descargar Git para macOS](https://git-scm.com/download/mac) Después de la instalación, [recargue](command:workbench.action.reloadWindow) (o [solucione los problemas](command:git.showOutput)). Se pueden instalar proveedores de control de código fuente adicionales [desde Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# view.workbench.scm.missing.guide.windows
source: [Download Git for Windows](https://git-scm.com/download/win) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
es: [Descargar Git para Windows](https://git-scm.com/download/win) Después de la instalación, [recargue](command:workbench.action.reloadWindow) (o [solucione los problemas](command:git.showOutput)). Se pueden instalar proveedores de control de código fuente adicionales [desde Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).

# changed
source: Log level changed to: {0}
fr: Niveau de journalisation remplacé par : {0}
zh_hans: 日志级别更改为: {0}

# confirm publish branch
source: The branch '{0}' has no upstream branch. Would you like to publish this branch?
fr: La branche '{0}' n'a pas de branche en amont. Voulez-vous publier cette branche ?
zh_hans: 分支“{0}”没有上游分支。您要发布此分支吗?

# sync is unpredictable
source: This action will push and pull commits to and from '{0}/{1}'.
fr: Cette action va envoyer (push) et tirer (pull) des commits à destination et en provenance de '{0}/{1}'.
zh_hans: 此操作会将提交项推送到“{0}/{1}”并从中拉取提交项。

# error
source: $(error) Error: {0}
fr: $(error) - Erreur : {0}
zh_hans: $(error) 错误: {0}

# none found
source: No remote repositories found.
fr: Dépôts distants introuvables.
zh_hans: 未找到远程存储库。

# pick url
source: Choose a URL to clone from.
fr: Choisissez l'URL à partir de laquelle effectuer le clonage.
zh_hans: 选择要从中进行克隆的 URL。

# provide url
source: Provide repository URL
fr: Indiquer l'URL du dépôt
zh_hans: 提供存储库 URL

# provide url or pick
source: Provide repository URL or pick a repository source.
fr: Indiquez l'URL du dépôt, ou choisissez une source de dépôt.
zh_hans: 提供存储库 URL 或选择存储库源。

# type to filter
source: Repository name
fr: Nom du dépôt
zh_hans: 存储库名称

# type to search
source: Repository name (type to search)
fr: Nom du dépôt (tapez pour effectuer une recherche)
zh_hans: 存储库名称(键入内容进行搜索)

# scm button publish title
source: $(cloud-upload) Publish Changes
fr: $(cloud-upload) Publier les modifications
zh_hans: $(cloud-upload)发布更改

# scm button publish tooltip
source: Publish Changes
fr: Publier les modifications
zh_hans: 发布更改

# scm button sync title
source: Sync Changes $(sync){0}{1}
fr: Synchroniser les modifications $(sync){0}{1}
zh_hans: 同步更改 $(sync){0}{1}

source: Publish Changes
fr: Publier les modifications
zh_hans: 发布更改

# git.index
source: Index
zh_hans: 索引

# git.workingTree
source: Working Tree
fr: Arborescence de travail
zh_hans: 工作树

# command.revealInExplorer
source: Reveal in Side Bar
fr: Révéler dans la barre latérale
zh_hans: 在侧边栏中显示

# view.workbench.scm.disabled
source: If you would like to use git features, please enable git in your [settings](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
fr: Si vous souhaitez utiliser les fonctionnalités de git, veuillez activer git dans vos [settings](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). Pour en savoir plus sur l’utilisation de git et du contrôle de code source dans Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
zh_hans: 如果希望使用 git 功能，请在 [设置](command:workbench.action.openSettings?%5B%22git.enabled%22%5D)中启用 git。 要详细了解如何在 Azure Data Studio 中使用 git 和源代码管理，请 [阅读我们的文档](https://aka.ms/vscode-scm)。
