Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/git.*.xlf
Languages: es, fr, ko, ru, zh_hans

# command.openChange
source: Open Changes
es: Abrir cambios
fr: Ouvrir les modifications
ko: 변경 내용 열기
ru: Открыть изменения
zh_hans: 打开更改

# command.openFile
source: Open File
es: Abrir archivo
fr: Ouvrir un fichier
ko: 파일 열기
ru: Открыть файл
zh_hans: 打开文件

# command.openHEADFile
source: Open File (HEAD)
es: Abrir archivo (HEAD)
fr: Ouvrir le fichier (HEAD)
ko: 파일 열기(HEAD)
ru: Открыть файл (HEAD)
zh_hans: 打开文件 (HEAD)

# command.openRepository
source: Open Repository
es: Abrir repositorio
fr: Ouvrir le dépôt
ko: 리포지토리 열기
ru: Открыть репозиторий
zh_hans: 打开存储库

# command.publish
source: Publish Branch...
es: Publicar rama...
fr: Publier la branche...
ko: 분기 게시...
ru: Опубликовать ветвь...
zh_hans: 发布分支...

# command.pull
source: Pull
es: Incorporación de cambios
ko: 풀
ru: Получить
zh_hans: 拉取

# command.pullFrom
source: Pull from...
es: Extraer de...
fr: Extraire de...
ko: 가져올 위치...
ru: Получить из...
zh_hans: 拉取自...

# command.pullRebase
source: Pull (Rebase)
es: Incorporación de cambios (fusionar mediante cambio de base)
fr: Pull (rebaser)
ko: 풀(다시 지정)
ru: Получить (переместить изменения из одной ветви в другую)
zh_hans: 拉取(变基)

# command.push
source: Push
es: Insertar
ko: 푸시
ru: Отправить
zh_hans: 推送

# command.pushFollowTags
source: Push (Follow Tags)
es: Insertar (seguir etiquetas)
fr: Pousser (suivre des balises)
ko: 푸시(태그 팔로우)
ru: Отправить (подписаться на теги)
zh_hans: 推送(“关注”标记)

# command.pushFollowTagsForce
source: Push (Follow Tags, Force)
es: Insertar (seguir etiquetas, forzar)
fr: Pousser (suivre des balises, forcer)
ko: 푸시(태그 팔로우, 강제 적용)
ru: Отправить (подписаться на теги, принудительно)
zh_hans: 推送(“关注”标记，强制)

# command.pushForce
source: Push (Force)
es: Envío de cambios (forzar)
fr: Pousser (forcer)
ko: 푸시(강제)
ru: Отправить (принудительно)
zh_hans: 推送(强制)

# command.pushTags
source: Push Tags
es: Insertar etiquetas
fr: Envoyer (push) des étiquettes
ko: 푸시 태그
ru: Отправить теги
zh_hans: 推送标记

# command.pushTo
source: Push to...
es: Insertar en...
fr: Transfert (Push) vers...
ko: 다음으로 푸시...
ru: Отправить в:
zh_hans: 推送到...

# command.pushToForce
source: Push to... (Force)
es: Insertar en... (Forzar)
fr: Transfert (Push) vers... (Force)
ko: ...로 푸시 (강제)
ru: Отправить в... (принудительно)
zh_hans: 推送到...(强制)

# command.rebase
source: Rebase Branch...
es: Reorganizar rama...
fr: Rebaser la branche...
ko: 분기 다시 지정...
ru: Перемещение изменений из одной ветви в другую…
zh_hans: 变基分支…

# command.rebaseAbort
source: Abort Rebase
es: Anular fusión mediante cambio de base
fr: Abandonner le rebasage
ko: 다시 지정 중단
ru: Прервать перемещение изменений из одной ветви в другую
zh_hans: 中止变基

# command.refresh
source: Refresh
es: Actualizar
fr: Actualiser
ko: 새로 고침
ru: Обновить
zh_hans: 刷新

# command.removeRemote
source: Remove Remote
es: Quitar remoto
fr: Supprimer le dépôt distant
ko: 원격 제거
ru: Удалить удаленный репозиторий
zh_hans: 删除远程存储库

# command.rename
source: Rename
es: Cambiar nombre
fr: Renommer
ko: 이름 바꾸기
ru: Переименование
zh_hans: 重命名

# command.renameBranch
source: Rename Branch...
es: Renombrar Rama...
fr: Renommer la branche...
ko: 분기 이름 바꾸기...
ru: Переименовать ветвь...
zh_hans: 重命名分支...

# command.restoreCommitTemplate
source: Restore Commit Template
es: Restaurar plantilla de confirmación
fr: Restaurer le modèle de commit
ko: 커밋 템플릿 복원
ru: Восстановить шаблон коммита
zh_hans: 还原提交模板

# command.revealFileInOS.linux
source: Open Containing Folder
ko: 상위 폴더 열기
ru: Открыть содержащую папку

# command.revealFileInOS.mac
source: Reveal in Finder
ko: Finder에 표시
ru: Отобразить в Finder

# command.revealFileInOS.windows
source: Reveal in File Explorer
ko: 파일 탐색기에 표시
ru: Показать в проводнике

# command.revealInExplorer
source: Reveal in Explorer View
es: Mostrar en la vista Explorador
ko: 탐색기 보기에 표시
ru: Отобразить в проводнике

# command.revertChange
source: Revert Change
es: Revertir el cambio
fr: Restaurer la modification
ko: 변경 내용 되돌리기
ru: Обратить изменение
zh_hans: 还原更改

# command.revertSelectedRanges
source: Revert Selected Ranges
es: Revertir los intervalos seleccionados
fr: Restaurer les portées sélectionnées
ko: 선택한 범위 되돌리기
ru: Обратить выбранные диапазоны
zh_hans: 还原所选更改

# command.setLogLevel
source: Set Log Level...
es: Establecer nivel de registro...
fr: Définir le niveau de journalisation (log) ...
ko: 로그 수준 설정...
ru: Установите уровень ведения журнала...
zh_hans: 设置日志级别...

# command.showOutput
source: Show Git Output
es: Mostrar salida de GIT
fr: Afficher la sortie Git
ko: Git 출력 표시
ru: Показать выходные данные GIT
zh_hans: 显示 GIT 输出

# command.stage
source: Stage Changes
es: Almacenar cambios provisionalmente
fr: Mettre en attente les modifications
ko: 변경 내용 스테이징
ru: Индексировать изменения
zh_hans: 暂存更改

# command.stageAll
source: Stage All Changes
es: Almacenar todos los cambios
fr: Mettre en attente toutes les modifications
ko: 모든 변경 내용 스테이징
ru: Хранить все промежуточные изменения
zh_hans: 暂存所有更改

# command.stageAllMerge
source: Stage All Merge Changes
es: Almacenar provisionalmente todos los cambios fusionados mediante combinación
fr: Indexer toutes les fusions de changements
ko: 모든 병합 변경 내용 스테이징
ru: Хранить все изменения слияния
zh_hans: 暂存所有合并更改

# command.stageAllTracked
source: Stage All Tracked Changes
es: Realizar copia intermedia de todos los cambios rastreados
fr: Indexer tous les changements suivis
ko: 추적된 모든 변경 내용 스테이징
ru: Подготовить все отслеживаемые изменения
zh_hans: 暂存所有跟踪的更改

# command.stageAllUntracked
source: Stage All Untracked Changes
es: Realizar copia intermedia de todos los cambios sin seguimiento
fr: Indexer tous les changements non suivis
ko: 추적되지 않은 모든 변경 내용 스테이징
ru: Подготовить все неотслеживаемые изменения
zh_hans: 暂存所有未跟踪的更改

# command.stageChange
source: Stage Change
es: Cambiar etapa
fr: Mettre en attente la modification
ko: 변경 내용 스테이징
ru: Изменение стадии
zh_hans: 暂存更改

# command.stageSelectedRanges
source: Stage Selected Ranges
es: Realizar copia intermedia de los intervalos seleccionados
fr: Mettre en attente les plages sélectionnées
ko: 선택한 범위 스테이징
ru: Индексировать выбранные диапазоны
zh_hans: 暂存所选范围

# command.stash
source: Stash
es: Guardar provisionalmente
fr: Remiser (stash)
ko: 스태시
ru: Спрятать
zh_hans: 储藏

# command.stashApply
source: Apply Stash...
es: Aplicar cambio guardados provisionalmente
fr: Appliquer la remise (Stash)...
ko: 스태시 적용하기...
ru: Применить спрятанное...
zh_hans: 应用储藏...

# command.stashApplyLatest
source: Apply Latest Stash
es: Aplicar últimos cambios guardados provisionalmente
fr: Appliquer la dernière remise (Stash)
ko: 최신 스태시 적용하기
ru: Применить последнее спрятанное
zh_hans: 应用最新储藏

# command.stashDrop
source: Drop Stash...
es: Descartar cambios guardados provisionalmente...
fr: Supprimer le remisage (stash)...
ko: 스태시 삭제...
ru: Удалить спрятанные данные...
zh_hans: 删除储藏...

# command.stashDropAll
source: Drop All Stashes...
es: Quitar todos los cambios guardados provisionalmente...
ko: 모든 스태시 삭제...
ru: Удалить все спрятанные записи...

# command.stashIncludeUntracked
source: Stash (Include Untracked)
es: Guardar provisionalmente (Incluir sin seguimiento)
fr: Remiser (Inclure les non-tracés)
ko: 스태시(미추적 포함)
ru: Спрятать (включить неотслеживаемые)
zh_hans: 储藏(包含未跟踪)

# command.stashPop
source: Pop Stash...
es: Aplicar y quitar cambios guardados provisionalmente...
fr: Appliquer et supprimer la remise...
ko: 스태시 표시...
ru: Извлечь спрятанное
zh_hans: 弹出储藏...

# command.stashPopLatest
source: Pop Latest Stash
es: Aplicar y quitar últimos cambios guardados provisionalmente...
fr: Appliquer et supprimer la dernière remise
ko: 최신 슬래시 표시
ru: Извлечь последнее спрятанное
zh_hans: 弹出最新储藏

# command.sync
source: Sync
es: Sincronizar
fr: Synchroniser
ko: 동기화
ru: Синхронизация
zh_hans: 同步

# command.syncRebase
source: Sync (Rebase)
es: Sincronizar (Rebase)
fr: Synchroniser (Rebase)
ko: 동기화(다시 지정)
ru: Синхронизация (с перебазированием)
zh_hans: 同步(变基)

# command.timelineCompareWithSelected
source: Compare with Selected
es: Comparar con seleccionados
fr: Comparer avec la sélection
ko: 선택한 항목과 비교
ru: Сравнить с выбранным
zh_hans: 与已选项目进行比较

# command.timelineCopyCommitId
source: Copy Commit ID
es: Copiar ID de confirmación
fr: Copier l'ID de commit
ko: 커밋 ID 복사
ru: Копировать идентификатор фиксации
zh_hans: 复制提交 ID

# command.timelineCopyCommitMessage
source: Copy Commit Message
es: Copiar mensaje de confirmación
fr: Copiez le message de commit.
ko: 커밋 메시지 복사
ru: Копировать сообщение фиксации
zh_hans: 复制提交消息

# command.timelineOpenDiff
source: Open Changes
es: Abrir cambios
fr: Ouvrir les modifications
ko: 변경 내용 열기
ru: Открыть изменения
zh_hans: 打开更改

# command.timelineSelectForCompare
source: Select for Compare
es: Seleccionar para comparar
fr: Sélectionner pour comparaison
ko: 비교를 위해 선택
ru: Выбрать для сравнения
zh_hans: 选择以进行比较

# command.undoCommit
source: Undo Last Commit
es: Deshacer última confirmación
fr: Annuler la dernière validation
ko: 마지막 커밋 실행 취소
ru: Отменить последнюю фиксацию
zh_hans: 撤消上次提交

# command.unstage
source: Unstage Changes
es: Cancelar almacenamiento provisional de los cambios
fr: Annuler la mise en attente des modifications
ko: 변경 내용 스테이징 취소
ru: Отменить промежуточное изменение
zh_hans: 取消暂存更改

# command.unstageAll
source: Unstage All Changes
es: Cancelar almacenamiento provisional de todos los cambios
fr: Annuler la mise en attente de toutes les modifications
ko: 모든 변경 내용 스테이징 취소
ru: Отменить все промежуточные изменения
zh_hans: 取消暂存所有更改

# command.unstageSelectedRanges
source: Unstage Selected Ranges
es: Cancelar almacenamiento provisional de los intervalos seleccionados
fr: Annuler la mise en attente des plages sélectionnées
ko: 선택한 범위 스테이징 취소
ru: Отменить индексацию выбранных диапазонов
zh_hans: 取消暂存所选范围

# config.allowForcePush
source: Controls whether force push (with or without lease) is enabled.
es: Controla si está habilitada la opción de forzar envío de cambios (con o sin concesión).
fr: Contrôle si force push (avec ou sans lease) est activé.
ko: 강제 푸시(임대 사용 또는 사용 안 함)가 가능한지 여부를 제어합니다.
ru: Определяет, будет ли применяться принудительная отправка (с арендой или без).
zh_hans: 控制是否启用强制推送 (不论 force 还是 force-with-lease)。

# config.allowNoVerifyCommit
source: Controls whether commits without running pre-commit and commit-msg hooks are allowed.
es: Controla si se permiten las confirmaciones sin ejecutar enlaces previos a la confirmación y de mensajes de confirmación.
fr: Détermine si les commits sans exécution des crochets pre-commit et commit-msg sont autorisés.
ko: pre-commit 및 commit-msg 후크를 실행하지 않는 커밋이 허용되는지를 제어합니다.
ru: Определяет, разрешены ли фиксации без выполнения обработчиков, запускаемых перед фиксацией, и обработчиков сообщений фиксации.
zh_hans: 控制是否允许没有运行 pre-commit 和 commit-msg 挂钩的提交。

# config.alwaysShowStagedChangesResourceGroup
source: Always show the Staged Changes resource group.
es: Permitir siempre el grupo de recursos Cambios almacenados provisionalmente.
fr: Toujours afficher le groupe de ressources des changements en zone de transit (Staged).
ko: 스테이징된 변경 내용 리소스 그룹을 항상 표시합니다.
ru: Всегда показывать группу ресурсов \"Изменения в индексе\".
zh_hans: 始终显示“暂存的更改”资源组。

# config.alwaysSignOff
source: Controls the signoff flag for all commits.
es: Controla el indicador de firma para todos los commits
fr: Contrôle le flag signoff pour toutes les modifications.
ko: 모든 커밋에 대한 확인 플래그를 제어합니다.
ru: Управляет флагом одобрения (signoff) для всех создаваемых коммитов.
zh_hans: 控制所有提交的 signoff 标志。

# config.autoRepositoryDetection
source: Configures when repositories should be automatically detected.
es: Configura cuándo los repositorios deben detectarse automáticamente.
fr: Configure le moment où les dépôts doivent être détectés automatiquement.
ko: 리포지토리가 자동으로 감지되어야 하는 경우를 구성합니다.
ru: Определяет, как автоматически обнаруживать репозитории.
zh_hans: 配置何时自动检测存储库。

# config.autoRepositoryDetection.false
source: Disable automatic repository scanning.
es: Desactivar el escaneado automático de repositorio.
fr: Désactivez l’analyse de dépôt automatique.
ko: 자동 리포지토리 검사를 사용하지 않습니다.
ru: Отключить автоматический поиск репозиториев.
zh_hans: 禁止自动扫描存储库。

# config.autoRepositoryDetection.openEditors
source: Scan for parent folders of open files.
es: Buscar por carpetas padre de los archivos abiertos.
fr: Rechercher dans les dossiers parents de fichiers ouverts.
ko: 열려 있는 파일의 부모 폴더를 검사합니다.
ru: Сканировать родительские папки открытых файлов.
zh_hans: 扫描当前打开文件的父文件夹。

# config.autoRepositoryDetection.subFolders
source: Scan for subfolders of the currently opened folder.
es: Buscar por subcarpetas de la carpeta actualmente abierta.
fr: Rechercher dans les sous-dossiers du dossier actuellement ouvert.
ko: 현재 열려 있는 폴더의 하위 폴더를 검사합니다.
ru: Сканировать подпапки для текущей открытой папки.
zh_hans: 扫描当前打开文件夹的子文件夹。

# config.autoRepositoryDetection.true
source: Scan for both subfolders of the current opened folder and parent folders of open files.
es: Buscar por ambas subcarpetas de la carpeta abierta actual y carpetas padre de archivos abiertos.
fr: Recherchez dans les deux sous-dossiers du dossier ouvert en cours et dans les dossiers parents de fichiers ouverts.
ko: 현재 열려 있는 폴더의 하위 폴더와 열려 있는 파일의 부모 폴더를 모두 검사합니다.
ru: Сканировать подпапки для текущей открытой папки и родительские папки открытых файлов.
zh_hans: 扫描当前打开文件夹与当前打开文件所在文件夹的子文件夹。

# config.autoStash
source: Stash any changes before pulling and restore them after successful pull.
es: Guarde cualquier cambio antes de insertar y restaurarlos cuando la inserción se haya completado correctamente.
fr: Remisez (stash) les changements avant de les tirer et de les restaurer après un tirage réussi.
ko: 풀하기 전에 변경 내용을 스태시하고 풀하는 데 성공한 후 변경 내용을 복원합니다.
ru: Прятать все изменения перед вытягиванием и восстанавливать их после успешного вытягивания.
zh_hans: 在拉取前暂存所有更改，在成功拉取后还原这些更改。

# config.autofetch
source: When set to true, commits will automatically be fetched from the default remote of the current Git repository. Setting to `all` will fetch from all remotes.
es: Cuando se establece en true, las confirmaciones se obtendrán automáticamente del remoto por defecto del repositorio Git actual. Si se establece como \"todo\" se obtendrán de todos los remotos.
fr: Quand la valeur est true, les commits sont automatiquement récupérés (fetch) à partir du dépôt distant par défaut du dépôt Git actuel. Quand la valeur est 'all', les commits sont récupérés à partir de tous les dépôts distants.
ko: true로 설정하면 커밋이 현재 Git 리포지토리의 기본 원격에서 자동으로 페치됩니다. 'all'로 설정하면 모든 원격에서 페치됩니다.
ru: Если задано значение true, фиксации будут автоматически извлекаться из удаленного репозитория по умолчанию для текущего репозитория Git. Если задано значение all, фиксации будут извлекаться из всех удаленных репозиториев.
zh_hans: 若设置为 true，则自动从当前 Git 存储库的默认远程库提取提交。若设置为“全部”，则从所有远程库进行提取。

# config.autofetchPeriod
source: Duration in seconds between each automatic git fetch, when `#git.autofetch#` is enabled.
es: Duración en segundos entre cada búsqueda automática de git, cuando \"#git.autofetch#\" está activado.
fr: Durée en secondes entre chaque récupération git automatique quand `git.autofetch` est activé.
ko: #git.autofetch#가 사용되는 경우 각 자동 git fetch 사이의 시간(초)입니다.
ru: Длительность в секундах между автоматическими извлечениями из git, если включен параметр \"#git.autofetch#\".
zh_hans: 在启用“#git.autofetch#”情况下每次自动 git fetch 之间的间隔时间(以秒为单位)。

# config.autorefresh
source: Whether auto refreshing is enabled.
es: Si la actualización automática es habilitada.
fr: Détermine si l'actualisation automatique est activée.
ko: 자동 새로 고침을 사용할지 여부입니다.
ru: Включено ли автоматическое обновление.
zh_hans: 是否启用自动刷新。

# config.branchPrefix
source: Prefix used when creating a new branch.
ko: 새 브랜치를 만들 때 사용되는 접두사입니다.
ru: Префикс, используемый при создании новой ветви.

# config.branchProtection
source: List of protected branches. By default, a prompt is shown before changes are committed to a protected branch. The prompt can be controlled using the `#git.branchProtectionPrompt#` setting.
ko: 보호된 브랜치 목록입니다. 기본적으로 변경 내용이 보호된 브랜치에 커밋되기 전에 프롬프트가 표시됩니다. 프롬프트는 '#git.branchProtectionPrompt#' 설정을 사용하여 제어할 수 있습니다.
ru: Список защищенных ветвей. По умолчанию перед фиксацией изменений в защищенной ветви отображается запрос. Запросом можно управлять с помощью параметра `#git.branchProtectionPrompt#`.

# config.branchProtectionPrompt
source: Controls whether a prompt is being before changes are committed to a protected branch.
ko: 변경 내용을 보호된 브랜치에 커밋하기 전에 프롬프트를 표시할지 여부를 제어합니다.
ru: Определяет, выполняется ли запрос перед фиксацией изменений в защищенной ветви.

# config.branchProtectionPrompt.alwaysCommit
source: Always commit changes to the protected branch.
ko: 항상 보호된 브랜치에 변경 내용을 커밋합니다.
ru: Всегда фиксировать изменения в защищенной ветви.

# config.branchProtectionPrompt.alwaysCommitToNewBranch
source: Always commit changes to a new branch.
ko: 변경 사항을 항상 새 브랜치에 커밋
ru: Всегда фиксировать изменения в новой ветви.

# config.branchProtectionPrompt.alwaysPrompt
source: Always prompt before changes are committed to a protected branch.
ko: 변경 내용이 보호된 분기에 커밋되기 전에 항상 프롬프트를 표시합니다.
ru: Всегда запрашивать перед фиксацией изменений в защищенной ветви.

# config.branchRandomNameDictionary
source: List of dictionaries used for the randomly generated branch name. Each value represents the dictionary used to generate the segment of the branch name. Supported dictionaries: `adjectives`, `animals`, `colors` and `numbers`.
ko: 무작위로 생성된 분기 이름에 사용되는 사전 목록입니다. 각 값은 분기 이름의 세그먼트를 생성하는 데 사용되는 사전을 나타냅니다. 지원되는 사전: '형용사', '동물', '색상', '숫자'.
ru: Список словарей, используемых для случайно сгенерированного названия ветки. Каждое значение представляет словарь, используемый для создания сегмента имени ветки. Поддерживаемые словари: "прилагательные", "животные", "цвета" и "числа".

# config.branchRandomNameDictionary.adjectives
source: A random adjective
ko: 무작위 형용사
ru: Случайное прилагательное

# config.branchRandomNameDictionary.animals
source: A random animal name
ko: 임의의 동물 이름
ru: Случайное имя животного

# config.branchRandomNameDictionary.colors
source: A random color name
ko: 임의의 색상 이름
ru: Случайное имя цвета

# config.branchRandomNameDictionary.numbers
source: A random number between 100 and 999
ko: 100에서 999 사이의 난수
ru: Случайное число от 100 до 999

# config.branchRandomNameEnable
source: Controls whether a random name is generated when creating a new branch.
ko: 새 브랜치를 만들 때 임의 이름이 생성되는지 여부를 제어합니다.
ru: Определяет, создается ли случайное имя при создании новой ветви.

# config.branchSortOrder
source: Controls the sort order for branches.
es: Controla el criterio de ordenación de las bifurcaciones.
fr: Contrôle l'ordre de tri des branches.
ko: 분기의 정렬 순서를 제어합니다.
ru: Управляет порядком сортировки ветвей.
zh_hans: 控制分支的排列顺序。

# config.branchValidationRegex
source: A regular expression to validate new branch names.
es: Una expresión regular para validar nuevos nombres de rama.
fr: Expression régulière pour valider les nouveaux noms de branche.
ko: 새 분기 이름의 유효성을 검사하는 정규식입니다.
ru: Регулярное выражение для проверки новых имен ветвей.
zh_hans: 用于验证新分支名称的正则表达式。

# config.branchWhitespaceChar
source: The character to replace whitespace in new branch names, and to separate segments of a randomly generated branch name.
ko: 새 브랜치 이름의 공백을 바꾸고 임의로 생성된 브랜치 이름의 세그먼트를 구분할 문자입니다.
ru: Символ для замены пробелов в новых именах ветвей и для разделения сегментов случайно созданного имени ветви.

# config.checkoutType
source: Controls what type of git refs are listed when running `Checkout to...`.
es: Controla qué tipo de referencias git son enumeradas cuando se ejecuta \"Desproteger en...\".
fr: Contrôle le type des références Git listées au moment de l'exécution de Extraire vers...
ko: '다음으로 체크 아웃...'을 실행할 때 나열되는 Git 참조의 형식을 제어합니다.
ru: Определяет, какие типы ссылок на GIT отображаются в списке при выполнении команды \"Извлечь в...\".
zh_hans: 控制在运行“签出到…”时列出的 git 参考类型。

# config.checkoutType.local
source: Local branches
es: Ramas locales
fr: Branches locales
ko: 로컬 분기
ru: Локальные ветви
zh_hans: 本地分支

# config.checkoutType.remote
source: Remote branches
es: Ramas remotas
fr: Branches distantes
ko: 원격 분기
ru: Удаленные ветви
zh_hans: 远程分支

# config.checkoutType.tags
source: Tags
es: Etiquetas
fr: Étiquettes
ko: 태그
ru: Теги
zh_hans: 标记

# config.closeDiffOnOperation
source: Controls whether the diff editor should be automatically closed when changes are stashed, committed, discarded, staged, or unstaged.
es: Controla si el editor de diferencias debe cerrarse automáticamente cuando los cambios se guardan provisionalmente, se confirman, se descartan, se almacenan provisionalmente o se quitan.
ko: 변경 내용을 스태시, 커밋, 삭제, 스테이징 또는 스테이징 해제할 때 diff 편집기를 자동으로 닫을지 여부를 제어합니다.
ru: Определяет, следует ли автоматически закрывать редактор несовпадений, когда изменения скрыты, зафиксированы, удалены, являются подготовленными или неподготовленными.

# config.commandsToLog
source: List of git commands (ex: commit, push) that would have their `stdout` logged to the [git output](command:git.showOutput). If the git command has a client-side hook configured, the client-side hook's `stdout` will also be logged to the [git output](command:git.showOutput).
es: Lista de comandos git (p. ej., commit, push) que tendrían `stdout` registrado en el [git output](command:git.showOutput). Si el comando git tiene configurado un enlace del lado cliente, el enlace del lado cliente `stdout` también se registrará en el [git output](command:git.showOutput).
ko: `stdout`를 [git output](command:git.showOutput)에 기록하는 git 명령(예: 커밋, 푸시) 목록입니다. git 명령에 클라이언트 측 후크가 구성된 경우 클라이언트 측 후크의 `stdout`도 [git output](command:git.showOutput)에 기록됩니다.
ru: Список команд Git (например, commit, push), для которых `stdout` записывается в [выходные данные Git](command:git.showOutput). Если для команды Git настроен обработчик на стороне клиента, то `stdout` обработчика на стороне клиента также будет записан в [выходные данные Git](command:git.showOutput).

# config.confirmEmptyCommits
source: Always confirm the creation of empty commits for the 'Git: Commit Empty' command.
es: Confirma siempre la creación de confirmaciones vacías para el comando \"Git: confirmación vacía\".
fr: Confirmez toujours la création de commits vides pour la commande 'Git: Commit Empty'.
ko: 'Git: Commit Empty' 명령에 대한 빈 항목 생성 커밋을 항상 확인합니다.
ru: Всегда подтверждайте создание пустых фиксаций для команды \"Git: Пустая фиксация\".
zh_hans: 始终为 “Git: Commit Empty” 命令确认创建空提交。

# config.confirmForcePush
source: Controls whether to ask for confirmation before force-pushing.
es: Controla si va a solicitar confirmación antes de forzar envío de cambios.
fr: Détermine s’il faut demander confirmation avant de forcer le push.
ko: 강제 푸시하기 전에 확인을 요청할지 여부를 제어합니다.
ru: Определяет, следует ли спрашивать подтверждение перед принудительной отправкой.
zh_hans: 控制在强制推送前是否进行确认。

# config.confirmNoVerifyCommit
source: Controls whether to ask for confirmation before committing without verification.
es: Controla si se debe pedir confirmación antes de ejecutar sin comprobación.
fr: Contrôle s’il faut demander une confirmation avant la validation sans vérification.
ko: 확인하지 않고 커밋하기 전에 확인을 요청할지를 제어합니다.
ru: Определяет, следует ли запрашивать подтверждение перед фиксацией без проверки.
zh_hans: 控制是否在提交前要求确认而不进行验证。

# config.confirmSync
source: Confirm before synchronizing git repositories.
es: Confirmar antes de sincronizar repositorios GIT.
fr: Confirmez avant de synchroniser des dépôts git.
ko: Git 리포지토리를 동기화하기 전에 확인합니다.
ru: Подтвердите синхронизацию репозиториев Git.
zh_hans: 同步 Git 存储库前请先进行确认。

# config.countBadge
source: Controls the Git count badge.
es: Controla la insignia de recuento de Git.
fr: Contrôle le badge de compte Git.
ko: Git 개수 배지를 제어합니다.
ru: Определяет индикатор событий Git.
zh_hans: 控制 Git 计数徽章。
