Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/import.*.xlf
Languages: de, ko, zh_hant

# flatFile.InvalidFileLocation
source: Invalid file location. Please try a different input file
de: Ungültiger Dateispeicherort. Versuchen Sie es mit einer anderen Eingabedatei.
ko: 잘못된 파일 위치입니다. 다른 입력 파일을 사용해 보세요.
zh_hant: 無效的檔案位置。請嘗試其他輸入檔

# flatFileImport.allowNulls
source: Allow Nulls
de: NULL-Werte zulassen
ko: Null 허용
zh_hant: 允許 Null 值

# flatFileImport.browseFiles
source: Browse
de: Durchsuchen
ko: 찾아보기
zh_hant: 瀏覽

# flatFileImport.columnName
source: Column Name
de: Spaltenname
ko: 열 이름
zh_hant: 資料行名稱

# flatFileImport.columnTableTitle
source: Column
de: Spalte
ko: 열

# flatFileImport.createDerivedColumn
source: Create derived column
de: Abgeleitete Spalte erstellen
ko: 파생 열 만들기

# flatFileImport.dataType
source: Data Type
de: Datentyp
ko: 데이터 형식
zh_hant: 資料類型

# flatFileImport.databaseDropdownTitle
source: Database the table is created in
de: Datenbank, in der die Tabelle erstellt wird
ko: 테이블이 생성된 데이터베이스
zh_hant: 資料表建立所在的資料庫

# flatFileImport.databaseName
source: Database name
de: Datenbankname
ko: 데이터베이스 이름
zh_hant: 資料庫名稱

# flatFileImport.deriverColumnInstruction1
source: Select the columns of data on the left required to derive your new column
de: Wählen Sie die Datenspalten auf der linken Seite aus, die zum Ableiten der neuen Spalte erforderlich sind
ko: 새 열을 파생시키는 데 필요한 왼쪽의 데이터 열을 선택하세요.

# flatFileImport.deriverColumnInstruction2
source: Select a row and specify an example transformation that you would like applied to the rest of the column
de: Wählen Sie eine Zeile aus, und geben Sie eine Beispieltransformation an, die Sie auf den Rest der Spalte anwenden möchten
ko: 행을 선택하고 나머지 열에 적용할 예제 변환을 지정합니다.

# flatFileImport.deriverColumnInstruction3
source: Click "Preview Transformation" to preview the transformation
de: Klicken Sie auf "Vorschau der Transformation anzeigen", um eine Vorschau der Transformation anzuzeigen
ko: 변환을 미리 보려면 "변환 미리 보기"를 클릭하세요.

# flatFileImport.deriverColumnInstruction4
source: Refine your transformation until you have the desired column
de: Verfeinern Sie Ihre Transformation, bis Sie die gewünschte Spalte erhalten
ko: 원하는 열이 생길 때까지 변환을 수정하세요.

# flatFileImport.deriverColumnInstruction5
source: Specify the new derived column's name and click "Done"
de: Geben Sie den Namen der neuen abgeleiteten Spalte an und klicken Sie auf "Fertig"
ko: 새 파생 열의 이름을 지정하고 "완료"를 클릭합니다.

# flatFileImport.fileImport
source: File to be imported
de: Zu importierende Datei
ko: 가져올 파일
zh_hant: 要匯入的檔案

# flatFileImport.fileTextboxTitle
source: Location of the file to be imported
de: Speicherort der zu importierenden Datei
ko: 가져올 파일의 위치
zh_hant: 要匯入檔案的位置

# flatFileImport.headerIntructionText
source: Welcome to the Derived Column Tool! To get started, please follow the steps below:
de: Willkommen beim Tool für abgeleitete Spalten! Führen Sie die folgenden Schritte aus, um loszulegen:
ko: 파생 열 도구에 오신 것을 환영합니다! 시작하려면 다음 단계를 따르세요.

# flatFileImport.importData
source: Import Data
de: Daten importieren
ko: 데이터 가져오기
zh_hant: 匯入資料

# flatFileImport.importInformation
source: Import information
de: Informationen importieren
ko: 정보 가져오기
zh_hant: 匯入資訊

# flatFileImport.importNewFile
source: Import new file
de: Neue Datei importieren
ko: 새 파일 가져오기
zh_hant: 匯入新檔案

# flatFileImport.importStatus
source: Import status
ko: 상태 가져오기
zh_hant: 匯入狀態

# flatFileImport.next
source: Next
de: Weiter
ko: 다음
zh_hant: 下一個

# flatFileImport.openFile
source: Open
de: Öffnen
ko: 열기
zh_hant: 開啟

# flatFileImport.page1Name
source: Specify Input File
de: Eingabedatei angeben
ko: 입력 파일 지정
zh_hant: 指定輸入檔

# flatFileImport.page2Name
source: Preview Data
de: Datenvorschau
ko: 데이터 미리 보기
zh_hant: 預覽資料

# flatFileImport.page3Name
source: Modify Columns
de: Spalten ändern
ko: 열 수정
zh_hant: 修改資料行

# flatFileImport.page4Name
source: Summary
de: Zusammenfassung
ko: 요약
zh_hant: 摘要

# flatFileImport.previewTransformation
source: Preview Transformation
de: Vorschau der Transformation
ko: 변환 미리 보기

# flatFileImport.primaryKey
source: Primary Key
de: Primärschlüssel
ko: 기본 키
zh_hant: 主索引鍵

# flatFileImport.prosePreviewMessage
source: This operation analyzed the input file structure to generate the preview below for up to the first 50 rows.
de: Mit diesem Vorgang wurde die Struktur der Eingabedatei analysiert, um die nachstehende Vorschau für die ersten 50 Zeilen zu generieren.
ko: 이 작업은 입력 파일 구조를 분석하여 처음 50개 행의 미리 보기를 아래에 생성했습니다.
zh_hant: 這項作業分析了輸出檔案結構，並產生了以下最多包含前 50 列的預覽。

# flatFileImport.prosePreviewMessageFail
source: This operation was unsuccessful. Please try a different input file.
de: Der Vorgang war nicht erfolgreich. Versuchen Sie es mit einer anderen Eingabedatei.
ko: 이 작업이 실패했습니다. 다른 입력 파일을 사용해 보세요.
zh_hant: 這項作業不成功。請嘗試其他輸入檔案。

# flatFileImport.refresh
source: Refresh
de: Aktualisieren
ko: 새로 고침
zh_hant: 重新整理

# flatFileImport.schemaTextboxTitle
source: Table schema
de: Tabellenschema
ko: 테이블 스키마
zh_hant: 資料表結構描述

# flatFileImport.selectAllColumns
source: Select all columns
de: Alle Spalten auswählen
ko: 모든 열 선택

# flatFileImport.selectColumn
source: Select column {0}
de: Spalte {0} auswählen
ko: 열 {0} 선택

# flatFileImport.serverDropdownTitle
source: Server the database is in
de: Server, auf dem sich die Datenbank befindet
ko: 데이터베이스가 있는 서버
zh_hant: 資料庫所在的伺服器

# flatFileImport.serverName
source: Server name
ko: 서버 이름
zh_hant: 伺服器名稱

# flatFileImport.specifyDerivedColNameTitle
source: Column Name
de: Spaltenname
ko: 열 이름

# flatFileImport.specifyTransformation
source: Specify Transformation
de: Transformation angeben
ko: 변환 지정

# flatFileImport.specifyTransformationForRow
source: Specify transformation for row {0}
de: Transformation für Zeile {0} angeben
ko: 행 {0}에 대한 변환 지정

# flatFileImport.success.norows
source: ✔ You have successfully inserted the data into a table.
de: ✔ Sie haben die Daten erfolgreich in eine Tabelle eingefügt.
ko: ✔ 테이블에 데이터를 입력했습니다.
zh_hant: ✔ 您已成功將資料插入表中。

# flatFileImport.tableName
source: Table name
de: Tabellenname
ko: 테이블 이름
zh_hant: 資料表名稱

# flatFileImport.tableSchema
source: Table schema
de: Tabellenschema
ko: 테이블 스키마
zh_hant: 資料表結構描述

# flatFileImport.tableTextboxTitle
source: New table name
de: Name der neuen Tabelle
ko: 새 테이블 이름
zh_hant: 新增資料表名稱

# flatFileImport.wizardName
source: Import flat file wizard
de: Assistent zum Importieren von Flatfiles
ko: 플랫 파일 가져오기 마법사
zh_hant: 匯入一般檔案精靈

# import.needConnection
source: Please connect to a server before using this wizard.
de: Stellen Sie eine Verbindung mit einem Server her, bevor Sie diesen Assistenten verwenden.
ko: 이 마법사를 사용하기 전에 서버에 연결하세요.
zh_hant: 請先連線至伺服器再使用本精靈。

# import.needSQLConnection
source: SQL Server Import extension does not support this type of connection
de: Die SQL-Server-Importerweiterung unterstützt diesen Verbindungstyp nicht.
ko: SQL Server 가져오기 확장은 이 유형의 연결을 지원하지 않습니다.
zh_hant: SQL Server 匯入延伸不支援此類型的連線

# import.serviceCrashButton
source: Give Feedback
de: Feedback senden
ko: 사용자 의견 제공
zh_hant: 提供意見反應

# serviceCrashMessage
source: service component could not start
de: Die Dienstkomponente konnte nicht gestartet werden.
ko: 서비스 구성 요소를 시작할 수 없습니다.
zh_hant: 服務元件無法啟動

# downloadingService
source: Downloading {0}
de: "{0}" wird heruntergeladen.
ko: {0} 다운로드 중
zh_hant: 正在下載 {0}

# downloadingServiceComplete
source: Done downloading {0}
de: Das Herunterladen von {0} wurde abgeschlossen
ko: {0} 다운로드 완료
zh_hant: 已完成下載 {0}

# downloadingServiceStatus
source: Downloading {0}
de: "{0}" wird heruntergeladen.
ko: {0} 다운로드 중
zh_hant: 正在下載 {0}

# entryExtractedChannelMsg
source: Extracted {0} ({1}/{2})
de: {0} extrahiert ({1}/{2})
ko: 추출된 {0}({1}/{2})
zh_hant: 已擷取 {0} ({1}/{2})

# flatFileImport.serviceStartFailed
source: Failed to start {0}: {1}
de: Fehler beim Starten von {0}: {1}
ko: {0}:{1}을(를) 시작하지 못함
zh_hant: 無法啟動 {0}: {1}

# installingService
source: Installing {0} Service
de: Der Dienst {0} wird installiert
ko: {0} 서비스를 설치하는 중
zh_hant: 正在安裝 {0} 服務

# installingServiceDetailed
source: Installing {0} to {1}
de: "{0}" wird in "{1}" installiert.
ko: {1}에 {0} 설치 중
zh_hant: 正在將 {0} 安裝到 {1}

# serviceInstalled
source: Installed {0}
de: "{0}" wurde installiert.
ko: 설치된 {0}
zh_hant: 已安裝 {0}

# serviceStarted
source: {0} Started
de: "{0}" wurde gestartet.
ko: {0}이(가) 시작됨
zh_hant: 已啟動 {0}

# serviceStarting
source: Starting {0}
de: "{0}" wird gestartet.
ko: {0}을(를) 시작하는 중
zh_hant: 正在啟動 {0}

# flatfileimport.configuration.title
source: Flat File Import configuration
de: Flatfile-Importkonfiguration
ko: 플랫 파일 가져오기 구성
zh_hant: 一般檔案匯入設定

# flatfileimport.logDebugInfo
source: [Optional] Log debug output to the console (View -> Output) and then select appropriate output channel from the dropdown
de: [Optional] Protokollieren Sie die Debugausgabe in der Konsole (Ansicht > Ausgabe), und wählen Sie dann in der Dropdownliste den geeigneten Ausgabekanal aus.
ko: [옵션] 디버그 출력을 콘솔에 로깅한 다음(보기 -> 출력), 드롭다운에서 해당 출력 채널을 선택합니다.
zh_hant: [選用] 將偵錯記錄輸出至主控台 ([檢視] -> [輸出])，並從下拉式清單選取適當的輸出通道
