Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/machine-learning.*.xlf
Languages: de, fr, it, ja, ko, pt_br, zh_hans, zh_hant

# modelTableInfo
source: Select a model table to view the list of existing / imported models.
de: Wählen Sie eine Modelltabelle aus, um die Liste der vorhandenen/importierten Modelle anzuzeigen.
fr: Sélectionnez une table de modèles pour afficher la liste des modèles existants/importés.
it: Selezionare una tabella modelli per visualizzare l'elenco dei modelli esistenti/importati.
ja: モデル テーブルを選択して、既存のまたはインポートされたモデルのリストを表示します。
ko: 모델 테이블을 선택하여 기존/가져온 모델 목록을 봅니다.
pt_br: Selecione uma tabela de modelo para exibir a lista de modelos existentes/importados.
zh_hans: 选择模型表以查看现有/导入的模型的列表。
zh_hant: 選取模型資料表以檢視現有/匯入模型的清單。

# models.RegisterWizard
source: Import models
de: Importieren von Modellen
fr: Importer des modèles
it: Importare modelli
ja: インポート モデル
ko: 모델 가져오기
pt_br: Modelos de importação
zh_hans: 导入模型
zh_hant: 匯入模型

# models.azureAccount
source: Azure account
de: Azure-Konto
fr: Compte Azure
it: Account Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Conta do Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶

# models.azureGroup
source: Resource group
de: Ressourcengruppe
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de recursos
zh_hans: 资源组
zh_hant: 資源群組

# models.azureModelFilter
source: Filter
fr: Filtrer
it: Filtro
ja: フィルター
ko: 필터
pt_br: Filtro
zh_hans: 筛选器
zh_hant: 篩選

# models.azureModelPageTitle
source: Import from Azure Machine Learning
de: Aus Azure Machine Learning importieren
fr: Importer à partir de Azure Machine Learning
it: Importare da Azure Machine Learning
ja: Azure Machine Learning からインポート
ko: Azure Machine Learning에서 가져오기
pt_br: Importar do Azure Machine Learning
zh_hans: 从 Azure 机器学习导入
zh_hant: 從 Azure Machine Learning 匯入

# models.azureModelSource
source: Azure Machine Learning
zh_hans: Azure 机器学习

# models.azureModelSourceDescriptionForImport
source: ‘Azure Machine Learning’ is selected. This allows you to import models stored in Azure Machine Learning workspaces in a model database in this SQL instance. Click ‘Next’ to continue.​​
de: „Azure Machine Learning“ ist ausgewählt. Auf diese Weise können Sie Modelle importieren, die in Azure Machine Learning-Arbeitsbereichen in einer Modelldatenbank in dieser SQL-Instanz gespeichert sind. Klicken Sie auf „Weiter“, um fortzufahren.​ ​
fr: « Azure Machine Learning » est sélectionnée. Cela vous permet d’importer des modèles stockés dans Azure Machine Learning espaces de travail d’une base de données model dans cette instance SQL. Cliquez sur suivant pour continuer.​​
it: “Azure Machine Learning” selezionato. Ciò consente di importare i modelli archiviati nelle aree di lavoro di Azure Machine Learning in un database modello in questa istanza SQL. Fare clic su “Avanti” per continuare.
ja: 'Azure Machine Learning' が選択されています。これにより、この SQL インスタンスのモデル データベース内の Azure Machine Learning ワークスペースに格納されているモデルをインポートできます。続行するには、[次へ] をクリックしてください。​​
ko: 'Azure Machine Learning'이 선택되었습니다. 이렇게 하면 SQL 인스턴스의 모델 데이터베이스에서 Azure Machine Learning 작업 영역에 저장 된 모델을 가져올 수 있습니다. 계속 하려면 '다음'을 클릭하세요.​​
pt_br: ‘Azure Machine Learning’ está selecionado. Isso permite que você importe modelos armazenados em espaços de trabalho do Azure Machine Learning em um banco de dados de modelo nesta instância SQL. Clique em ‘Avançar’ para continuar.​​
zh_hans: 已选择“Azure 机器学习”。此操作允许你导入存储在此 SQL 实例中模型数据库内 Azure 机器学习工作区中的模型。单击“下一步”以继续。​ ​
zh_hant: 已選取‘Azure Machine Learning’。這可讓您匯入儲存在此 SQL 執行個體中模型資料庫 Azure Machine Learning 工作區中的模型。點擊 [下一步] 以繼續。​​

# models.azureModelSourceDescriptionForPredict
source: ‘Azure Machine Learning’ is selected. This allows you to choose from models stored in Azure Machine Learning workspaces. Click ‘Next’ to continue.​
de: „Azure Machine Learning“ ist ausgewählt. Auf diese Weise können Sie aus Modellen auswählen, die in Azure Machine Learning-Arbeitsbereichen gespeichert sind. Klicken Sie auf „ Weiter“, um fortzufahren. ​
fr: « Azure Machine Learning » est sélectionnée. Cela vous permet de choisir des modèles stockés dans Azure Machine Learning espaces de travail. Cliquez sur suivant pour continuer.​
it: “Azure Machine Learning” selezionato. Ciò consente di scegliere tra i modelli archiviati nelle aree di lavoro di Azure Machine Learning. Fare clic su “Avanti” per continuare.​
ja: 'Azure Machine Learning' が選択されています。これにより、Azure Machine Learning ワークスペースに保存されているモデルを選択できます。続行するには、[次へ] をクリックしてください。​
ko: 'Azure Machine Learning'이 선택되었습니다. 이렇게 하면 Azure Machine Learning 작업 영역에 저장된 모델 중에서 선택할 수 있습니다. 계속하려면 '다음'을 클릭하세요.​
pt_br: ‘Azure Machine Learning’ está selecionado. Isso permite que você escolha um dos modelos armazenados nos espaços de trabalho do Azure Machine Learning. Clique em ‘Avançar’ para continuar.​
zh_hans: 已选择“Azure 机器学习”。此操作允许从存储在 Azure 机器学习工作区内的模型中进行选择。单击“下一步”以继续。​
zh_hant: 已選取‘Azure Machine Learning’。這可讓您從儲存在 Azure Machine Learning 工作區的模型中選擇。點擊 [下一步] 以繼續。​

# models.azureModelWorkspace
source: Azure ML workspace
de: Azure ML-Arbeitsbereich
fr: Espace de travail Azure ML
it: Area di lavoro di Azure ML
ja: Azure ML ワークスペース
ko: Azure ML 작업 영역
pt_br: Workspace do Machine Learning do Azure
zh_hans: Azure ML 工作区
zh_hant: Azure ML 工作區

# models.azureModels
source: Models
de: Modelle
fr: Modèles
it: Modelli
ja: モデル
ko: 모델
pt_br: Modelos
zh_hans: 模型
zh_hant: 模型

# models.azureModelsListEmptyDescription
source: Select another Azure ML workspace
de: Wählen Sie einen anderen Azure ML-Arbeitsbereich aus
fr: Sélectionner un autre espace de travail Azure ML
it: Selezionare un'altra area di lavoro di Azure ML
ja: 別の Azure ML ワークスペースを選択します
ko: 다른 Azure ML 작업 영역 선택
pt_br: Selecione outro espaço de trabalho do Azure ML
zh_hans: 选择另一个 Azure ML 工作区
zh_hant: 選取其他 Azure ML 工作區

# models.azureModelsListEmptyTitle
source: No models found
de: Keine Modelle gefunden.
fr: Aucun modèle trouvé
it: Non sono stati trovati modelli
ja: モデルが見つかりません
ko: 모델을 찾을 수 없음
pt_br: Nenhum modelo encontrado
zh_hans: 找不到任何模型
zh_hant: 找不到模型

# models.azureModelsTitle
source: Azure models
de: Azure-Modelle
fr: Modèles Azure
it: Modelli di Azure
ja: Azure モデル
ko: Azure 모델
pt_br: Modelos do Azure
zh_hans: Azure 模型
zh_hant: Azure 模型

# models.azureSignIn
source: Azure sign in or refresh account
de: Azure-Anmelde- oder -Aktualisierungskonto
fr: Connexion ou actualisation du compte Azure
it: Accedi ad Azure o Aggiorna account
ja: Azure サインインまたは更新アカウント
ko: Azure 로그인 또는 계정 새로 고침
pt_br: Entrar ou atualizar conta do Azure
zh_hans: Azure 登录或刷新帐户
zh_hant: Azure 登入或重新整理帳戶

# models.azureSubscription
source: Azure subscription
de: Azure-Abonnement
fr: Abonnement Azure
it: Sottoscrizione di Azure
ja: Azure サブスクリプション
ko: Azure 구독
pt_br: Assinatura do Azure
zh_hans: Azure 订阅
zh_hant: Azure 訂用帳戶

# models.columnDataTypeMismatchWarning
source: The data type of the source table column does not match the required input field’s type.
de: Der Datentyp der Quelltabellenspalte stimmt nicht mit dem erforderlichen Eingabefeldtyp überein.
fr: Le type de données de la colonne de la table source ne correspond pas au type du champ d’entrée requis.
it: Il tipo di dati della colonna della tabella di origine non corrisponde al tipo di campo di input richiesto.
ja: ソース テーブル列のデータ型が、必要な入力フィールドの型と一致しません。
ko: 원본 테이블 열의 데이터 형식이 필수 입력 필드의 형식과 일치하지 않습니다.
pt_br: O tipo de dados da coluna da tabela de origem não corresponde ao tipo do campo de entrada obrigatório.
zh_hans: 源表列的数据类型与所需的输入字段类型不匹配。
zh_hant: 來源資料表資料行的資料類型與必要的輸入欄位類型不相符。

# models.columnDataTypeMismatchWarningHeading
source: Differences in data type
de: Unterschiede beim Datentyp
fr: Différences dans le type de données
it: Differenze nel tipo di dati
ja: データ型の相違点
ko: 데이터 형식의 차이
pt_br: Diferenças no tipo de dados
zh_hans: 数据类型的差异
zh_hant: 資料類型的差異

# models.columnDataTypeMismatchWarningHelper
source: Click to review warning details
de: Klicken Sie hier, um die Warnungsdetails zu überprüfen
fr: Cliquez pour revoir les détails de l'avertissement
it: Fare clic per rivedere i dettagli dell'avviso
ja: クリックして警告の詳細を確認する
ko: 경고 세부 정보를 검토하려면 클릭하세요.
pt_br: Clique para examinar os detalhes do aviso
zh_hans: 单击以查看警告详细信息
zh_hant: 按一下以檢閱警告詳細資料

# models.columnSelectionPageTitle
source: Map source data to model
de: Quelldaten dem Modell zuordnen
fr: Mapper les données sources au modèle
it: Mappa i dati di origine al modello
ja: ソース データをモデルにマッピングする
ko: 모델에 원본 데이터 매핑
pt_br: Mapear dados de origem para o modelo
zh_hans: 将源数据映射到模型
zh_hant: 將來源資料對應至模型

# models.confirmDeleteModel
source: Are you sure you want to delete model '{0}?
de: Möchten Sie das Modell „{0}“ wirklich löschen?
fr: Voulez-vous vraiment supprimer le modèle {0} ?
it: Eliminare il modello '{0}?
ja: この '{0}' を削除しますか?
ko: ‘{0} 모델을 삭제하시겠습니까?
pt_br: Tem certeza de que deseja excluir o modelo '{0}?
zh_hans: 确定要删除模型“{0}”?
zh_hant: 確定要刪除 {0} 模型嗎?

# models.createNotebookDesc
source: Run experiments and create models in a notebook
de: Experimente ausführen und Modelle in einem Notizbuch erstellen
fr: Exécuter des expérimentations et créer des modèles dans un bloc-notes
it: Eseguire esperimenti e creare modelli in un blocco appunti
ja: ノートブックで実験を行い、モデルを作成します
ko: Notebook에서 실험 실행 및 모델 만들기
pt_br: Executar experimentos e criar modelos em um bloco de anotações
zh_hans: 在笔记本中运行试验和创建模型
zh_hant: 在筆記本中執行實驗並建立模型

# models.createNotebookTitle
source: Create notebook
de: Notebook erstellen
fr: Créer un notebook
it: Creare notebook
ja: ノートブックの作成
ko: 전자 필기장 만들기
pt_br: Criar um notebook
zh_hans: 创建笔记本
zh_hant: 建立筆記本

# models.created
source: Date created
de: Erstellt am
fr: Date de création
it: Data creazione
ja: 作成日
ko: 만든 날짜
pt_br: Data de criação
zh_hans: 已创建日期
zh_hant: 建立日期

# models.currentModelsTitle
source: Models
de: Modelle
fr: Modèles
it: Modelli
ja: モデル
ko: 모델
pt_br: Modelos
zh_hans: 模型
zh_hant: 模型

# models.description
source: Description
de: Beschreibung
it: Descrizione
ja: 説明
ko: 설명
pt_br: Descrição
zh_hans: 说明
zh_hant: 描述

# models.downloadModelMsgTaskName
source: Downloading Model from Azure
de: Das Modell wird aus Azure heruntergeladen
fr: Téléchargement du modèle à partir d’Azure
it: Download del modello da Azure
ja: Azure でモデルをダウンロードしています
ko: Azure에서 모델 다운로드
pt_br: Baixando modelo do Azure
zh_hans: 正在从 Azure 下载模型
zh_hant: 正在從 Azure 下載模型

# models.editModelTitle
source: Edit model
de: Modell bearbeiten
fr: Modifier le modèle
it: Modifica modello
ja: モデルの編集
ko: 모델 편집
pt_br: Editar o modelo
zh_hans: 编辑模型
zh_hant: 編輯模型

# models.fileName
source: File
de: Datei
fr: Fichier
ja: ファイル
ko: 파일
pt_br: Arquivo
zh_hans: 文件
zh_hant: 檔案

# models.framework
source: Framework
ja: フレームワーク
ko: 프레임워크
zh_hans: 框架
zh_hant: 架構

# models.frameworkVersion
source: Framework version
fr: Version du framework
it: Versione framework
ja: フレームワークのバージョン
ko: 프레임워크 버전
pt_br: Versão do Framework
zh_hans: 框架版本
zh_hant: 架構版本

# models.importModelDesc
source: Import or view machine learning models stored in database
de: In der Datenbank gespeicherte Machine Learning-Modelle importieren oder anzeigen
fr: Importer ou afficher les modèles machine learning stockés dans la base de données
it: Importare o visualizzare i modelli di Machine Learning archiviati nel database
ja: データベースに格納されている機械学習モデルをインポートまたは表示します
ko: 데이터베이스에 저장된 기계 학습 모델 가져오기 또는 보기
pt_br: Importar ou exibir modelos de Machine Learning armazenados no banco de dados
zh_hans: 导入或查看存储在数据库中的机器学习模型
zh_hant: 匯入或檢視儲存在資料庫中的機器學習模型

# models.importModelDoneButton
source: Import
de: Importieren
fr: Importer
it: Importa
ja: インポート
ko: 가져오기
pt_br: Importar
zh_hans: 导入
zh_hant: 匯入

# models.importModelFailedError
source: Failed to register the model: {0} ,file: {1}
de: Fehler beim Registrieren des Modells: {0}, Datei: {1}
fr: Échec de l’inscription du modèle : {0}, fichier : {1}
it: Non è stato possibile registrare il modello: {0}, file: {1}
ja: モデル {0}、ファイル {1} を登録できませんでした
ko: 모델을 등록 하지 못함: {0}, 파일: {1}
pt_br: Falha ao registrar o modelo: {0}, arquivo: {1}
zh_hans: 未能注册模型: {0}，文件: {1}
zh_hant: 無法註冊模型: {0}，檔案: {1}

# models.importModelTitle
source: Import or view models
de: Importieren oder Anzeigen von Modellen
fr: Importer ou afficher des modèles
it: Importa o Visualizza modelli
ja: モデルのインポートまたは表示
ko: 모델 가져오기 또는 보기
pt_br: Importar ou exibir modelos
zh_hans: 导入或查看模型
zh_hant: 匯入或檢視模型

# models.imported
source: Date imported
de: Importdatum
fr: Date d'importation
it: Data importazione
ja: インポートされた日付
ko: 가져온 날짜
pt_br: Data da importação
zh_hans: 已导入日期
zh_hant: 匯入日期

# models.importedModelSourceDescriptionForPredict
source: ‘Imported Models’ is selected. This allows you to choose from models stored in a model table in your database. Click ‘Next’ to continue.​
de: "Importierte Modelle" ist ausgewählt. Auf diese Weise können Sie aus Modellen auswählen, die in einer Modelltabelle in Ihrer Datenbank gespeichert sind. Klicken Sie auf "Weiter", um den Vorgang fortzusetzen.​
fr: L’option « modèles importés » est sélectionnée. Cela vous permet de choisir parmi les modèles stockés dans une table de modèles de votre base de données. Cliquez sur suivant pour continuer.​
it: È stato selezionato 'Modelli importati'. Consente di scegliere tra i modelli archiviati in una tabella modelli nel database. Fare clic su 'Avanti' per continuare.​
ja: ‘インポート済みモデル‘ が選択されました。これにより、データベース内のモデル テーブルに格納されているモデルを選択できます。[次へ] をクリックして続行します。​
ko: '가져온 모델'이 선택되었습니다. 이렇게 하면 데이터베이스의 모델 테이블에 저장된 모델 중에서 선택할 수 있습니다. 계속하려면 '다음'을 클릭하세요.​
pt_br: 'Modelos importados' está selecionado. Isso permite que você escolha um dos modelos armazenados em uma tabela de modelo no seu banco de dados. Clique em "Avançar" para continuar.​
zh_hans: 已选择“导入的模型”。这使你可以从存储在数据库中模型表内的模型中进行选择。单击“下一步”以继续。​
zh_hant: 已選取 [匯入的模型]。這可讓您從儲存在資料庫之模型資料表中的模型中選擇。按一下 [下一步] 以繼續。​

# models.importedModelsPageTitle
source: Select imported model
de: Importiertes Modell auswählen
fr: Sélectionner le modèle importé
it: Selezionare modello importato
ja: インポート済みモデルの選択
ko: 가져온 모델 선택
pt_br: Selecionar modelo importado
zh_hans: 选择导入的模型
zh_hant: 選取匯入的模型

# models.invalidAzureResourceError
source: Invalid Azure resource
de: Ungültige Azure-Ressource
fr: Ressource Azure non valide
it: Risorsa di Azure non valida
ja: 無効な Azure リソース
ko: 잘못된 Azure 리소스
pt_br: Recurso do Azure inválido
zh_hans: Azure 资源无效
zh_hant: Azure 資源無效

# models.invalidImportTableError
source: Invalid table for importing models. database name: {0} ,table name: {1}
de: Ungültige Tabelle zum Importieren von Modellen. Datenbankname: {0}, Tabellenname: {1}
fr: Table non valide pour l’importation de modèles. nom de la base de données : {0}, nom de la table : {1}
it: Tabella non valida per l'importazione di modelli. nome database: {0}, nome tabella: {1}
ja: モデルをインポートするための無効なテーブル。データベース名: {0}、テーブル名: {1}
ko: 모델을 가져오기 위한 테이블이 잘못되었습니다. 데이터베이스 이름: {0}, 테이블 이름: {1}
pt_br: Tabela inválida para importar modelos. nome do banco de dados: {0}, nome da tabela: {1}
zh_hans: 导入模型的表无效。数据库名: {0}，表名: {1}
zh_hant: 資料表無效，無法匯入模型。資料庫名稱: {0}，資料表名稱: {1}

# models.invalidImportTableSchemaError
source: Table schema is not supported for model import. Database name: {0}, table name: {1}.
de: Das Tabellenschema wird für den Modellimport nicht unterstützt. Datenbankname: {0}, Tabellenname: {1}.
fr: Le schéma de la table n’est pas pris en charge pour l’importation de modèle. Nom de la base de données : {0}, nom de la table : {1}.
it: Lo schema della tabella non è supportato per l'importazione del modello. Nome database: {0}, nome tabella: {1}.
ja: テーブル スキーマは、モデルのインポートがサポートされていません。データベース名: {0}、テーブル名: {1}。
ko: 모델 가져오기에는 테이블 스키마가 지원되지 않습니다. 데이터베이스 이름: {0}, 테이블 이름: {1}.
pt_br: O esquema de tabela não tem suporte para importação do modelo. Nome do banco de dados: {0}, nome da tabela: {1}.
zh_hans: 模型导入不支持表架构。数据库名: {0}，表名: {1}。
zh_hant: 模型匯入不支援資料表結構描述。資料庫名稱: {0}，資料表名稱: {1}。

# models.invalidModelImportTargetError
source: Please select a valid table
de: Wählen Sie eine gültige Tabelle aus
fr: Sélectionnez une table valide
it: Selezionare una tabella valida
ja: 有効なテーブルを選択してください
ko: 올바른 테이블을 선택하세요.
pt_br: Selecione uma tabela válida
zh_hans: 请选择一个有效任务
zh_hant: 請選取有效的資料表

# models.invalidModelParametersError
source: Please select valid source table and model parameters
de: Wählen Sie gültige Quelltabellen-und Modellparameter aus.
fr: Veuillez sélectionner une table source et des paramètres de modèle valides
it: Selezionare i parametri validi per la tabella e il modello di origine
ja: 有効なソース テーブルとモデル パラメーターを選択してください
ko: 유효한 원본 테이블 및 모델 매개 변수를 선택하세요.
pt_br: Selecione parâmetros de tabela e modelo de origem válidos
zh_hans: 请选择有效的源表和模型参数
zh_hant: 請選取有效的來源資料表和模型參數

# models.invalidModelToPredictError
source: Invalid model to predict
de: Ungültiges Modell für Vorhersage
fr: Modèle non valide pour prédire
it: Modello non valido da stimare
ja: 予測するモデルが無効
ko: 예측할 모델이 잘못되었습니다.
pt_br: Modelo inválido para previsão
zh_hans: 要预测的模型无效
zh_hant: 要預測的模型無效

# models.invalidModelToRegisterError
source: Invalid model to register
de: Ungültiges Modell zum Registrieren
fr: Modèle non valide pour l’inscription
it: Modello non valido per la registrazione
ja: 登録するモデルが無効
ko: 등록할 모델이 잘못되었습니다.
pt_br: Modelo inválido para registrar
zh_hans: 要注册的模型无效
zh_hant: 要註冊的模型無效

# models.invalidModelToSelectError
source: Please select a valid model
de: Wählen Sie ein gültiges Modell aus
fr: Sélectionnez un modèle valide
it: Selezionare un modello valido
ja: 有効なモデルを選択してください。
ko: 유효한 모델을 선택하세요.
pt_br: Selecione um modelo válido
zh_hans: 请选择一个有效模型
zh_hant: 請選取有效的模型

# models.learnMoreLink
source: Learn more.
de: Weitere Informationen.
fr: En savoir plus.
it: Altre informazioni.
ja: 詳細を表示。
ko: 자세히 알아보세요.
pt_br: Saiba mais.
zh_hans: 了解详细信息。
zh_hant: 深入了解。

# models.loadModelParameterFailedError
source: Failed to load model parameters'
de: Fehler beim Laden der Modellparameter
fr: Impossible de charger les paramètres du modèle
it: Non è stato possibile caricare i parametri del modello'
ja: モデル パラメーターを読み込めませんでした
ko: 모델 매개 변수를 로드하지 못했습니다.'
pt_br: Falha ao carregar os parâmetros modelo'
zh_hans: 未能加载模型参数’
zh_hant: 無法載入模型參數

# models.localModelPageTitle
source: Upload model file
de: Modelldatei hochladen
fr: Télécharger le fichier de modèle
it: Carica file di modello
ja: モデル ファイルのアップロード
ko: 모델 파일 업로드
pt_br: Carregar arquivo de modelo
zh_hans: 上传模型文件
zh_hant: 上傳模型檔

# models.localModelSource
source: File upload
de: Dateiupload
fr: Chargement de fichier
it: Caricamento file
ja: ファイルのアップロード
ko: 파일 업로드
pt_br: Upload de arquivo
zh_hans: 文件上传
zh_hant: 檔案上傳

# models.localModelSourceDescriptionForImport
source: ‘File Upload’ is selected. This allows you to import a model file from your local machine into a model database in this SQL instance. Click ‘Next’ to continue.​
de: „Dateiupload“ ist ausgewählt. Dadurch können Sie eine Modelldatei von Ihrem lokalen Computer in eine Modelldatenbank in dieser SQL-Instanz importieren. Klicken Sie auf „Weiter“, um fortzufahren.​
fr: 'Chargement de fichier’ est sélectionné. Cela vous permet d’importer un fichier de modèle de votre machine locale dans une base de données de modèles dans cette instance SQL. Cliquez sur suivant pour continuer.​
it: 'Caricamento file' selezionato. Consente di importare un file di modello dal computer locale in un database modello in questa istanza SQL. Fare clic su 'avanti' per continuare.​
ja: ‘ファイル アップロード‘ が選択されました。これにより、モデル ファイルをローカル マシンからこの SQL インスタンスのモデル データベースにインポートできます。[次へ] をクリックして続行します。​
ko: ‘파일 업로드’가 선택되었습니다. 이렇게 하면 로컬 컴퓨터에서 이 SQL 인스턴스의 모델 데이터베이스로 모델 파일을 가져올 수 있습니다. 계속하려면 ‘다음’을 클릭하세요.​
pt_br: 'Carregamento de arquivo' foi selecionado. Isso permite que você importe um arquivo de modelo do computador local para um banco de dados modelo nesta instância do SQL. Clique em "Avançar" para continuar.​
zh_hans: 已选择“文件上传”。这允许你将模型文件从本地计算机导入到此 SQL 实例中的模型数据库中。单击“下一步”以继续。​
zh_hant: 已選取 [檔案上傳]。這可讓您將本機電腦中的模型檔案匯入此 SQL 執行個體中的模型資料庫。按一下 [下一步] 以繼續。​

# models.localModelSourceDescriptionForPredict
source: ‘File Upload’ is selected. This allows you to upload a model file from your local machine. Click ‘Next’ to continue.​​
de: „Dateiupload“ ist ausgewählt. Dadurch können Sie eine Modelldatei von Ihrem lokalen Computer hochladen. Klicken Sie auf „Weiter“, um fortzufahren.​​
fr: 'Chargement de fichier’est sélectionné. Cela vous permet de charger un fichier de modèle à partir de votre machine locale. Cliquez sur ‘Suivant’ pour continuer.​​
it: 'Caricamento file' è selezionato. In questo modo è possibile caricare un file di modello dal computer locale. Fare clic su ‘ Avanti’ per continuare.​​
ja: ‘ファイル アップロード‘ が選択されました。これにより、モデル ファイルをローカル マシンでアップロードできます。[次へ] をクリックして続行します。​​
ko: '파일 업로드'가 선택되었습니다. 이렇게 하면 로컬 컴퓨터에서 모델 파일을 업로드할 수 있습니다. 계속하려면 '다음'을 클릭하세요.​​
pt_br: 'Carregamento de Arquivo' selecionado. Isso permite que você carregue um arquivo de modelo do seu computador local. Clique em "Avançar" para continuar.​​
zh_hans: 已选择“文件上传”。此操作允许从本地计算机上传模型文件。单击“下一步”以继续。​​
zh_hant: 已選取 [檔案上傳]。這可讓您從本機電腦上傳模型檔案。按一下 [下一步] 以繼續。​​

# models.localModelsTitle
source: Local models
de: Lokale Modelle
fr: Modèles locaux
it: Modelli locali
ja: ローカル モデル
ko: 로컬 모델
pt_br: Modelos locais
zh_hans: 本地模型
zh_hant: 本機模型

# models.makePredictionDesc
source: Generate a predicted value or scores using a managed model
de: Vorhergesagten Wert oder Ergebnisse mithilfe eines verwalteten Modells generieren
fr: Générer une valeur ou des scores prédits en utilisant un modèle managé.
it: Generare un valore stimato o punteggi usando un modello gestito
ja: 管理対象のモデルを使用して予測値またはスコアを生成する
ko: 관리되는 모델을 사용하여 예측 값 또는 점수 생성
pt_br: Gerar um valor previsto ou uma pontuação usando um modelo gerenciado
zh_hans: 使用托管模型生成预测值或分数
zh_hant: 使用受控模型產生預測值或分數

# models.makePredictionTitle
source: Make predictions
de: Vorhersagen vornehmen
fr: Effectuer des prédictions
it: Eseguire stime
ja: 予測する
ko: 예측 만들기
pt_br: Fazer previsão
zh_hans: 进行预测
zh_hant: 進行預測

# models.modelDetailsPageTitle
source: Enter model details
de: Modelldetails eingeben
fr: Entrer les détails du modèle
it: Immettere i dettagli del modello
ja: モデルの詳細を入力する
ko: 모델 세부 정보 입력
pt_br: Exibir os detalhes do modelo
zh_hans: 输入模型详细信息
zh_hant: 輸入模型詳細資料

# models.modelFailedToRegistered
source: Model failed to register
de: Fehler beim Registrieren des Modells.
fr: Le modèle n'a pas été enregistré
it: Registrazione del modello non riuscita
ja: モデルを登録できませんでした
ko: 모델을 등록하지 못했습니다.
pt_br: O modelo não pôde registrar
zh_hans: 模型未能注册
zh_hant: 模型無法註冊

# models.modelImportTargetPageTitle
source: Select or enter the location to import the models to
de: Wählen Sie den Speicherort für den Import der Modelle aus oder geben Sie diesen ein.
fr: Sélectionnez ou entrez l’emplacement dans lequel les modèles doivent être importés
it: Selezionare o immettere il percorso in cui importare i modelli
ja: モデルをインポートする場所を選択または入力する
ko: 모델을 가져올 위치 선택 또는 입력
pt_br: Selecione ou insira o local para o qual importar os modelos
zh_hans: 选择或输入要将模型导入到的位置
zh_hant: 選取或輸入要將模型匯入的位置

# models.modelLocalSourceTitle
source: Source files
de: Quelldateien
fr: Fichiers sources
it: File di origine
ja: ソース ファイル
ko: 원본 파일
pt_br: Arquivos de origem
zh_hans: 源文件
zh_hant: 來源檔案

# models.modelLocalSourceTooltip
source: File paths of the models to import
de: Dateipfade der zu importierenden Modelle
fr: Chemins d’accès aux fichiers des modèles à importer
it: Percorsi dei file dei modelli da importare
ja: インポートするモデルのファイル パス
ko: 가져올 모델의 파일 경로
pt_br: Caminhos de arquivo dos modelos a serem importados
zh_hans: 要导入的模型的文件路径
zh_hant: 要匯入之模型的檔案路徑

# models.modelNameRequiredError
source: Model name is required.
de: Der Modellname muss angegeben werden.
fr: Nom de modèle obligatoire.
it: Il nome del modello è obbligatorio.
ja: モデル名が必要です。
ko: 모델 이름이 필요합니다.
pt_br: É necessário o nome do modelo.
zh_hans: 模型名称是必填项。
zh_hant: 需要模型名稱。

# models.modelRegisteredSuccessfully
source: Model registered successfully
de: Das Modell wurde erfolgreich registriert
fr: Inscription du modèle réussie
it: Il modello è stato registrato
ja: モデルは正常に登録されました
ko: 모델이 등록되었습니다.
pt_br: Modelo registrado com êxito
zh_hans: 已成功注册类型
zh_hant: 已成功註冊模型
