Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/machine-learning.*.xlf
Languages: de, fr, it, ja, ko, pt_br, zh_hans, zh_hant

# azure.resource.error
source: Error: {0}
de: Fehler: {0}
fr: Erreur : {0}
it: Errore: {0}
ja: エラー: {0}
ko: 오류: {0}
pt_br: Erro: {0}
zh_hans: 错误: {0}
zh_hant: 錯誤: {0}

# dashboardDesc
source: Machine Learning for SQL databases
de: Machine Learning für SQL-Datenbanken
fr: Machine Learning des bases de données SQL
it: Machine Learning per i database SQL
ja: SQL データベース向け機械学習
ko: SQL 데이터베이스에 대한 Machine Learning
pt_br: Machine Learning para bancos de dados SQL
zh_hans: 针对 SQL 数据库的机器学习
zh_hant: SQL 資料庫的機器學習

# dashboardLinksTitle
source: Useful links
de: Nützliche Links
fr: Liens utiles
it: Collegamenti utili
ja: 役に立つリンク
ko: 유용한 링크
pt_br: Links Úteis
zh_hans: 有用链接
zh_hant: 實用連結

# dashboardTitle
source: Machine Learning
pt_br: Aprendizado de Máquina
zh_hans: 机器学习
zh_hant: 機器學習

# dashboardVideoLinksTitle
source: Video tutorials
fr: Tutoriels vidéo
it: Esercitazioni video
ja: ビデオ チュートリアル
ko: 비디오 자습서
pt_br: Tutoriais em vídeo
zh_hans: 视频教程
zh_hant: 影片教學課程

# databaseName
source: Database
de: Datenbank
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Base de dados
zh_hans: 数据库
zh_hant: 資料庫

# databaseToStoreInfo
source: Select a database to store the new model.
de: Wählen Sie eine Datenbank zum Speichern des neuen Modells aus.
fr: Sélectionnez une base de données pour stocker le nouveau modèle.
it: Selezionare un database per archiviare il nuovo modello.
ja: 新しいモデルの格納のため、データベースを選択する。
ko: 새 모델을 저장할 데이터베이스를 선택합니다.
pt_br: Selecionar um banco de dados para armazenar o novo modelo.
zh_hans: 选择要存储新模型的数据库。
zh_hant: 選取要儲存新模型的資料庫。

# editTitle
source: Edit
de: Bearbeiten
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
pt_br: Editar
zh_hans: 编辑
zh_hant: 編輯

# existingTableName
source: Existing table
de: Vorhandene Tabelle
fr: Table existante
it: Tabella esistente
ja: 既存のテーブル
ko: 기존 테이블
pt_br: Tabela Existente
zh_hans: 现有表
zh_hant: 現有資料表

# extLang.CancelButtonText
source: Cancel
de: Abbrechen
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消
zh_hant: 取消

# extLang.DialogTitle
source: Languages
de: Sprachen
fr: Langues
it: Lingue
ja: 言語
ko: 언어
pt_br: Linguagens
zh_hans: 语言
zh_hant: 語言

# extLang.DoneButtonText
source: Close
de: Schließen
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭
zh_hant: 關閉

# extLang.OkButtonText
source: OK
ko: 확인
zh_hans: 确定
zh_hant: 確定

# extLang.SaveButtonText
source: Save
de: Speichern
fr: Enregistrer
it: Salva
ja: 保存
ko: 저장
pt_br: Salvar
zh_hans: 保存
zh_hant: 儲存

# extLang.Target
source: Target
de: Ziel
fr: Cible
it: Destinazione
ja: ターゲット
ko: 대상
pt_br: Alvo
zh_hans: 目标
zh_hant: 目標

# extLang.delete
source: Delete
de: Löschen
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除
zh_hant: 刪除

# extLang.envVariables
source: Environment variables
de: Umgebungsvariablen
fr: Variables d'environnement
it: Variabili di ambiente
ja: 環境変数
ko: 환경 변수
pt_br: Variáveis ​​ambientais
zh_hans: 环境变量
zh_hant: 環境變數

# extLang.extensionFileLocation
source: Language extension location
de: Speicherort der Spracherweiterung
fr: Emplacement de l’extension de langage
it: Posizione dell'estensione del linguaggio
ja: 言語拡張機能の場所
ko: 언어 확장 위치
pt_br: Localização da extensão de idioma
zh_hans: 语言扩展位置
zh_hant: 語言延伸模組位置

# extLang.extensionFileName
source: Extension file Name
de: Name der Erweiterungsdatei
fr: Nom du fichier d’extension
it: Nome del file di estensione
ja: 拡張機能ファイル名
ko: 확장 파일 이름
pt_br: Nome do arquivo de extensão
zh_hans: 扩展文件名
zh_hant: 延伸模組檔案名稱

# extLang.extensionFilePath
source: Language extension path
de: Spracherweiterungspfad
fr: Chemin d’accès de l’extension de langage
it: Percorso di estensione del linguaggio
ja: 言語拡張機能パス
ko: 언어 확장 경로
pt_br: Caminho de extensão de linguagem
zh_hans: 语言扩展路径
zh_hant: 語言延伸模組路徑

# extLang.fileBrowserTabTitle
source: File Browser
de: Dateibrowser
fr: Explorateur de fichiers
it: Visualizzatore file
ja: ファイル ブラウザー
ko: 파일 브라우저
pt_br: Navegador de Arquivos
zh_hans: 文件浏览器
zh_hant: 檔案瀏覽器

# extLang.installButtonText
source: Install
de: Installieren
fr: Installer
it: Installa
ja: インストール
ko: 설치
pt_br: Instalar
zh_hans: 安装
zh_hant: 安裝

# extLang.installFailedError
source: Failed to install language
de: Fehler beim Installieren der Sprache
fr: Échec de l’installation de la langue
it: Non è stato possibile installare il linguaggio
ja: 言語をインストールできませんでした
ko: 언어를 설치하지 못했습니다.
pt_br: Falha ao instalar o idioma
zh_hans: 未能安装语言
zh_hant: 無法安裝語言

# extLang.installTabTitle
source: Installed
de: Installiert
fr: Installé
it: Installato
ja: インストール済み
ko: 설치됨
pt_br: Instalado
zh_hans: 已安装
zh_hant: 已安裝

# extLang.languageCreatedDate
source: Installed
de: Installiert
fr: Installé
it: Installato
ja: インストール済み
ko: 설치됨
pt_br: Instalado
zh_hans: 已安装
zh_hant: 已安裝

# extLang.languageName
source: Name
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称
zh_hant: 名稱

# extLang.languagePlatform
source: Platform
de: Plattform
fr: Plateforme
it: Piattaforma
ja: プラットフォーム
ko: 플랫폼
pt_br: Plataforma
zh_hans: 平台
zh_hant: 平台

# extLang.newLanguageTabTitle
source: Add new
de: Neu hinzufügen
fr: Ajouter un nouveau
it: Aggiungi nuovo
ja: 新規追加
ko: 새 항목 추가
pt_br: Adicionar novo
zh_hans: 新增
zh_hant: 新增

# extLang.parameters
source: Parameters
de: Parameter
fr: Paramètres
it: Parametri
ja: パラメーター
ko: 매개 변수
pt_br: Parâmetros
zh_hans: 参数
zh_hant: 參數

# extLang.selectedPath
source: Selected Path
de: Ausgewählter Pfad
fr: Chemin sélectionné
it: Percorso selezionato
ja: 選択されたパス
ko: 선택한 경로
pt_br: Caminho Selecionado
zh_hans: 所选路径
zh_hant: 選取的路徑

# extLang.updateFailedError
source: Failed to update language
de: Fehler beim Aktualisieren der Sprache.
fr: Échec de la mise à jour de la langue
it: Non è stato possibile aggiornare il linguaggio
ja: 言語を更新できませんでした
ko: 언어를 업데이트하지 못함
pt_br: Falha ao atualizar o idioma
zh_hans: 未能更新语言
zh_hant: 無法更新語言

# learnMoreTitle
source: Learn more
de: Weitere Informationen
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세히 알아보기
pt_br: Saber mais
zh_hans: 了解详细信息
zh_hant: 深入了解

# ml.dataCount
source: Showing {0} model(s)
de: Es wird/werden {0} Model(e) angezeigt.
fr: Affichage du ou des modèles {0}
it: Visualizzazione di {0} modello/i
ja: {0} モデルを表示しています
ko: {0} 모델 표시
pt_br: Mostrando {0} modelo(s)
zh_hans: 正在显示 {0} 个模型
zh_hant: 顯示 {0} 模型

# mls.cannotFindPython.error
source: Cannot find Python executable '{0}'. Please make sure Python is installed and configured correctly
de: Die ausführbare Python-Datei "{0}" wurde nicht gefunden. Stellen Sie sicher, dass Python ordnungsgemäß installiert und konfiguriert ist
fr: L’exécutable Python « {0} » est introuvable. Vérifiez que Python est correctement installé et configuré
it: Non è possibile trovare l'eseguibile R “ {0}“. Verificare che R sia installato e configurato correttamente
ja: Python 実行可能ファイル '{0}' が見つかりません。Python が正しくインストールおよび構成されていることを確認してください
ko: Python 실행 파일 '{0}'을(를) 찾을 수 없습니다. Python이 올바르게 설치 및 구성되어 있는지 확인하세요.
pt_br: Não é possível localizar o executável Python '{0}'. Certifique-se de que o Python está instalado e configurado corretamente
zh_hans: 找不到 Python 可执行文件“{0}”。请确保已正确安装和配置 Python
zh_hant: 找不到 Python 可執行檔 '{0}'。請確定已正確安裝及設定 Python

# mls.cannotFindR.error
source: Cannot find R executable '{0}'. Please make sure R is installed and configured correctly
de: Die ausführbare R-Datei "{0}" wurde nicht gefunden. Stellen Sie sicher, dass R ordnungsgemäß installiert und konfiguriert ist
fr: L’exécutable R « {0} » est introuvable. Vérifiez que R est correctement installé et configuré
it: Non è possibile trovare l'eseguibile R “{0}”. Verificare che R sia installato e configurato correttamente
ja: R 実行可能ファイル '{0}' が見つかりません。R が正しくインストールおよび構成されていることを確認してください
ko: R 실행 파일 '{0}'을(를) 찾을 수 없습니다. R이 설치되어 있고 제대로 구성되어 있는지 확인하세요.
pt_br: Não é possível localizar o executável R '{0}'. Certifique-se de que R está instalado e configurado corretamente
zh_hans: 找不到 R 可执行文件“{0}”。请确保已正确安装和配置 R
zh_hant: 找不到 R 可執行檔 '{0}'。請確定已正確安裝及設定 R

# mls.configAction
source: Action
de: Aktion
it: Azione
ja: アクション
ko: 작업
pt_br: Ação
zh_hans: 操作
zh_hant: 動作

# mls.configStatus
source: Enabled
de: Aktiviert
fr: Activé
it: Abilitata
ja: 有効
ko: 사용
pt_br: Habilitado
zh_hans: 已启用
zh_hant: 已啟用

# mls.configTitle
source: Config
de: Konfiguration
fr: Configurer
it: Configurazione
ja: 構成
ko: 구성
zh_hans: 配置
zh_hant: 設定

# mls.configUpdateFailed
source: Failed to modify Machine Learning Services configurations
de: Fehler beim Ändern der Machine Learning Services-Konfigurationen
fr: Échec de la modification des configurations de Machine Learning Services
it: Non è stato possibile modificare le configurazioni del servizio Machine Learning
ja: Machine Learning Services 構成を変更できませんでした
ko: Machine Learning Services 구성을 수정하지 못했습니다.
pt_br: Falha ao modificar as configurações de Machine Learning Services
zh_hans: 未能修改机器学习服务配置
zh_hant: 無法修改機器學習服務設定

# mls.confirmEnableExternalScripts
source: External script is required for package management. Are you sure you want to enable that.
de: Für die Paketverwaltung ist ein externes Skript erforderlich. Möchten Sie dies wirklich aktivieren?
fr: Un script externe est requis pour la gestion des packages. Voulez-vous vraiment l’activer.
it: Lo script esterno è obbligatorio per la gestione pacchetti. Abilitare questa opzione.
ja: パッケージ管理には外部スクリプトが必要です。これを有効にしてもよろしいですか?
ko: 패키지 관리에는 외부 스크립트가 필요합니다. 사용하도록 설정하시겠습니까?
pt_br: O script externo é necessário para o gerenciamento de pacotes. Tem certeza de que deseja habilitar isso.
zh_hans: 包管理需要外部脚本。是否确实要启用它?
zh_hant: 套件管理需要外部指令碼。您確定要啟用。

# mls.confirmInstallPythonPackages
source: Are you sure you want to install required packages?
de: Möchten Sie die erforderlichen Pakete installieren?
fr: Voulez-vous vraiment installer les packages requis ?
it: Installare i pacchetti obbligatori?
ja: 必要なパッケージをインストールしてもよろしいですか?
ko: 필수 패키지를 설치하시겠습니까?
pt_br: Tem certeza de que deseja instalar os pacotes necessários?
zh_hans: 是否确实要安装所需的包?
zh_hant: 您確定要安裝必要的套件嗎?

# mls.disableButtonTitle
source: Disable
de: Deaktivieren
fr: Désactiver
it: Disabilita
ja: 無効化
ko: 사용 안 함
pt_br: Desabilitar
zh_hans: 禁用
zh_hant: 停用

# mls.downloadError
source: Error while downloading
de: Fehler beim Herunterladen
fr: Erreur lors du téléchargement
it: Si è verificato un errore durante il download
ja: ダウンロード中のエラー
ko: 다운로드하는 동안 오류 발생
pt_br: Erro durante o download
zh_hans: 下载时出错
zh_hant: 下載時發生錯誤

# mls.downloadingProgress
source: Downloading
de: Download wird ausgeführt.
fr: Téléchargement
it: Download in corso
ja: ダウンロード中
ko: 다운로드
pt_br: Baixando
zh_hans: 正在下载
zh_hant: 正在下載

# mls.enableButtonTitle
source: Enable
de: Aktivieren
fr: Activer
it: Abilita
ja: 有効化
ko: 사용
pt_br: Habilitar
zh_hans: 启用
zh_hant: 啟用

# mls.enableExternalScriptsError
source: Failed to enable External script.
de: Fehler beim Aktivieren des externen Skripts.
fr: Échec de l’activation du script externe.
it: Non è stato possibile abilitare lo script esterno.
ja: 外部スクリプトの有効化に失敗しました。
ko: 외부 스크립트를 사용하도록 설정하지 못했습니다.
pt_br: Falha ao habilitar o script externo.
zh_hans: 未能启用外部脚本。
zh_hant: 無法啟用外部指令碼。

# mls.enabledMessage
source: Machine Learning Services Enabled
de: Machine Learning Services aktiviert
fr: Machine Learning Services activé
it: Servizio Machine Learning abilitato
ja: Machine Learning service が有効にされました
ko: Machine Learning Services 사용
pt_br: Serviços de Machine Learning habilitados
zh_hans: 已启用机器学习服务
zh_hant: 已啟用機器學習服務

# mls.externalExecuteScriptTitle
source: External Execute Script
de: Externes Ausführungsskript
fr: Script d’exécution externe
it: Script Execute esterno
ja: 外部実行スクリプト
ko: 외부 실행 스크립트
pt_br: Script de Execução Externo
zh_hans: 外部执行脚本
zh_hant: 外部執行指令碼

# mls.externalScriptsIsRequiredError
source: External script configuration is required for this action.
de: Für diese Aktion ist eine externe Skriptkonfiguration erforderlich.
fr: Une configuration de script externe est nécessaire pour cette action.
it: La configurazione dello script esterno è richiesta per questa azione.
ja: このアクションには、外部スクリプトの構成が必要です。
ko: 이 작업에는 외부 스크립트 구성이 필요합니다.
pt_br: A configuração de script externo é necessária para esta ação.
zh_hans: 此操作需要外部脚本配置。
zh_hant: 此動作需要外部指令碼設定。

# mls.httpGetRequestError
source: Package info request failed with error: {0} {1}
de: Fehler beim Anfordern von Paketinformationen: {0} {1}
fr: La demande d'informations de package a échoué avec l'erreur : {0} {1}
it: La richiesta di informazioni sul pacchetto non è riuscita. Errore: {0} {1}
ja: パッケージ情報要求がエラーで失敗しました: {0} {1}
ko: {0} {1} 오류를 나타내며 패키지 정보 요청 실패
pt_br: Falha na solicitação de informações do pacote com o erro: {0} {1}
zh_hans: 包信息请求失败，出现错误: {0} {1}
zh_hant: 套件資訊要求失敗。錯誤: {0} {1}

# mls.installDependencies.confirmInstallPythonPackages
source: The following Python packages are required to install: {0}
de: Die folgenden Python-Pakete sind für die Installation erforderlich: {0}
fr: Les packages Python suivants sont requis pour l’installation : {0}
it: Per l'installazione sono necessari i pacchetti Python seguenti: {0}
ja: 次の Python パッケージがインストールされている必要があります: {0}
ko: {0}를 설치하려면 다음 Python 패키지가 필요합니다.
pt_br: Os seguintes pacotes de Python são necessários para instalação: {0}
zh_hans: 需要安装以下 Python 包: {0}
zh_hant: 需要下列 Python 套件才能安裝: {0}

# mls.installDependencies.confirmInstallRPackages
source: The following R packages are required to install: {0}
de: Die folgenden R-Pakete sind für die Installation erforderlich: {0}
fr: Les packages R suivants sont requis pour l’installation : {0}
it: Per l'installazione sono necessari i pacchetti R seguenti: {0}
ja: 次の R パッケージがインストールされている必要があります: {0}
ko: 설치하려면 다음 R 패키지가 필요합니다. {0}
pt_br: Os seguintes pacotes R são necessários para instalar: {0}
zh_hans: 安装需要以下 R 包: {0}
zh_hant: 需要下列 R 套件才能安裝: {0}

# mls.installDependencies.getPackagesError
source: Failed to get installed python packages. Error: {0}
de: Fehler beim Abrufen installierter Python-Pakete. Fehler: {0}
fr: Échec de l’obtention des packages python installés. Erreur : {0}
it: Non è stato possibile ottenere i pacchetti Python installati. Errore: {0}
ja: インストールされている Python パッケージを取得できませんでした。エラー: {0}
ko: 설치된 Python 패키지를 가져오지 못했습니다. 오류: {0}
pt_br: Falha ao obter pacotes Python instalados. Erro: {0}
zh_hans: 未能获取已安装的 python 包。错误: {0}
zh_hant: 無法取得已安裝的 Python 套件。錯誤: {0}

# mls.installDependencies.packages
source: Installing required packages ...
de: Erforderliche Pakete werden installiert...
fr: Installation des packages obligatoires...
it: Installazione dei pacchetti obbligatori in corso ...
ja: 必須パッケージをインストールしています...
ko: 필요한 패키지를 설치하는 중...
pt_br: Instalando os pacotes necessários...
zh_hans: 正在安装所需的包...
zh_hant: 正在安裝必要套件 ...

# mls.installDependencies.packagesAlreadyInstalled
source: Required packages are already installed.
de: Die erforderlichen Pakete sind bereits installiert.
fr: Les packages requis sont déjà installés.
it: I pacchetti richiesti sono già installati.
ja: 必要なパッケージは既にインストールされています。
ko: 필수 패키지가 이미 설치되어 있습니다.
pt_br: Os pacotes necessários já estão instalados.
zh_hans: 已安装所需的包。
zh_hant: 已安裝必要的套件。

# mls.installModelMngDependencies.msgTaskName
source: Verifying model management dependencies
de: Überprüfen von Modellverwaltungsabhängigkeiten
fr: Vérification des dépendances de gestion des modèles
it: Verifica delle dipendenze di gestione modelli
ja: モデル管理の依存関係を確認しています
ko: 모델 관리 종속성 확인
pt_br: Verificando dependências de gerenciamento de modelo
zh_hans: 正在验证模型管理依赖项
zh_hant: 正在驗證模型管理相依性

# mls.installPackageMngDependencies.msgTaskName
source: Verifying package management dependencies
de: Überprüfen von Paketverwaltungsabhängigkeiten
fr: Vérification des dépendances de gestion des packages
it: Verifica delle dipendenze di gestione pacchetti
ja: パッケージ管理の依存関係の確認
ko: 패키지 관리 종속성 확인
pt_br: Verificando dependências de gerenciamento de pacotes
zh_hans: 正在验证包管理依赖项
zh_hant: 正在驗證套件管理相依性

# mls.installingDependencies
source: Installing dependencies ...
de: Fehler beim Installieren von Abhängigkeiten...
fr: Installation des dépendances...
it: Installazione delle dipendenze in corso ...
ja: 依存関係のインストール中...
ko: 종속성을 설치하는 중...
pt_br: Instalando dependências...
zh_hans: 正在安装依赖项...
zh_hant: 正在安裝相依性 ...

# mls.invalidModelIdError
source: Invalid model id. model url: {0}
de: Ungültige Modell-ID. Modell-URL: {0}
fr: ID de modèle non valide. URL du modèle : {0}
it: ID modello non valido. URL del modello: {0}
ja: モデル ID が無効です。モデルの URL: {0}
ko: 모델 ID가 잘못되었습니다. 모델 URL: {0}
pt_br: ID de modelo inválido. url do modelo: {0}
zh_hans: 模型 ID 无效。模型 URL: {0}
zh_hant: 模型識別碼無效。模型 URL: {0}

# mls.latestVersion
source: Latest
de: Neueste
fr: Plus récent
it: Ultima versione
ja: 最新
ko: 최신
pt_br: Mais recentes
zh_hans: 最新
zh_hant: 最新

# mls.managePackages.error
source: Package management is not supported for the server. Make sure you have Python or R installed.
de: Die Paketverwaltung wird für den Server nicht unterstützt. Stellen Sie sicher, dass Python oder R installiert ist.
fr: La gestion des packages n’est pas prise en charge pour le serveur. Vérifiez que Python ou R est installé.
it: Gestione pacchetti non supportata per il server. Assicurarsi di avere installato Python o R.
ja: パッケージ管理は、サーバーではサポートされていません。Python または R がインストールされていることを確認してください。
ko: 서버에 대해 패키지 관리가 지원되지 않습니다. Python 또는 R이 설치되어 있는지 확인합니다.
pt_br: O gerenciamento de pacotes não é compatível com o servidor. Certifique-se de ter Python ou R instalado.
zh_hans: 服务器不支持包管理。请确保已安装 Python 或 R。
zh_hant: 伺服器不支援套件管理。請確定您已安裝 Python 或 R。

# mls.mssqlExtensionNotLoaded
source: MSSQL extension is not loaded
de: Die MSSQL-Erweiterung wurde nicht geladen
fr: L’extension MSSQL n’est pas chargée
it: L'estensione MSSQL non è caricata
ja: MSSQL 拡張機能が読み込まれていません
ko: MSSQL 확장이 로드되지 않았습니다.
pt_br: A extensão MSSQL não está carregada
zh_hans: 未加载 MSSQL 扩展
zh_hant: 未載入 MSSQL 延伸模組

# mls.noArtifactError
source: Model doesn't have any artifact. model url: {0}
de: Das Modell verfügt über kein Artefakt. Modell-URL: {0}
fr: Le modèle n’a pas d’artefact. URL du modèle : {0}
it: Il modello non contiene artefatti. URL del modello: {0}
ja: モデルにアーティファクトがありません。モデルの URL: {0}
ko: 모델에 아티팩트가 없습니다. 모델 url: {0}
pt_br: O modelo não tem nenhum artefato. url do modelo: {0}
zh_hans: 模型没有任何项目。模型 URL: {0}
zh_hant: 模型沒有任何成品。模型 URL: {0}

# mls.noResultError
source: No Result returned
de: Kein Ergebnis zurückgegeben
fr: Aucun résultat retourné
it: Nessun risultato restituito
ja: 結果は返されませんでした
ko: 결과가 반환되지 않음
pt_br: Nenhum resultado retornado
zh_hans: 未返回任何结果
zh_hant: 未傳回任何結果

# mls.notebookExtensionNotLoaded
source: Notebook extension is not loaded
de: Die Notebook-Erweiterung wurde nicht geladen
fr: L’extension de bloc-notes n’est pas chargée
it: L'estensione del blocco appunti non è caricata
ja: ノートブックの拡張機能が読み込まれていません
ko: Notebook 확장이 로드되지 않음
pt_br: A extensão do notebook não está carregada
zh_hans: 未加载笔记本扩展
zh_hant: 未載入筆記本延伸模組

# mls.packageManager.NoConnection
source: No connection selected
de: Keine Verbindung ausgewählt
fr: Aucune connexion sélectionnée
it: Non sono state selezionate connessioni.
ja: 接続が選択されていません
ko: 선택한 연결 없음
pt_br: Nenhuma conexão selecionada
zh_hans: 未选择连接
zh_hant: 未選取連線

# mls.pythonConfigError
source: Python executable is not configured
de: Die ausführbare Python-Datei ist nicht konfiguriert
fr: L’exécutable Python n’est pas configuré
it: L'eseguibile Python non è configurato
ja: Python 実行可能ファイルが構成されていません
ko: Python 실행 파일이 구성되지 않았습니다.
pt_br: O executável Python não está configurado
zh_hans: 未配置 Python 可执行文件
zh_hant: 未設定 Python 可執行檔

# mls.rConfigError
source: R executable is not configured
de: Die ausführbare R-Datei ist nicht konfiguriert
fr: L’exécutable R n’est pas configuré
it: L'eseguibile R non è configurato
ja: R 実行可能ファイルが構成されていません
ko: R 실행 파일이 구성되지 않았습니다.
pt_br: O executável R não está configurado
zh_hans: 未配置 R 可执行文件
zh_hant: 未設定 R 可執行檔

# mls.requiredPackagesNotInstalled
source: The required packages are not installed
de: Die erforderlichen Pakete sind nicht installiert
fr: Les packages requis ne sont pas installés
it: I pacchetti richiesti non sono installati
ja: 必要なパッケージがインストールされていません
ko: 필요한 패키지가 설치되어 있지 않습니다.
pt_br: Os pacotes necessários não estão instalados
zh_hans: 未安装所需的包
zh_hant: 未安裝所需的套件

# mls.resourceNotFound
source: Could not find the specified resource
de: Die angegebene Ressource wurde nicht gefunden
fr: La ressource spécifiés est introuvable
it: Non è stato possibile trovare la risorsa specificata
ja: 指定されたファイルが見つかりませんでした
ko: 지정된 리소스를 찾을 수 없습니다.
pt_br: Não foi possível localizar o recurso especificado
zh_hans: 无法找到指定的资源
zh_hant: 找不到指定的資源

# mls.taskFailedError.error
source: Failed to complete task '{0}'. Error: {1}
de: Fehler beim Abschließen der Aufgabe "{0}". Fehler: {1}
fr: Échec de l’exécution de la tâche « {0} ». Erreur : {1}
it: Non è stato possibile completare l'attività “{0}” Errore: {1}
ja: タスク '{0}' を完了できませんでした。エラー: {1}
ko: '{0}' 작업을 완료하지 못했습니다. 오류: {1}
pt_br: Falha ao concluir a tarefa '{0}'. Erro: {1}
zh_hans: 无法完成任务“{0}”。错误: {1}
zh_hant: 無法完成工作 '{0}'。錯誤: {1}

# mls.verifyOdbcDriverError.error
source: '{0}' is required for package management. Please make sure it is installed and set up correctly.
de: "{0}" ist für die Paketverwaltung erforderlich. Stellen Sie sicher, dass sie installiert und ordnungsgemäß eingerichtet ist.
fr: « {0} » est requis pour la gestion des packages. Assurez-vous qu’il est installé et configuré correctement.
it: “ {0}“ è necessario per la gestione dei pacchetti. Verificare che sia installato e configurato correttamente.
ja: パッケージ管理には '{0}' が必要です。インストールされていること、および正しく設定されていることを確認してください。
ko: 패키지 관리에는 '{0}'이(가) 필요합니다. 설치되어 있고 올바르게 설정되었는지 확인하세요.
pt_br: '{0}' é necessário para gerenciamento de pacote. Verifique se ele está instalado e configurado corretamente.
zh_hans: 包管理需要“{0}”。请确保其已安装并正确设置。
zh_hant: 套件管理需要 '{0}'。請確定已正確安裝及設定。

# mlsInstallObdcDocTitle
source: Install the Microsoft ODBC driver for SQL Server
de: Installieren des Microsoft ODBC Driver for SQL Server
fr: Installer le pilote Microsoft ODBC pour SQL Server
it: Installare Microsoft ODBC Driver for SQL Server
ja: Microsoft ODBC Driver for SQL Server をインストールする
ko: Microsoft ODBC Driver for SQL Server 설치
pt_br: Instalar o driver ODBC da Microsoft para SQL Server
zh_hans: 安装 Microsoft ODBC driver for SQL Server
zh_hant: 安裝 Microsoft ODBC Driver for SQL Server

# mlsInstallOdbcDocDesc
source: This document explains how to install the Microsoft ODBC Driver for SQL Server.
de: In diesem Dokument wird erläutert, wie der Microsoft ODBC Driver for SQL Server installiert wird.
fr: Ce document explique comment Installer le pilote Microsoft ODBC Driver for SQL Server.
it: Questo documento spiega come installare Microsoft ODBC Driver for SQL Server.
ja: このドキュメントでは、Microsoft ODBC Driver for SQL Server のインストール方法について説明します。
ko: 이 문서에서는 Microsoft ODBC Driver for SQL Server를 설치하는 방법을 설명합니다.
pt_br: Este documento explica como instalar o driver Microsoft ODBC Driver for SQL Server.
zh_hans: 本文档介绍如何安装 Microsoft ODBC Driver for SQL Server。
zh_hant: 此文件說明如何安裝 Microsoft ODBC Driver for SQL Server。

# modelDatabaseInfo
source: Select a database where existing / imported models are stored.
de: Wählen Sie eine Datenbank aus, in der vorhandene/importierte Modelle gespeichert sind.
fr: Sélectionnez une base de données dans laquelle les modèles existants/importés sont stockés.
it: Selezionare un database in cui sono archiviati i modelli esistenti/importati.
ja: 既存の、またはインポートされたモデルが格納されているデータベースを選択します。
ko: 기존/가져온 모델이 저장되는 데이터베이스를 선택합니다.
pt_br: Selecione um banco de dados onde os modelos existentes/importados são armazenados.
zh_hans: 选择存储现有/导入模型的数据库。
zh_hant: 選取已儲存現有/匯入模型的資料庫。
