Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/machine-learning.*.xlf
Languages: de, fr, it, ja, ko, pt_br, zh_hans, zh_hant

# ml.enablePython.description
source: Enable Python package management in database.
de: Python-Paketverwaltung in Datenbank aktivieren.
fr: Activez la gestion des packages python dans la base de données.
it: Abilitare la gestione dei pacchetti Python nel database.
ja: データベースで Python パッケージ管理を有効にします。
ko: 데이터베이스에서 Python 패키지 관리를 사용하도록 설정합니다.
pt_br: Habilite o gerenciamento de pacote Python no banco de dados.
zh_hans: 在数据库中启用 Python 包管理。
zh_hant: 在資料庫中啟用 Python 套件管理。

# ml.enableR.description
source: Enable R package management in database.
de: R-Paketverwaltung in Datenbank aktivieren.
fr: Activez la gestion des packages R dans la base de données.
it: Abilitare la gestione dei pacchetti R nel database.
ja: データベースで R パッケージ管理を有効にします。
ko: 데이터베이스에서 R 패키지 관리를 사용하도록 설정합니다.
pt_br: Habilite o gerenciamento de pacote R no banco de dados.
zh_hans: 在数据库中启用 R 包管理。
zh_hant: 在資料庫中啟用 R 套件管理。

# ml.pythonPath.description
source: Local path to a preexisting Python installation used by Machine Learning.
de: Lokaler Pfad zu einer bereits vorhandenen R-Installation, die von Machine Learning verwendet wird.
fr: Chemin d'accès local à une installation Python préexistante utilisée par Machine Learning.
it: Percorso locale di un'installazione preesistente di Python usata da Machine Learning.
ja: Machine Learning で使用される、以前から存在する Python インストールのローカル パス。
ko: Machine Learning에서 사용하는 기존 Python 설치에 대한 로컬 경로입니다.
pt_br: Caminho local para uma instalação Python preexistente usada pelo Machine Learning.
zh_hans: 机器学习使用的预先存在的 Python 安装的本地路径。
zh_hant: 機器學習所使用之現有 Python 安裝的本機路徑。

# ml.rPath.description
source: Local path to a preexisting R installation used by Machine Learning.
de: Lokaler Pfad zu einer bereits vorhandenen R-Installation, die von Machine Learning verwendet wird.
fr: Chemin d'accès local à une installation R préexistante utilisée par Machine Learning.
it: Percorso locale di un'installazione preesistente di R usata da Machine Learning.
ja: Machine Learning で使用される、以前から存在する R インストールのローカル パス。
ko: 기계 학습에서 사용하는 기존 R 설치의 로컬 경로입니다.
pt_br: Caminho local para uma instalação R preexistente usada pelo Machine Learning.
zh_hans: 机器学习使用的预先存在的 R 安装的本地路径。
zh_hant: 機器學習所使用之現有 R 安裝的本機路徑。

# title.configurations
source: Configurations
de: Konfigurationen
it: Configurazioni
ja: 構成
ko: 구성
pt_br: Configurações
zh_hans: 配置
zh_hant: 設定

# title.documents
source: Documents
de: Dokumente
it: Documenti
ja: ドキュメント
ko: 문서
pt_br: Documentos
zh_hans: 文档
zh_hant: 文件

# title.endpoints
source: Endpoints
de: Endpunkte
fr: Points de terminaison
it: Endpoint
ja: エンドポイント
ko: 엔드포인트
pt_br: Pontos de Extremidade
zh_hans: 终结点
zh_hant: 端點

# title.tasks
source: Tasks
de: Aufgaben
fr: Tâches
it: Attività
ja: タスク
ko: 작업
pt_br: Tarefas
zh_hans: 任务
zh_hant: 工作

# mls.rLanguageTitle
source: R
fr: D
