Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/machine-learning.*.xlf
Languages: de, fr, it, ja, ko, pt_br, zh_hans, zh_hant

# models.modelSchemaIsAcceptedMessage
source: Table meets requirements!
de: Die Tabelle erfüllt die Anforderungen!
fr: La table répond aux exigences !
it: La tabella soddisfa i requisiti!
ja: テーブルが要件を満たしています。
ko: 테이블이 요구 사항을 충족합니다.
pt_br: A tabela atende aos requisitos!
zh_hans: 表满足要求!
zh_hant: 資料表符合需求!

# models.modelSchemaIsNotAcceptedMessage
source: Invalid table structure!
de: Ungültige Tabellenstruktur!
fr: Structure de table non valide.
it: Struttura di tabella non valida.
ja: テーブルの構造が無効です。
ko: 테이블 구조가 잘못되었습니다.
pt_br: Estrutura de tabela inválida!
zh_hans: 表结构无效!
zh_hant: 資料表結構無效！

# models.modelSourcePageTitle
source: Select model source type
de: Modellquelltyp auswählen
fr: Sélectionner le type de source du modèle
it: Selezionare il tipo di origine del modello
ja: モデル ソースの種類の選択
ko: 모델 원본 유형 선택
pt_br: Selecionar tipo de fonte de modelo
zh_hans: 选择模型源类型
zh_hant: 選取模型來源類型

# models.modelSourcesTitle
source: Source location
de: Quellstandort
fr: Emplacement source
it: Località di origine
ja: ソースの場所
ko: 원본 위치
pt_br: Localização de origem
zh_hans: 源位置
zh_hant: 來源位置

# models.modelUpdateFailedError
source: Failed to update the model
de: Fehler beim Aktualisieren des Modells
fr: Échec de la mise à jour du modèle
it: Non è stato possibile aggiornare il modello
ja: モデルを更新できませんでした
ko: 모델을 업데이트하지 못했습니다.
pt_br: Falha ao atualizar o modelo
zh_hans: 未能更新模型
zh_hant: 無法更新模型

# models.modelUpdatedSuccessfully
source: Model updated successfully
de: Die Modelle wurden erfolgreich aktualisiert
fr: Modèle mis à jour
it: I modelli sono stati aggiornati
ja: モデルが正常に更新されました
ko: 모델을 업데이트했습니다.
pt_br: O modelo foi atualizado com êxito
zh_hans: 已成功更新模型
zh_hant: 已成功更新模型

# models.modelsListEmptyDescription
source: Select another database or table
de: Eine andere Datenbank oder Tabelle auswählen
fr: Sélectionner une autre base de données ou table
it: Selezionare un altro database o tabella
ja: 別のデータベースまたはテーブルの選択
ko: 다른 데이터베이스 또는 테이블 선택
pt_br: Selecionar outro banco de dados ou tabela
zh_hans: 选择其他数据库或表
zh_hant: 選取另一個資料庫或資料表

# models.modelsListEmptyMessage
source: No models found
de: Keine Modelle gefunden.
fr: Aucun modèle trouvé
it: Non sono stati trovati modelli
ja: モデルが見つかりません
ko: 모델을 찾을 수 없음
pt_br: Nenhum modelo encontrado
zh_hans: 找不到任何模型
zh_hant: 找不到任何模型

# models.modelsRequiredError
source: Please select at least one model to import.
de: Wählen Sie mindestens ein Modul zum Importieren aus.
fr: Veuillez sélectionner au moins un modèle à importer.
it: Selezionare almeno un modulo da importare.
ja: インポートするモデルを少なくとも 1 つ選択してください。
ko: 가져올 모델을 하나 이상 선택하세요.
pt_br: Selecione pelo menos um módulo para importar.
zh_hans: 请至少选择一个要导入的模型。
zh_hant: 請至少選取一個要匯入的模型。

# models.name
source: Name
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称
zh_hant: 名稱

# models.onnxNotSupportedError
source: ONNX runtime is not supported in current server
de: Die ONNX-Laufzeit wird auf dem aktuellen Server nicht unterstützt.
fr: Runtime ONNX n’est pas pris en charge dans le serveur actuel
it: Il runtime di ONNX non è supportato nel server corrente
ja: ONNX ランタイムは現在のサーバーではサポートされていません
ko: ONNX 런타임은 현재 서버에서 지원되지 않습니다.
pt_br: O tempo de execução do ONNX não tem suporte no servidor atual
zh_hans: 当前服务器中不支持 ONNX 运行时
zh_hant: 目前的伺服器不支援 ONNX 執行階段

# models.outputColumnDataTypeNotSupportedWarning
source: The data type of output column does not match the output field’s type.
de: Der Datentyp der Ausgabespalte stimmt nicht mit dem Typ des Ausgabefelds überein.
fr: Le type de données de la colonne de sortie ne correspond pas au type du champ de sortie.
it: Il tipo di dati della colonna di output non corrisponde al tipo del campo di output.
ja: 出力列のデータ型が出力フィールドの種類と一致しません。
ko: 출력 열의 데이터 형식이 출력 필드의 형식과 일치하지 않습니다.
pt_br: O tipo de dado da coluna de saída não corresponde ao tipo do campo de saída.
zh_hans: 输出列的数据类型与输出字段类型不匹配。
zh_hant: 輸出資料行的資料類型不符合輸出欄位的類型。

# models.predictModel
source: Predict
de: Vorhersagen
fr: Prédire
it: Stima
ja: 予測
ko: 예측
pt_br: Prever
zh_hans: 预测
zh_hant: 預測

# models.registeredModelsSource
source: Imported models
de: Importierte Modelle
fr: Modèles importés
it: Modelli importati
ja: インポート済みモデル
ko: 가져온 모델
pt_br: Modelos importados
zh_hans: 导入的模型
zh_hant: 匯入的模型

# models.selectModelDatabaseMessage
source: Select Database
de: Datenbank auswählen
fr: Sélectionner une base de données
it: Seleziona database
ja: データベースの選択
ko: 데이터베이스 선택
pt_br: Selecionar banco de dados
zh_hans: 选择数据库
zh_hant: 選取資料庫

# models.selectModelDatabaseTitle
source: Select database with models
de: Datenbank mit Modellen auswählen
fr: Sélectionner une base de données avec des modèles
it: Seleziona database con modelli
ja: モデルを含むデータベースを選択する
ko: 모델이 있는 데이터베이스 선택
pt_br: Selecionar banco de dados com modelos
zh_hans: 选择具有模型的数据库
zh_hant: 選取有模型的資料庫

# models.selectModelTableMessage
source: Select table
de: Tabelle auswählen
fr: Sélectionner le tableau
it: Seleziona tabella
ja: テーブルの選択
ko: 테이블 선택
pt_br: Selecionar tabela
zh_hans: 选择表
zh_hant: 選取資料表

# models.selectModelTableTitle
source: Select tables with models
de: Tabellen mit Modellen auswählen
fr: Sélectionnez des tables avec des modèles
it: Seleziona tabelle con modelli
ja: モデルが含まれるテーブルの選択
ko: 모델이 있는 테이블 선택
pt_br: Selecionar tabelas com modelos
zh_hans: 选择具有模型的表
zh_hant: 選取有模型的資料表

# models.selectModelsTableMessage
source: Select models table
de: Modelltabelle auswählen
fr: Sélectionner la table des modèles
it: Selezionare la tabella dei modelli
ja: モデル テーブルの選択
ko: 모델 테이블 선택
pt_br: Selecionar tabela de modelos
zh_hans: 选择模型表
zh_hant: 選取模型資料表

# models.unsupportedModelParameterType
source: unsupported
de: Nicht unterstützt
fr: non pris en charge
it: non supportato
ja: サポートされていません
ko: 지원되지 않음
pt_br: sem suporte
zh_hans: 不受支持
zh_hant: 不支援

# models.updateModelFailedError
source: Failed to update the model
de: Fehler beim Aktualisieren des Modells
fr: Échec de la mise à jour du modèle
it: Non è stato possibile aggiornare il modello
ja: モデルを更新できませんでした
ko: 모델을 업데이트하지 못했습니다.
pt_br: Falha ao atualizar o modelo
zh_hans: 未能更新模型
zh_hant: 無法更新模型

# models.version
source: Version
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
zh_hans: 版本
zh_hant: 版本

# models.viewImportModeledForPredictDesc
source: The models are stored in one or more databases and tables. Select the model database and table to view models in them.
de: Die Modelle sind in einer oder mehreren Datenbanken und Tabellen gespeichert. Wählen Sie die Modelldatenbank und die Tabelle aus, um die darin enthaltenen Modelle anzuzeigen.
fr: Les modèles sont stockés dans une ou plusieurs bases de données et tables. Sélectionnez la base de données de modèles et la table dans laquelle afficher les modèles.
it: I modelli vengono archiviati in uno o più database e tabelle. Selezionare il database dei modelli e la tabella in cui visualizzare i modelli.
ja: モデルは、1 つ以上のデータベースとテーブルに格納されます。モデル データベースとテーブルを選択して、それらにモデルを表示します。
ko: 모델은 하나 이상의 데이터베이스 및 테이블에 저장됩니다. 모델 데이터베이스 및 테이블을 선택하여 내부 모델을 봅니다.
pt_br: Os modelos são armazenados em um ou mais bancos de dados e tabelas. Selecione os bancos de dados e tabelas modelos para visualizar os modelos neles.
zh_hans: 模型存储在一个或多个数据库和表中。选择模型数据库和表以查看其中的模型。
zh_hant: 模型儲存在一或多個資料庫及資料表中。請選取模型資料庫及資料表，以查看其中的模型。

# models.viewImportModelsDesc
source: Machine Learning models can be stored in one or more databases and tables. Select the model database and table to view the models within them.
de: Machine Learning-Modelle können in einer oder mehreren Datenbanken und Tabellen gespeichert werden. Wählen Sie die Modelldatenbank und die Tabelle aus, um die darin enthaltenen Modelle anzuzeigen.
fr: Les modèles Machine Learning peuvent être stockés dans une ou plusieurs bases de données et tables. Sélectionnez la table et la base de données model pour afficher les modèles qui s’y trouvent.
it: È possibile archiviare i modelli Machine Learning in uno o più database e tabelle. Selezionare il database e la tabella del modello per visualizzare i modelli in essi contenuti.
ja: 機械学習モデルは、1 つ以上のデータベースとテーブルに格納できます。モデル データベースとテーブルを選択して、その内部にモデルを表示します。
ko: 기계 학습 모델은 하나 이상의 데이터베이스 및 테이블에 저장할 수 있습니다. 모델 데이터베이스 및 테이블을 선택하여 해당 모델을 봅니다.
pt_br: Modelos de Machine Learning podem ser armazenados em um ou mais bancos de dados e tabelas. Selecione o banco de dados modelo e a tabela para exibir os modelos neles.
zh_hans: 机器学习模型可以存储在一个或多个数据库和表中。选择模型数据库和表以查看其中的模型。
zh_hant: 機器學習模型可以儲存在一或多個資料庫及資料表中。請選取模型資料庫及資料表，以查看其中的模型。

# models.viewImportModelsTitle
source: View and import models
de: Modelle anzeigen und importieren
fr: Afficher et importer des modèles
it: Visualizza e importa modelli
ja: モデルを表示してインポートする
ko: 모델 보기 및 가져오기
pt_br: Exibir e importar modelos
zh_hans: 查看和导入模型
zh_hant: 檢視和匯入模型

# msgNo
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否
zh_hant: 否

# msgYes
source: Yes
de: Ja
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
zh_hans: 是
zh_hant: 是

# newTableName
source: New table
de: Neue Tabelle
fr: Nouvelle table
it: Nuova tabella
ja: 新しいテーブル
ko: 새 테이블
pt_br: Nova tabela
zh_hans: 新建表
zh_hant: 新增資料表

# notSupportedEventArg
source: Not supported event args
de: Nicht unterstützte Ereignisargumente
fr: Arguments d’événement non pris en charge
it: Argomenti dell'evento non supportati
ja: サポートされていないイベント引数
ko: 지원되지 않는 이벤트 인수
pt_br: Argumentos de evento sem suporte
zh_hans: 不受支持的事件参数
zh_hant: 不支援的事件引數

# notebookExtensionFailedError
source: The extension failed to load because of it's dependency to Notebook extension. Please check the output log for Notebook extension to get more details
de: Die Erweiterung konnte aufgrund ihrer Abhängigkeit von der Notebook-Erweiterung nicht geladen werden. Überprüfen Sie das Ausgabeprotokoll für die Notebook-Erweiterung, um weitere Details zu erhalten.
fr: Échec du chargement de l’extension en raison de sa dépendance à l’extension de bloc-notes. Pour plus d’informations, consultez le journal de sortie de l’extension du bloc-notes
it: Il caricamento dell'estensione non è riuscito a causa della dipendenza dall'estensione Notebook. Controllare il log di output per l'estensione Notebook per ottenere altri dettagli
ja: この拡張機能は Notebook 拡張機能に依存しているため、読み込みできませんでした。詳細については、Notebook 拡張機能の出力ログを確認してください
ko: 전자 필기장 확장에 대한 종속성으로 인해 확장을 로드하지 못했습니다. 자세한 내용을 보려면 전자 필기장 확장에 대한 출력 로그를 확인하세요.
pt_br: Falha ao carregar a extensão devido a sua dependência com a extensão do bloco de anotações. Verifique o log de saída para obter a extensão do bloco de anotações para obter mais detalhes
zh_hans: 扩展因其对笔记本扩展的依赖项而未能加载。请检查笔记本扩展的输出日志以获取更多详细信息
zh_hant: 無法載入延伸模組，因為它與筆記本延伸模組有相依性。請查看筆記本延伸模組的輸出記錄以取得更多詳細資料

# onnxOnEdgeOdbcDocDesc
source: Get started with machine learning in Azure SQL Database Edge
de: Erste Schritte mit Machine Learning in Azure SQL-Datenbank Edge
fr: Démarrer avec machine learning dans Azure SQL Database Edge
it: Introduzione a Machine Learning in Azure SQL Database Edge
ja: Azure SQL Database Edge で機械学習を開始します。
ko: Azure SQL Database Edge에서 기계 학습 시작
pt_br: Introdução ao Machine Learning no Banco de Dados SQL do Azure Edge
zh_hans: Azure SQL 数据库 Edge 中的机器学习入门
zh_hant: 開始使用 Azure SQL Database Edge 中的機器學習

# onnxOnEdgeOdbcDocTitle
source: Machine learning and AI with ONNX in SQL Database Edge Preview
de: Machine Learning und KI mit ONNX in SQL-Datenbank Edge-Vorschau
fr: Machine learning et AI avec ONNX dans la préversion Edge de base de données SQL
it: Machine Learning e intelligenza artificiale con ONNX nell'anteprima del database SQL Edge
ja: SQL Database Edge プレビューでの機械学習と ONNX を使用した AI
ko: SQL Database Edge 미리 보기에서 ONNX를 사용한 기계 학습 및 AI
pt_br: ML e IA com ONNX na Visualização do Banco de Dados SQL
zh_hans: SQL 数据库 Edge 预览版中使用 ONNX 的机器学习和 AI
zh_hant: 在 SQL Database Edge 預覽中使用 ONNX 的機器學習及 AI

# predict.columnDatabase
source: Source database
de: Quelldatenbank
fr: Base de données source
it: Database di origine
ja: ソース データベース
ko: 원본 데이터베이스
pt_br: Banco de dados de origem
zh_hans: 源数据库
zh_hant: 來源資料庫

# predict.columnDatabaseInfo
source: Select the database containing the dataset to apply the prediction.
de: Wählen Sie die Datenbank aus, die das Dataset zum Anwenden der Vorhersage enthält.
fr: Sélectionnez la base de données contenant le jeu de données auquel la prédiction doit être appliquée.
it: Selezionare il database contenente il set di dati per applicare la stima.
ja: データセットを含むデータベースを選択して、予測を適用します。
ko: 예측을 적용할 데이터 세트가 포함된 데이터베이스를 선택합니다.
pt_br: Selecione o banco de dados que contém o conjunto de dados para aplicar a previsão.
zh_hans: 选择包含数据集的数据库以应用预测。
zh_hant: 選取包含要套用預測之資料集的資料庫。

# predict.columnName
source: Source columns
de: Quellspalten
fr: Colonnes sources
it: Colonne di origine
ja: 基になる列
ko: 원본 열
pt_br: Colunas de origem
zh_hans: 源列
zh_hant: 來源資料行

# predict.columnTable
source: Source table
de: Quelltabelle
fr: Table source
it: Tabella di origine
ja: ソース テーブル
ko: 원본 테이블
pt_br: Tabela de origem
zh_hans: 源表
zh_hant: 來源資料表

# predict.columnTableInfo
source: Select the table containing the dataset to apply the prediction.
de: Wählen Sie die Tabelle aus, die das Dataset zum Anwenden der Vorhersage enthält.
fr: Sélectionnez la table contenant le jeu de données auquel la prédiction doit être appliquée.
it: Selezionare la tabella contenente il set di dati per applicare la stima.
ja: データセットを含むテーブルを選択して、予測を適用します。
ko: 예측을 적용할 데이터 세트가 포함된 테이블을 선택합니다.
pt_br: Selecione a tabela que contém o conjunto de dados para aplicar a previsão.
zh_hans: 选择包含数据集的表以应用预测。
zh_hant: 選取包含要套用預測之資料集的資料表。

# predict.dataTypeName
source: Type
de: Typ
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
zh_hans: 类型
zh_hant: 類型

# predict.displayName
source: Display name
de: Anzeigename
fr: Nom d’affichage
it: Nome visualizzato
ja: 表示名
ko: 표시 이름
pt_br: Nome de Exibição
zh_hans: 显示名称
zh_hant: 顯示名稱

# predict.inputColumns
source: Model Input mapping
de: Modell für die Eingabezuordnung erstellen
fr: Mappage des entrées du modèle
it: Mapping dell'input del modello
ja: 入力マッピングのモデル化
ko: 입력 매핑 추가
pt_br: Mapeamento de entrada de modelo
zh_hans: 模型输入映射
zh_hant: 模型輸入對應

# predict.inputName
source: Model input
de: Modelleingabe
fr: Entrée de modèle
it: Input del modello
ja: モデルの入力
ko: 모델 입력
pt_br: Entrada de modelo
zh_hans: 模型输入
zh_hant: 模型輸入

# predict.outputColumns
source: Model output
de: Modellausgabe
fr: Sortie de modèle
it: Output del modello
ja: モデルの出力
ko: 모델 출력
pt_br: Saída de modelo
zh_hans: 模型输出
zh_hant: 模型輸出

# predict.outputName
source: Name
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称
zh_hant: 名稱

# predict.selectColumnTitle
source: Select column...
de: Wählen Sie eine Spalte aus...
fr: Sélectionner une colonne...
it: Seleziona colonna...
ja: 列の選択...
ko: 열 선택...
pt_br: Selecionar coluna...
zh_hans: 选择列...
zh_hant: 選取資料行...

# predict.selectDatabaseTitle
source: Select database
de: Datenbank auswählen
fr: Sélectionner une base de données
it: Selezionare database
ja: データベースを選択してください
ko: 데이터베이스 선택
pt_br: Selecionar o banco de dados
zh_hans: 选择数据库
zh_hant: 選取資料庫

# predict.selectTableTitle
source: Select table
de: Tabelle auswählen
fr: Sélectionner le tableau
it: Seleziona tabella
ja: テーブルの選択
ko: 테이블 선택
pt_br: Selecionar tabela
zh_hans: 选择表
zh_hant: 選取資料表

# showLessTitle
source: Show less
de: Weniger anzeigen
fr: Afficher moins
it: Visualizza meno
ja: 表示数を減らす
ko: 간단히 보기
pt_br: Mostrar menos
zh_hans: 收起
zh_hant: 顯示較少

# showMoreTitle
source: Show more
de: Mehr anzeigen
fr: Afficher plus
it: Mostra di più
ja: さらに表示
ko: 더 보기
pt_br: Mostrar mais
zh_hans: 显示更多
zh_hant: 顯示較多

# sqlMlDocDesc
source: Learn how to use machine learning in SQL Server and SQL on Azure, to run Python and R scripts on relational data.
de: Erfahren Sie, wie Sie Machine Learning in SQL Server und SQL auf Azure verwenden, um Python- und R-Skripts für relationale Daten auszuführen.
fr: Découvrez comment utiliser machine learning dans SQL Server et SQL sur Azure pour exécuter des scripts Python et R sur des données relationnelles.
it: Informazioni su come usare Machine Learning in SQL Server e SQL in Azure per eseguire script Python e R su dati relazionali.
ja: Azure の SQL Server および SQL で機械学習を使用して、関連データで Python および R スクリプトを実行する方法について説明します。
ko: Azure의 SQL Server 및 SQL에서 기계 학습을 사용하여 관계형 데이터에서 Python 및 R 스크립트를 실행하는 방법에 대해 알아봅니다.
pt_br: Saiba como usar o Machine Learning em SQL Server e SQL no Azure, para executar scripts Python e R em dados relacionais.
zh_hans: 了解如何在 Azure 上的 SQL Server 和 SQL 中使用机器学习，以对关系数据运行 Python 和 R 脚本。
zh_hant: 了解如何在 Azure 上的 SQL Server 和 SQL 上使用機器學習，對關聯式資料執行 Python 及 R 指令碼。

# sqlMlDocTitle
source: SQL machine learning documentation
de: SQL Machine Learning-Dokumentation
fr: Documentation sur l'apprentissage automatique en SQL
it: Documentazione di SQL Machine Learning
ja: SQL 機械学習ドキュメント
ko: SQL 기계 학습 설명서
pt_br: Documentação do SQL Machine Learning
zh_hans: SQL 机器学习文档
zh_hant: SQL 機器學習文件

# sqlMlExtDocDesc
source: Learn how to use Machine Learning extension in Azure Data Studio, to manage packages, make predictions, and import models.
de: Erfahren Sie, wie Sie Machine Learning-Erweiterungen in Azure Data Studio verwenden, um Pakete zu verwalten, Vorhersagen zu treffen und Modelle zu importieren.
fr: Découvrez comment utiliser l’extension Machine Learning dans Azure Data Studio, pour gérer les packages, créer des prédictions et importer des modèles.
it: Informazioni su come usare l'estensione Machine Learning in Azure Data Studio, per gestire i pacchetti, eseguire stime e importare modelli.
ja: Azure Data Studio で Machine Learning 拡張機能を使用する方法、パッケージを管理する方法、予測する方法、およびモデルをインポートする方法について説明します。
ko: Azure Data Studio Machine Learning 확장을 사용하여 패키지를 관리하고, 예측을 수행하고, 모델을 가져오는 방법을 알아봅니다.
pt_br: Saiba como usar a extensão Machine Learning no Azure Data Studio, para gerenciar pacotes, fazer previsões e importar modelos.
zh_hans: 了解如何在 Azure Data Studio 中使用机器学习扩展来管理包、进行预测和导入模型。
zh_hant: 了解如何使用 Azure Data Studio 中的 Machine Learning 延伸模組來管理套件、進行預測及匯入模型。

# sqlMlExtDocTitle
source: Machine Learning extension in Azure Data Studio
de: Machine Learning-Erweiterung in Azure Data Studio
fr: Extension de Machine Learning dans Azure Data Studio
it: Estensione Machine Learning in Azure Data Studio
ja: Azure Data Studio における Machine Learning 拡張機能
ko: Azure Data Studio에서 기계 학습 확장
pt_br: Extensão Machine Learning no Azure Data Studio
zh_hans: Azure Data Studio 中的机器学习扩展
zh_hant: Azure Data Studio 中的 Machine Learning 延伸模組

# sqlMlsDocDesc
source: Get started with Machine Learning Services on SQL Server and how to install it on Windows and Linux.
de: Erste Schritte mit Machine Learning Services auf SQL Server und deren Installation unter Windows und Linux.
fr: Démarrage d’un Machine Learning Services sur SQL Server et comment l’installer sur Windows et Linux.
it: Iniziare a usare Machine Learning Services su SQL Server e come installarlo in Windows e Linux.
ja: SQL Server 上での Machine Learning Services を開始し、Windows と Linux にインストールする方法を説明します。
ko: SQL Server에서 Machine Learning Services를 시작하고 Windows 및 Linux에서 설치를 시작합니다.
pt_br: Comece a usar o Serviços de Machine Learning no SQL Server e como instalá-lo no Windows e no Linux.
zh_hans: SQL Server 上的机器学习服务入门，以及如何在 Windows 和 Linux 上安装它。
zh_hant: 開始使用 SQL Server 上的機器學習服務，以及如何將其安裝在 Windows 和 Linux 上。

# sqlMlsDocTitle
source: SQL Server Machine Learning Services (Python and R)
de: SQL Server-Machine Learning Services (Python und R)
fr: SQL Server Machine Learning Services (en base de données)
it: SQL Server Machine Learning Services (In-Database)
ja: SQL Server Machine Learning Services (Python および R)
ko: SQL Server Machine Learning Services(Python 및 R)
pt_br: Serviços de Machine Learning do SQL Server (Python e R)
zh_hans: SQL Server 机器学习服务(Python 和 R)
zh_hant: SQL Server 機器學習服務 (Python 和 R)

# sqlMlsMIDocDesc
source: Get started with Machine Learning Services in Azure SQL Managed Instances.
de: Erste Schritte mit Machine Learning Services in Azure SQL Managed Instances.
fr: Démarrez avec Machine Learning Services dans Azure SQL Managed Instance.
it: Introduzione alle Machine Learning Services in Istanze gestite di Azure SQL.
ja: Azure SQL Managed Instance で Machine Learning Services を開始します。
ko: Azure SQL Managed Instance에서 Machine Learning Services를 시작합니다.
pt_br: Introdução ao Serviços de Machine Learning na Instância Gerenciada do SQL do Azure.
zh_hans: Azure SQL 托管实例中的机器学习服务入门。
zh_hant: 開始使用 Azure SQL 受控執行個體中的機器學習服務。

# sqlMlsMIDocTitle
source: Machine Learning Services in Azure SQL Managed Instance
fr: Machine Learning Services dans Azure SQL Managed Instance
it: Machine Learning Services nell’istanza gestita SQL di Azure
ja: Azure SQL Managed Instance における Machine Learning Services
ko: Azure SQL Managed Instance의 Machine Learning Services
pt_br: Serviços de Machine Learning na Instância Gerenciada de SQL do Azure
zh_hans: Azure SQL 托管实例中的机器学习服务
zh_hant: Azure SQL 受控執行個體中的機器學習服務

# tableName
source: Table
de: Tabelle
it: Tabella
ja: テーブル
ko: 테이블
pt_br: Tabela
zh_hans: 表
zh_hant: 資料表

# tableToStoreInfo
source: Select an existing table that conforms the model schema or create a new one to store the imported model.
de: Wählen Sie eine vorhandene Tabelle aus, die dem Modellschema entspricht, oder erstellen Sie eine neue Tabelle, um das importierte Modell zu speichern.
fr: Sélectionnez une table existante conforme au schéma du modèle ou créez-en une nouvelle pour stocker le modèle importé.
it: Selezionare una tabella esistente conforme allo schema del modello o crearne una nuova per archiviare il modello importato.
ja: モデル スキーマに準拠している既存のテーブルを選択するか、インポートされたモデルを格納する新しいテーブルを作成します。
ko: 모델 스키마를 준수하는 기존 테이블을 선택하거나 가져온 모델을 저장할 새 테이블을 만듭니다.
pt_br: Selecione uma tabela existente que esteja em conformidade com o esquema do modelo ou crie uma nova para armazenar o modelo importado.
zh_hans: 选择符合模型架构的现有表或创建一个新表以存储导入的模型。
zh_hant: 選取符合模型結構描述的現有資料表，或建立新的資料表來儲存匯入的模型。

# description
source: Machine Learning
zh_hans: 机器学习
zh_hant: 機器學習

# displayName
source: Machine Learning
zh_hans: 机器学习
zh_hant: 機器學習

# ml.command.dependencies
source: Install Machine Learning Dependencies
de: Machine Learning-Abhängigkeiten installieren
fr: Installer les dépendances Machine Learning
it: Installa dipendenze di Machine Learning
ja: Machine Learning 依存関係のインストール
ko: Machine Learning 종속성 설치
pt_br: Instalar Dependências de Machine Learning
zh_hans: 安装机器学习依赖项
zh_hant: 安裝機器學習依存性

# ml.command.enableExternalScript
source: Enable External script
de: Externes Skript aktivieren
fr: Activer le script externe
it: Abilita script esterno
ja: 外部スクリプトを有効にする
ko: 외부 스크립트 사용
pt_br: Habilitar Script externo
zh_hans: 启用外部脚本
zh_hant: 啟用外部指令碼

# ml.command.importModel
source: Import model
de: Modell importieren
fr: Importer le modèle
it: Importa il modello
ja: モデルのインポート
ko: 모델 가져오기
pt_br: Modelo de importação
zh_hans: 导入模型
zh_hant: 匯入模型

# ml.command.manageLanguages
source: Manage external languages
de: Externe Sprachen verwalten
fr: Gérer les langues externes
it: Gestisci lingue esterne
ja: 外部言語の管理
ko: 외부 언어 관리
pt_br: Gerenciar linguagens externas
zh_hans: 管理外部语言
zh_hant: 管理外部語言

# ml.command.manageModels
source: Manage models
de: Modelle verwalten
fr: Gérer les modèles
it: Gestisci modelli
ja: モデルの管理
ko: 모델 관리
pt_br: Gerenciar modelos
zh_hans: 管理模型
zh_hant: 管理模型

# ml.command.managePackages
source: Manage packages in database
de: Pakete in Datenbank verwalten
fr: Gérer les packages dans la base de données
it: Gestisci i pacchetti nel database
ja: データベースのパッケージを管理します
ko: 데이터베이스에서 패키지 관리
pt_br: Gerenciar pacotes no banco de dados
zh_hans: 管理数据库中的包
zh_hant: 管理資料庫中的套件

# ml.command.predictModel
source: Make prediction
de: Vorhersage vornehmen
fr: Effectuer la prédiction
it: Effettua una stima
ja: 予測の作成
ko: 예측 만들기
pt_br: Fazer previsão
zh_hans: 进行预测
zh_hant: 進行預測

# ml.configuration.title
source: Machine Learning Configurations
de: Machine Learning-Konfigurationen
fr: Configurations de Machine Learning
it: configurazioni Machine Learning
ja: Machine Learning の構成
ko: Machine Learning 구성
pt_br: Configurações do Machine Learning
zh_hans: 机器学习配置
zh_hant: 機器學習設定
