Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.machine-learning.*.xlf
Languages: es

# ml.rPath.description
source: Local path to a preexisting R installation used by Machine Learning.
es: Ruta de acceso local a una instalación de R preexistente utilizada por Machine Learning.

# ml.configuration.title
source: Machine Learning Configurations
es: Configuraciones de Machine Learning

# ml.command.predictModel
source: Make prediction
es: Realizar una predicción

# ml.command.manageLanguages
source: Manage external languages
es: Administrar lenguajes externos

# ml.command.manageModels
source: Manage models
es: Administrar modelos

# ml.command.managePackages
source: Manage packages in database
es: Administrar paquetes en una base de datos

# title.tasks
source: Tasks
es: Tareas
