Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.machine-learning.*.xlf
Languages: es

# mls.verifyOdbcDriverError.error
source: '{0}' is required for package management. Please make sure it is installed and set up correctly.
es: '{0}' es necesario para la administración de paquetes. Asegúrese de que está instalado y configurado correctamente.

# mls.configAction
source: Action
es: Acción

# extLang.newLanguageTabTitle
source: Add new
es: Añadir nuevos

# models.confirmDeleteModel
source: Are you sure you want to delete model '{0}?
es: ¿Seguro que desea eliminar el modelo '{0}?

# mls.confirmInstallPythonPackages
source: Are you sure you want to install required packages?
es: ¿Está seguro de que quiere instalar los paquetes necesarios?

# models.azureModelWorkspace
source: Azure ML workspace
es: Área de trabajo de Azure ML

# models.azureAccount
source: Azure account
es: Cuenta de Azure

# models.azureModelsTitle
source: Azure models
es: Modelos de Azure

# models.azureSignIn
source: Azure sign in or refresh account
es: Inicio de sesión o actualización de la cuenta de Azure

# models.azureSubscription
source: Azure subscription
es: Suscripción a Azure

# extLang.CancelButtonText
source: Cancel
es: Cancelar

# mls.cannotFindPython.error
source: Cannot find Python executable '{0}'. Please make sure Python is installed and configured correctly
es: No se encuentra el ejecutable de Python '{0}'. Asegúrese de que Python está instalado y configurado correctamente.

# mls.cannotFindR.error
source: Cannot find R executable '{0}'. Please make sure R is installed and configured correctly
es: No se encuentra el ejecutable de R '{0}'. Asegúrese de que R está instalado y configurado correctamente.

# models.columnDataTypeMismatchWarningHelper
source: Click to review warning details
es: Hacer clic para revisar los detalles de la advertencia

# extLang.DoneButtonText
source: Close
es: Cerrar

# mls.configTitle
source: Config
es: Configuración

# mls.resourceNotFound
source: Could not find the specified resource
es: No se pudo encontrar el recurso especificado

# models.createNotebookTitle
source: Create notebook
es: Crear cuaderno

# databaseName
source: Database
es: Base de datos

# models.created
source: Date created
es: Fecha de creación

# models.imported
source: Date imported
es: Fecha de la importación

# extLang.delete
source: Delete
es: Eliminar

# models.description
source: Description
es: Descripción

# models.columnDataTypeMismatchWarningHeading
source: Differences in data type
es: Diferencias en el tipo de datos

# mls.disableButtonTitle
source: Disable
es: Deshabilitar

# predict.displayName
source: Display name
es: Nombre para mostrar

# mls.downloadingProgress
source: Downloading
es: Descargando

# models.downloadModelMsgTaskName
source: Downloading Model from Azure
es: Descargando modelo de Azure

# editTitle
source: Edit
es: Editar

# models.editModelTitle
source: Edit model
es: Editar modelo

# mls.enableButtonTitle
source: Enable
es: Habilitar

# mls.configStatus
source: Enabled
es: Habilitado

# models.modelDetailsPageTitle
source: Enter model details
es: Especificar detalles de modelo

# extLang.envVariables
source: Environment variables
es: Variables de entorno

# mls.downloadError
source: Error while downloading
es: Error durante la descarga

# existingTableName
source: Existing table
es: Tabla existente

# extLang.extensionFileName
source: Extension file Name
es: Nombre del archivo de extensión

# mls.externalExecuteScriptTitle
source: External Execute Script
es: Script de ejecución externa

# mls.externalScriptsIsRequiredError
source: External script configuration is required for this action.
es: Se requiere la configuración del script externo para esta acción.

# mls.confirmEnableExternalScripts
source: External script is required for package management. Are you sure you want to enable that.
es: El script externo es necesario para la administración de paquetes. ¿Está seguro de que quiere habilitarlo?

# mls.taskFailedError.error
source: Failed to complete task '{0}'. Error: {1}
es: No se pudo completar la tarea '{0}'. Error: {1}

# mls.enableExternalScriptsError
source: Failed to enable External script.
es: No se pudo habilitar el script externo.

# mls.installDependencies.getPackagesError
source: Failed to get installed python packages. Error: {0}
es: No se pudieron obtener los paquetes de Python instalados. Error: {0}

# extLang.installFailedError
source: Failed to install language
es: No se pudo instalar el idioma

# models.loadModelParameterFailedError
source: Failed to load model parameters'
es: Error de carga de los parámetros del modelo

# mls.configUpdateFailed
source: Failed to modify Machine Learning Services configurations
es: No se pudieron modificar las configuraciones de Machine Learning Services

# models.importModelFailedError
source: Failed to register the model: {0} ,file: {1}
es: No se pudo registrar el modelo: {0}, archivo: {1}

# extLang.updateFailedError
source: Failed to update language
es: No se pudo actualizar el idioma

# models.updateModelFailedError
source: Failed to update the model
es: No se pudo actualizar el modelo

# models.modelUpdateFailedError
source: Failed to update the model
es: No se pudo actualizar el modelo

# models.fileName
source: File
es: Archivo

# extLang.fileBrowserTabTitle
source: File Browser
es: Explorador de archivos

# models.modelLocalSourceTooltip
source: File paths of the models to import
es: Rutas de acceso de archivos de los modelos que se van a importar

# models.localModelSource
source: File upload
es: Carga de archivo

# models.azureModelFilter
source: Filter
es: Filtro

# models.framework
source: Framework
es: Marco

# models.frameworkVersion
source: Framework version
es: Versión del marco

# models.makePredictionDesc
source: Generate a predicted value or scores using a managed model
es: Generar un valor o puntuaciones previstos mediante un modelo administrado

# sqlMlsMIDocDesc
source: Get started with Machine Learning Services in Azure SQL Managed Instances.
es: Introducción a Machine Learning Services en Azure SQL Managed Instance.

# sqlMlsDocDesc
source: Get started with Machine Learning Services on SQL Server and how to install it on Windows and Linux.
es: Empiece a trabajar con Machine Learning Services en SQL Server y aprenda a instalarlo en Windows y Linux.

# onnxOnEdgeOdbcDocDesc
source: Get started with machine learning in Azure SQL Database Edge
es: Introducción al aprendizaje automático en Azure SQL Database Edge

# models.importModelDoneButton
source: Import
es: Importar

# models.azureModelPageTitle
source: Import from Azure Machine Learning
es: Importar desde Azure Machine Learning

# models.RegisterWizard
source: Import models
es: Importar modelos

# models.importModelDesc
source: Import or view machine learning models stored in database
es: Importar o ver los modelos de Machine Learning almacenados en la base de datos

# models.importModelTitle
source: Import or view models
es: Importar o ver modelos

# models.registeredModelsSource
source: Imported models
es: Modelos importados

# extLang.installButtonText
source: Install
es: Instalar

# mlsInstallObdcDocTitle
source: Install the Microsoft ODBC driver for SQL Server
es: Instalar Microsoft ODBC Driver for SQL Server

# extLang.languageCreatedDate
source: Installed
es: Instalado

# extLang.installTabTitle
source: Installed
es: Instalado

# mls.installingDependencies
source: Installing dependencies ...
es: Instalando dependencias...

# mls.installDependencies.packages
source: Installing required packages ...
es: Instalando los paquetes necesarios ...

# models.invalidAzureResourceError
source: Invalid Azure resource
es: Recurso de Azure no válido

# mls.invalidModelIdError
source: Invalid model id. model url: {0}
es: Id. de modelo no válido. Dirección URL del modelo: {0}

# models.invalidModelToPredictError
source: Invalid model to predict
es: Modelo no válido para predecir

# models.invalidModelToRegisterError
source: Invalid model to register
es: Modelo no válido para registrar

# models.invalidImportTableError
source: Invalid table for importing models. database name: {0} ,table name: {1}
es: Tabla no válida para la importación de modelos. nombre de la base de datos: {0}, nombre de la tabla: {1}

# models.modelSchemaIsNotAcceptedMessage
source: Invalid table structure!
es: Estructura de tabla no válida.

# extLang.extensionFileLocation
source: Language extension location
es: Ubicación de la extensión de idioma

# extLang.extensionFilePath
source: Language extension path
es: Ruta de acceso de la extensión de idioma

# extLang.DialogTitle
source: Languages
es: Idiomas

# mls.latestVersion
source: Latest
es: Último

# sqlMlExtDocDesc
source: Learn how to use Machine Learning extension in Azure Data Studio, to manage packages, make predictions, and import models.
es: Aprenda a usar la extensión de Machine Learning en Azure Data Studio para administrar paquetes, realizar predicciones e importar modelos.

# sqlMlDocDesc
source: Learn how to use machine learning in SQL Server and SQL on Azure, to run Python and R scripts on relational data.
es: Obtenga información sobre cómo el aprendizaje automático en SQL Server y SQL en Azure para ejecutar scripts de Python y R en datos relacionales.

# learnMoreTitle
source: Learn more
es: Más información

# models.learnMoreLink
source: Learn more.
es: Más información.

# models.localModelsTitle
source: Local models
es: Modelos locales

# mls.mssqlExtensionNotLoaded
source: MSSQL extension is not loaded
es: La extensión MSSQL no está cargada

# mls.enabledMessage
source: Machine Learning Services Enabled
es: Machine Learning Services habilitado

# sqlMlsMIDocTitle
source: Machine Learning Services in Azure SQL Managed Instance
es: Machine Learning Services en Azure SQL Managed Instance

# sqlMlExtDocTitle
source: Machine Learning extension in Azure Data Studio
es: Extensión de Machine Learning en Azure Data Studio

# dashboardDesc
source: Machine Learning for SQL databases
es: Machine Learning para bases de datos SQL

# models.viewImportModelsDesc
source: Machine Learning models can be stored in one or more databases and tables. Select the model database and table to view the models within them.
es: Los modelos de Machine Learning se pueden almacenar en una o varias bases de datos y tablas. Seleccione la base de datos modelo y la tabla para ver los modelos que contienen.

# onnxOnEdgeOdbcDocTitle
source: Machine learning and AI with ONNX in SQL Database Edge Preview
es: Aprendizaje automático e IA con ONNX en la versión preliminar de SQL Database Edge

# models.makePredictionTitle
source: Make predictions
es: Realizar predicciones

# models.columnSelectionPageTitle
source: Map source data to model
es: Asignar datos de origen al modelo

# predict.inputColumns
source: Model Input mapping
es: Asignación de entrada del modelo

# mls.noArtifactError
source: Model doesn't have any artifact. model url: {0}
es: El modelo no tiene ningún artefacto. Dirección URL del modelo: {0}

# models.modelFailedToRegistered
source: Model failed to register
es: No se pudo registrar el modelo

# predict.inputName
source: Model input
es: Entrada del modelo

# models.modelNameRequiredError
source: Model name is required.
es: Es necesario especificar el nombre del modelo.

# predict.outputColumns
source: Model output
es: Salida del modelo

# models.modelRegisteredSuccessfully
source: Model registered successfully
es: Se registró correctamente el modelo

# models.modelUpdatedSuccessfully
source: Model updated successfully
es: Modelo actualizado correctamente

# models.currentModelsTitle
source: Models
es: Modelos

# models.azureModels
source: Models
es: Modelos

# predict.outputName
source: Name
es: Nombre

# models.name
source: Name
es: Nombre

# extLang.languageName
source: Name
es: Nombre

# newTableName
source: New table
es: Nueva tabla

# mls.noResultError
source: No Result returned
es: No se devolvió ningún resultado

# mls.packageManager.NoConnection
source: No connection selected
es: No se seleccionó ninguna conexión

# models.azureModelsListEmptyTitle
source: No models found
es: No se encontró ningún modelo

# models.modelsListEmptyMessage
source: No models found
es: No se encontró ningún modelo

# notSupportedEventArg
source: Not supported event args
es: Argumentos de evento no admitidos

# mls.notebookExtensionNotLoaded
source: Notebook extension is not loaded
es: No se ha cargado la extensión del bloc de notas

# extLang.OkButtonText
source: OK
es: Aceptar

# models.onnxNotSupportedError
source: ONNX runtime is not supported in current server
es: La ejecución de ONNX no se admite en el servidor actual

# mls.httpGetRequestError
source: Package info request failed with error: {0} {1}
es: Error en la solicitud de información del paquete: {0} {1}

# mls.managePackages.error
source: Package management is not supported for the server. Make sure you have Python or R installed.
es: No se admite la administración de paquetes para el servidor. Asegúrese de que tiene Python o R instalado.

# extLang.parameters
source: Parameters
es: Parámetros

# extLang.languagePlatform
source: Platform
es: Plataforma

# models.invalidModelToSelectError
source: Please select a valid model
es: Seleccione un modelo válido

# models.invalidModelImportTargetError
source: Please select a valid table
es: Seleccione una tabla válida

# models.modelsRequiredError
source: Please select at least one model to import.
es: Seleccione al menos un módulo para importar.

# models.invalidModelParametersError
source: Please select valid source table and model parameters
es: Seleccione una tabla de origen y parámetros de modelo válidos.

# models.predictModel
source: Predict
es: Predicción

# mls.pythonConfigError
source: Python executable is not configured
es: El archivo ejecutable de Python no está configurado

# mls.rConfigError
source: R executable is not configured
es: El ejecutable de R no está configurado

# mls.installDependencies.packagesAlreadyInstalled
source: Required packages are already installed.
es: Los paquetes necesarios ya están instalados.

# models.azureGroup
source: Resource group
es: Grupo de recursos

# models.createNotebookDesc
source: Run experiments and create models in a notebook
es: Ejecutar experimentos y crear modelos en un cuaderno

# sqlMlsDocTitle
source: SQL Server Machine Learning Services (Python and R)
es: SQL Server Machine Learning Services (Python y R)

# sqlMlDocTitle
source: SQL machine learning documentation
es: Documentación de Machine Learning de SQL

# extLang.SaveButtonText
source: Save
es: Guardar

# models.selectModelDatabaseMessage
source: Select Database
es: Seleccionar base de datos

# databaseToStoreInfo
source: Select a database to store the new model.
es: Seleccione una base de datos para almacenar el nuevo modelo.

# modelDatabaseInfo
source: Select a database where existing / imported models are stored.
es: Seleccione una base de datos en la que se almacenen los modelos importados o existentes.

# modelTableInfo
source: Select a model table to view the list of existing / imported models.
es: Seleccione una tabla de modelo para ver la lista de modelos existentes o importados.

# tableToStoreInfo
source: Select an existing table that conforms the model schema or create a new one to store the imported model.
es: Seleccione una tabla existente que se ajuste al esquema de modelo o cree una nueva para almacenar el modelo importado.

# models.azureModelsListEmptyDescription
source: Select another Azure ML workspace
es: Seleccione otra área de trabajo de Azure Machine Learning

# models.modelsListEmptyDescription
source: Select another database or table
es: Seleccionar otra base de datos o tabla

# predict.selectColumnTitle
source: Select column...
es: Seleccionar columna...

# predict.selectDatabaseTitle
source: Select database
es: Seleccionar base de datos

# models.selectModelDatabaseTitle
source: Select database with models
es: Seleccionar base de datos con modelos

# models.importedModelsPageTitle
source: Select imported model
es: Seleccionar modelo importado

# models.modelSourcePageTitle
source: Select model source type
es: Seleccionar tipo de origen del modelo

# models.selectModelsTableMessage
source: Select models table
es: Seleccionar tabla de modelos

# models.modelImportTargetPageTitle
source: Select or enter the location to import the models to
es: Seleccione o especifique la ubicación a la que se importarán los modelos.

# predict.selectTableTitle
source: Select table
es: Seleccionar tabla

# models.selectModelTableMessage
source: Select table
es: Seleccionar tabla

# models.selectModelTableTitle
source: Select tables with models
es: Seleccionar tablas con modelos

# predict.columnDatabaseInfo
source: Select the database containing the dataset to apply the prediction.
es: Seleccione la base de datos que contiene el conjunto de datos al que se aplicará la predicción.

# predict.columnTableInfo
source: Select the table containing the dataset to apply the prediction.
es: Seleccione la tabla que contiene el conjunto de datos al que desea aplicar la predicción.

# extLang.selectedPath
source: Selected Path
es: Ruta seleccionada

# showLessTitle
source: Show less
es: Mostrar menos

# showMoreTitle
source: Show more
es: Mostrar más

# ml.dataCount
source: Showing {0} model(s)
es: Se muestran {0} modelo(s)

# predict.columnName
source: Source columns
es: Columnas de origen

# predict.columnDatabase
source: Source database
es: Base de datos de origen

# models.modelLocalSourceTitle
source: Source files
es: Archivos de origen

# models.modelSourcesTitle
source: Source location
es: Ubicación de origen

# predict.columnTable
source: Source table
es: Tabla de origen

# tableName
source: Table
es: Tabla

# models.modelSchemaIsAcceptedMessage
source: Table meets requirements!
es: La tabla cumple los requisitos

# models.invalidImportTableSchemaError
source: Table schema is not supported for model import. Database name: {0}, table name: {1}.
es: No se admite el esquema de tabla para la importación de modelos. Nombre de la base de datos: {0}, nombre de la tabla: {1}.

# extLang.Target
source: Target
es: Destino

# models.outputColumnDataTypeNotSupportedWarning
source: The data type of output column does not match the output field’s type.
es: El tipo de datos de la columna de salida no coincide con el tipo del campo de salida.

# models.columnDataTypeMismatchWarning
source: The data type of the source table column does not match the required input field’s type.
es: El tipo de datos de la columna de la tabla de origen no coincide con el tipo de campo de entrada requerido.

# notebookExtensionFailedError
source: The extension failed to load because of it's dependency to Notebook extension. Please check the output log for Notebook extension to get more details
es: No se pudo cargar la extensión debido a que es una dependencia de la extensión de Cuaderno. Compruebe el registro de salida para obtener más información sobre la extensión de Cuaderno.

# mls.installDependencies.confirmInstallPythonPackages
source: The following Python packages are required to install: {0}
es: Se requieren los siguientes paquetes de Python para instalar: {0}

# mls.installDependencies.confirmInstallRPackages
source: The following R packages are required to install: {0}
es: Se requieren los siguientes paquetes de R para instalar: {0}

# models.viewImportModeledForPredictDesc
source: The models are stored in one or more databases and tables. Select the model database and table to view models in them.
es: Los modelos se almacenan en una o varias bases de datos y tablas. Seleccione la base de datos modelo y la tabla para ver los modelos que contienen.

# mls.requiredPackagesNotInstalled
source: The required packages are not installed
es: Los paquetes necesarios no están instalados

# mlsInstallOdbcDocDesc
source: This document explains how to install the Microsoft ODBC Driver for SQL Server.
es: En este documento se explica cómo instalar el Microsoft ODBC Driver for SQL Server.

# predict.dataTypeName
source: Type
es: Tipo

# models.localModelPageTitle
source: Upload model file
es: Cargar archivo de modelo

# dashboardLinksTitle
source: Useful links
es: Vínculos útiles

# mls.installModelMngDependencies.msgTaskName
source: Verifying model management dependencies
es: Comprobando las dependencias de administración del modelo

# mls.installPackageMngDependencies.msgTaskName
source: Verifying package management dependencies
es: Comprobando las dependencias de administración de paquetes

# models.version
source: Version
es: Versión

# dashboardVideoLinksTitle
source: Video tutorials
es: Tutoriales de vídeo

# models.viewImportModelsTitle
source: View and import models
es: Ver e importar modelos

# msgYes
source: Yes
es: Sí

# models.unsupportedModelParameterType
source: unsupported
es: no compatible

# models.azureModelSourceDescriptionForPredict
source: ‘Azure Machine Learning’ is selected. This allows you to choose from models stored in Azure Machine Learning workspaces. Click ‘Next’ to continue.​
es: Se ha seleccionado 'Azure Machine Learning'. Esto le permite elegir modelos almacenados en áreas de trabajo de Azure Machine Learning. Haga clic en 'Siguiente' para continuar.​

# models.azureModelSourceDescriptionForImport
source: ‘Azure Machine Learning’ is selected. This allows you to import models stored in Azure Machine Learning workspaces in a model database in this SQL instance. Click ‘Next’ to continue.​​
es: Se ha seleccionado 'Azure Machine Learning'. Esto permite importar modelos almacenados en áreas de trabajo de Azure Machine Learning en una base de datos de modelos en esta instancia de SQL. Haga clic en 'Siguiente' para continuar.​​

# models.localModelSourceDescriptionForImport
source: ‘File Upload’ is selected. This allows you to import a model file from your local machine into a model database in this SQL instance. Click ‘Next’ to continue.​
es: "Carga de archivos" seleccionada. Esto permite importar un archivo modelo de la máquina local a una base de datos modelo en esta instancia de SQL. Haga clic en "siguiente" para continuar.​

# models.localModelSourceDescriptionForPredict
source: ‘File Upload’ is selected. This allows you to upload a model file from your local machine. Click ‘Next’ to continue.​​
es: "Carga de archivos" está seleccionada. Esto permite cargar un archivo de modelo desde el equipo local. Haga clic en "siguiente" para continuar.​​

# models.importedModelSourceDescriptionForPredict
source: ‘Imported Models’ is selected. This allows you to choose from models stored in a model table in your database. Click ‘Next’ to continue.​
es: "Modelos importados" está seleccionado. Esto le permite elegir modelos almacenados en una tabla modelo de la base de datos. Haga clic en "siguiente" para continuar.​

# title.configurations
source: Configurations
es: Configuraciones

# title.documents
source: Documents
es: Documentos

# ml.command.enableExternalScript
source: Enable External script
es: Habilitar script externo

# ml.enablePython.description
source: Enable Python package management in database.
es: Habilite la administración de paquetes de Python en la base de datos.

# ml.enableR.description
source: Enable R package management in database.
es: Habilite la administración de paquetes de R en la base de datos.

# title.endpoints
source: Endpoints
es: Puntos de conexión

# ml.command.importModel
source: Import model
es: Importar modelo

# ml.command.dependencies
source: Install Machine Learning Dependencies
es: Instalar dependencias de Machine Learning

# ml.pythonPath.description
source: Local path to a preexisting Python installation used by Machine Learning.
es: Ruta de acceso local a una instalación de Python preexistente utilizada por Machine Learning.
