Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# mssql.tracingLevel
source: [Optional] Log level for backend services. Azure Data Studio generates a file name every time it starts and if the file already exists the logs entries are appended to that file. For cleanup of old log files see logRetentionMinutes and logFilesRemovalLimit settings. The default tracingLevel does not log much. Changing verbosity could lead to extensive logging and disk space requirements for the logs. Error includes Critical, Warning includes Error, Information includes Warning and Verbose includes Information
de: [Optional] Protokolliergrad für Back-End-Dienste. Azure Data Studio generiert bei jedem Start einen Dateinamen, und falls die Datei bereits vorhanden ist, werden die Protokolleinträge an diese Datei angehängt. Zur Bereinigung alter Protokolldateien können die Einstellungen "logRetentionMinutes" und "logFilesRemovalLimit" verwendet werden. Bei Verwendung des Standardwerts für "tracingLevel" werden nur wenige Informationen protokolliert. Eine Änderung der Ausführlichkeit kann zu einem umfangreichen Protokollierungsaufkommen und einem hohen Speicherplatzbedarf für die Protokolle führen. "Error" umfasst kritische Meldungen, "Warning" umfasst alle Daten aus "Error" sowie Warnmeldungen, "Information" umfasst alle Daten aus "Warning" sowie Informationsmeldungen, "Verbose" umfasst ausführliche Informationen.
es: [Opcional] El nivel de registro para servicios back-end. Azure Data Studio genera un nombre de archivo cada vez que se inicia y, si el archivo ya existe, las entradas de registros se anexan a ese archivo. Para la limpieza de archivos de registro antiguos, consulte la configuración de logRetentionMinutes y logFilesRemovalLimit. El valor predeterminado tracingLevel no registra mucho. El cambio de detalle podría dar lugar a amplios requisitos de registro y espacio en disco para los registros. Error incluye Crítico, Advertencia incluye Error, Información incluye Advertencia y Detallado incluye Información.
fr: [Facultatif] Niveau de journalisation des services de back-end. Azure Data Studio génère un nom de fichier à chaque démarrage et, si le fichier existe déjà, ajoute les entrées de journal à ce fichier. Pour nettoyer les anciens fichiers journaux, consultez les paramètres logRetentionMinutes et logFilesRemovalLimit. Le niveau de suivi par défaut correspond à une faible journalisation. Si vous changez le niveau de détail, vous pouvez obtenir une journalisation massive nécessitant de l'espace disque pour les journaux. Le niveau Erreur inclut le niveau Critique, le niveau Avertissement inclut le niveau Erreur, le niveau Informations inclut le niveau Avertissement et le niveau Détail inclut le niveau Informations
it: [Facoltativa] Livello di registrazione per i servizi back-end. Azure Data Studio genera un nome file a ogni avvio e, se il file esiste già, le voci del log vengono accodate a tale file. Per la pulizia dei file di log meno recenti, vedere le impostazioni logRetentionMinutes e logFilesRemovalLimit. Con l'impostazione predefinita di tracingLevel, la quantità di dati registrata non è eccessiva. Se si cambia il livello di dettaglio, la registrazione potrebbe diventare eccessiva e richiedere un notevole spazio su disco per i log. Il livello Error include quello Critical, il livello Warning include quello Error, il livello Information include quello Warning e il livello Verbose include quello Information
ja: [省略可能] バックエンド サービスのログ レベル。Azure Data Studio は開始のたびにファイル名を生成し、そのファイルが既に存在する場合にはログ エントリが対象ファイルに追加されます。古いログ ファイルのクリーンアップについては、logRetentionMinutes と logFilesRemovalLimit の設定を参照してください。既定の tracingLevel では、ログに記録される数は多くありません。詳細レベルを変更すると、詳細なログが記録され、ログのためのディスク容量が必要になる場合があります。エラーには重大が含まれ、警告にはエラーが含まれ、情報には警告が含まれ、詳細には情報が含まれます
ko: [옵션] 백 엔드 서비스의 로그 수준입니다. Azure Data Studio는 시작할 때마다 파일 이름을 생성하며 파일이 이미 있으면 로그 항목이 해당 파일에 추가됩니다. 이전 로그 파일을 정리하려면 logRetentionMinutes 및 logFilesRemovalLimit 설정을 참조하세요. 기본 tracingLevel에서는 많은 양의 로그가 기록되지 않습니다. 세부 정보 표시를 변경하면 로깅이 광범위해지고 로그의 디스크 공간 요구 사항이 커질 수 있습니다. 오류이면 중요가 포함되고 경고이면 오류가 포함되고 정보이면 경고가 포함되고 세부 정보 표시이면 정보가 포함됩니다.
pt_br: [Opcional] Registre o nível para serviços de back-end. O Azure Data Studio gera um nome de arquivo sempre que é iniciado e, quando o arquivo já existe, as entradas de logs são acrescentadas a esse arquivo. Para a limpeza de arquivos de log antigos, confira as configurações logRetentionMinutes e logFilesRemovalLimit. O tracingLevel padrão não registra uma grande quantidade de log. A alteração de detalhamento pode levar ao aumento dos requisitos de log e de espaço em disco para os logs. Erro inclui Crítico, Aviso inclui Erro, informações incluem Aviso e Detalhado inclui Informações
ru: [Необязательно] Уровень ведения журнала для серверных служб. Azure Data Studio создает имя файла при каждом запуске, а если такой файл уже существует, записи журналов добавляются в него. Для очистки старых файлов журналов см. описание параметров logRetentionMinutes и logFilesRemovalLimit. Параметр tracingLevel по умолчанию регистрирует не слишком многое. Изменение детализации может привести к тому, что журналы будут занимать слишком много места. Ошибка включает критический уровень, предупреждение включает ошибку, информационный уровень включает предупреждение, а подробный уровень включает информационный уровень.
zh_hans: [可选] 后端服务的日志级别。Azure Data Studio 在每次启动时都会生成文件名；如果文件已存在，日志条目将追加到该文件。有关旧日志文件的清理，请参阅 logRetentionMinutes 和 logFilesRemovalLimit 设置。默认 tracingLevel 记录的内容很少。更改详细级别可能提升日志的记录和磁盘空间要求。“错误”包含“严重”，“警告”包含“错误”，“信息”包含“警告”，“详细级别”包含“信息”
zh_hant: [選用] 後端服務的記錄層級。每當 Azure Data Studio 啟動，或是檔案已經有附加至該檔案的記錄項目時，Azure Data Studio 都會產生檔案名稱。如需清除舊記錄檔，請查看 logRetentionMinutes 和 logFilesRemovalLimit 設定。預設 tracingLevel 不會記錄太多項目。變更詳細資訊可能會導致大量記錄和記錄的磁碟空間需求。錯誤包含嚴重，警告包含錯誤，資訊包含警告而詳細資訊包含資訊

# mssql.piiLogging
source: [Optional] Should Personally Identifiable Information (PII) be logged in the log file.
de: [Optional] Hiermit wird festgelegt, ob personenbezogene Informationen (PII) in der Protokolldatei protokolliert werden sollen.
es: [Opcional] Debe registrarse información de identificación personal (DCP) en el archivo de registro.
fr: [Facultatif] Si des informations d’identification personnelle (PII) doivent être enregistrées dans le fichier journal.
it: [Facoltativo] Indicare se le informazioni personali devono essere registrate nel file di log.
ja: [オプション]個人を特定できる情報 (PII) をログ ファイルに記録する必要があります。
ko: [선택 사항] PII(개인 식별 정보)가 로그 파일에 기록되게 합니다.
pt_br: [Opcional] As informações de identificação pessoal (PII) devem ser registradas no arquivo de log.
ru: [Необязательно] Должны ли личные сведения регистрироваться в файле журнала.
zh_hans: [可选] 应在日志文件中记录个人身份信息(PII)。
zh_hant: [選用] 是否應在記錄檔中記錄個人識別資訊 (PII)。

# mssql.tracing.desc
source: [Optional] Traces the communication between Azure Data Studio and SQL Tools Service to the SQL Tools Service output channel. WARNING: This may include sensitive information when verbose logging is enabled.
de: [Optional] Verfolgt die Kommunikation zwischen Azure Data Studio und dem SQL-Toolsdienst mit dem Ausgabekanal des SQL-Toolsdiensts. WARNUNG: Dies kann vertrauliche Informationen enthalten, wenn die ausführliche Protokollierung aktiviert ist.
es: [Opcional] Realiza un seguimiento de la comunicación entre Azure Data Studio y el Servicio de herramientas de SQL al canal de salida del Servicio de herramientas de SQL. ADVERTENCIA: esto puede incluir información confidencial cuando está habilitado el registro detallado.
fr: [Facultatif] Trace la communication entre Azure Data Studio et SQL Tools Service vers le canal de sortie SQL Tools Service. AVERTISSEMENT : cela peut inclure des informations sensibles lorsque la journalisation détaillée est activée.
it: [Facoltativo] Consente di monitorare la comunicazione tra Azure Data Studio e SQL Tools Service nel canale di output di SQL Tools Service. AVVISO: potrebbero essere incluse informazioni riservate quando è abilitata la registrazione dettagliata.
ja: [省略可能] Azure Data Studio と SQL Tools Service の間の SQL Tools Service 出力チャネルへの通信をトレースします。警告: 詳細なログ記録が有効になっている場合、機密情報が含まれる可能性があります。
ko: [선택 사항] Azure Data Studio와 SQL Tools Service 간의 통신을 SQL Tools Service 출력 채널로 추적합니다. 경고: 자세한 정보 로깅을 사용하는 경우 중요한 정보가 포함될 수 있습니다.
pt_br: [Opcional] Rastreia a comunicação entre o Azure Data Studio e o Serviço de Ferramentas SQL até o canal de saída do Serviço de Ferramentas SQL. AVISO: isso pode incluir informações confidenciais quando o registro detalhado estiver habilitado.
ru: [Необязательно] Отслеживает связь между Azure Data Studio и службой инструментов SQL до выходного канала службы инструментов SQL. ПРЕДУПРЕЖДЕНИЕ. Если включить режим подробного ведения журнала, в журнале может появляться конфиденциальная информация.
zh_hans: [可选]跟踪 Azure Data Studio 与 SQL 工具服务到 SQL 工具服务输出通道之间的通信。警告: 启用详细日志记录时，这可能会包含敏感信息。
zh_hant: [選用] 追蹤 Azure Data Studio 與 SQL Tools Service 至 SQL Tools Service 輸出通道之間的通訊。警告: 啟用詳細資訊記錄時，這可能包含敏感性資訊。

# mssql.connectionOptions.serverName.placeholder
source: e.g. servername,port
de: Beispiel: Servername,Port
es: por ejemplo, nombredeservidor, puerto
fr: par exemple : nom du serveur, port
it: es. nomeserver,porta
ja: 例: servername,port
ko: 예: 서버 이름,포트
pt_br: por exemplo, nome do servidor,porta
ru: например, имя сервера,порт
zh_hans: 例如服务器名、端口
zh_hant: 例如伺服器名稱、連接埠

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
de: Gibt an, dass Kommas in einer Liste am Anfang der einzelnen Anweisungen (z. B. ", mycolumn2") und nicht am Ende platziert werden sollen: "mycolumn1,"
es: Indica si las comas deben colocarse al principio de cada instrucción de una lista por ejemplo, ", micolumna2" en lugar de al final, por ejemplo, "micolumna1,".
fr: spécifie si des virgules doivent être placées au début de chaque instruction dans une liste (par exemple : ',mycolumn2') plutôt qu'à la fin (par exemple : 'mycolumn1,')
it: Consente di indicare se le virgole devono essere inserite all'inizio di ogni istruzione in un elenco, ad esempio ', mycolumn2', anziché alla fine, ad esempio 'mycolumn1,'?
ja: コンマを、'mycolumn1,' のようにリスト内の各ステートメントの末尾に配置する代わりに ',mycolumn2' のように先頭に配置するかどうか
ko: 목록의 각 문 앞에 쉼표를 표시할지 여부(예: 끝에 'mycolumn1' 대신 ', mycolumn2' 사용)
pt_br: vírgulas devem ser colocadas no início de cada instrução em uma lista? Por exemplo, ', minhacoluna2' em vez de no final, por exemplo, 'minhacoluna1,'?
ru: Следует ли ставить запятые в начале каждой инструкции в списке, например ", mycolumn2", а не в конце, например "mycolumn1,"
zh_hans: 是否应将逗号置于列表中每个语句的开头(例如 ", mycolumn2")而不是结尾(例如 "mycolumn1,")
zh_hant: 逗號是否放在 list 中每個語句的開頭，例如: ", mycolumn2" 而非在結尾，例如: "mycolumn1,"

# objectManagement.filesSectionHeader
source: Files
de: Dateien
it: File
ja: ファイル
ko: 파일
pt_br: Arquivos
zh_hans: 文件

# objectManagement.optionsSectionHeader
source: Options
de: Optionen
it: Opzioni
ja: オプション​​
ko: 옵션
pt_br: Opções
zh_hans: 选项
