Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.encryption.description
source: This database is encrypted using Transparent Data Encryption (TDE). You need to migrate certificates before you can migrate this database.
de: Diese Datenbank wird mit TDE (Transparent Data Encryption) verschlüsselt. Sie müssen Zertifikate migrieren, bevor Sie diese Datenbank migrieren können.
es: Esta base de datos se cifra mediante Cifrado de datos transparente (TDE). Debe migrar los certificados para poder migrar esta base de datos.
fr: Cette base de données est cryptée à l'aide de Transparent Data Encryption (TDE). Vous devez migrer les certificats avant de pouvoir migrer cette base de données.
ja: このデータベースは、Transparent Data Encryption (TDE) を使用して暗号化されます。このデータベースを移行する前に、証明書を移行する必要があります。
ko: 이 데이터베이스는 TDE(투명한 데이터 암호화)를 사용하여 암호화됩니다. 이 데이터베이스를 마이그레이션하려면 인증서를 마이그레이션해야 합니다.
pt_br: Esse banco de dados é criptografado usando TDE (Transparent Data Encryption). Você precisa migrar certificados antes de migrar esse banco de dados.
ru: Эта база данных зашифрована с использованием прозрачного шифрования данных (TDE). Перед переносом этой базы данных необходимо перенести сертификаты.
zh_hans: 此数据库使用透明数据加密 (TDE) 进行加密。需要先迁移证书，然后才能迁移此数据库。
zh_hant: 此資料庫使用透明資料加密 (TDE) 來加密。您必須先移轉憑證，才能移轉此資料庫。

# sql.migration.assessments.blocking.issue
source: This is a blocking issue that will prevent the database migration from succeeding.
de: Dies ist ein Blockierproblem, das eine erfolgreiche Datenbankmigration verhindert.
es: Se trata de un problema de bloqueo que impedirá que la migración de la base de datos se realice de manera correcta.
fr: Il s’agit d’un problème bloquant qui empêche la migration de la base de données de réussir.
ja: これがデータベース移行の成功を妨げるブロック問題です。
ko: 이 문제는 데이터베이스 마이그레이션이 성공하는 것을 막는 차단 문제입니다.
pt_br: Este é um problema de bloqueio que impedirá o êxito da migração do banco de dados.
ru: Это блокирующая проблема, которая препятствует успешному выполнению миграции базы данных.
zh_hans: 这是一个阻止性问题，将阻止数据库迁移成功。
zh_hant: 這是會導致資料庫移轉無法成功的執行問題。

# sql.migration.sku.azureRecommendation.status.autoRefreshTimer
source: Time before next SKU recommendation update: {0} minute(s).
de: Zeit bis zur nächsten Aktualisierung von SKU-Empfehlungen: {0} Minute(n).
es: Tiempo antes de la siguiente actualización de recomendación de SKU: {0} minuto(s).
fr: Temps avant la prochaine mise à jour des recommandations SKU : {0} minute(s).
ja: 次回の SKU レコメンデーションの更新前の時間: {0} 分。
ko: 다음 SKU 권장 사항 업데이트 전 시간: {0}분
pt_br: Tempo antes da próxima atualização de recomendação de SKU: {0} minuto(s).
ru: Время до следующего обновления рекомендации SKU: {0} мин.
zh_hans: 距离下次 SKU 建议更新: {0} 分钟。
zh_hant: 下次 SKU 建議更新之前的時間: {0} 分鐘。

# sql.migration.select.skip.assessment.check.to.continue
source: To continue, check skip assessment option.
de: Um fortzufahren, aktivieren Sie die Option "Bewertung überspringen".
es: Para continuar, compruebe la opción de omitir evaluación.
fr: Pour continuer, vérifiez l’option ignorer l’évaluation.
ja: 続行するには、[評価をスキップする] オプションにチェックします。
ko: 계속하려면 평가 건너뛰기 옵션을 선택합니다.
pt_br: Para continuar, marque a opção ignorar avaliação.
ru: Чтобы продолжить, установите флажок "Пропустить оценку".
zh_hans: 若要继续，检查“跳过评估”选项。
zh_hant: 若要繼續，請勾選 [跳過評定] 選項。

# sql.migration.missing.targetPassword.error
source: To continue, enter a valid target password.
de: Geben Sie ein gültiges Zielkennwort ein, um fortzufahren.
es: Para continuar, escriba una contraseña de destino válida.
fr: Pour continuer, saisissez un mot de passe cible valide.
ja: 続行するには、有効なターゲット パスワードを入力します。
ko: 계속하려면 유효한 대상 암호를 입력합니다.
pt_br: Para continuar, insira uma senha de destino válida.
ru: Чтобы продолжить, введите допустимый пароль целевого объекта.
zh_hans: 如果要继续，请输入有效的目标密码。
zh_hant: 若要繼續，請輸入有效的目標密碼。

# sql.migration.missing.targetUserName.error
source: To continue, enter a valid target user name.
de: Geben Sie einen gültigen Zielbenutzernamen ein, um fortzufahren.
es: Para continuar, introduzca un nombre de usuario de destino válido.
fr: Pour continuer, entrez un nom d'utilisateur cible valide.
ja: 続行するには、有効なターゲット ユーザー名を入力します。
ko: 계속하려면 유효한 대상 사용자 이름을 입력합니다.
pt_br: Para continuar, insira um nome de usuário de destino válido.
ru: Чтобы продолжить, введите допустимое имя пользователя целевого объекта.
zh_hans: 如果要继续，请输入有效的目标用户名。
zh_hant: 若要繼續，請輸入有效的使用者名稱。

# sql.migration.invalid.non.page.blob.backupFile.error
source: To continue, select a blob container where all the backup files are page blobs for source database '{0}', as block blobs are supported only for targets running SQL Server 2016 or later. Learn more: https://aka.ms/dms-migrations-troubleshooting
de: Um fortzufahren, wählen Sie einen Blobcontainer aus, in dem alle Sicherungsdateien Seitenblobs für die Quelldatenbank "{0}" sind, da Blockblobs nur für Ziele unterstützt werden, die SQL Server 2016 oder höher ausführen. Weitere Informationen: https://aka.ms/dms-migrations-troubleshooting
es: Para continuar, seleccione un contenedor de blobs donde todos los archivos de copia de seguridad sean blobs en páginas para la base de datos de origen "{0}", ya que los blobs en bloques solo se admiten para destinos que ejecutan SQL Server 2016 o posterior. Más información: https://aka.ms/dms-migrations-troubleshooting
fr: Pour continuer, sélectionnez un conteneur d’objets blob où tous les fichiers de sauvegarde sont des objets blob de pages pour la base de données source « {0} », car les objets blob de blocs sont pris en charge uniquement pour les cibles qui s’exécutent SQL Server 2016 ou version ultérieure. En savoir plus : https://aka.ms/dms-migrations-troubleshooting
ja: 続行するには、すべてのバックアップ ファイルがソース データベース '{0}' のページ BLOB である BLOB コンテナーを選択してください。ブロック BLOB は、SQL Server 2016 以降を実行しているターゲットでのみサポートされています。詳細情報: https://aka.ms/dms-migrations-troubleshooting
ko: 블록 Blob이 SQL Server 2016 이상을 실행하는 대상에만 지원되므로 계속하려면 모든 백업 파일이 원본 데이터베이스 '{0}'에 대한 페이지 Blob인 BLOB 컨테이너를 선택합니다. 자세한 정보: https://aka.ms/dms-migrations-troubleshooting
pt_br: Para continuar, selecione um contêiner de blobs em que todos os arquivos de backup sejam blobs de páginas para o banco de dados de origem "{0}", pois os blobs de blocos têm suporte apenas para destinos que executam o SQL Server 2016 ou posterior. Saiba mais: https://aka.ms/dms-migrations-troubleshooting
ru: Чтобы продолжить, выберите контейнер BLOB-объектов, в котором все файлы резервных копий являются страничными BLOB-объектами для базы данных-источника '{0}', так как блочные BLOB-объекты поддерживаются только для целевых объектов с SQL Server 2016 или более поздней версии. Дополнительные сведения: https://aka.ms/dms-migrations-troubleshooting
zh_hans: 如果要继续，请选择一个 blob 容器，其中所有备份文件都是源数据库“{0}”的页 blob，因为运行 SQL Server 2016 或更高版本的目标仅支持块 blob。要了解详细信息，请访问: https://aka.ms/dms-migrations-troubleshooting
zh_hant: 若要繼續，請選取 Blob 容器 (其中所有備份檔案都是來源資料庫 '{0}' 的分頁 Blob)，因為只有執行 SQL Server 2016 或更新版本的目標才支援區塊 Blob。深入了解: https://aka.ms/dms-migrations-troubleshooting

# sql.migration.select.target.to.continue
source: To continue, select a target.
de: Wählen Sie ein Ziel aus, um fortzufahren.
es: Para continuar, seleccione un destino.
fr: Pour continuer, sélectionnez une cible.
ja: 続行するには、ターゲットを選択してください。
ko: 계속하려면 대상을 선택하세요.
pt_br: Para continuar, selecione um destino.
ru: Чтобы продолжить, выберите целевой объект.
zh_hans: 如果要继续，请选择目标。
zh_hant: 若要繼續，請選取目標。

# sql.migration.invalid.sqldatabase.error
source: To continue, select a valid Azure SQL Database server.
de: Wählen Sie einen gültigen Azure SQL-Datenbank-Server aus, um fortzufahren.
es: Para continuar, seleccione un servidor de Azure SQL Database válido.
fr: Pour continuer, sélectionnez un serveur Azure SQL Database valide.
ja: 続行するには、有効なAzure SQL Database サーバーを選択します。
ko: 계속하려면 유효한 Azure SQL Database 서버를 선택합니다.
pt_br: Para continuar, selecione um servidor válido do Banco de Dados SQL do Azure.
ru: Чтобы продолжить, выберите допустимый сервер Базы данных SQL Azure.
zh_hans: 如果要继续，请选择有效的 Azure SQL 数据库服务器。
zh_hant: 若要繼續，請選取有效的 Azure SQL Database 伺服器。

# sql.migration.invalid.account.error
source: To continue, select a valid Azure account.
de: Wählen Sie ein gültiges Azure-Konto aus, um den Vorgang fortzusetzen.
es: Para continuar, seleccione una cuenta de Azure válida.
fr: Pour continuer, sélectionnez un compte Azure valide.
ja: 続けるには、有効な Azure アカウントを選択してください。
ko: 계속하려면 유효한 Azure 계정을 선택합니다.
pt_br: Para continuar, selecione uma conta válida do Azure.
ru: Для продолжения выберите допустимую учетную запись Azure.
zh_hans: 如果要继续，请选择有效的 Azure 帐户。
zh_hant: 若要繼續，請選取有效的 Azure 帳戶。

# sql.migration.invalid.blob.lastBackupFolder.error
source: To continue, select a valid backup folder for source database '{0}'.
de: Wählen Sie einen gültigen Sicherungsordner für die Quelldatenbank „{0}“ aus, um den Vorgang fortzusetzen.
es: Para continuar, seleccione una carpeta de copia de seguridad válida para la base de datos de origen "{0}".
fr: Pour continuer, sélectionnez un dossier de sauvegarde valide pour la base de données source ’{0}’.
ja: 続行するには、ソース データベース '{0}' の有効なバックアップ フォルダーを選択します。
ko: 계속하려면 '{0}' 원본 데이터베이스에 대해 유효한 백업 폴더를 선택하세요.
pt_br: Para continuar, selecione uma pasta de backup válida para o banco de dados de origem '{0}'.
ru: Для продолжения выберите допустимую папку резервного копирования для базы данных-источника "{0}".
zh_hans: 如果要继续，请为源数据库“{0}”选择有效的备份文件夹。
zh_hant: 若要繼續，請選取來源資料庫 '{0}' 的有效備份資料夾。

# sql.migration.invalid.blob.container.error
source: To continue, select a valid blob container for source database '{0}'.
de: Um fortzufahren, wählen Sie einen gültigen Blobcontainer für die Quelldatenbank "{0}" aus.
es: Para continuar, seleccione un contenedor de blobs válido para la base de datos de origen "{0}".
fr: Pour continuer, sélectionnez un conteneur d’objet blob valide pour la base de données source « {0} ».
ja: 先に進むには、ソース データベース '{0}' の有効な BLOB コンテナーを選択してください。
ko: 계속하려면 원본 데이터베이스 '{0}'에 대해 유효한 Blob 컨테이너를 선택하세요.
pt_br: Para continuar, selecione um contêiner de blob válido para o banco de dados de origem '{0}'.
ru: Для продолжения выберите допустимый контейнер больших двоичных объектов для базы данных-источника "{0}".
zh_hans: 若要继续，请为源数据库“{0}”选择有效的 blob 容器。
zh_hant: 若要繼續，請選取來源資料庫 '{0}' 的有效 Blob 容器。

# sql.migration.invalid.blob.lastBackupFile.error
source: To continue, select a valid last backup file for source database '{0}'.
de: Um fortzufahren, wählen Sie eine gültige letzte Sicherungsdatei für die Quelldatenbank "{0}" aus.
es: Para continuar, seleccione un archivo válido de copia de seguridad reciente para la base de datos de origen "{0}".
fr: Pour continuer, sélectionnez un dernier fichier de sauvegarde valide pour la base de données source « {0} ».
ja: 先に進むには、ソース データベース '{0}' の有効な最終バックアップ ファイルを選択してください。
ko: 계속하려면 원본 데이터베이스 '{0}'에 대한 유효한 마지막 백업 파일을 선택하세요.
pt_br: Para continuar, selecione um último arquivo de backup válido para o banco dados de origem '{0}'.
ru: Для продолжения выберите допустимый последний файл резервной копии для базы данных-источника "{0}".
zh_hans: 若要继续，请为源数据库“{0}”选择有效的上一个备份文件。
zh_hant: 若要繼續，請選取來源資料庫 '{0}' 的上一個有效備份檔案。

# sql.migration.invalid.location.error
source: To continue, select a valid location.
de: Wählen Sie einen gültigen Speicherort aus, um den Vorgang fortzusetzen.
es: Para continuar, seleccione una ubicación válida.
fr: Pour continuer, sélectionnez un emplacement valide.
ja: 先に進むには、有効な場所を選択してください。
ko: 계속하려면 유효한 위치를 선택하세요.
pt_br: Para continuar, selecione um local válido.
ru: Чтобы продолжить, выберите действительное расположение.
zh_hans: 若要继续，请选择有效位置。
zh_hant: 若要繼續，請選取有效的位置。

# sql.migration.invalid.managedInstance.error
source: To continue, select a valid managed instance.
de: Wählen Sie eine gültige verwaltete Instanz aus, um den Vorgang fortzusetzen.
es: Para continuar, seleccione una instancia administrada válida.
fr: Pour continuer, sélectionnez une instance gérée valide.
ja: 続行するには、有効なマネージド インスタンスを選択してください。
ko: 계속하려면 유효한 관리되는 인스턴스를 선택하세요.
pt_br: Para continuar, selecione uma instância gerenciada válida.
ru: Чтобы продолжить, выберите допустимый управляемый экземпляр.
zh_hans: 如果要继续，请选择有效的托管实例。
zh_hant: 若要繼續，請選取有效的受控執行個體。

# sql.migration.invalid.blob.resourceGroup.error
source: To continue, select a valid resource group for source database '{0}'.
de: Um fortzufahren, wählen Sie eine gültige Ressourcengruppe für die Quelldatenbank "{0}" aus.
es: Para continuar, seleccione un grupo de recursos válido para la base de datos de origen "{0}".
fr: Pour continuer, sélectionnez un groupe de ressources valide pour la base de données source « {0} ».
ja: 先に進むには、ソース データベース '{0}' の有効なリソース グループを選択してください。
ko: 계속하려면 원본 데이터베이스 '{0}'에 대해 유효한 리소스 그룹을 선택하세요.
pt_br: Para continuar, selecione um grupo de recursos válido para o banco de dados de origem '{0}'.
ru: Для продолжения выберите действительную группу ресурсов для базы данных-источника "{0}".
zh_hans: 若要继续，请为源数据库“{0}”选择有效的资源组。
zh_hant: 若要繼續，請選取來源資料庫 '{0}' 的有效資源群組。

# sql.migration.invalid.resourceGroup.error
source: To continue, select a valid resource group.
de: Wählen Sie eine gültige Ressourcengruppe aus, um fortzufahren.
es: Para continuar, seleccione un grupo de recursos válido.
fr: Pour continuer, sélectionnez un groupe de ressources valide.
ja: 続行するには、有効なリソースグループを選択してください。
ko: 계속하려면 유효한 리소스 그룹을 선택하세요.
pt_br: Para continuar, selecione um grupo de recursos válido.
ru: Чтобы продолжить, выберите действительную группу ресурсов.
zh_hans: 如果要继续，请选择有效的资源组。
zh_hant: 若要繼續，請選取有效的資源群組。

# sql.migration.invalid.blob.storageAccount.error
source: To continue, select a valid storage account for source database '{0}'.
de: Um fortzufahren, wählen Sie ein gültiges Speicherkonto für die Quelldatenbank "{0}" aus.
es: Para continuar, seleccione una cuenta de almacenamiento válida para la base de datos de origen "{0}".
fr: Pour continuer, sélectionnez un connecteur d’objets blob valide pour la base de données source « {0} ».
ja: 先に進むには、ソース データベース '{0}' の有効なストレージ アカウントを選択してください。
ko: 계속하려면 원본 데이터베이스 '{0}'에 대한 유효한 저장소 계정을 선택하세요.
pt_br: Para continuar, selecione uma conta de armazenamento válida para o banco de dados de origem '{0}'.
ru: Для продолжения выберите действительную учетную запись хранения для базы данных-источника "{0}".
zh_hans: 若要继续，请为源数据库“{0}”选择有效的存储帐户。
zh_hant: 若要繼續，請選取來源資料庫 '{0}' 的有效儲存體帳戶。

# sql.migration.invalid.storageAccount.error
source: To continue, select a valid storage account.
de: Wählen Sie ein gültiges Speicherkonto aus, um den Vorgang fortzusetzen.
es: Para continuar, seleccione una cuenta de almacenamiento válida.
fr: Sélectionnez un compte de stockage valide.
ja: 先に進むには、有効なストレージ アカウントを選択してください。
ko: 계속하려면 유효한 스토리지 계정을 선택하세요.
pt_br: Para continuar, selecione uma conta de armazenamento válida.
ru: Чтобы продолжить, выберите действительную учетную запись хранения.
zh_hans: 若要继续，请选择有效的存储帐户。
zh_hant: 若要繼續，請選取有效的儲存體帳戶。

# sql.migration.invalid.subscription.error
source: To continue, select a valid subscription.
de: Wählen Sie ein gültiges Abonnement aus, um den Vorgang fortzusetzen.
es: Para continuar, seleccione una suscripción válida.
fr: Pour continuer, sélectionnez un abonnement valide.
ja: 先に進むには、有効なサブスクリプションを選択してください。
ko: 계속하려면 유효한 구독을 선택하세요.
pt_br: Para continuar, selecione uma assinatura válida.
ru: Чтобы продолжить, выберите действительную подписку.
zh_hans: 若要继续，请选择有效的订阅。
zh_hant: 若要繼續，請選取有效的訂用帳戶。

# sql.migration.invalid.virtualMachine.error
source: To continue, select a valid virtual machine.
de: Wählen Sie einen gültigen virtuellen Computer aus, um den Vorgang fortzusetzen.
es: Para continuar, seleccione una máquina virtual válida.
fr: Pour continuer, sélectionnez une machine virtuelle valide.
ja: 続行するには、有効な仮想マシンを選択してください。
ko: 계속하려면 유효한 가상 머신을 선택하세요.
pt_br: Para continuar, selecione uma máquina virtual válida.
ru: Чтобы продолжить, выберите допустимую виртуальную машину.
zh_hans: 如果要继续，请选择有效的虚拟机。
zh_hant: 若要繼續，請選取有效的虛擬機器。

# sql.migration.tde.wizard.description
source: To migrate an encrypted database successfully you need to provide access to the encryption certificates or migrate certificates manually before proceeding with the migration. {0}.
de: Um eine verschlüsselte Datenbank erfolgreich zu migrieren, müssen Sie Zugriff auf die Verschlüsselungszertifikate gewähren oder Zertifikate manuell migrieren, bevor Sie mit der Migration fortfahren. {0}.
es: Para migrar correctamente una base de datos cifrada, debe proporcionar acceso a los certificados de cifrado o migrarlos manualmente antes de continuar con la migración. {0}.
fr: Pour réussir la migration d’une base de données chiffrée, vous devez donner accès aux certificats de chiffrement ou migrer les certificats manuellement avant de procéder à la migration. {0}.
ja: 暗号化されたデータベースを正常に移行するには、暗号化証明書へのアクセスを許可するか、移行を続行する前に証明書を手動で移行する必要があります。{0}。
ko: 암호화된 데이터베이스를 마이그레이션하려면 마이그레이션을 계속하기 전에 암호화 인증서에 대한 액세스를 제공하거나 인증서를 수동으로 마이그레이션해야 합니다. {0}.
pt_br: Para migrar um banco de dados criptografado com êxito, você precisa fornecer acesso aos certificados de criptografia ou migrar certificados manualmente antes de prosseguir com a migração. {0}.
ru: Для миграции зашифрованной базы данных необходимо предоставить доступ к сертификатам шифрования или перенести сертификаты вручную, прежде чем продолжить миграцию. {0}.
zh_hans: 若要成功迁移加密数据库，需要在继续迁移之前提供对加密证书的访问权限或手动迁移证书。{0}。
zh_hant: 若要成功移轉加密的資料庫，您必須先提供加密憑證的存取權或手動移轉憑證，才能繼續移轉。{0}。

# sql.migration.sku.recommendation.view.assessment.sqldb
source: To migrate to Azure SQL Database, view assessment results and select one or more databases.
de: Um zu Azure SQL-Datenbank zu migrieren, zeigen Sie die Bewertungsergebnisse an, und wählen Sie eine oder mehrere Datenbanken aus.
es: Para migrar a Azure SQL Database, vea los resultados de la evaluación y seleccione una o varias bases de datos.
fr: Pour migrer vers Azure SQL Database, affichez les résultats de l'évaluation et sélectionnez une ou plusieurs bases de données.
ja: Azure SQL Database に移行するには、評価結果を表示し、1 つ以上のデータベースを選択します。
ko: Azure SQL 데이터베이스로 마이그레이션하려면 평가 결과를 보고 하나 이상의 데이터베이스를 선택합니다.
pt_br: Para migrar para o Banco de Dados SQL do Azure, exiba os resultados da avaliação e selecione um ou mais bancos de dados.
ru: Для миграции на Базу данных SQL Azure просмотрите результаты оценки и выберите одну или несколько баз данных.
zh_hans: 要迁移到 Azure SQL 数据库，请查看评估结果并选择一个或多个数据库。
zh_hant: 若要移轉至 Azure SQL Database，請檢視評定結果並選取一或多個資料庫。

# sql.migration.sku.recommendation.view.assessment.mi
source: To migrate to Azure SQL Managed Instance, view assessment results and select one or more databases.
de: Um zu Azure SQL Managed Instance zu migrieren, zeigen Sie die Bewertungsergebnisse an, und wählen Sie eine oder mehrere Datenbanken aus.
es: Para migrar a Azure SQL Managed Instance, vea los resultados de la evaluación y seleccione una o varias bases de datos.
fr: Pour migrer vers Azure SQL Managed Instance, affichez les résultats de l’évaluation et sélectionnez une ou plusieurs bases de données.
ja: Azure SQL Managed Instance に移行するには、評価結果を表示し、1 つ以上のデータベースを選択します。
ko: Azure SQL Managed Instance로 마이그레이션하려면 평가 결과를 보고 하나 이상의 데이터베이스를 선택합니다.
pt_br: Para migrar para a Instância Gerenciada de SQL do Azure, exiba os resultados da avaliação e selecione um ou mais bancos de dados.
ru: Просмотрите результаты оценки и выберите одну или несколько баз данных для миграции в Управляемый экземпляр SQL Azure.
zh_hans: 若要迁移到 Azure SQL 托管实例，请查看评估结果并选择一个或多个数据库。
zh_hant: 若要移轉至 Azure SQL 受控執行個體，請檢視評定結果並選取一或多個資料庫。

# sql.migration.sku.recommendation.view.assessment.vm
source: To migrate to SQL Server on Azure Virtual Machine, view assessment results and select one or more databases.
de: Um zu SQL Server auf einem virtuellen Azure-Computer zu migrieren, zeigen Sie die Bewertungsergebnisse an, und wählen Sie eine oder mehrere Datenbanken aus.
es: Para migrar a SQL Server en la máquina virtual de Azure, vea los resultados de la evaluación y seleccione una o varias bases de datos.
fr: Pour migrer vers SQL Server sur une machine virtuelle Azure, affichez les résultats de l’évaluation et sélectionnez une ou plusieurs bases de données.
ja: Azure Virtual Machine 上の SQL Server に移行するには、評価結果を表示し、1 つ以上のデータベースを選択します。
ko: Azure 가상 머신의 SQL Server로 마이그레이션하려면 평가 결과를 보고 하나 이상의 데이터베이스를 선택합니다.
pt_br: Para migrar para o SQL Server na Máquina Virtual do Azure, exiba os resultados da avaliação e selecione um ou mais bancos de dados.
ru: Просмотрите результаты оценки и выберите одну или несколько баз данных для миграции в SQL Server на виртуальной машине Azure.
zh_hans: 若要迁移到 Azure 虚拟机上的 SQL Server，请查看评估结果并选择一个或多个数据库。
zh_hant: 若要移轉至 Azure 虛擬機器上的 SQL Server，請檢視評定結果並選取一或多個資料庫。

# sql.migration.database.migration.mode.description
source: To migrate to the Azure SQL target, choose a migration mode based on your downtime requirements.
de: Um zum Azure SQL-Ziel zu migrieren, wählen Sie einen Migrationsmodus basierend auf Ihren Ausfallzeiten aus.
es: Para migrar al destino Azure SQL, elija un modo de migración en función de los requisitos del tiempo de inactividad.
fr: Pour effectuer la migration vers le serveur cible Azure SQL, choisissez un mode de migration en fonction de vos besoins en temps d’arrêt.
ja: Azure SQL ターゲットに移行するには、ダウンタイムの要件に基づいて移行モードを選択します。
ko: Azure SQL 대상으로 마이그레이션하려면 가동 중지 시간 요구 사항에 따라 마이그레이션 모드를 선택합니다.
pt_br: Para migrar para o destino do SQL do Azure, escolha um modo de migração baseado em seus requisitos de tempo de inatividade.
ru: Чтобы выполнить миграцию в целевую базу данных Azure SQL, выберите режим миграции в соответствии с требованиями к простою.
zh_hans: 要迁移到 Azure SQL 目标，请根据停机时间要求选择迁移模式。
zh_hant: 若要移轉到 Azure SQL 目標，請根據您的停機需求選擇移轉模式。

# sql.migration.select.azure.mi.db.count.under.threshold
source: To proceed, press Select button
de: Um fortzufahren, drücken Sie die Schaltfläche "Auswählen".
es: Para continuar, presione el botón Seleccionar
fr: Pour continuer, appuyez sur le bouton Sélectionner
ja: 続行するには、[選択] ボタンを押します
ko: 계속하려면 [선택] 단추를 누르세요.
pt_br: Para prosseguir, pressione o botão Selecionar
ru: Чтобы продолжить, нажмите кнопку "Выбрать"
zh_hans: 若要继续，请按“选择”按钮
zh_hant: 若要繼續，請按 [選取] 按鈕

# sql.migration.support.request.note
source: To receive assistance from Microsoft customer support, please submit a support request.
de: Um Unterstützung vom Microsoft-Support zu erhalten, senden Sie bitte eine Supportanfrage.
es: Para recibir asistencia del servicio de atención al cliente de Microsoft, envíe una solicitud de soporte técnico.
fr: Pour recevoir de l’aide du service clientèle Microsoft, envoyez une demande de support.
ja: Microsoft カスタマー サポートから支援を受けるには、サポート リクエストを送信してください。
ko: Microsoft 고객 지원의 지원을 받으려면 지원 요청을 제출하세요.
pt_br: Para receber assistência do suporte ao cliente da Microsoft, envie uma solicitação de suporte.
ru: Чтобы получить помощь в службе поддержки клиентов Майкрософт, отправьте запрос на поддержку.
zh_hans: 若要从 Microsoft 客户支持部门获得帮助，请提交支持请求。
zh_hant: 若要收到 Microsoft 客戶支援的協助，請提交支援要求。

# sql.migration.total.findings.label
source: Total findings: {0}
de: Ergebnisse gesamt: {0}
es: Total de hallazgos: {0}
fr: Résultats totaux : {0}
ja: 結果の合計: {0}
ko: 총 결과: {0}
pt_br: Resultados totais: {0}
ru: Всего результатов: {0}
zh_hans: 总结果: {0}
zh_hant: 結果總計: {0}

# sql.migration.total.issues.label
source: Total issues found: {0}
de: Gesamtanzahl gefundener Probleme: {0}
es: Número total de problemas encontrados: {0}
fr: Nombre total de problèmes trouvés : {0}
ja: 検出された問題の合計数: {0}
ko: 발견된 총 문제: {0}
pt_br: Total de problemas encontrados: {0}
ru: Всего найденных проблем: {0}
zh_hans: 发现的问题总数: {0}
zh_hant: 發現的問題總數: {0}

# sql.migration.details.serverobjects.all.tables.label
source: Total tables
de: Gesamtzahl von Tabellen
es: Número total de tablas
fr: Nombre total de tables
ja: テーブルの合計数
ko: 총 테이블
pt_br: Total de tabelas
ru: Всего таблиц
zh_hans: 表数总计
zh_hant: 資料表總計
