Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.azurecore.*.xlf
Languages: de, ja, pt_br, ru, zh_hans, zh_hant

# azurecore.consentDialog.cancel
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# azure.microsoftAccountDisplayName
source: Microsoft Account
de: Microsoft-Konto
ja: Microsoft アカウント
pt_br: Conta Microsoft
ru: Учетная запись Майкрософт
zh_hans: Microsoft 帐户
zh_hant: Microsoft 帳戶

# azure.microsoftCorpAccount
source: Microsoft Corp
ru: Корпорация Майкрософт

# azurecore.consentDialog.open
source: Open
de: Öffnen
ja: 開く
pt_br: Abrir
ru: Открыть
zh_hans: 打开
zh_hant: 開啟

# noMicrosoftResource
source: Provider '{0}' does not have a Microsoft resource endpoint defined.
de: Für den Anbieter "{0}" ist kein Microsoft-Ressourcenendpunkt definiert.
ja: プロバイダー '{0}' には、Microsoft リソース エンドポイントが定義されていません。
pt_br: O provedor '{0}' não tem um ponto de extremidade de recurso da Microsoft definido.
ru: Для поставщика {0} не определена конечная точка ресурса Майкрософт.
zh_hans: 提供程序 "{0}" 未定义 Microsoft 资源终结点。
zh_hant: 提供者 '{0}' 未定義 Microsoft 資源端點。

# msal.accountNotFoundError
source: Unable to find account info when acquiring token, please remove account and add again.
de: Beim Abrufen von Token wurden keine Kontoinformationen gefunden. Entfernen Sie Ihr Konto, und fügen Sie es erneut hinzu.
ja: トークンの取得時にアカウント情報が見つかりません。アカウントを削除して、もう一度追加してください。
pt_br: Não é possível localizar as informações da conta ao adquirir o token. Remova a conta e adicione novamente.
ru: Не удалось найти сведения об учетной записи при получении токена. Удалите учетную запись и добавьте ее еще раз.
zh_hans: 获取令牌时找不到帐户信息，请删除帐户并重新添加。
zh_hant: 取得權杖時找不到帳戶資訊，請移除帳戶，然後再新增一次。

# msal.resourceNotFoundError
source: Unable to find configuration for Azure Resource {0}
de: Die Konfiguration für Azure-Resource {0} wurde nicht gefunden
ja: Azure Resource {0}の構成が見つかりません
pt_br: Não é possível encontrar a configuração para o Azure Resource {0}
ru: Не удалось найти конфигурацию для ресурса Azure {0}
zh_hans: 找不到 Azure 资源 {0} 的配置
zh_hant: 找不到 Azure 資源的設定 {0}

# azurecore.consentDialog.body
source: Your tenant {0} ({1}) requires you to re-authenticate again to access {2} resources. Press Open to start the authentication process.
de: Für Ihren Mandanten {0} ({1}) müssen Sie sich erneut authentifizieren, um auf {2}-Ressourcen zuzugreifen. Klicken Sie auf "Öffnen", um den Authentifizierungsvorgang zu starten.
ja: テナント {0} ({1}) では、 {2} リソースにアクセスするために再認証する必要があります。[開く] を押して認証プロセスを開始します。
pt_br: Seu locatário {0} ({1}) exige que você se autentique novamente para acessar os {2} recursos. Pressione Abrir para iniciar o processo de autenticação.
ru: Клиент {0} ({1}) требует повторной проверки подлинности для доступа к ресурсам {2}. Нажмите кнопку "Открыть", чтобы начать проверку подлинности.
zh_hans: 你的租户 {0} ({1}) 需要你重新进行身份验证才能访问 {2} 资源。请按“打开”启动身份验证过程。
zh_hant: 您的租用戶 {0} ({1}) 需要再次重新驗證，才能存取 {2} 資源。請按 [開啟] 啟動驗證程序。

# azureAuthCodeGrant.getAuthCodeUrlError
source: An error occurred in MSAL library when requesting auth code URL. For more detailed information on error, please check 'Azure Accounts' output pane.
de: Fehler in MSAL-Bibliothek beim Anfordern der Authentifizierungscode-URL. Ausführlichere Informationen zum Fehler finden Sie im Ausgabebereich 'Azure-Konten'.
ja: 認証コード URL の要求中に MSAL ライブラリでエラーが発生しました。エラーの詳細については、'Azure アカウント' 出力ウィンドウを確認してください。
pt_br: Ocorreu um erro na biblioteca MSAL ao solicitar a URL do código de autenticação. Para obter informações mais detalhadas sobre o erro, verifique o painel de saída 'Contas do Azure'.
ru: Произошла ошибка в библиотеке MSAL при запросе URL-адреса кода проверки подлинности. Для получения более подробной информации об ошибке см. панель вывода "Учетные записи Azure".
zh_hans: 请求身份验证代码 URL 时，MSAL 库中出错。有关错误的详细信息，请检查“Azure 帐户”输出窗格。
zh_hant: 要求驗證碼 URL 時，MSAL 程式庫發生錯誤。如需錯誤的詳細資訊，請檢查 [Azure 帳戶] 輸出窗格。

# azureAuth.nonceError
source: Authentication failed due to a nonce mismatch, please close Azure Data Studio and try again.
de: Fehler bei der Authentifizierung aufgrund eines Nonce-Konflikts. Schließen Sie Azure Data Studio, und versuchen Sie es noch mal.
ja: nonce の不一致のため、認証に失敗しました。 Azure Data Studio を閉じてから、もう一度お試しください。
pt_br: Falha na autenticação devido a uma incompatibilidade de nonce. Feche o Azure Data Studio e tente novamente.
ru: Не удалось выполнить проверку подлинности из-за несоответствия nonce, закройте Azure Data Studio и повторите попытку.
zh_hans: 由于 nonce 不匹配，身份验证失败，请关闭 Azure Data Studio，然后重试。
zh_hant: 因為 nonce 不相符，導致驗證失敗，請關閉 Azure Data Studio，然後再試一次。

# azureAuth.stateError
source: Authentication failed due to a state mismatch, please close ADS and try again.
de: Fehler bei der Authentifizierung aufgrund eines Statuskonflikts. Schließen Sie ADS, und versuchen Sie es noch mal.
ja: 状態の不一致のため、認証に失敗しました。 ADS を終了してから、もう一度お試しください。
pt_br: Falha na autenticação devido a uma incompatibilidade de estado. Feche o ADS e tente novamente.
ru: Не удалось выполнить проверку подлинности из-за несоответствия состояния, закройте ADS и повторите попытку.
zh_hans: 由于状态不匹配，身份验证失败，请关闭 ADS，然后重试。
zh_hant: 因為狀態不相符，導致驗證失敗，請關閉 ADS，然後再試一次。

# azure.azureAuthCodeGrantName
source: Azure Auth Code Grant
de: Azure-Authentifizierungscodezuweisung
pt_br: Concessão de Código de Autenticação do Azure
ru: Предоставление кода проверки подлинности Azure
zh_hans: Azure 身份验证代码授予
zh_hant: Azure 驗證碼授與

# azure.serverCouldNotStart
source: Server could not start. This could be a permissions error or an incompatibility on your system. You can try enabling device code authentication from settings.
de: Der Server konnte nicht gestartet werden. Möglicherweise handelt es sich um einen Berechtigungsfehler oder eine Inkompatibilität auf Ihrem System. Sie können versuchen, die Gerätecodeauthentifizierung über die Einstellungen zu aktivieren.
ja: サーバーを起動できませんでした。これは、システムのアクセス許可エラーまたは互換性がない可能性があります。設定からデバイス コード認証を有効にすることができます。
pt_br: Não foi possível iniciar o servidor. Isso pode ocorrer devido a um erro de permissões ou a uma incompatibilidade no seu sistema. Você pode tentar habilitar a autenticação de código do dispositivo nas configurações.
ru: Не удалось запустить сервер. Это может быть связано с ошибкой разрешений или несовместимостью вашей системы. Вы можете попробовать включить проверку подлинности кода устройства в разделе параметров.
zh_hans: 无法启动服务器。这可能是由于权限错误或系统不兼容。可以尝试从设置启用设备代码身份验证。
zh_hant: 無法啟動伺服器。這可能是系統的權限發生錯誤或系統不相容。可嘗試從設定啟用裝置代碼驗證。

# addAccount
source: Add {0} account
de: {0}-Konto hinzufügen
ja: {0} アカウントの追加
pt_br: Adicionar a conta {0}
ru: Добавить учетную запись {0}
zh_hans: 添加 {0} 帐户
zh_hant: 新增 {0} 帳戶

# azure.azureDeviceCodeAuth
source: Azure Device Code
de: Azure-Gerätecode
ja: Azure デバイス コード
pt_br: Código de Dispositivo do Azure
ru: Код устройства Azure
zh_hans: Azure 设备代码
zh_hant: Azure 裝置代碼

# azure.deprecatedGetSecurityToken
source: A call was made to azdata.accounts.getSecurityToken, this method is deprecated and will be removed in future releases. Please use getAccountSecurityToken instead.
de: "azdata.accounts.getSecurityToken" wurde aufgerufen. Diese Methode ist veraltet und wird in zukünftigen Releases entfernt. Verwenden Sie stattdessen "getAccountSecurityToken".
ja: azdata.accounts.getSecurityToken の呼び出しが行われました。このメソッドは非推奨であり、今後のリリースで削除されます。代わりに getAccountSecurityToken を使用してください。
pt_br: Uma chamada foi realizada para azdata.accounts.getSecurityToken. Esse método foi preterido e será removido em versões futuras. Em vez disso, use getAccountSecurityToken.
ru: Выполнен вызов метода azdata.accounts.getSecurityToken. Этот метод является устаревшим и будет удален в будущих выпусках. Используйте вместо него метод getAccountSecurityToken.
zh_hans: 对 azdata.accounts.getSecurityToken 进行了调用，此方法已弃用，并会在未来的版本中删除。请改用 getAccountSecurityToken。
zh_hant: 已對 azdata.accounts.getSecurityToken 發出呼叫，此方法已淘汰，並將於日後的版本中移除。請改用 getAccountSecurityToken。

# genericTokenError
source: Failed to get token
de: Fehler beim Abrufen des Tokens
ja: トークンを取得できませんでした
pt_br: Falha ao obter o token
ru: Не удалось получить маркер
zh_hans: 无法获取令牌
zh_hant: 無法取得權杖

# azure.NoAuthMethod.Available
source: No Azure auth method available. You must enable the auth methods in ADS configuration.
de: Es ist keine Azure-Authentifizierungsmethode verfügbar. Sie müssen die Authentifizierungsmethoden in der ADS-Konfiguration aktivieren.
ja: 使用可能な Azure 認証方法がありません。ADS 構成で認証方法を有効にする必要があります。
pt_br: Nenhum método de autenticação do Azure disponível. Você precisa habilitar os métodos de autenticação na configuração do ADS.
ru: Методы проверки подлинности Azure недоступны. Необходимо включить методы проверки подлинности в конфигурации ADS.
zh_hans: 无可用的 Azure 身份验证方法。必须在 ADS 配置中启用身份验证方法。
zh_hant: 沒有任何可用的 Azure 驗證方法。您必須在 ADS 組態中啟用驗證方法。

# azure.NoAuthMethod.Selected
source: No Azure auth method selected. You must select what method of authentication you want to use.
de: Es wurde keine Azure-Authentifizierungsmethode ausgewählt. Sie müssen die Art der Authentifizierung auswählen, die Sie verwenden möchten.
ja: Azure 認証方法が選択されていません。使用する認証方法を選択する必要があります。
pt_br: Nenhum método de autenticação do Azure selecionado. Você precisa selecionar o método de autenticação que deseja usar.
ru: Метод проверки подлинности Azure не выбран. Необходимо выбрать метод проверки подлинности, который будет использоваться.
zh_hans: 未选择任何 Azure 身份验证方法。必须选择你要使用的身份验证方法。
zh_hant: 未選取任何 Azure 驗證方法。您必須選取要使用的驗證方法。

# msalTokenError
source: {0} occurred when acquiring token. {1}
de: {0} beim Abrufen des Tokens. {1}
ja: トークンの取得中に {0} が発生しました。 {1}
pt_br: {0} ocorreu ao adquirir o token. {1}
ru: {0} произошло при приобретении маркера. {1}
zh_hans: 获取令牌时发生“{0}”。 {1}
zh_hant: 取得權杖時發生 {0}。 {1}

# clearTokenCacheFailure
source: Failed to clear token cache
de: Fehler beim Löschen des Tokencaches.
ja: トークン キャッシュをクリアできませんでした
pt_br: Falha ao limpar o cache do token
ru: Не удалось очистить кэш токена
zh_hans: 未能清除令牌缓存
zh_hant: 無法清除權杖快取

# chinaCloudDisplayName
source: Azure (China)
ru: Azure для Китая
zh_hans: Azure (中国)
zh_hant: Azure (中國)

# usGovCloudDisplayName
source: Azure (US Government)
de: Azure (US-Regierungsbehörden)
pt_br: Azure (Governo dos EUA)
ru: Azure для государственных организаций США
zh_hans: Azure (美国政府)
zh_hant: Azure (美國政府)

# azure.noTenants
source: A tenant is required for this feature. Your Azure subscription seems to have no tenants.
de: Für dieses Feature ist ein Mandant erforderlich. Ihr Azure-Abonnement weist offenbar keine Mandanten auf.
ja: この機能にはテナントが必要です。Azure サブスクリプションにテナントがないようです。
pt_br: Um locatário é necessário neste recurso. A sua assinatura do Azure parece não ter locatários.
ru: Для этой функции требуется клиент. Похоже, в вашей подписке Azure нет клиентов.
zh_hans: 此功能需要使用租户。你的 Azure 订阅似乎没有租户。
zh_hant: 需要有租用戶，才能使用此功能。您的 Azure 訂閱似乎沒有任何租用戶。

# azure.pickAnAzureAccount
source: Select an Azure account
de: Azure-Konto auswählen
ja: Azure アカウントを選択する
pt_br: Selecionar uma conta do Azure
ru: Выберите учетную запись Azure
zh_hans: 选择 Azure 帐户
zh_hant: 選取 Azure 帳戶

# azure.signIn
source: Sign in
de: Anmelden
ja: サインイン
pt_br: Entrar
ru: Войти
zh_hans: 登录
zh_hant: 登入

# azure.startingCloudShell
source: Starting cloud shell…
de: Cloud Shell wird gestartet…
ja: Cloud Shell を開始しています...
pt_br: Iniciando o cloud shell…
ru: Запуск Cloud Shell…
zh_hans: 正在启动 Cloud Shell…
zh_hant: 正在啟動 Cloud Shell…

# azure.noAccountError
source: You are not currently signed into any Azure accounts, Please sign in and then try again.
de: Sie sind zurzeit nicht bei Azure-Konten angemeldet. Melden Sie sich an, und versuchen Sie es dann noch mal.
ja: 現在、Azure アカウントにサインインしていません。サインインしてから、もう一度お試しください。
pt_br: No momento, você não está conectado a nenhuma conta do Azure. Conecte-se e tente novamente.
ru: Вы не вошли ни в одну учетную запись Azure. Выполните вход и повторите попытку.
zh_hans: 你当前未登录到任何 Azure 帐户，请登录，然后重试。
zh_hant: 您目前未登入任何 Azure 帳戶，請先登入，然後再試一次。

# azure.cloudTerminalPreview
source: You must enable preview features in order to use Azure Cloud Shell.
de: Sie müssen die Vorschaufeatures aktivieren, um Azure Cloud Shell zu verwenden.
ja: Azure Cloud Shell を使用するには、プレビュー機能を有効にする必要があります。
pt_br: Você precisa habilitar os recursos da versão prévia para usar o Azure Cloud Shell.
ru: Чтобы использовать Azure Cloud Shell, необходимо включить предварительные версии функций.
zh_hans: 必须启用预览功能才能使用 Azure Cloud Shell。
zh_hant: 您必須啟用預覽功能，才能使用 Azure Cloud Shell。

# azure.mustPickTenant
source: You must select a tenant for this feature to work.
de: Sie müssen einen Mandanten auswählen, damit dieses Feature funktioniert.
ja: この機能を動作させるには、テナントを選択する必要があります。
pt_br: Você precisa selecionar um locatário para que este recurso funcione.
ru: Для работы этой функции необходимо выбрать клиента.
zh_hans: 必须选择一个租户才能使用此功能。
zh_hant: 您必須選取租用戶，此功能才能運作。

# azure.accountNotSelectedError
source: You must select an Azure account for this feature to work.
de: Sie müssen ein Azure-Konto auswählen, damit dieses Feature funktioniert.
ja: この機能を動作させるには、Azure アカウントを選択する必要があります。
pt_br: Você precisa selecionar uma conta do Azure para que este recurso funcione.
ru: Для работы этой функции необходимо выбрать учетную запись Azure.
zh_hans: 必须选择一个 Azure 帐户才能使用此功能。
zh_hant: 您必須選取 Azure 帳戶，此功能才能運作。

# azure.subscriptionError
source: Failed to get subscriptions for account {0}. Please refresh the account.
de: Fehler beim Abrufen von Abonnements für das Konto {0}. Aktualisieren Sie das Konto.
ja: アカウント {0} のサブスクリプションを取得できませんでした。アカウントを更新してください。
pt_br: Falha ao obter assinaturas da conta {0}. Atualize a conta.
ru: Не удалось получить подписки для учетной записи {0}. Обновите ее.
zh_hans: 无法获取帐户 {0} 的订阅。请刷新帐户。
zh_hant: 無法取得帳戶 {0} 的訂用帳戶。請重新整理該帳戶。

# azure.resource.providers.AzureMonitorContainerLabel
source: Log Analytics workspaces
de: Log Analytics-Arbeitsbereiche
ja: Log Analytics ワークスペース
pt_br: Workspaces do Log Analytics
ru: Рабочие области Log Analytics
zh_hans: Log Analytics 工作区
zh_hant: Log Analytics 工作區

source: Azure CosmosDB for MongoDB
pt_br: Azure CosmosDB para MongoDB
ru: Azure CosmosDB для MongoDB
zh_hant: 適用於 MongoDB 的 Azure CosmosDB

source: Azure CosmosDB for NoSQL
ja: NoSQL 版 Azure CosmosDB
pt_br: Azure CosmosDB para NoSQL
ru: Azure CosmosDB для NoSQL
zh_hant: 適用於 NoSQL 的 Azure CosmosDB

source: Azure CosmosDB for PostgreSQL Cluster
ja: Azure cosmosDB for PostgreSQL クラスター
pt_br: Cluster do Azure CosmosDB for PostgreSQL
ru: Кластер Azure CosmosDB для PostgreSQL
zh_hant: 適用於 PostgreSQL 叢集的 Azure CosmosDB

# azure.resource.providers.database.treeDataProvider.databaseContainerLabel
source: SQL databases
de: SQL-Datenbanken
ja: SQL データベース
pt_br: Bancos de dados SQL
ru: Базы данных SQL
zh_hans: SQL 数据库
zh_hant: SQL 資料庫

source: SQL servers
de: SQL Server-Instanzen
ja: SQL Server
ru: Серверы SQL
zh_hans: SQL 服务器
zh_hant: SQL 伺服器

# azure.resource.providers.KustoContainerLabel
source: Azure Data Explorer Clusters
de: Azure Data Explorer-Cluster
ja: Azure Data Explorer クラスター
pt_br: Clusters do Azure Data Explorer
ru: Кластеры Azure Data Explorer
zh_hans: Azure 数据资源管理器群集
zh_hant: Azure 資料總管叢集

source: Azure Database for MySQL flexible servers
de: Flexible Server für Azure Database for MySQL
ja: Azure Database for MySQL フレキシブル サーバー
pt_br: Servidores flexíveis do Banco de Dados do Azure para MySQL
ru: Гибкие серверы базы данных Azure для MySQL
zh_hans: Azure Database for MySQL 灵活服务器
zh_hant: 適用於 MySQL 彈性伺服器的 Azure 資料庫

source: PostgreSQL servers – Azure Arc
de: PostgreSQL-Server – Azure Arc
ja: PostgreSQL サーバー - Azure Arc
pt_br: Servidores PostgreSQL – Azure Arc
ru: Серверы PostgreSQL — Azure Arc
zh_hans: PostgreSQL 服务器 –Azure Arc
zh_hant: PostgreSQL 伺服器 –Azure Arc

source: Azure Database for PostgreSQL flexible servers
de: Flexible Server für Azure Database for PostgreSQL
ja: Azure Database for PostgreSQL のフレキシブル サーバー
pt_br: Servidores flexíveis do Banco de Dados do Azure para PostgreSQL
ru: Гибкие серверы Базы данных Azure для PostgreSQL
zh_hans: Azure Database for PostgreSQL 灵活服务器
zh_hant: 適用於 PostgreSQL 的 Azure 資料庫彈性伺服器

source: Azure Database for PostgreSQL Servers
de: Azure Database for PostgreSQL-Server
ja: Azure Database for PostgreSQL サーバー
pt_br: Servidores do Banco de Dados do Azure para PostgreSQL
ru: База данных Azure для серверов PostgreSQL
zh_hans: Azure Database for PostgreSQL 服务器
zh_hant: 適用於 PostgreSQL 的 Azure 資料庫伺服器

# azure.resource.providers.sqlInstanceContainerLabel
source: SQL managed instances
de: Verwaltete SQL-Instanzen
ja: SQL マネージド インスタンス
pt_br: Instâncias gerenciadas SQL
ru: Управляемые экземпляры SQL
zh_hans: SQL 托管实例
zh_hant: SQL 受控執行個體

# azure.resource.providers.sqlInstanceArcContainerLabel
source: SQL managed instances - Azure Arc
de: Verwaltete SQL-Instanzen – Azure Arc
ja: SQL マネージド インスタンス - Azure Arc
pt_br: Instâncias gerenciadas do SQL – Azure Arc
ru: Управляемые экземпляры SQL — Azure Arc
zh_hans: SQL 托管实例 - Azure Arc
zh_hant: SQL 受控執行個體 - Azure Arc

source: Dedicated SQL Pools
de: Dedizierte SQL-Pools
ja: 専用 SQL プール
pt_br: Pool de SQL Dedicados
ru: Выделенные пулы SQL
zh_hans: 专用 SQL 池
zh_hant: 專用 SQL 集區

# azurecore.unregisteredProviderType
source: Unrecognized Provider resource type: {0}
de: Unbekannter Anbieterressourcentyp: {0}
ja: プロバイダー リソースの種類を認識できません: {0}
pt_br: Tipo de recurso de Provedor não reconhecido: {0}
ru: Нераспознанный тип ресурса поставщика: {0}
zh_hans: 无法识别的提供程序资源类型:{0}
zh_hant: 無法辨識的提供者資源類型: {0}

# azurecore.unregisteredProvider
source: Unrecognized Provider resource: {0}
de: Unbekannte Anbieterressource: {0}
ja: プロバイダー リソースを認識できません: {0}
pt_br: Recurso de Provedor não reconhecido: {0}
ru: Нераспознанный ресурс поставщика: {0}
zh_hans: 无法识别的提供程序资源:{0}
zh_hant: 無法辨識的提供者資源: {0}

# azure.resource.resourceTreeNode.noResourcesLabel
source: No Resources found
de: Keine Ressourcen gefunden.
ja: リソースは見つかりませんでした
pt_br: Nenhum recurso encontrado
ru: Ресурсы не найдены
zh_hans: 未找到资源
zh_hant: 找不到任何資源

# azure.resource.tenantTokenError
source: Failed to acquire Access Token for account '{0}' (tenant '{1}').
de: Fehler beim Abrufen des Zugriffstokens für Konto "{0}" (Mandant "{1}").
ja: アカウント '{0}' (テナント '{1}') のアクセス トークンの取得に失敗しました。
pt_br: Falha ao adquirir o token de acesso para a conta '{0}' (locatário '{1}').
ru: Не удалось получить маркер доступа для учетной записи "{0}" (клиент "{1}").
zh_hans: 无法为账户 "{0}" (租户 "{1}") 获取访问令牌。
zh_hant: 無法取得租用戶 '{0}' 的存取權杖 (租用戶 '{1}')。

# azure.resource.tenantSubscriptionsError
source: Failed to get subscriptions for account {0} (tenant '{1}'). {2}
de: Fehler beim Abrufen von Abonnements für das Konto {0} (Mandant "{1}"). {2}
ja: アカウント {0} (テナント '{1}') のサブスクリプションを取得できませんでした。{2}
pt_br: Falha ao obter assinaturas da conta {0} (locatário '{1}'). {2}
ru: Не удалось получить подписки для учетной записи {0} (клиент "{1}"). {2}
zh_hans: 无法获取帐户{0} (租户 "{1}")的订阅。{2}
zh_hant: 無法取得帳戶 {0} (租用戶 '{1}') 的訂用帳戶。{2}

# azure.cloudShell
source: Azure Cloud Shell (Preview) {0} ({1})
de: Azure Cloud Shell (Vorschau) {0} ({1})
ja: Azure Cloud Shell (プレビュー) {0} ({1})
pt_br: Azure Cloud Shell (Versão Prévia) {0} ({1})
ru: Azure Cloud Shell (предварительная версия) {0} ({1})
zh_hans: Azure Cloud Shell (预览) {0} ({1})
zh_hant: Azure Cloud Shell (預覽) {0} ({1})

# azure.coudTerminal.neverUsed
source: If you have not launched Azure Cloud Shell from this account before, please visit https://shell.azure.com/ to get started. Once you are set up, you can use AzureCloud Shell directly in Azure Data Studio.
de: Wenn Sie Azure Cloud Shell noch nicht von diesem Konto aus gestartet haben, besuchen Sie zum Einstieg https://shell.azure.com/. Nach der Einrichtung können Sie Azure Cloud Shell direkt in Azure Data Studio verwenden.
ja: このアカウントから以前に Azure Cloud Shell を起動したことがない場合は、https://shell.azure.com/ にアクセスして、作業を開始してください。セットアップすると、Azure Data Studio で AzureCloud Shell を直接使用できます。
pt_br: Se você ainda não iniciou o Azure Cloud Shell nesta conta, visite https://shell.azure.com/ para começar. Quando estiver configurado, você poderá usar o AzureCloud Shell diretamente no Azure Data Studio.
ru: Если ранее вы не запускали Azure Cloud Shell из этой учетной записи, перейдите на страницу https://shell.azure.com/, чтобы начать работу. Выполнив настройку, вы сможете использовать Azure Cloud Shell непосредственно в Azure Data Studio.
zh_hans: 如果你以前未从此帐户启动过 Azure Cloud Shell，请访问 https://shell.azure.com/ 以开始使用。设置后，可以直接在 Azure Data Studio 中使用 AzureCloud Shell。
zh_hant: 若您以前未從此帳戶啟動 Azure Cloud Shell，請前往 https://shell.azure.com/ 以開始使用。設定之後，即可在 Azure Data Studio 中直接使用 AzureCloud Shell。

# azure.cloudTerminal.ok
source: OK
ru: ОК
zh_hans: 确定
zh_hant: 確定

# azure.cloudTerminal.openAzureShell
source: Open Azure Shell
de: Azure-Shell öffnen
ja: Azure Shell を開く
pt_br: Abrir Shell do Azure
ru: Открыть Azure Shell
zh_hans: 打开 Azure Shell
zh_hant: 開啟 Azure Shell

# azure.selectShellType
source: Select Bash or PowerShell for Azure Cloud Shell
de: Bash oder PowerShell für Azure Cloud Shell auswählen
ja: Azure Cloud Shell に Bash または PowerShell を選択する
pt_br: Selecionar o Bash ou o PowerShell para o Azure Cloud Shell
ru: Выберите Bash или PowerShell для Azure Cloud Shell
zh_hans: 为 Azure Cloud Shell 选择 Bash 或 PowerShell
zh_hant: 選取適用於 Azure Cloud Shell 的 Bash 或 PowerShell

# azure.shellClosed
source: Shell closed.
de: Shell geschlossen.
ja: シェルが終了しました。
pt_br: Shell fechado.
ru: Оболочка закрыта.
zh_hans: Shell 已关闭。
zh_hant: Shell 已關閉。

# azure.shellTypeRequired
source: You must pick a shell type
de: Sie müssen einen Shelltyp auswählen.
ja: シェルの種類を選択する必要があります
pt_br: Você precisa escolher um tipo de shell
ru: Необходимо выбрать тип оболочки
zh_hans: 必须选取一个 shell 类型
zh_hant: 您必須挑選殼層類型

# azure.resource.tree.accountNotSignedInTreeNode.signInLabel
source: Sign in to Azure...
de: Bei Azure anmelden...
ja: Azure にサインイン...
pt_br: Entrar no Azure...
ru: Вход в Azure…
zh_hans: 登录到 Azure…
zh_hant: 登入 Azure…

# azure.resource.tree.accountTreeNode.noTenantsLabel
source: No Tenants found.
de: Keine Mandanten gefunden.
ja: テナントが見つかりません。
pt_br: Nenhum Locatário encontrado.
ru: Клиенты не найдены.
zh_hans: 找不到租户。
zh_hant: 找不到任何租用戶。

# azure.resource.tree.treeProvider.accountLoadError
source: Failed to load some Azure accounts. {0}
de: Fehler beim Laden einiger Azure-Konten. {0}
ja: Azure アカウントを読み込めませんでした。{0}
pt_br: Falha ao carregar algumas contas do Azure. {0}
ru: Не удалось загрузить некоторые учетные записи хранения Azure. {0}
zh_hans: 未能加载部分 Azure 存储帐户。{0}
zh_hant: 無法載入某些 Azure 帳戶。{0}

# azure.resource.tree.treeProvider.loadingLabel
source: Loading ...
de: Wird geladen...
ja: 読み込み中...
pt_br: Carregando...
ru: Идет загрузка…
zh_hans: 正在加载…
zh_hant: 正在載入...

# azure.resource.tree.treeProvider.openAccountsDialog
source: Show Azure accounts
de: Azure-Konten anzeigen
ja: Azure アカウントの表示
pt_br: Mostrar contas do Azure
ru: Показать учетные записи Azure
zh_hans: 显示 Azure 帐户
zh_hant: 顯示 Azure 帳戶

# azure.resource.tree.accountTreeNode.noSubscriptionsLabel
source: No Subscriptions found.
de: Keine Abonnements gefunden.
ja: サブスクリプションが見つかりません。
pt_br: Nenhuma Assinatura encontrada.
ru: Подписки не найдены.
zh_hans: 未找到订阅。
zh_hant: 找不到任何訂用帳戶。

# azure.resource.tree.subscriptionTreeNode.noResourcesLabel
source: No Resources found.
de: Keine Ressourcen gefunden.
ja: リソースは見つかりませんでした。
pt_br: Nenhum recurso encontrado.
ru: Ресурсы не найдены.
zh_hans: 未找到资源。
zh_hant: 找不到資源。

# azure.accounts.getLocations.queryError
source: Error fetching locations for account {0} ({1}) subscription {2} ({3}) tenant {4} : {5}
de: Fehler beim Abrufen von Standorten für das Konto "{0}" ({1}), Abonnement "{2}" ({3}), Mandant "{4}": {5}
ja: アカウント {0} ({1}) サブスクリプション {2} ({3}) テナント {4} の場所の取り込みでエラーが発生しました: {5}
pt_br: Erro ao buscar locais para a conta {0} ({1}) assinatura {2} ({3}) locatário {4} : {5}
ru: Ошибка при получении местоположений для учетной записи {0} ({1}) в подписке {2} ({3}) и клиенте {4}: {5}
zh_hans: 提取帐户 {0} ({1})订阅 {2} ({3})租户 {4} 的位置时出错: {5}
zh_hant: 擷取帳戶 {0} ({1}) 訂閱 {2} ({3}) 租用戶 {4} 的位置時發生錯誤: {5}
