Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.login.migration.wizard.target.data.migration.warning
source: We recommend migrating your databases(s) to the Azure SQL target before starting the login migration to avoid failures in the process. Nevertheless, you can run this migration process whenever want you want if your goal is to update the user mapping for recently migrated databases. If the source and database names are not the same, then it is possible that some permissions may not be applied properly.
de: Wir empfehlen, Ihre Datenbanken vor Beginn der Benutzernamenmigration zum Azure SQL-Ziel zu migrieren, um Fehler während des Prozesses zu vermeiden. Unabhängig davon können Sie diesen Migrationsprozess jederzeit durchführen, wenn Sie die Benutzerzuordnung für kürzlich migrierte Datenbanken aktualisieren möchten. Wenn die Namen von Quelle und Datenbank nicht übereinstimmen, werden einige Berechtigungen möglicherweise nicht richtig angewendet.
es: Se recomienda migrar las bases de datos al destino Azure SQL antes de iniciar la migración de inicio de sesión para evitar errores en el proceso. No obstante, puede ejecutar este proceso de migración siempre que quiera si su objetivo es actualizar la asignación de usuarios para las bases de datos migradas recientemente. Si los nombres de origen y de base de datos no son iguales, es posible que algunos permisos no se apliquen correctamente.
fr: Nous vous recommandons de migrer vos bases de données vers la cible Azure SQL avant de commencer la migration de connexion pour éviter les échecs du processus. Vous pouvez exécuter ce processus de migration quand vous le souhaitez si votre objectif est de mettre à jour le mappage utilisateur pour les bases de données récemment migrées. Si les noms de la source et de la base de données ne sont pas identiques, il est possible que certaines autorisations ne soient pas appliquées correctement.
ja: ログイン移行を開始する前に、データベースを Azure SQL ターゲットに移行して、プロセスでエラーが発生しないようにすることをお勧めします。最近移行したデータベースのユーザー マッピングを更新することが目標である場合は、いつでもこの移行プロセスを実行できます。 ソース名とデータベース名が同じでない場合は、一部のアクセス許可が正しく適用されない可能性があります。
ko: 프로세스의 오류를 방지하기 위해서 로그인 마이그레이션을 시작하기 전에 데이터베이스를 Azure SQL 대상으로 마이그레이션하는 것이 좋습니다. 최근에 마이그레이션된 데이터베이스에 대한 사용자 매핑을 업데이트하는 것이 목표라면 원할 때마다 이 마이그레이션 프로세스를 실행할 수 있습니다. 원본 이름과 데이터베이스 이름이 같으면 일부 사용 권한이 제대로 적용되지 않을 수 있습니다.
pt_br: Recomendamos migrar seus bancos de dados para o destino do SQL do Azure antes de iniciar a migração de login para evitar falhas no processo. No entanto, você pode executar esse processo de migração sempre que quiser se o seu objetivo for atualizar o mapeamento de usuário para bancos de dados migrados recentemente. Se os nomes de origem e banco de dados não forem os mesmos, é possível que algumas permissões não sejam aplicadas adequadamente.
ru: Рекомендуется перенести базы данных в целевой объект Azure SQL перед началом миграции имен для входа, чтобы избежать сбоев. Однако этот процесс миграции можно запускать в любое время, если цель — обновить сопоставление пользователей для недавно перенесенных баз данных. Если имена источника и базы данных не совпадают, некоторые разрешения могут быть применены неправильно.
zh_hans: 建议在开始登录迁移之前，先将数据库迁移到 Azure SQL 目标，以避免过程中出现故障。但是，如果目标是更新最近迁移的数据库的用户映射，你可以根据需要随时运行此迁移过程。 如果源名称和数据库名称不同，则某些权限可能无法正确应用。
zh_hant: 建議您先將資料庫移轉到 Azure SQL 目標，再開始登入移轉，以避免流程中發生失敗。不過，如果您的目標是更新最近移轉資料庫的使用者對應，您可以隨時執行此移轉流程。 如果來源與資料庫名稱不同，則可能無法正確套用某些權限。

# sql.migration.blob.storage.folder.info
source: When uploading database backups to your blob container, ensure that backup files from different databases are stored in separate folders. Only the root of the container and folders at most one level deep are supported.
de: Stellen Sie beim Hochladen von Datenbanksicherungen in Ihren Blobcontainer sicher, dass Sicherungsdateien aus verschiedenen Datenbanken in separaten Ordnern gespeichert werden. Nur der Stamm des Containers und die Ordner auf höchstens einer Ebene werden unterstützt.
es: Al cargar copias de seguridad de bases de datos en el contenedor de blobs, asegúrese de que los archivos de copia de seguridad de diferentes bases de datos se almacenan en carpetas independientes. Solo se admite la raíz del contenedor y las carpetas con un nivel máximo de profundidad.
fr: Lorsque vous chargez des sauvegardes de base de données dans votre conteneur d'objets blob, assurez-vous que les fichiers de sauvegarde de différentes bases de données sont stockés dans des dossiers distincts. Seule la racine du conteneur et les dossiers d'au plus un niveau de profondeur sont pris en charge.
ja: データベースのバックアップを BLOB コンテナーにアップロードする際、異なるデータベースのバックアップ ファイルは必ず異なるフォルダーに保存してください。コンテナーのルートと深さ 1 レベルまでのフォルダーのみがサポートされています。
ko: 데이터베이스 백업을 Blob 컨테이너에 업로드할 때 서로 다른 데이터베이스의 백업 파일이 별도의 폴더에 저장되어 있는지 확인하세요. 최대 한 수준 깊이의 컨테이너와 폴더 루트만 지원됩니다.
pt_br: Ao carregar backups de banco de dados no contêiner de blobs, verifique se os arquivos de backup de bancos de dados diferentes estão armazenados em pastas separadas. Há suporte apenas para a raiz do contêiner e das pastas no máximo um nível de profundidade.
ru: При отправке резервных копий баз данных в контейнер BLOB-объектов убедитесь, что файлы резервных копий из разных баз данных хранятся в отдельных папках. Поддерживается только корень контейнера и папок глубиной не более одного уровня.
zh_hans: 将数据库备份上传到 blob 容器时，请确保不同数据库中的备份文件存储在单独的文件夹中。仅支持容器的根目录和最高级别的深层文件夹。
zh_hant: 將資料庫備份上傳到 Blob 容器時，請確定來自不同資料庫的備份檔案儲存在不同的資料夾中。只支援容器與資料夾最多一層深的根目錄。

# sql.ir.local.ir.setup.note
source: When you click 'execute script', the PowerShell script below will automatically download self-hosted integration runtime software, install, and register it with your Azure Database Migration Service. To check the connection status of the IR, go back to the previous screen and refresh.
zh_hans: 单击“执行脚本”后，下面的 PowerShell 脚本将自动下载自承载集成运行时软件、安装并将其注册到 Azure 数据库迁移服务。若要检查 IR 的连接状态，请返回到上一个屏幕并刷新。

# sql.migration.sku.azureRecommendation.data.collection.popup.message.label
source: Where do you want to save collected data?
de: Wo möchten Sie gesammelte Daten speichern?
es: ¿Dónde desea guardar los datos recopilados?
fr: Où souhaitez-vous sauvegarder les données collectées ?
ja: 収集したデータをどこに保存しますか?
ko: 수집된 데이터는 어디에 저장하시겠습니까?
pt_br: Onde você deseja salvar os dados coletados?
ru: Где вы хотите сохранить собранные данные?
zh_hans: 要将收集的数据保存到何处?
zh_hant: 您要將收集的資料儲存在哪裡?

# sql.migration.network.share.windows.user.label
source: Windows user account with read access to the network share location
de: Windows-Benutzerkonto mit Lesezugriff auf den Speicherort der Netzwerkfreigabe
es: Cuenta de usuario de Windows con acceso de lectura a la ubicación del recurso compartido de red
fr: Compte d’utilisateur Windows avec accès en lecture à l’emplacement du partage réseau
ja: ネットワーク共有の場所への読み取り権限のある Windows ユーザー アカウント
ko: 네트워크 공유 위치에 대한 읽기 권한이 있는 Windows 사용자 계정
pt_br: Conta de usuário do Windows com acesso de leitura ao local de compartilhamento de rede.
ru: Учетная запись пользователя Windows с доступом на чтение сетевой папки
zh_hans: 具有对网络共享位置读取权限的 Windows 用户账户。
zh_hant: 具有網路共用位置讀取存取權的 Windows 使用者帳戶。

# sql.migration.network.share.windows.user.info
source: Windows user account with read access to the network share location.
de: Windows-Benutzerkonto mit Lesezugriff auf den Speicherort der Netzwerkfreigabe.
es: Cuenta de usuario de Windows con acceso de lectura a la ubicación del recurso compartido de red.
fr: Compte d’utilisateur Windows avec accès en lecture à l’emplacement du partage réseau.
ja: ネットワーク共有の場所への読み取り権限のある Windows ユーザー アカウント。
ko: 네트워크 공유 위치에 대한 읽기 권한이 있는 Windows 사용자 계정입니다.
pt_br: Conta de usuário do Windows com acesso de leitura ao local de compartilhamento de rede.
ru: Учетная запись пользователя Windows с доступом на чтение сетевой папки.
zh_hans: 具有对网络共享位置读取权限的 Windows 用户账户。
zh_hant: 具有網路共用位置讀取存取權的 Windows 使用者帳戶。

# sql.migration.yes
source: Yes
de: Ja
es: Sí
fr: Oui
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# sql.migration.sku.azureRecommendation.description2
source: You can also choose to select this data from an existing folder, if you have already collected it previously.
de: Sie können diese Daten auch aus einem vorhandenen Ordner auswählen, wenn Sie sie bereits zuvor gesammelt haben.
es: También puede seleccionar estos datos a partir de una carpeta existente si ya los ha recopilado anteriormente.
fr: Vous pouvez également choisir de sélectionner ces données dans un dossier existant, si vous les avez déjà collectées précédemment.
ja: 以前に収集したことがある場合は、既存のフォルダーからこのデータを選択することもできます。
ko: 이미 데이터를 수집했다면 기존 폴더에서 이 데이터를 선택하도록 선택할 수도 있습니다.
pt_br: Você também pode optar por selecionar esses dados a partir de uma pasta existente, caso já os tenha coletado anteriormente.
ru: Вы также можете выбрать эти данные в существующей папке, если они уже собраны ранее.
zh_hans: 如果之前已收集此数据，则还可以选择从现有文件夹中选择此数据。
zh_hant: 如果您先前已收集過此資料，也可以選擇從現有資料夾選取此資料。

# sql.migration.community.support.note
source: You can post your question with the Microsoft community support through the Q&A channel.
de: Sie können Ihre Frage über den F&A-Kanal beim Microsoft-Communitysupport posten.
es: Puede publicar su pregunta con el soporte técnico de la comunidad de Microsoft a través del canal de preguntas y respuestas.
fr: Vous pouvez publier votre question auprès du support de la communauté Microsoft via le canal Q&A.
ja: Q&A チャネルを使用して、Microsoft コミュニティ サポートに質問を投稿できます。
ko: 질문 및 답변 채널을 통해 Microsoft 커뮤니티 지원에 질문을 게시할 수 있습니다.
pt_br: Você pode postar sua pergunta com o suporte da comunidade Microsoft por meio do canal de perguntas e respostas.
ru: Вы можете опубликовать свой вопрос для получения поддержки от сообщества Майкрософт на канале вопросов и ответов.
zh_hans: 可以通过问答频道向 Microsoft 社区支持人员发布问题。
zh_hant: 您可以透過問與答頻道，向 Microsoft 社群支援張貼您的問題。

# sql.migration.tde.msg.tde
source: You have given Azure Data Studio access to migrate the encryption certificates and database.
de: Sie haben den Zugriff auf Azure Data Studio gewährt, um die Verschlüsselungszertifikate und die Datenbank zu migrieren.
es: Ha concedido Azure Data Studio acceso para migrar los certificados de cifrado y la base de datos.
fr: Vous avez donné Azure Data Studio accès pour migrer les certificats de chiffrement et la base de données.
ja: 暗号化証明書とデータベースを移行するために、Azure Data Studio へのアクセス権を付与しました。
ko: 암호화 인증서 및 데이터베이스를 마이그레이션하기 위한 Azure Data Studio 액세스 권한을 부여받았습니다.
pt_br: Você concedeu acesso ao Azure Data Studio para migrar os certificados de criptografia e o banco de dados.
ru: Вы предоставили Azure Data Studio доступ для миграции сертификатов шифрования и базы данных.
zh_hans: 你已授予 Azure Data Studio 迁移加密证书和数据库的访问权限。
zh_hant: 您已取得用於移轉加密憑證和資料庫的 Azure Data Studio 存取權。

# sql.migration.tde.msg.manual
source: You have not given Azure Data Studio access to migrate the encryption certificates.
de: Sie haben keinen Zugriff auf Azure Data Studio, um die Verschlüsselungszertifikate zu migrieren.
es: No ha concedido acceso Azure Data Studio para migrar los certificados de cifrado.
fr: Vous n’avez pas donné accès à Azure Data Studio pour migrer les certificats de chiffrement.
ja: 暗号化証明書を移行するための Azure Data Studio へのアクセス権を付与していません。
ko: 암호화 인증서 및 데이터베이스를 마이그레이션하기 위한 Azure Data Studio 액세스 권한을 부여받지 않았습니다.
pt_br: Você não concedeu acesso ao Azure Data Studio para migrar os certificados de criptografia.
ru: Вы не предоставили Azure Data Studio доступ для миграции сертификатов шифрования.
zh_hans: 你尚未授予 Azure Data Studio 迁移加密证书和数据库的访问权限。
zh_hant: 您未取得用於移轉加密憑證和資料庫的 Azure Data Studio 存取權。

# sql.migration.tde.cert.migration.info
source: You must click the '{0}' button before proceeding to the next page of the wizard.
de: Sie müssen auf die Schaltfläche "{0}" klicken, bevor Sie mit der nächsten Seite des Assistenten fortfahren.
es: Debe hacer clic en el botón "{0}" antes de continuar con la página siguiente del asistente.
fr: Vous devez cliquer sur le bouton '{0}' avant de passer à la page suivante de l’Assistant.
ja: ウィザードの次のページに進む前に、['{0}'] ボタンをクリックする必要があります。
ko: 마법사의 다음 페이지로 넘어가기 전에 '{0}' 단추를 클릭해야 합니다.
pt_br: Você deve clicar no botão ''{0}'' antes de prosseguir para a próxima página do assistente.
ru: Необходимо нажать кнопку "{0}" перед переходом к следующей странице мастера.
zh_hans: 必须点击“{0}”按钮，然后才能继续转到向导的下一页。
zh_hant: 您必須按一下 '{0}' 按鈕，才能繼續前往精靈的下一頁。

# sql.migration.dms.resource
source: Your Azure Database Migration Service resource name
de: Ihr Azure Database Migration Service-Ressourcenname
es: Nombre del recurso de Azure Database Migration Service
fr: Nom de votre ressource Azure Database Migration Service
ja: Azure Database Migration Service のリソース名。
ko: Azure Database Migration Service 리소스 이름
pt_br: Seu nome de recurso do Serviço de Migração de Banco de Dados do Azure
ru: Имя ресурса Azure Database Migration Service
zh_hans: Azure 数据库迁移服务资源名称
zh_hant: 您的 Azure 資料庫移轉服務資源名稱。

# sql.migration.sku.resource
source: Your Azure SQL target resource name
de: Name der Azure SQL-Zielressource
es: Nombre del recurso de destino de Azure SQL
fr: Nom de votre ressource cible Azure SQL
ja: Azure SQL ターゲット リソース名
ko: Azure SQL 대상 리소스 이름
pt_br: Seu nome de recurso do SQL do Azure de destino
ru: Имя целевого ресурса Azure SQL
zh_hans: Azure SQL 目标资源名称
zh_hant: 您的 Azure SQL 目標資源名稱

# sql.migration.sku.resource.port
source: Your Azure SQL target resource port number : 0 - 65535
de: Ihre Azure SQL-Portnummer der Zielressource: 0 – 65535
es: Nombre del puerto del recurso de destino de Azure SQL: 0 - 65535
fr: Votre Azure SQL numéro de port de ressource cible : 0 - 65535
ja: Azure SQL ターゲット リソースのポート番号: 0 - 65535
ko: Azure SQL 대상 리소스 포트 번호: 0 - 65535
pt_br: Seu número de porta de recurso de destino do SQL do Azure : 0 - 65535
ru: Номер вашего целевого ресурса порта Azure SQL: 0–65535
zh_hans: 你的 Azure SQL 目标资源端口号: 0 - 65535
zh_hant: 您的 Azure SQL 目標資源連接埠號碼: 0 - 65535

# sql.migration.storage.account.blob.container
source: Your Blob Container name
zh_hans: Blob 容器名称

# sql.migration.storage.account
source: Your Storage Account name
zh_hans: 存储帐户名称

# sql.migration.pre.req.4
source: Your database backup location details, either a network file share or an Azure Blob Storage container (not required for Azure SQL Database targets).
de: Details zum Speicherort Ihrer Datenbanksicherung, entweder eine Netzwerkdateifreigabe oder ein Azure Blob Storage- Container (für Azure SQL-Datenbankziele nicht erforderlich).
es: Los detalles de la ubicación de la copia de seguridad de la base de datos, ya sea un recurso compartido de archivos de red o un contenedor de Azure Blob Storage (no es necesario para los destinos de Azure SQL Database).
fr: Les détails de l’emplacement de sauvegarde de votre base de données, un partage de fichiers réseau ou un conteneur Stockage Blob Azure (non requis pour Azure SQL Database cibles).
ja: データベースバックアップの場所の詳細、ネットワーク ファイル共有またはAzure Blob Storageコンテナー (Azure SQL データベース ターゲットには必要ありません)。
ko: 네트워크 파일 공유 또는 Azure Blob Storage 컨테이너(Azure SQL Database 대상에는 필요하지 않음)인 데이터베이스 백업 위치 세부 정보.
pt_br: Os detalhes do local de backup do seu banco de dados, seja um compartilhamento de arquivos de rede ou um contêiner de Armazenamento de Blobs do Azure (não necessário para destinos de Banco de Dados SQL do Azure).
ru: Сведения о расположении резервной копии базы данных: сетевой общей папке или контейнере Хранилища BLOB-объектов Azure (не требуется для целевых Баз данных SQL Azure).
zh_hans: 你的数据库备份位置详细信息，可以是网络文件共享或 Azure Blob 存储容器(非 Azure SQL 数据库目标所需)。
zh_hant: 您的資料庫備份位置詳細資料，網路檔案共用或 Azure Blob 儲存體容器 (Azure SQL Database 目標不需要)。

# sql.migration.wizard.sku.assessment.error.detail
source: [There are no assessment results to validate readiness of your database migration. By checking this box, you acknowledge you want to proceed migrating your database to the desired Azure SQL target.]
de: [Es sind keine Bewertungsergebnisse vorhanden, um die Bereitschaft Ihrer Datenbankmigration zu überprüfen. Durch Aktivieren dieses Kontrollkästchens bestätigen Sie, dass Sie mit der Migration Ihrer Datenbank zum gewünschten Azure SQL-Ziel fortfahren möchten.]
es: [No hay resultados de evaluación para validar la preparación de la migración de la base de datos. Al activar esta casilla, confirma que quiere continuar migrando la base de datos al destino de Azure SQL deseado.]
fr: [Il n’existe aucun résultat d’évaluation pour valider la préparation de la migration de votre base de données. En cochant cette case, vous reconnaissez vouloir poursuivre la migration de votre base de données vers la cible Azure SQL souhaitée.]
ja: [データベース移行の準備状況を確認するための評価結果はありません。このチェックボックスをオンにすることで、データベースを目的の Azure SQL ターゲットに移行することを承認します。]
ko: [데이터베이스 마이그레이션 준비 상태의 유효성을 검사하는 평가 결과가 없습니다. 이 확인란을 선택하면 데이터베이스를 원하는 Azure SQL 대상으로 계속 마이그레이션할 수 있습니다.]
pt_br: [Não há resultados de avaliação para validar a preparação da migração do seu banco de dados. Ao marcar esta caixa, você reconhece que deseja continuar migrando seu banco de dados para o destino SQL do Azure desejado.]
ru: [Нет результатов оценки для проверки готовности к миграции базы данных. При установке этого флажка вы подтверждаете, что хотите продолжить миграцию базы данных в требуемый Azure SQL целевой объект.]
zh_hans: [没有评估结果来验证数据库迁移的准备情况。选中此框即表示你确认要继续将数据库迁移到所需的 Azure SQL 目标。]
zh_hant: [沒有評定結果可驗證資料庫移轉的整備程度。選取此方塊，即表示您確認要繼續將資料庫移轉至所需的 Azure SQL 目標。]

# sql.migration.wizard.sku.error.message
source: message: {0}
de: Meldung: {0}
es: mensaje: {0}
ja: メッセージ: {0}
ko: 메시지: {0}
pt_br: mensagem: {0}
ru: сообщение: {0}
zh_hans: 消息: {0}
zh_hant: 訊息: {0}

# sql.migration.wizard.sku.assessment.error.with.info
source: message: {0}{1}errorSummary: {2}{3}possibleCauses: {4}}{5}guidance: {6}{7}errorId: {8}
es: mensaje: {0}{1}errorSummary: {2}{3}possibleCases: {4}}{5}guía: {6}{7}errorId: {8}
fr: message : {0}{1}errorSummary: {2}{3}possibleCauses: {4}}{5}conseils : {6}{7}errorId: {8}
ja: メッセージ: {0}{1}errorSummary: {2}{3}possibleCauses: {4}}{5}guidance: {6}{7}errorId: {8}
ko: 메시지: {0}{1}errorSummary: {2}{3}possibleCauses: {4}}{5}guidance: {6}{7}errorId: {8}
pt_br: mensagem: {0}{1}errorSummary: {2}{3}possibleCauses: {4}}{5}diretrizes: {6}{7}errorId: {8}
ru: сообщение: {0}{1}errorSummary: {2}{3}possibleCauses: {4}}{5}руководство: {6}{7}errorId: {8}
zh_hans: 消息: {0}{1}errorSummary: {2}{3}possibleCauses: {4}}{5}指南: {6}{7}errorId: {8}

# sql.migration.wizard.sku.assessment.error.with.stack
source: message: {0}{1}stack: {2}
de: Meldung: {0}{1}Stapel: {2}
es: mensaje: {0}{1}pila: {2}
ja: メッセージ: {0}{1}スタック: {2}
ko: 메시지: {0}{1}스택: {2}
pt_br: mensagem: {0}{1}pilha: {2}
ru: сообщение: {0}{1}стек: {2}
zh_hans: 消息: {0}{1}堆栈: {2}

# sql.migration.service.prompt
source: {0} (change)
de: {0} (Änderung)
es: {0} (cambiar)
fr: {0} (modification)
ja: {0} (変更)
ko: {0}(변경)
pt_br: {0} (alterar)
ru: {0} (изменение)
zh_hans: {0} (更改)
zh_hant: {0} (變更)

# sql.migration.account.credentials.refresh.required
source: {0} (requires credentials refresh)
de: {0} (erfordert Aktualisierung der Anmeldeinformationen)
es: {0} (requiere la actualización de credenciales)
fr: {0} (nécessite l’actualisation des informations d’identification)
ja: {0} (資格情報の更新が必要)
ko: {0}(자격 증명 새로 고침 필요)
pt_br: {0} (requer atualização de credenciais)
ru: {0} (требуется обновление учетных данных)
zh_hans: {0}(需要刷新凭据)
zh_hant: {0} (需要重新整理認證)

# sql.migration.validate.ir.status.error.count.one
source: {0} - 1 error
de: {0} – 1 Fehler
fr: {0} – 1 erreur
ja: {0} - 1 件のエラー
ko: {0} - 1개의 오류
pt_br: {0} - 1 erro
ru: {0} — 1 ошибка
zh_hans: {0} - 1 个错误
zh_hant: {0} - 1 個錯誤

# sql.migration.validate.ir.status.error.count.many
source: {0} - {1} errors
de: {0} – {1} Fehler
es: {0} -{1} errores
fr: {0} – {1} erreurs
ja: {0} - {1} 件のエラー
ko: {0} - {1}개의 오류
pt_br: {0} - {1} erros
ru: {0} - {1} ошибки
zh_hans: {0} - {1} 个错误
zh_hant: {0} - {1} 個錯誤

# sql.migration.sku.recommendations.title
source: {0} Recommendations
de: {0} Empfehlungen
es: ({0} recomendaciones)
fr: ({0} Recommandations)
ja: {0} 件のレコメンデーション
ko: {0} 권장 사항
pt_br: ({0} recomendações)
ru: Рекомендаций: {0}
zh_hans: {0} 个建议
zh_hant: {0} 項建議

# sql.migration.tde.msg.databases.selected
source: {0} Transparent Data Encryption enabled databases selected for migration. {1}
de: {0} Für die Migration ausgewählte Transparent Data Encryption aktivierte Datenbanken. {1}
es: {0} El cifrado de datos transparente habilitó las bases de datos seleccionadas para la migración. {1}
fr: {0} Transparent Data Encryption a activé les bases de données sélectionnées pour la migration. {1}
ja: Transparent Data Encryption に対応したデータベース {0} つを移行対象に選択しました。{1}
ko: 마이그레이션에 {0} 투명한 데이터 암호화를 사용하는 데이터베이스를 선택했습니다. {1}
pt_br: {0}O Transparent Data Encryption habilitou os bancos de dados selecionados para migração. {1}
ru: Выбранные для миграции базы данных, использующие прозрачное шифрование: {0}. {1}
zh_hans: {0} 透明数据加密已为迁移选择的已启用数据库。{1}
zh_hant: {0} 已選取啟用 [透明資料加密] 的資料庫來進行移轉。{1}

# sql.migration.wizard.account.count.single.message
source: {0} account linked
de: {0} Konto verknüpft
es: {0} cuenta vinculada
fr: Compte {0} lié
ja: リンク済みの {0} アカウント
ko: 연결된 계정 {0}개
pt_br: {0} conta vinculada
ru: Связанная учетная запись {0}
zh_hans: 已链接 {0} 个帐户
zh_hant: {0} 個帳戶已連結

# sql.migration.wizard.account.count.multiple.message
source: {0} accounts linked
de: {0} Konten verknüpft
es: {0} cuentas vinculadas
fr: Comptes {0} liés
ja: リンク済みの {0} アカウント
ko: 연결된 계정 {0}개
pt_br: {0} contas vinculadas
ru: Связанные учетные записи {0}
zh_hans: 已链接 {0} 个帐户
zh_hant: {0} 個帳戶已連結

# sql.migration.sku.cpu
source: {0} cores
de: {0} Kerne
es: {0} núcleos
fr: {0} cœurs
ja: {0} コア
ko: {0} 코어
pt_br: {0} núcleos
ru: Ядер: {0}
zh_hans: {0} 个核心
zh_hant: {0} 核心

# sql.migration.count.database.single
source: {0} database
de: {0} Datenbank
es: {0} base de datos
fr: {0} base de données
ja: {0} データベース
ko: 데이터베이스 {0}개
pt_br: {0} banco de dados
ru: {0} базы данных
zh_hans: {0} 数据库
zh_hant: {0} 個資料庫

# sql.migration.inprogress.warning.single
source: {0} database has warnings
de: {0} Datenbank weist Warnungen auf
es: {0}database tiene advertencias
fr: La base de données {0} contient des avertissements
ja: {0} データベースに警告があります
ko: {0} 데이터베이스에 경고가 있음
pt_br: {0} o banco de dados possui avisos
ru: {0} база данных содержит предупреждения
zh_hans: {0} 数据库具有警告
zh_hant: {0} 個資料庫出現警告

# sql.migration.count.database.multiple
source: {0} databases
de: {0} Datenbanken
es: {0} bases de datos
fr: {0} bases de données
ja: {0} データベース
ko: 데이터베이스 {0}개
pt_br: {0} bancos de dados
ru: {0} баз данных
zh_hans: {0} 个数据库
zh_hant: {0} 個資料庫

# sql.migration.inprogress.warning.multiple
source: {0} databases have warnings
de: {0} Datenbanken weisen Warnungen auf
es: {0} bases de datos tienen advertencias
fr: {0} bases de données contiennent des avertissements
ja: {0} データベースに警告があります
ko: {0} 데이터베이스에 경고가 있습니다.
pt_br: {0} os bancos de dados possuem avisos
ru: Баз данных с предупреждениями: {0}
zh_hans: {0} 个数据库有警告
zh_hant: {0} 個資料庫出現警告

# sql.migration.day
source: {0} day
de: {0} Tag
es: {0} día
fr: {0} jour
ja: {0} 日
ko: {0}일
pt_br: {0} dia
ru: {0} дн.
zh_hans: {0} 天
zh_hant: {0} 天

# sql.migration.days
source: {0} days
de: {0} Tage
es: {0} días
fr: {0} jours
ja: {0} 日
ko: {0}일
pt_br: {0} dias
ru: {0} дн.
zh_hans: {0} 天
zh_hant: {0} 天

# sql.migration.hr
source: {0} hr
de: {0} Std.
es: {0} h
fr: {0} heure
ja: {0} 時間
ko: {0}시간
pt_br: {0} hora
ru: {0} ч
zh_hans: {0} 小时
zh_hant: {0} 小時

# sql.migration.hrs
source: {0} hrs
de: {0} Std.
es: {0} h
fr: {0} heures
ja: {0} 時間
ko: {0}시간
pt_br: {0} horas
ru: {0} ч
zh_hans: {0} 小时
zh_hant: {0} 小時

# sql.migration.min
source: {0} min
fr: {0} minute
ja: {0} 分
ko: {0}분
pt_br: {0} minuto
ru: {0} мин
zh_hans: {0} 分钟
zh_hant: {0} 分鐘

# sql.migration.mins
source: {0} mins
de: {0} Min.
es: {0} minutos
fr: {0} minutes
ja: {0} 分
ko: {0}분
pt_br: {0} minutos
ru: {0} мин
zh_hans: {0} 分钟
zh_hant: {0} 分鐘

# sql.migration.sku.ms
source: {0} ms
ja: {0} ミリ秒
ru: {0} мс
zh_hans: {0} 毫秒
zh_hant: {0} 毫秒
