Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.azcli.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# az.noAzWithLink
source: No Azure CLI is available, [install the Azure CLI](command:az.install) to enable the features that require it.
de: Es ist keine Azure CLI verfügbar. [Installieren Sie die Azure CLI](command:azdata.Install), um die Funktionen zu aktivieren, die dies erfordern.
es: No está disponible la CLI de Azure, [instale la CLI de Azure](command:az.install) para habilitar las funciones que la requieren.
fr: Aucune Azure CLI n’est disponible, [install the Azure CLI](command:az.install) pour activer les fonctionnalités qui en ont besoin.
it: Non è disponibile alcuna interfaccia della riga di comando di Azure, [installare l'interfaccia della riga di comando di Azure](comando:az.install) per abilitare le funzionalità che lo richiedono.
ja: 使用可能な Azure CLI がありません。[Azure CLI の更新](コマンド: az.install) を行い、それを必要とする機能を有効にします。
ko: Azure CLI를 사용할 수 없습니다. 필요한 기능을 사용하도록 설정하려면 [Azure CLI 설치](command:az.install)를 수행하세요.
pt_br: Nenhuma CLI do Azure está disponível, [instale a CLI do Azure](command:azdata.install) para habilitar os recursos que a exigem.
ru: Служба Azure CLI недоступна, [установите Azure CLI](command:az.install), чтобы включить необходимые функции.
zh_hans: 没有可用的 Azure CLI，请 [安装Azure CLI](command:az.install)以启用需要它的功能。
zh_hant: 沒有 Azure CLI 可用，請[安裝 Azure CLI](command:az.install) 以啟用需要它的功能。

# az.noAz
source: No Azure CLI is available, run the command 'Azure CLI: Install' to enable the features that require it.
de: Es ist keine Azure CLI verfügbar. Führen Sie den Befehl „Azure CLI: Installieren“ aus, um die Funktionen zu aktivieren, die dies erfordern.
es: Si no está disponible la CLI de Azure, ejecute el comando \"CLI de Azure: instalar\" para habilitar las funciones que lo requieren.
fr: Aucune Azure CLI n’est disponible, exécutez la commande 'Azure CLI : Installer' pour activer les fonctionnalités qui en ont besoin.
it: Non è disponibile alcuna interfaccia della riga di comando di Azure. Eseguire il comando 'Interfaccia della riga di comando di Azure: Install' per abilitare le funzionalità che lo richiedono.
ja: 使用可能な Azure CLI がありません。コマンド 'Azure CLI: Install' を実行し、それを必要とする機能を有効にします。
ko: Azure CLI를 사용할 수 없습니다. 'Azure CLI: 설치' 명령을 실행하여 필요한 기능을 사용하도록 설정하세요.
pt_br: Nenhuma CLI do Azure está disponível. Execute o comando 'Azure CLI: Install' para habilitar os recursos que a exigem.
ru: Служба Azure CLI недоступна, запустите команду \"Azure CLI: установить\", чтобы включить необходимые функции.
zh_hans: 没有可用的 Azure CLI，请运行命令“Azure CLI: 安装”以启用需要它的功能。
zh_hant: 沒有 Azure CLI 可用，請執行 'Azure CLI: Install' 命令以啟用需要它的功能。

# az.noAzureCLI
source: No Azure CLI is available. Install the latest version manually from [here](https://docs.microsoft.com/cli/azure/install-azure-cli) and then restart Azure Studio.
de: Es ist keine Azure CLI verfügbar. Installieren Sie die neueste Version manuell von [hier](https://docs.microsoft.com/cli/azure/install-azure-cli) aus und starten Sie dann Azure Studio neu.
es: No está disponible la CLI de Azure. Instale la última versión manualmente desde [aquí](https://docs.microsoft.com/cli/azure/install-azure-cli) y luego reinicie Azure Studio.
fr: Aucune interface de ligne de commande Azure n’est disponible. Installez la dernière version manuellement depuis [ici](https://docs.microsoft.com/cli/azure/install-azure-cli), puis redémarrez Azure Studio.
it: Non è disponibile alcuna interfaccia della riga di comando di Azure. Installare manualmente la versione più recente da [qui](https://docs.microsoft.com/cli/azure/install-azure-cli), poi riavviare Azure Studio.
ja: 使用可能な Azure CLI がありません。[こちら](https://docs.microsoft.com/cli/azure/install-azure-cli) から最新バージョンを手動でインストールしてから、Azure Studio を再起動してください。
ko: Azure CLI를 사용할 수 없습니다. [여기](https://docs.microsoft.com/cli/azure/install-azure-cli)에서 수동으로 최신 버전을 설치한 다음 Azure Studio를 다시 시작합니다.
pt_br: Nenhum CLI do Azure está disponível. Instale a versão mais recente manualmente [aqui](https://docs.microsoft.com/cli/azure/install-azure-cli) e reinicie o Azure Studio.
ru: Azure CLI недоступен. Установите последнюю версию вручную [отсюда](https://docs.microsoft.com/cli/azure/install-azure-cli) и перезапустите Azure Studio.
zh_hans: 没有可用的 Azure CLI。从 [此处](https://docs.microsoft.com/cli/azure/install-azure-cli)手动安装最新版本，然后重启 Azure Studio。
zh_hant: 沒有可用的 Azure CLI。從 [此處](https://docs.microsoft.com/cli/azure/install-azure-cli)手動安裝最新版本，然後重新啟動 Azure Studio。

# az.updateCheckSkipped
source: No check for new Azure CLI version availability performed as Azure CLI was not found to be installed
de: Es wurde nicht nach neuen verfügbaren Azure CLI-Versionen gesucht, da keine Azure CLI-Installation gefunden wurde
es: No se ha comprobado la disponibilidad de la nueva versión de la CLI de Azure porque no se encuentra instalada.
fr: Aucune vérification de la disponibilité de la nouvelle version d’Azure CLI effectuée car Azure CLI n’a pas été trouvé pour être installé
it: Non è stato effettuato il controllo sulla disponibilità della nuova versione dell'interfaccia della riga di comando di Azure, in quanto non è presente alcuna installazione.
ja: Azure CLI がインストールされていないことが判明したため、新しい Azure CLI バージョンの可用性のチェックが実行されませんでした。
ko: 설치된 Azure CLI를 찾을 수 없으므로 새 Azure CLI 버전 가용성 확인이 수행되지 않음
pt_br: Nenhuma verificação para a nova disponibilidade de versão da CLI do Azure foi executada, pois a CLI do Azure não foi encontrada para ser instalada
ru: Проверка доступности новой версии Azure CLI не выполнена, так как не удалось установить Azure CLI
zh_hans: 未执行对新 Azure CLI 版本的可用性检查，因为找不到要安装的 Azure CLI
zh_hant: 因為找不到要安裝的 Azure CLI，所以未執行新的 Azure CLI 版本可用性檢查

# az.noDownloadLink
source: No download link available for platform '{0}' Release info: ${1}
es: No hay ningún vínculo de descarga disponible para la plataforma “{0}" Información de la versión: ${1}
fr: Aucun lien de téléchargement n’est disponible pour la plateforme '{0}' Informations de publication : ${1}
it: Nessun collegamento di download disponibile per la piattaforma '{0}' Informazioni sulla versione: ${1}
ja: プラットフォーム'{0}' リリース情報に利用可能なダウンロード リンクがありません: ${1}
ko: 플랫폼 '{0}' 릴리스 정보: ${1}에 사용할 수 있는 다운로드 링크가 없습니다.
pt_br: Nenhum link de download disponível para a plataforma ''{0}'' Informações sobre a versão: ${1}
ru: Нет доступной ссылки для скачивания для платформы "{0}" Сведения о выпуске: ${1}
zh_hans: 没有适用于平台“{0}”的下载链接 发布信息: ${1}
zh_hant: 平台 '{0}' 沒有可用的下載連結 發行資訊: ${1}

# az.noReleaseVersion
source: No release version available for platform '{0}' Release info: ${1}
de: Für die Plattform „{0}“ ist keine Releaseversion verfügbar, Versionsinformationen: ${1}
es: No hay ninguna versión disponible para la plataforma"{0}" Información de versión: ${1}
fr: Aucune version disponible pour la plate-forme '{0}' Informations sur la version : ${1}
it: Nessuna versione release disponibile per la piattaforma '{0}' Informazioni sulla versione: ${1}
ja: プラットフォーム '{0}' リリース情報に利用可能なリリース バージョンがありません: ${1}
ko: 플랫폼 '{0}' 릴리스 정보: ${1}에 사용할 수 있는 릴리스 버전이 없습니다.
pt_br: Nenhuma versão de lançamento disponível para a plataforma "{0}" Informações sobre a versão: ${1}
ru: Нет доступной версии выпуска для платформы "{0}" Версия выпуска: ${1}
zh_hans: 没有适用于平台“{0}”的发布版本 发布信息: ${1}
zh_hant: 平台 '{0}' 沒有發行版本 發行資訊: ${1}

# az.platformUnsupported
source: Platform '{0}' is currently unsupported
de: Die Plattform „{0}“ wird zurzeit nicht unterstützt
es: La plataforma \"{0}\" no es compatible actualmente
fr: La plateforme « {0} » n’est pas prise en charge actuellement
it: La piattaforma '{0}' non è attualmente supportata
ja: プラットフォーム '{0}' は現在サポート外です
ko: '{0}' 플랫폼은 현재 지원되지 않습니다.
pt_br: A plataforma '{0}' não tem suporte no momento
ru: Платформа \"{0}\" сейчас не поддерживается
zh_hans: 平台“{0}”当前不受支持
zh_hant: 目前不支援平台 '{0}'

# az.promptLog
source: Prompting the user to accept the following: {0}
de: Der Benutzer wird aufgefordert, Folgendes zu akzeptieren: {0}
es: Se pide al usuario que acepte lo siguiente: {0}
fr: Demande à l’utilisateur d’accepter les éléments suivants : {0}
it: Verrà richiesto all'utente di accettare quanto segue: {0}
ja: ユーザーが次に同意するよう促すダイアログの表示: {0}
ko: 사용자에게 다음을 수락하도록 요청하는 중: {0}
pt_br: Solicitando que o usuário aceite o seguinte: {0}
ru: Пользователю будет предложено принять следующее: {0}
zh_hans: 正在提示用户接受以下内容: {0}
zh_hant: 提示使用者接受下列內容: {0}

# arc.releaseDateNotParsed
source: Release date could not be parsed.
de: Das Releasedatum konnte nicht analysiert werden.
es: No se pudo analizar la fecha de lanzamiento.
fr: Impossible d’analyser la date de sortie.
it: Non è stato possibile analizzare la data di rilascio.
ja: リリース日を解析できませんでした。
ko: 릴리스 날짜를 구문 분석할 수 없습니다.
pt_br: A data de lançamento não pôde ser analisada.
ru: Не удалось разобрать дату выпуска.
zh_hans: 无法分析发布日期。
zh_hant: 無法剖析發行日期。

# az.searchingForAz
source: Searching for existing Azure CLI installation...
de: Es wird nach einer vorhandenen Azure CLI-Installation gesucht...
es: Buscando la instalación existente de la CLI de Azure...
fr: Recherche d’une installation Azure CLI existante...
it: Ricerca dell'installazione dell'interfaccia della riga di comando di Azure esistente in corso...
ja: 既存の Azure CLI のインストールを検索しています...
ko: 기존 Azure CLI 설치를 검색하는 중...
pt_br: Procurando pela instalação existente da CLI do Azure...
ru: Поиск существующей установки Azure CLI...
zh_hans: 正在搜索现有 Azure CLI 安装...
zh_hant: 正在搜尋現有的 Azure CLI 安裝...

# az.skipInstall
source: Skipping installation of Azure CLI and arcdata extension, since the operation was not user requested and config option: {0}.{1} is {2}
de: Die Installation der Azure CLI und der arcdata-Erweiterung wird übersprungen, da der Vorgang nicht vom Benutzer angefordert wurde und die Konfigurationsoption {0}.{1} {2} ist
es: Omitiendo la instalación de la CLI de Azure y la extensión arcdata, ya que la operación no fue solicitada por el usuario y la opción config: {0}.{1} es {2}
fr: Ignorer l’installation d’Azure CLI et de l’extension arcdata, car l’opération n’a pas été demandée par l’utilisateur et l’option de configuration : {0}.{1} est {2}
it: L'installazione dell'interfaccia della riga di comando di Azure e dell'estensione arcdata verrà ignorata perché l'operazione non è stata richiesta dall'utente e l'opzione di configurazione: {0}.{1} è {2}
ja: この操作はユーザーが要求したものではなく、構成オプション {0} でもないため、Azure CLI と arcdata 拡張機能のインストールをスキップします。{1} は {2} です
ko: 사용자가 작업을 요청하지 않았고 구성 옵션: {0}이므로 Azure CLI 및 arcdata 확장을 건너뛰는 중입니다.{1}은(는) {2}입니다.
pt_br: Ignorando a instalação do CLI do Azure e da extensão arcdata, pois a operação não foi solicitada pelo usuário e a opção de configuração: {0}.{1} é {2}
ru: Пропущена установка Azure CLI и расширения arcdata, так как операция не была запрошена пользователем, а параметр конфигурации {0}.{1} — {2}
zh_hans: 正在跳过安装 Azure CLI 和 arcdata 扩展，因为操作不是用户请求的，并且配置选项 {0}.{1} 为 {2}
zh_hant: 略過 Azure CLI 和 arcdata 延伸模組的安裝，因為此作業不是使用者要求的，且設定選項: {0}.{1} 是 {2}

# az.arcdataInstalled
source: The Azure CLI arcdata extension was successfully installed. Restarting Azure Studio is required to complete configuration - features will not be activated until this is done.
de: Die Azure CLI arcdata-Erweiterung wurde erfolgreich installiert. Azure Studio muss neugestartet werden, um die Konfiguration abzuschließen. Die Funktionen werden erst danach aktiviert.
es: La extensión arcdata de la CLI de Azure se ha instalado correctamente. Es necesario reiniciar Azure Studio para completar la configuración; las funciones no se activarán hasta que se realice esta acción.
fr: L’extension arcdata Azure CLI a été installée avec succès. Le redémarrage d’Azure Studio est nécessaire pour terminer la configuration – les fonctionnalités ne seront pas activées tant que cela ne sera pas fait.
it: L'estensione arcdata dell'interfaccia della riga di comando di Azure è stata installata. Il riavvio di Azure Studio è necessario per completare la configurazione. Le funzionalità non verranno attivate fino a quando l’operazione non sarà completata.
ja: Azure CLI arcdata 拡張機能が正常にインストールされました。構成を完了するには、Azure Studio を再起動する必要があります。この操作が完了するまで、機能はアクティブ化されません。
ko: Azure CLI arcdata 확장이 성공적으로 설치되었습니다. 구성을 완료하려면 Azure Studio를 다시 시작해야 합니다. 이 작업이 완료될 때까지 기능이 사용하도록 설정되지 않습니다.
pt_br: A extensão arcdata da CLI do Azure foi instalada com êxito. A reinicialização do Azure Data Studio é necessária para concluir a configuração. Os recursos não serão ativados até que isso seja feito.
ru: Расширение arcdata для Azure CLI успешно установлено. Перезапуск Azure Studio необходим для завершения настройки — функции не будут активированы, пока это не будет сделано.
zh_hans: 已成功安装 Azure CLI arcdata 扩展。需要重启 Azure Studio 才能完成配置 - 在完成此操作之前，将不会激活功能。
zh_hant: 已成功安裝 Azure CLI arcdata 延伸模組。需要重新啟動 Azure Studio 才能完成設定 - 除非完成此作業，否則功能將不會啟用。

# az.promptForRequiredAzUpdate
source: This extension requires Azure CLI >= {0} to be installed, do you wish to update to the latest version ({1}) now? If you do not then some functionality may not work.
de: Für diese Erweiterung muss die Azure CLI >= {0} installiert werden. Möchten Sie jetzt auf die neueste Version ({1}) aktualisieren? Wenn nicht, funktionieren einige Funktionen möglicherweise nicht.
es: Esta extensión requiere que la CLI de Azure >= {0} esté instalada, ¿desea actualizar a la última versión ({1}) ahora? Si no lo hace, es posible que alguna funcionalidad no funcione.
fr: Cette extension nécessite l’installation d'Azure CLI >= {0}, souhaitez-vous mettre à jour vers la dernière version ({1}) maintenant ? Si vous ne le faites pas, certaines fonctionnalités peuvent ne pas fonctionner.
it: Questa estensione richiede l'installazione dell'interfaccia della riga di comando di Azure >= {0}. Eseguire l'aggiornamento alla versione più recente ({1}) adesso? In caso contrario, alcune funzionalità potrebbero non funzionare.
ja: この拡張機能を使用するには、Azure CLI >= {0} がインストールされている必要がありますが、今すぐ最新バージョン ({1}) に更新しますか? 更新しない場合、一部の機能が動作しない可能性があります。
ko: 이 확장을 사용하려면 Azure CLI >= {0}을(를) 설치해야 합니다. 지금 최신 버전({1})으로 업데이트하시겠습니까? 그렇지 않으면 일부 기능이 작동하지 않을 수 있습니다.
pt_br: Esta extensão requer que a CLI do Azure >= {0} seja instalada. Deseja atualizar para a versão mais recente ({1}) agora? Se você não fizer isso, algumas funcionalidades poderão não funcionar.
ru: Для этого расширения требуется установить Azure CLI >= {0}, чтобы выполнить обновление до последней версии ({1}) сейчас? В противном случае некоторые функции могут не работать.
zh_hans: 此扩展需要安装 Azure CLI >= {0}，是否希望立即更新到最新版本({1})? 如果不更新，则某些功能可能不起作用。
zh_hant: 此延伸模組需要安裝 Azure CLI >= {0}，您要立即更新至最新版本 ({1}) 嗎? 否則，某些功能可能無法運作。

# az.arcdataExtensionNotInstalled
source: This extension requires the Azure CLI extension 'arcdata' to be installed. Install the latest version using instructions from [here](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
de: Für diese Erweiterung muss die Azure CLI-Version der Erweiterung „arcdata“ installiert sein. Installieren Sie die neueste Version mithilfe der Anweisungen von [hier](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
es: Esta extensión requiere la instalación de la extensión \"arcdata\" de la CLI de Azure. Instale la última versión siguiendo las instrucciones de [aquí](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
fr: Cette extension nécessite l’installation de l’extension Azure CLI « arcdata ». Installez la dernière version en suivant les instructions de [ici](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
it: Questa estensione richiede l'installazione dell'estensione 'arcdata' dell'interfaccia della riga di comando di Azure. Installare la versione più recente seguendo le istruzioni riportate [qui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
ja: この拡張機能は、Azure CLI の拡張機能 'arcdata' がインストールされている必要があります。[こちら](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension) の手順に従って最新バージョンをインストールしてください。
ko: 이 확장을 사용하려면 Azure CLI 확장 'arcdata'를 설치해야 합니다. [여기](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension)의 지침을 사용하여 최신 버전을 설치합니다.
pt_br: Essa extensão requer que a extensão 'arcdata' da CLI do Azure seja instalada. Instale a versão mais recente usando as instruções fornecidas [aqui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
ru: Для этого расширения требуется установленное расширение \"arcdata\" для Azure CLI. Установите последнюю версию, следуя инструкциям [здесь](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
zh_hans: 此扩展需要安装 Azure CLI 扩展 “arcdata”。使用 [此处](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension)的说明安装最新版本。
zh_hant: 此延伸模組需要安裝 Azure CLI 延伸模組 'arcdata'。使用[此處](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension) 的指示安裝正確的版本。

# az.requiredVersionNotAvailable
source: This extension requires the Azure CLI extension 'arcdata' version >= {0} to be installed, but the current version available is only {1}. Install the correct version using instructions from [here](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
de: Für diese Erweiterung muss die Azure CLI-Version der Erweiterung „arcdata“ >= {0} installiert sein, die aktuelle Version ist jedoch nur {1}. Installieren Sie die richtige Version mithilfe der Anweisungen von [hier](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
es: Esta extensión requiere que la extensión de la CLI de Azure \"arcdata\" versión >= {0}sea instalada, pero la versión actual disponible es sólo {1}. Instale la versión correcta usando las instrucciones de [aquí](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
fr: Cette extension nécessite l’installation de l’extension Azure CLI 'arcdata' version >= {0}, mais la version actuellement disponible est uniquement {1}. Installez la version correcte en suivant les instructions de [ici](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
it: Questa estensione richiede l'installazione dell'estensione 'arcdata' dell'interfaccia della riga di comando di Azure >= {0}, ma la versione corrente disponibile è solo {1}. Installare la versione corretta seguendo le istruzioni riportate [qui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
ja: この拡張機能を使用するには、Azure CLI の拡張機能 'arcdata' バージョン >= {0} がインストールされている必要がありますが、現在利用可能なバージョンは {1} のみです。[こちら](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension) の手順に従って正しいバージョンをインストールしてください。
ko: 이 확장을 사용하려면 Azure CLI 확장 'arcdata' 버전 >= {0}을(를) 설치해야 하지만 현재 사용 가능한 버전은 {1}입니다. [여기](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension)의 지침을 사용하여 올바른 버전을 설치합니다.
pt_br: Essa extensão requer que a extensão 'arcdata' do CLI do Azure versão >= {0} seja instalada, mas a versão atual disponível é apenas {1}. Instale a versão correta usando as instruções [aqui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
ru: Для этого расширения требуется установленное расширение arcdata для Azure CLI версии не ниже {0}, но в настоящее время доступна только версия {1}. Установите соответствующую версию, следуя инструкциям [отсюда](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
zh_hans: 此扩展需要安装 Azure CLI 扩展 “arcdata” 版本 >= {0}，但当前可用版本仅为 {1}。使用 [此处](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension)的说明安装正确的版本。
zh_hant: 此延伸模組需要安裝 Azure CLI 延伸模組 'arcdata' >= {0}，但目前可用的版本僅為 {1}。使用 [此處](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension) 的指示安裝正確的版本。

# az.unexpectedCommandError
source: Unexpected error executing command: {0}
de: Unerwarteter Fehler beim Ausführen des Befehls: {0}
es: Error inesperado al ejecutar el comando: {0}
fr: Erreur inattendue lors de l’exécution de la commande : {0}
it: Errore imprevisto durante l'esecuzione del comando: {0}
ja: コマンド {0} の実行中に予期しないエラーが発生しました
ko: 명령 실행 중 예기치 않은 오류 발생: {0}
pt_br: Erro inesperado ao executar o comando: {0}
ru: Непредвиденная ошибка при выполнении команды: {0}
zh_hans: 执行命令时出现意外错误: {0}
zh_hant: 執行命令時發生未預期的錯誤: {0}

# az.unexpectedExitCode
source: Unexpected exit code from command: {1} ({0})
de: Unerwarteter Exitcode von Befehl: {1} ({0})
es: Código de salida inesperado desde el comando: {1} ({0})
fr: Code de sortie inattendu de la commande : {1} ({0})
it: Codice di uscita imprevisto dal comando: {1} ({0})
ja: コマンドからの予期しない終了コード: {1} ({0})
ko: 명령에서 예기치 않은 종료 코드: {1}({0})
pt_br: Código de saída inesperado do comando: {1}({0})
ru: Непредвиденный код выхода из команды: {1} ({0})
zh_hans: 命令中出现意外的退出代码: {1} ({0})
zh_hant: 命令中未預期的結束代碼: {1} ({0})

# az.updatingAz
source: Updating Azure CLI...
de: Azure CLI wird aktualisiert...
es: Actualizando la CLI de Azure...
fr: Mise à jour de l’interface de ligne de commande Azure...
it: Aggiornamento dell'interfaccia della riga di comando di Azure in corso...
ja: Azure CLI を更新しています...
ko: Azure CLI 업데이트하는 중...
pt_br: Atualizando a CLI do Azure...
ru: Обновление Azure CLI...
zh_hans: 正在更新 Azure CLI...
zh_hant: 正在更新 Azure CLI...

# az.userResponseInstall
source: User Response on prompt to install Azure CLI: {0}
de: Benutzerantwort auf die Aufforderung zur Installation der Azure CLI: {0}
es: Respuesta del usuario a la solicitud de instalación de la CLI de Azure: {0}
fr: Réponse de l’utilisateur à l’invite pour installer Azure CLI : {0}
it: Risposta dell’utente alla richiesta di installazione dell'interfaccia della riga di comando di Azure: {0}
ja: Azure CLI のインストールを促すダイアログの表示でのユーザー応答: {0}
ko: Azure CLI를 설치하라는 사용자 응답: {0}
pt_br: Resposta do usuário no prompt para instalar a CLI do Azure: {0}
ru: Ответ пользователя при запросе на установку Azure CLI: {0}
zh_hans: 提示安装 Azure CLI 时的用户响应: {0}
zh_hant: 提示安裝 Azure CLI 時的使用者回應: {0}

# az.userResponseUpdate
source: User Response on prompt to update Azure CLI: {0}
de: Benutzerantwort auf die Aufforderung zum Aktualisieren der Azure CLI: {0}
es: Respuesta del usuario a la solicitud de actualización de la CLI de Azure:: {0}
fr: Réponse de l’utilisateur à l’invite pour mettre à jour Azure CLI : {0}
it: Risposta dell’utente alla richiesta di aggiornamento dell'interfaccia della riga di comando di Azure: {0}
ja: Azure CLI の更新を促すダイアログの表示でのユーザー応答: {0}
ko: Azure CLI를 업데이트하라는 메시지의 사용자 응답: {0}
pt_br: Resposta do usuário no prompt para atualizar a CLI do Azure: {0}
ru: Ответ пользователя при запросе на обновление Azure CLI: {0}
zh_hans: 提示更新 Azure CLI 时的用户响应: {0}
zh_hant: 提示更新 Azure CLI 時的使用者回應: {0}

# az.userRequestedInstall
source: User requested to install Azure CLI and arcdata extension using 'Azure CLI: Install' command
de: Der Benutzer hat die Installation der Azure CLI und der arcdata-Erweiterung mithilfe des Befehls „Azure CLI: Install“ angefordert
es: El usuario solicitó instalar la CLI de Azure y la extensión arcdata usando el comando \"CLI de Azure: instalar\"
fr: L’utilisateur a demandé d’installer Azure CLI et l’extension arcdata à l’aide de la commande « Azure CLI : Installer »
it: L'utente ha richiesto di installare l'interfaccia della riga di comando di Azure e l'estensione arcdata usando il comando 'Interfaccia della riga di comando di Azure: Install'
ja: ユーザーが 'Azure CLI: Install' コマンドを使用して Azure Data CLI と arcdata 拡張機能のインストールを要求しました
ko: 사용자가 'Azure CLI: 설치' 명령을 사용하여 Azure CLI 및 arcdata 확장을 설치하도록 요청했습니다.
pt_br: O usuário solicitou a instalação da CLI do Azure e a extensão arcdata usando o comando 'Azure CLI: Install'
ru: Пользователь запросил установку Azure CLI и расширения arcdata с помощью команды \"Azure CLI: Установить\"
zh_hans: 用户已请求使用 “Azure CLI: 安装” 命令安装 Azure CLI 和 arcdata 扩展
zh_hant: 使用者要求使用 'Azure CLI: Install' 命令安裝 Azure CLI 和 arcdata 延伸模組

# az.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是
