Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.azcli.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# az.promptForAzUpdate
source: A new version of Azure CLI ( {0} ) is available, do you wish to update to it now?
de: Es ist eine neue Azure CLI-Version ({0}) verfügbar. Möchten Sie jetzt auf diese aktualisieren?
es: Una nueva versión de la CLI de Azure ( {0} ) está disponible, ¿desea actualizarla ahora?
fr: Une nouvelle version de Azure Data CLI ( {0} ) est disponible, souhaitez-vous la mettre à jour maintenant ?
it: È disponibile una nuova versione dell'interfaccia della riga di comando di Azure ( {0} ). Eseguire l'aggiornamento ora?
ja: Azure CLI の新しいバージョン ( {0} ) が利用できます。今すぐ更新しますか?
ko: 새 버전의 Azure CLI( {0} )를 사용할 수 있습니다. 지금 업데이트하시겠습니까?
pt_br: Uma nova versão da CLI do Azure ({0}) está disponível. Deseja atualizá-la agora?
ru: Доступна новая версия Azure CLI ({0}). Обновить до нее сейчас?
zh_hans: 新版本的 Azure CLI ({0}) 已可用，是否希望立即更新?
zh_hant: 有新版的 Azure CLI ( {0} )，您要立即更新嗎?

# az.accept
source: Accept
de: Akzeptieren
es: Aceptar
fr: Accepter
it: Accetto
ja: 承諾する
ko: 수용하다
pt_br: Aceitar
ru: Принять
zh_hans: 接受
zh_hant: 接受

# az.parseVersionError
source: An error occurred while parsing the output of az --version.
de: Fehler beim Analysieren der Ausgabe von az --version.
es: Se ha producido un error al analizar la salida de la versión --az.
fr: Une erreur s’est produite lors de l’analyse de la sortie de az --version.
it: Si è verificato un errore durante l'analisi dell'output di az --version.
ja: az --version の出力の解析中にエラーが発生しました。
ko: az --version의 출력을 구문 분석하는 동안 오류가 발생했습니다.
pt_br: Erro ao analisar a saída de az --version.
ru: При анализе выходных данных az --version произошла ошибка.
zh_hans: 分析 az --version 的输出时出错。
zh_hant: 剖析 az --version 的輸出時發生錯誤。

# az.azOutputParseErrorCaught
source: An error occurred while parsing the output of az command: {0}. The output is not JSON.
de: Fehler beim Analysieren der Ausgabe des az-Befehls: {0}. Die Ausgabe ist nicht JSON.
es: Se ha producido un error al analizar la salida del comando az: {0}. La salida no es JSON.
fr: Une erreur s’est produite lors de l’analyse de la sortie de la commande az : {0}. La sortie n’est pas JSON.
it: Si è verificato un errore durante l'analisi dell'output del comando az: {0}. L'output non è JSON.
ja: az コマンド {0} の出力の解析中にエラーが発生しました。出力は JSON ではありません。
ko: az 명령의 출력을 구문 분석하는 동안 오류가 발생했습니다: {0}. 출력은 JSON이 아닙니다.
pt_br: Erro ao analisar a saída do comando Az: {0}. A saída não é JSON.
ru: Произошла ошибка при анализе выходных данных команды az: {0}. Выходные данные не соответствуют формату JSON.
zh_hans: 分析 az 命令 {0} 的输出时出错。输出不是 JSON。
zh_hant: 剖析 az 命令的輸出時發生錯誤: {0}。輸出不是 JSON。

# az.askLater
source: Ask Later
de: Später fragen
es: Preguntar más tarde
fr: Demander plus tard
it: Chiedi più tardi
ja: 後で依頼する
ko: 나중에 물어보기
pt_br: Perguntar mais tarde
ru: Спросить позже
zh_hans: 稍后询问
zh_hant: 稍後再問我

# az.az
source: Azure CLI
es: CLI de Azure
it: Interfaccia della riga di comando di Azure
pt_br: CLI do Azure

# az.missingRequiredVersion
source: Azure CLI >= {0} is required for this feature. Run the 'Azure CLI: Check for Update' command to install this and then try again.
de: Azure CLI >= {0} ist für diese Funktion erforderlich. Führen Sie den Befehl „Azure CLI: Nach Updates suchen“ aus, um sie zu installieren, und wiederholen Sie dann den Vorgang.
es: LA CLI de Azure >= {0} es necesaria para esta función. Ejecute el comando \"CLI de Azure: buscar actualizaciones\" para instalarlo e inténtelo de nuevo.
fr: Azure CLI >= {0} est requis pour cette fonctionnalité. Exécutez la commande « Azure CLI : rechercher les mises à jour » pour l’installer, puis réessayez.
it: L'interfaccia della riga di comando di Azure >= {0} è necessaria per questa funzionalità. Eseguire il comando 'Interfaccia della riga di comando di Azure: check for Update' per installare questa opzione e riprovare.
ja: この機能には、Azure CLI >= {0} が必要です。'Azure CLI: Check for Update' コマンドを実行してからこれをインストールして、もう一度お試しください。
ko: 이 기능에는 Azure CLI >= {0}이(가) 필요합니다. 'Azure CLI: 업데이트 확인' 명령을 실행하여 이를 설치한 다음 다시 시도하세요.
pt_br: A CLI do Azure >= {0} é necessária para esse recurso. Execute o comando 'Azure CLI: Check for Update' para instalá-lo e tente novamente.
ru: Для этой функции требуется Azure CLI >= {0}. Запустите команду \"Azure CLI: проверка на наличие обновления\", чтобы установить ее, а затем повторите попытку.
zh_hans: Azure CLI >= {0} 是此功能所必需的。运行 “Azure CLI: 检查更新” 命令以安装此版本，然后重试。
zh_hant: 此功能需要 Azure CLI >= {0}。請執行 'Azure CLI: Check for Update' 命令安裝它，然後再試一次。

# az.azUserSettingReadLog
source: Azure CLI user setting: {0}.{1} read, value: {2}
de: Benutzereinstellung für Azure CLI: {0}.{1} lesen, Wert: {2}
es: Configuración del usuario de la CLI de Azure: {0}.{1}valor leído: {2}
fr: Paramètre utilisateur Azure CLI : {0}.{1} lire, valeur : {2}
it: Configurazione utente dell'interfaccia della riga di comando di Azure: {0}.{1} lettura, valore: {2}
ja: Azure CLI のユーザー設定: {0}。{1} が読み取られ、値: {2}
ko: Azure CLI 사용자 설정: {0}.{1} 읽기, 값: {2}
pt_br: Configuração de usuário da CLI do Azure: {0}.{1}leitura, valor: {2}
ru: Пользовательский параметр Azure CLI: {0}.{1} чтение, значение: {2}
zh_hans: Azure CLI 用户设置: {0}.{1} 读取，值: {2}
zh_hant: Azure CLI 使用者設定: {0}.{1} 讀取，值: {2}

# az.azUserSettingUpdatedLog
source: Azure CLI user setting: {0}.{1} updated, newValue: {2}
de: Benutzereinstellung für Azure CLI: {0}.{1} aktualisiert, neuer Wert: {2}
es: Configuración del usuario de la CLI de Azure: {0}.{1}actualizado, newValue: {2}
fr: Paramètre utilisateur Azure CLI : {0}.{1} mis à jour, newValue : {2}
it: Configurazione utente dell'interfaccia della riga di comando di Azure: {0}.{1} aggiornata, newValue: {2}
ja: Azure CLI のユーザー設定: {0}。{1} が更新され、newValue: {2}
ko: Azure CLI 사용자 설정: {0}.{1} 업데이트됨, newValue: {2}
pt_br: Configuração do usuário da CLI do Azure: {0}.{1}atualizado, newValue: {2}
ru: Пользовательский параметр Azure CLI: {0}. {1} обновлено, newValue: {2}
zh_hans: Azure CLI 用户设置: 已更新 {0}.{1}，newValue: {2}
zh_hant: Azure CLI 使用者設定: {0}.{1} 已更新，新值: {2}

# az.azInstalled
source: Azure CLI was successfully installed. Restarting Azure Studio is required to complete configuration - features will not be activated until this is done.
de: Azure CLI wurde erfolgreich installiert. Azure Studio muss neu gestartet werden, um die Konfiguration abzuschließen. Die Funktionen werden erst danach aktiviert.
es: La CLI de Azure se ha instalado correctamente. Es necesario reiniciar Azure Studio para completar la configuración; las funciones no se activarán hasta que se realice esta acción.
fr: Azure CLI a été installé avec succès. Le redémarrage d’Azure Studio est nécessaire pour terminer la configuration – les fonctionnalités ne seront pas activées tant que cela ne sera pas fait.
it: L’installazione dell'interfaccia della riga di comando di Azure completata. Il riavvio di Azure Studio è necessario per completare la configurazione. Le funzionalità non verranno attivate fino a quando l’operazione non verrà completata.
ja: Azure CLI が正常にインストールされました。構成を完了するには、Azure Studio を再起動する必要があります。この操作が完了するまで、機能はアクティブ化されません。
ko: Azure CLI가 성공적으로 설치되었습니다. 구성을 완료하려면 Azure Studio를 다시 시작해야 합니다. 이 작업이 완료될 때까지 기능이 사용하도록 설정되지 않습니다.
pt_br: A CLI do Azure foi instalada com êxito. A reinicialização do Azure Studio é necessária para concluir a configuração. Os recursos não serão ativados até que isso seja feito.
ru: Служба Azure CLI успешно установлена. Перезапуск Azure Studio необходим для завершения настройки — функции не будут активированы, пока это не будет сделано.
zh_hans: 已成功安装 Azure CLI。需要重启 Azure Studio 才能完成配置 - 在完成此操作之前，将不会激活功能。
zh_hant: 已成功安裝 Azure CLI。需要重新啟動 Azure Studio 才能完成設定 - 除非完成此作業，否則功能將不會啟用。

# az.checkingLatestAzVersion
source: Checking for latest available version of Azure CLI
de: Es wird nach der neuesten verfügbaren Azure CLI-Version gesucht
es: Comprobación de la última versión disponible de la CLI de Azure
fr: Vérification de la dernière version disponible d'Azure Data CLI
it: Verifica della disponibilità della versione più recente dell'interfaccia della riga di comando di Azure
ja: Azure CLI の使用可能な最新バージョンを確認しています
ko: 사용 가능한 최신 Azure CLI 버전 확인
pt_br: Verificando a versão mais recente disponível da CLI do Azure
ru: Проверка наличия последней доступной версии Azure CLI
zh_hans: 正在检查最新可用版本的 Azure CLI
zh_hant: 正在檢查 Azure CLI 最新可用的版本

# az.couldNotFindAzWithPrompt
source: Could not find Azure CLI, install it now? If not then some features will not be able to function.
de: Azure CLI wurde nicht gefunden. Möchten Sie es jetzt installieren? Wenn nicht, könnten einige Features nicht funktionieren.
es: No pudo encontrar la CLI de Azure, ¿desea instalarla ahora? Si no es así, algunas características podrían no funcionar.
fr: Impossible de trouver Azure CLI, installez-le maintenant ? Sinon, certaines fonctionnalités ne pourront pas fonctionner.
it: Non è stato possibile trovare l'interfaccia della riga di comando di Azure. Installarla ora? In caso contrario, alcune funzionalità non saranno in grado di funzionare.
ja: Azure CLI が見つかりませんでした。今すぐインストールしますか? そうでない場合は、一部の機能が動作しない可能性があります。
ko: Azure CLI를 찾을 수 없습니다. 지금 설치하시겠습니까? 그렇지 않으면 일부 기능이 작동하지 않습니다.
pt_br: Não foi possível localizar a CLI do Azure. Deseja instalar agora? Caso contrário, alguns recursos poderão não funcionar.
ru: Не удалось найти Azure CLI, установить сейчас? Если нет, то некоторые функции не смогут работать.
zh_hans: 找不到 Azure CLI，是否立即安装? 如果不安装，则某些功能将无法正常工作。
zh_hant: 找不到 Azure CLI，要立即安裝嗎? 否則，某些功能將無法運作。

# az.couldNotFindAz
source: Could not find Azure CLI. Error: {0}
de: Azure CLI wurde nicht gefunden. Fehler: {0}
es: No se pudo encontrar la CLI de Azure CLI. Error: {0}
fr: Impossible de trouver Azure CLI. Erreur : {0}
it: Non è stato possibile trovare l'interfaccia della riga di comando di Azure. Errore: {0}
ja: Azure CLI が見つかりませんでした。エラー: {0}
ko: Azure CLI 찾을 수 없습니다. 오류: {0}
pt_br: Não foi possível localizar a CLI do Azure. Erro: {0}
ru: Не удалось найти Azure CLI. Ошибка: {0}
zh_hans: 找不到 Azure CLI。错误: {0}
zh_hant: 找不到 Azure CLI。錯誤: {0}

# az.couldNotFindArcdataWithPrompt
source: Could not find the Azure CLI arcdata extension, install it now? If not then some features will not be able to function.
de: Die Azure CLI arcdata-Erweiterung wurde nicht gefunden. Möchten Sie sie jetzt installieren? Wenn nicht, funktionieren einige Features u. U. nicht.
es: No se ha podido encontrar la extensión arcdata de la CLI de Azure, instálela ahora. Si no es así, algunas funciones podrían no funcionar.
fr: Impossible de trouver l’extension arcdata Azure CLI, installez-la maintenant ? Sinon, certaines fonctionnalités ne pourront pas fonctionner.
it: Non è stato possibile trovare l'estensione arcdata dell'interfaccia della riga di comando di Azure. Installarla ora? In caso contrario, alcune funzionalità non saranno in grado di funzionare.
ja: Azure CLI arcdata 拡張機能が見つかりませんでした。今すぐインストールしますか? そうでない場合は、一部の機能が動作しない可能性があります。
ko: Azure CLI arcdata 확장을 찾을 수 없습니다. 지금 설치하시겠습니까? 그렇지 않으면 일부 기능이 작동하지 않을 수 있습니다.
pt_br: Não foi possível localizar a extensão arcdata da CLI do Azure. Deseja instalar agora? Caso contrário, alguns recursos poderão não funcionar.
ru: Не удалось найти расширение arcdata для Azure CLI, установить сейчас? Если нет, то некоторые функции не смогут работать.
zh_hans: 找不到 Azure CLI arcdata 扩展，是否立即安装? 如果不安装，某些功能将无法正常工作。
zh_hant: 找不到 Azure CLI arcdata 延伸模組，要立即安裝嗎? 否則，某些功能將無法運作。

# az.couldNotFindAzArc
source: Could not find the Azure CLI arcdata extension. Error: {0}
de: Die Azure CLI arcdata-Erweiterung wurde nicht gefunden. Fehler: {0}
es: No se ha podido encontrar la extensión arcdata dela CLI de Azure. Error: {0}
fr: Impossible de trouver l’extension arcdata Azure CLI. Erreur : {0}
it: Non è stato possibile trovare l'estensione arcdata dell'interfaccia della riga di comando di Azure. Errore: {0}
ja: Azure CLI arcdata 拡張機能が見つかりませんでした。エラー: {0}
ko: Azure CLI arcdata 확장을 찾을 수 없습니다. 오류: {0}
pt_br: Não foi possível localizar a extensão arcdata da CLI do Azure. Erro: {0}
ru: Не удалось найти расширение arcdata для Azure CLI. Ошибка: {0}
zh_hans: 找不到 Azure CLI arcdata 扩展。错误: {0}
zh_hant: 找不到 Azure CLI arcdata 延伸模組。錯誤: {0}

# az.currentlyInstalledVersionIsLatest
source: Currently installed version of Azure CLI: {0} is same or newer than any other version available
de: Aktuell installierte Azure CLI-Version {0} ist gleich oder neuer als alle anderen verfügbaren Versionen
es: La versión actualmente instalada de la CLI de Azure: {0} es igual o más nueva que cualquier otra versión disponible
fr: Version actuellement installée d’Azure CLI : {0} est identique ou plus récente que toute autre version disponible
it: La versione attualmente installata dell'interfaccia della riga di comando di Azure: {0} è uguale o successiva a qualsiasi altra versione disponibile
ja: 現在インストールされている Azure CL {0} は、使用可能な他のバージョンと同じか、それより新しいバージョンです
ko: 현재 설치된 Azure CLI 버전: {0}은(는) 사용 가능한 다른 버전과 동일하거나 최신 버전입니다.
pt_br: Versão atualmente instalada da CLI do Azure: {0} é igual ou mais recente do que qualquer outra versão disponível
ru: Установленная в настоящее время версия Azure CLI: {0} или более новая, чем любая другая доступная версия
zh_hans: 当前安装的 Azure CLI 版本 {0} 与任何其他可用版本相同或更新
zh_hant: 目前安裝的 Azure CLI 版本 {0} 與其他可用版本相同或更新

# az.decline
source: Decline
de: Ablehnen
es: Rechazar
fr: Refuser
it: Rifiuta
ja: 同意しない
ko: 감소
pt_br: Recusar
ru: Отклонить
zh_hans: 拒绝
zh_hant: 拒絕

# az.doNotAskAgain
source: Don't Ask Again
de: Nicht mehr fragen
es: No volver a preguntar
fr: Ne plus me poser la question
it: Non chiedere più
ja: 今後このメッセージを表示しない
ko: 다시 묻지 않음
pt_br: Não perguntar novamente
ru: Больше не спрашивать
zh_hans: 不再询问
zh_hant: 不要再詢問

# az.downloadFinished
source: Download finished
de: Download abgeschlossen
es: Descarga finalizada
fr: Téléchargement terminé
it: Download completato
ja: ダウンロードが完了しました
ko: 다운로드 완료
pt_br: Download concluído
ru: Загрузка завершена
zh_hans: 已完成下载
zh_hant: 下載完成

# az.downloadingProgressMb
source: Downloading ({0} / {1} MB)
de: ({0} / {1} MB) wird heruntergeladen
es: Descargando ({0} / {1} MB)
fr: Téléchargement ({0} / {1} Mo)
it: Downloading di ({0}/{1}MB)
ja: ダウンロード中 ({0} / {1} MB)
ko: 다운로드 중({0}/{1}MB)
pt_br: Baixando ({0} / {1} MB)
ru: Выполняется скачивание ({0} / {1} МБ)
zh_hans: 正在下载({0} / {1} MB)
zh_hant: 正在下載 ({0} / {1} MB)

# az.downloadingTo
source: Downloading {0} from {1} to {2}
de: {0} von {1} wird nach {2} heruntergeladen
es: Descargando {0} de {1} a {2}
fr: Téléchargement de {0} à partir de {1} vers {2}
it: Downloading {0} da {1} a {2} in corso
ja: {0} を {1} から {2} にダウンロードしています
ko: {0}을(를) {1}에서 {2}(으)로 다운로드하는 중
pt_br: Baixando {0} de {1} para {2}
ru: Идет скачивание {0} из {1} в {2}
zh_hans: 正在将 {0} 从 {1} 下载到 {2}
zh_hant: 正在將 {0} 從 {1} 下載到 {2}

# az.endpointOrNamespaceRequired
source: Either an endpoint or a namespace must be specified
de: Es muss entweder ein Endpunkt oder ein Namespace angegeben werden
es: Se debe especificar un punto de conexión o un espacio de nombres
fr: Un point de terminaison ou un espace de noms doit être spécifié
it: È necessario specificare un endpoint o uno spazio dei nomi
ja: エンドポイントまたは名前空間のいずれかを指定しなければなりません
ko: 엔드포인트 또는 네임스페이스를 지정해야 합니다.
pt_br: Um ponto de extremidade ou um namespace deve ser especificado
ru: Необходимо указать конечную точку или пространство имен
zh_hans: 必须指定终结点或命名空间
zh_hant: 必須指定端點或命名空間

# az.installError
source: Error installing Azure CLI and arcdata extension: {0}
de: Fehler beim Installieren der Azure CLI und arcdata-Erweiterung: {0}
es: Error al instalar la CLI de Azure y la extensión arcdata: {0}
fr: Erreur lors de l’installation d’Azure CLI et de l’extension arcdata : {0}
it: Si è verificato un errore durante l'installazione dell'interfaccia della riga di comando di Azure e dell'estensione arcdata: {0}
ja: Azure CLI と arcdata 拡張機能のインストール中にエラーが発生しました: {0}
ko: Azure CLI 및 arcdata 확장 설치 오류: {0}
pt_br: Erro ao instalar a CLI do Azure e a extensão arcdata: {0}
ru: Ошибка при установке Azure CLI и расширения arcdata: {0}
zh_hans: 安装 Azure CLI 和 arcdata 扩展时出错: {0}
zh_hant: 安裝 Azure CLI 和 arcdata 延伸模組時發生錯誤: {0}

# az.updateError
source: Error updating Azure CLI: {0}
de: Fehler beim Aktualisieren der Azure CLI: {0}
es: Error al actualizar la CLI de Azure: {0}
fr: Erreur lors de la mise à jour d’Azure CLI : {0}
it: Errore durante l'aggiornamento dell'interfaccia della riga di comando di Azure: {0}
ja: Azure CLI を更新中に発生したエラー: {0}
ko: Azure CLI 업데이트 오류: {0}
pt_br: Erro ao atualizar o CLI do Azure: {0}
ru: Ошибка при обновлении Azure CLI: {0}
zh_hans: 更新 Azure CLI 时出错: {0}
zh_hant: 更新 Azure CLI 時發生錯誤: {0}

# az.downloadError
source: Error while downloading
de: Fehler beim Herunterladen
es: Error al descargar
fr: Erreur lors du téléchargement
it: Si è verificato un errore durante il download
ja: ダウンロード中のエラー
ko: 다운로드하는 동안 오류 발생
pt_br: Erro durante o download
ru: Ошибка при скачивании
zh_hans: 下载时出错
zh_hant: 下載時發生錯誤

# az.executingCommand
source: Executing command: '{0} {1}'
de: Der Befehl „{0} {1}“ wird ausgeführt
es: Ejecutando el comando: “{0} {1}”
fr: Exécution de la commande : « {0} {1} »
it: Esecuzione del comando: '{0} {1}‘
ja: コマンドの実行中: '{0} {1}'
ko: 명령 실행 중: '{0} {1}'
pt_br: Executando comando: '{0}{1}'
ru: Выполняется команда: \"{0} {1}\"
zh_hans: 正在执行命令:“{0} {1}”
zh_hant: 正在執行命令: '{0} {1}'

# az.failedToParseReleaseInfo
source: Failed to parse the JSON of contents at: {0}. File contents: {1} Error: {2}
de: Fehler beim Analysieren der JSON-Inhalte unter: {0}. Dateiinhalte: {1} Fehler: {2}
es: No se pudo analizar el JSON del contenido en: {0}. Contenido del archivo: {1} Error: {2}
fr: Échec de l'analyse du JSON du contenu à : {0}. Contenu du fichier : {1} Erreur : {2}
it: Non è stato possibile analizzare il JSON dei contenuti in: {0}. Contenuti file: {1} Errore: {2}
ja: {0} でコンテンツの JSON を解析できませんでした。 ファイル コンテンツ: {1} エラー: {2}
ko: {0}에서 콘텐츠의 JSON을 구문 분석하지 못했습니다. 파일 내용: {1} 오류: {2}
pt_br: Falha ao analisar o JSON de conteúdo em: {0}. Conteúdo do arquivo: {1} Erro: {2}
ru: Не удалось проанализировать JSON содержимого: в: {0}. Содержимое файла: {1} Ошибка: {2}
zh_hans: 未能分析 {0} 处内容的 JSON。 文件内容: {1} 错误: {2}
zh_hant: 無法剖析位於: {0} 的內容 JSON。 檔案內容: {1} 錯誤: {2}

# az.foundExistingAz
source: Found existing Azure CLI installation of version (v{0}) at path:{1} with arcdata version: {2}.
de: Es wurde eine vorhandene Azure CLI-Installation der Version (v{0}) unter dem Pfad „{1}“ mit der arcdata-Version {2} gefunden.
es: Se encontró la instalación existente de la CLI de Azure de la versión (v{0}) en la ruta:{1} con la versión arcdata: {2}.
fr: Installation Azure CLI existante de la version (v{0}) trouvée dans le chemin :{1} avec la version arcdata : {2}.
it: È stata trovata l'installazione dell'interfaccia della riga di comando di Azure esistente della versione (v{0}) nel percorso:{1} con versione arcdata: {2}.
ja: バージョン (v{0}) の既存の Azure CLI のインストールが、arcdata バージョン {2} を持つパス {1} で見つかりました。
ko: arcdata 버전이 {2}인 경로:{1}에서 버전(v{0})의 기존 Azure CLI 설치를 찾았습니다.
pt_br: Foi encontrada uma instalação de CLI do Azure existente da versão (v{0}) no caminho:{1} com a versão do arcdata: {2}.
ru: Найдена существующая установка Azure CLI версии (v{0}) по пути {1} с версией arcdata {2}.
zh_hans: 在 arcdata 版本为 {2} 的路径 {1} 处找到现有 Azure CLI 安装(版本为 v{0})。
zh_hant: 在路徑 {1} 中找到版本 (v{0}) 的現有 Azure CLI 安裝，arcdata 版本為 {2}。

# az.versionForUpdate
source: Found version: {0} that Azure CLI can be updated to from current version: {1}.
de: Gefundene Version: {0}, auf die die Azure CLI von der aktuellen Version {1} aktualisiert werden kann.
es: Versión encontrada: {0} a la que se puede actualizar la CLI de Azure desde la versión actual: {1}.
fr: Version trouvée : {0} vers laquelle Azure Data CLI peut être mis à jour à partir de la version actuelle : {1}.
it: Versione trovata: {0} alla quale è possibile aggiornare l'interfaccia della riga di comando di Azure dalla versione corrente: {1}.
ja: バージョン {0} が見つかりました。Azure CLI は、現在のバージョンから {1} を更新できます。
ko: 발견된 버전: {0}, 현재 버전: {1}에서 Azure CLI를 업데이트할 수 있습니다.
pt_br: Versão encontrada: {0} a CLI do Azure pode ser atualizada da versão atual: {1}.
ru: Найдена версия {0}, до которой можно обновить Azure CLI с текущей версии {1}.
zh_hans: 找到的版本为 {0}。Azure CLI 可以从当前版本 {1} 更新到此版本。
zh_hant: 找到 Azure CLI 可從目前版本 {1} 更新的版本 {0}。

# az.gettingTextContentsOfUrl
source: Getting text contents of resource at URL {0}
de: Textinhalte der Ressource werden unter URL {0} abgerufen
es: Obteniendo el contenido de texto del recurso en la dirección URL {0}
fr: Obtention du contenu textuel de la ressource à l’URL {0}
it: Recupero dei contenuti di testo della risorsa all'URL {0}
ja: URL {0} でリソースのテキスト コンテンツを取得しています
ko: URL {0}에서 리소스의 텍스트 콘텐츠를 가져오고 있습니다.
pt_br: Obtendo conteúdo de texto do recurso em URL {0}
ru: Получение текстового содержимого ресурса по URL-адресу {0}
zh_hans: 正在获取位于 URL {0} 的资源的文本内容
zh_hant: 正在取得位於 URL {0} 之資源的文字內容

# az.installingAz
source: Installing Azure CLI...
de: Azure CLI wird installiert…
es: Instalando la CLI de Azure...
fr: Installation d’Azure CLI...
it: Installazione dell'interfaccia della riga di comando di Azure in corso...
ja: Azure CLI をインストールしています...
ko: Azure CLI 설치 중...
pt_br: Instalando a CLI do Azure…
ru: Установка Azure CLI...
zh_hans: 正在安装 Azure CLI...
zh_hant: 正在安裝 Azure CLI...

# az.installingArcdata
source: Installing the Azure CLI arcdata extension...
de: Die Azure CLI arcdata-Erweiterung wird installiert...
es: Instalación de la extensión arcdata de la CLI de Azure...
fr: Installation de l’extension arcdata Azure CLI...
it: Installazione dell'estensione arcdata dell'interfaccia della riga di comando di Azure in corso...
ja: Azure CLI arcdata 拡張機能をインストールしています...
ko: Azure CLI arcdata 확장 설치 중...
pt_br: Instalando a extensão arcdata da CLI do Azure...
ru: Установка расширения arcdata для Azure CLI...
zh_hans: 正在安装 Azure CLI arcdata 扩展...
zh_hant: 正在安裝 Azure CLI arcdata 延伸模組...

# az.latestAzVersionAvailable
source: Latest available Azure CLI version: {0}.
de: Neueste verfügbare Azur CLI-Version: {0}.
es: Última versión disponible de la CLI de Azure: {0}.
fr: Dernière version disponible de l’interface Azure Data CLI : {0}.
it: Ultima versione disponibile dell’interfaccia della riga di comando di Azure: {0}.
ja: Azure CLI の最新バージョン: {0}。
ko: 사용 가능한 최신 Azure CLI 버전: {0}.
pt_br: Versão mais recente da CLI do Azure: {0}.
ru: Последняя доступная версия Azure CLI: {0}.
zh_hans: 最新可用 Azure CLI 版本: {0}。
zh_hant: 最新可用的 Azure CLI 版本: {0}。

# az.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# az.noAzArc
source: No Azure CLI arcdata extension is available.
de: Es ist keine Azure CLI arcdata-Erweiterung verfügbar.
es: No está disponible la extensión arcdata de la CLI de Azure.
fr: Aucune extension arcdata Azure CLI n’est disponible.
it: Non è disponibile alcuna estensione arcdata dell'interfaccia della riga di comando di Azure.
ja: 使用可能な Azure CLI arcdata 拡張機能がありません。
ko: Azure CLI arcdata 확장을 사용할 수 없습니다.
pt_br: Nenhuma extensão de arcdata da CLI do Azure está disponível.
ru: Расширение arcdata для Azure CLI недоступно.
zh_hans: 没有可用的 Azure CLI arcdata 扩展。
zh_hant: 沒有可用的 Azure CLI arcdata 延伸模組。
