Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

source: Connection error
de: Verbindungsfehler
es: Error de conexión
fr: Erreur de connexion
it: Errore di connessione
ja: 接続エラー
ko: 연결 오류
pt_br: Erro de conexão
ru: Ошибка подключения
zh_hans: 连接错误
zh_hant: 連線錯誤

source: Enable Trust server certificate
de: Vertrauensserverzertifikat aktivieren
es: Habilitar certificado de servidor de confianza
fr: Activer Faire confiance au certificat de serveur
it: Abilitare Certificato del server attendibile
ja: 信頼サーバー証明書を有効にする
ko: 신뢰 서버 인증서 활성화
pt_br: Certificado do servidor de confiança
ru: Доверять сертификату сервера
zh_hans: 启用信任服务器证书
zh_hant: 啟用信任伺服器憑證

# trustServerCertInstructionText
source: Encryption was enabled on this connection, review your SSL and certificate configuration for the target SQL Server, or enable 'Trust server certificate' in the connection dialog. Note: A self-signed certificate offers only limited protection and is not a recommended practice for production environments. Do you want to enable 'Trust server certificate' on this connection and retry?
de: Die Verschlüsselung wurde für diese Verbindung aktiviert, überprüfen Sie Ihre SSL- und Zertifikatkonfiguration für die Ziel-SQL Server, oder aktivieren Sie "Serverzertifikat vertrauen" im Verbindungsdialogfeld. Hinweis: Ein selbstsigniertes Zertifikat bietet nur eingeschränkten Schutz und ist keine empfohlene Vorgehensweise für Produktionsumgebungen. Möchten Sie "Serverzertifikat vertrauen" für diese Verbindung aktivieren und es erneut versuchen?
es: Se habilitó el cifrado en esta conexión, revise la configuración de SSL y certificado para el servidor SQL Server de destino o habilite “Certificado de servidor de confianza” en el cuadro de diálogo de conexión. Nota: Un certificado autofirmado solo ofrece una protección limitada y no es una práctica recomendada para entornos de producción. ¿Desea habilitar “Certificado de servidor de confianza” en esta conexión y reintentar?
fr: Le chiffrement a été activé sur cette connexion, passez en revue votre configuration SSL et de certificat pour le SQL Server cible, ou activez « Certificat de serveur d’approbation » dans la boîte de dialogue de connexion. Remarque : un certificat auto-signé offre uniquement une protection limitée et n’est pas une pratique recommandée pour les environnements de production. Voulez-vous activer le « certificat de serveur d’approbation » sur cette connexion et réessayer ?
it: La crittografia è stata abilitata in questa connessione, rivedere la configurazione SSL e del certificato per SQL Server di destinazione o abilitare 'Considerare attendibile il certificato del server' nella finestra di dialogo di connessione. Nota: un certificato autofirmato offre solo una protezione limitata e non è una procedura consigliata per gli ambienti di produzione. Abilitare 'Considerare attendibile il certificato del server' in questa connessione e riprovare?
ja: この接続で暗号化が有効になっていました。ターゲットの SQL Server の SSL と証明書の構成を確認するか、接続ダイアログで [サーバー証明書を信頼] を有効にします。 注意: 自己署名証明書では限定的な保護しか提供されないので、運用環境では推奨されません。この接続で [サーバー証明書を信頼] を有効にして再試行しますか?
ko: 이 연결에 암호화를 사용합니다. 대상 SQL Server의 SSL과 인증서 구성을 검토하거나, 연결 대화에서 '신뢰할 수 있는 서버 인증서'를 활성화하세요. 참고: 자체 서명된 인증서는 제한된 보호만 제공하며 프로덕션 환경에서는 권장되지 않습니다. 이 연결에서 '신뢰할 수 있는 서버 인증서'를 활성화하고 다시 시도하시겠어요?
pt_br: A criptografia foi habilitada nesta conexão, examine sua configuração de SSL e certificado para a configuração de SQL Server, ou habilite "Certificado do servidor de confiança" na caixa de diálogo de conexão. Observação: um certificado autoassinado oferece apenas proteção limitada e não é uma prática recomendada para ambientes de produção. Deseja habilitar o "Certificado do servidor de confiança" nesta conexão e tentar novamente?
ru: Для этого подключения включено шифрование. Проверьте конфигурацию SSL и сертификата для целевого SQL Server или включите "Доверять сертификату сервера" в диалоговом окне подключения. Примечание. Самозаверяющий сертификат обеспечивает только ограниченную защиту и не рекомендуется для рабочих сред. Вы хотите включить "Доверять сертификату сервера" для этого подключения и повторить попытку?
zh_hans: 已在此连接上启用加密，请查看目标 SQL Server 的 SSL 和证书配置，或在连接对话框中启用“信任服务器证书”。 注意: 自签名证书仅提供有限的保护，且不建议用于生产环境。是否要在此连接上启用“信任服务器证书”，然后重试?
zh_hant: 已在此連線上啟用加密、檢閱目標 SQL Server 的 SSL 與憑證設定，或在連線對話方塊中啟用 [信任伺服器憑證]。 注意: 自我簽署憑證只提供有限的保護，且不是實際執行環境的建議做法。您要在此連線上啟用 [信任伺服器憑證] 並重試嗎?

# mssql.missingLinkedAzureAccount
source: Azure Data Studio needs to contact Azure Key Vault to access a column master key for Always Encrypted, but no linked Azure account is available. Please add a linked Azure account and retry the query.
de: Azure Data Studio muss Azure Key Vault kontaktieren, um auf einen Spaltenhauptschlüssel für Always Encrypted zuzugreifen, aber es ist kein verknüpftes Azure-Konto verfügbar. Fügen Sie ein verknüpftes Azure-Konto hinzu, und wiederholen Sie die Abfrage.
es: Azure Data Studio debe ponerse en contacto con Azure Key Vault para acceder a la clave maestra de una columna para Always Encrypted, pero no hay ninguna cuenta de Azure vinculada disponible. Agregue una cuenta de Azure vinculada y vuelva a intentar realizar la consulta.
fr: Azure Data Studio doit contacter Azure Key Vault pour accéder à une clé principale de colonne pour Always Encrypted, mais aucun compte Azure lié n'est disponible. Ajoutez un compte Azure lié et réessayez la requête.
it: Azure Data Studio deve contattare Azure Key Vault per accedere a una chiave master di colonna per Always Encrypted, ma non è disponibile alcun account Azure collegato. Aggiungere un account Azure collegato e ripetere la query.
ja: Azure Data Studio では、Always Encrypted の列マスター キーにアクセスするために Azure Key Vault に接続する必要がありますが、リンクされた Azure アカウントがありません。リンクされた Azure アカウントを追加して、クエリを再試行してください。
ko: Azure Data Studio는 Always Encrypted의 열 마스터 키에 액세스하려면 Azure Key Vault에 연결해야 하지만, 연결된 Azure 계정을 사용할 수 없습니다. 연결된 Azure 계정을 추가하고 쿼리를 다시 시도하세요.
pt_br: O Azure Data Studio precisa entrar em contato com o Azure Key Vault para acessar uma chave mestra de coluna para Always Encrypted, mas nenhuma conta vinculada do Azure está disponível. Adicione uma conta vinculada do Azure e tente a consulta novamente.
ru: Azure Data Studio необходимо связаться с Azure Key Vault для доступа к главному ключу столбца для Always Encrypted, но связанная учетная запись Azure недоступна. Добавьте связанную учетную запись Azure и повторите запрос.
zh_hans: Azure Data Studio 需要连接 Azure Key Vault 才能访问 Always Encrypted 的列主密钥，但没有可用的链接 Azure 帐户。请添加链接的 Azure 帐户，然后重试查询。
zh_hant: Azure Data Studio 必須連絡 Azure Key Vault 以存取 Always Encrypted 的資料行主要金鑰，但沒有任何已連結的 Azure 帳戶可供使用。請新增已連結的 Azure 帳戶，然後重試一次此查詢。

# mssql.canceledLinkedAzureAccountSelection
source: Azure Data Studio needs to contact Azure Key Vault to access a column master key for Always Encrypted, but no linked Azure account was selected. Please retry the query and select a linked Azure account when prompted.
de: Azure Data Studio muss Azure Key Vault kontaktieren, um auf einen Spaltenhauptschlüssel für Always Encrypted zuzugreifen, aber es wurde kein verknüpftes Azure-Konto ausgewählt. Wiederholen Sie die Abfrage, und wählen Sie bei Aufforderung ein verknüpftes Azure-Konto aus.
es: Azure Data Studio debe ponerse en contacto con Azure Key Vault para acceder a la clave maestra de una columna para Always Encrypted, pero no se ha seleccionado ninguna cuenta de Azure vinculada. Vuelva a intentar realizar la consulta y, cuando se le solicite, seleccione una cuenta de Azure vinculada.
fr: Azure Data Studio doit contacter Azure Key Vault pour accéder à une clé principale de colonne pour Always Encrypted, mais aucun compte Azure lié n'a été sélectionné. Réessayez la requête et sélectionnez un compte Azure lié quand vous y êtes invité.
it: Azure Data Studio deve contattare Azure Key Vault per accedere a una chiave master di colonna per Always Encrypted, ma non è stato selezionato alcun account Azure collegato. Ripetere la query e selezionare un account Azure collegato quando richiesto.
ja: Azure Data Studio では、Always Encrypted の列マスター キーにアクセスするために Azure Key Vault に接続する必要がありますが、リンクされた Azure アカウントが選択されていません。クエリを再試行して、メッセージが表示されたら、リンクされた Azure アカウントを選択してください。
ko: Azure Data Studio는 Always Encrypted의 열 마스터 키에 액세스하려면 Azure Key Vault에 연결해야 하지만, 연결된 Azure 계정을 선택하지 않았습니다. 쿼리를 다시 시도하고 메시지가 표시되면 연결된 Azure 계정을 선택하세요.
pt_br: O Azure Data Studio precisa entrar em contato com o Azure Key Vault para acessar uma chave mestra de coluna para Always Encrypted, mas nenhuma conta vinculada do Azure foi selecionada. Repita a consulta e selecione uma conta vinculada do Azure quando solicitado.
ru: Azure Data Studio необходимо связаться с Azure Key Vault для доступа к главному ключу столбца для Always Encrypted, но связанная учетная запись Azure не выбрана. Повторите запрос и выберите связанную учетную запись Azure при появлении соответствующего запроса.
zh_hans: Azure Data Studio 需要连接 Azure Key Vault 才能访问 Always Encrypted 的列主密钥，但未选择任何链接的 Azure 帐户。请重试查询，并在出现提示时选择链接的 Azure 帐户。
zh_hant: Azure Data Studio 必須連絡 Azure Key Vault 以存取 Always Encrypted 的資料行主要金鑰，但沒有選取任何已連結的 Azure 帳戶。請重試一次此查詢，並在提示出現時選取已連結的 Azure 帳戶。

# mssql.chooseLinkedAzureAccount
source: Please select a linked Azure account:
de: Wählen Sie ein verknüpftes Azure-Konto aus:
es: Seleccione una cuenta de Azure vinculada:
fr: Sélectionnez un compte Azure lié :
it: Selezionare un account Azure collegato:
ja: リンクされた Azure アカウントを選択してください:
ko: 연결된 Azure 계정을 선택하세요.
pt_br: Selecione uma conta vinculada do Azure:
ru: Выберите связанную учетную запись Azure:
zh_hans: 请选择链接的 Azure 帐户:
zh_hant: 請選取已連結的 Azure 帳戶:

# mssql.insufficientlyPrivelagedAzureAccount
source: The configured Azure account for {0} does not have sufficient permissions for Azure Key Vault to access a column master key for Always Encrypted.
de: Das konfigurierte Azure-Konto für "{0}" verfügt nicht über ausreichende Berechtigungen für Azure Key Vault, um auf einen Spaltenhauptschlüssel für Always Encrypted zuzugreifen.
es: La cuenta de Azure configurada para {0} no tiene suficientes permisos para que Azure Key Vault tenga acceso a una clave maestra de columna para Always Encrypted.
fr: Le compte Azure configuré pour {0} n'a pas les autorisations suffisantes pour permettre à Azure Key Vault d'accéder à une clé principale de colonne pour Always Encrypted.
it: L'account Azure configurato per {0} non ha autorizzazioni sufficienti per Azure Key Vault per accedere alla chiave master di colonna per Always Encrypted.
ja: {0} に構成された Azure アカウントには、Always Encrypted の列マスターキーにアクセスするための Azure Key Vault の十分なアクセス許可がありません。
ko: {0}에 대해 구성된 Azure 계정에 Always Encrypted의 열 마스터 키에 액세스할 수 있는 Azure Key Vault에 대한 권한이 없습니다.
pt_br: A conta do Azure configurada para {0} não tem permissões suficientes para o Azure Key Vault para acessar uma chave mestra de coluna para Always Encrypted.
ru: Настроенная учетная запись Azure для {0} не имеет необходимых разрешений для доступа Azure Key Vault к главному ключу столбца для Always Encrypted.
zh_hans: 为 {0} 配置的 Azure 帐户没有足够的权限让 Azure Key Vault 访问 Always Encrypted 的列主密钥。
zh_hant: 為 {0} 所設定的 Azure 帳戶，沒有足夠的權限讓 Azure Key Vault 存取 Always Encrypted 的資料行主要金鑰。

# mssql.tokenRefreshFailedNoSecurityToken
source: Editor token refresh failed, autocompletion will be disabled until the editor is disconnected and reconnected
de: Fehler bei der Aktualisierung des Editor-Tokens, die automatische Vervollständigung wird deaktiviert, bis der Editor getrennt und die Verbindung erneut hergestellt wurde.
es: Error al actualizar el token del editor; la función de autocompletar se deshabilitará hasta que el editor se desconecte y vuelva a conectarse
fr: Échec de l’actualisation du jeton de l’éditeur. La saisie semi-automatique sera désactivée jusqu’à ce que l’éditeur soit déconnecté et reconnecté.
it: L'aggiornamento del token dell'editor non è riuscito. Il completamento automatico verrà disabilitato fino a quando l’editor non verrà disconnesso e riconnesso
ja: エディター トークンの更新が失敗しました。エディターが切断されて再接続されるまで、オートコンプリートは無効になります
ko: 편집기 토큰 새로 고침에 실패했습니다. 편집기 연결을 끊고 다시 연결할 때까지 자동 완성이 비활성화됩니다.
pt_br: Falha na atualização do token do editor, o preenchimento automático será desativado até que o editor seja desconectado e reconectado
ru: Не удалось обновить токен редактора, автозаполнение будет отключено до тех пор, пока редактор не будет отключен и подключен снова.
zh_hans: 编辑器令牌刷新失败，自动完成将被禁用，直到编辑器断开连接并重新连接
zh_hant: 編輯器權杖重新整理失敗，將會停用自動編譯，直到編輯器中斷連線並重新連線為止

# mssql.failedToFindAccount
source: Failed to find azure account {0} when executing token refresh
de: Fehler beim Suchen des Azure-Kontos {0} beim Ausführen der Tokenaktualisierung.
es: No se pudo encontrar la cuenta de Azure {0} al ejecutar la actualización del token
fr: Le compte Azure {0} est introuvable lors de l’exécution de l’actualisation du jeton.
it: Non è stato possibile trovare l'account Azure {0} durante l'esecuzione dell'aggiornamento del token
ja: トークンの更新時に Azure アカウント {0} が見つかりませんでした
ko: 토큰 새로 고침을 실행할 때 Azure 계정 {0}을(를) 찾지 못했습니다.
pt_br: Falha ao localizar a conta do Azure {0} ao executar a atualização do token
ru: Не удалось найти учетную запись Azure {0} при обновлении токена
zh_hans: 执行令牌刷新时找不到 Azure 帐户 {0}
zh_hant: 執行權杖重新整理時找不到 azure 帳戶 {0}

# mssql.failedToFindTenants
source: Failed to find tenant '{0}' in account '{1}' when refreshing security token
de: Fehler beim Suchen des Mandanten „{0}“ im Konto „{1}“ beim Aktualisieren des Sicherheitstokens.
es: No se pudo encontrar el inquilino '{0}' en la cuenta '{1}' al actualizar el token de seguridad
fr: Impossible de trouver le client '{0}' dans le '{1}' de compte lors de l’actualisation du jeton de sécurité
it: Non è stato possibile trovare il tenant '{0}' nell'account '{1}' durante l'aggiornamento del token di sicurezza
ja: セキュリティ トークンの更新時にアカウント '{1}' にテナント '{0}' が見つかりませんでした
ko: 보안 토큰을 새로 고칠 때 '{1}' 계정에서 '{0}' 테넌트를 찾지 못했습니다.
pt_br: Falha ao localizar o locatário '{0}' na conta '{1}' ao atualizar o token de segurança
ru: Не удалось найти клиент ''{0}'' в учетной записи ''{1}'' при обновлении токена безопасности
zh_hans: 刷新安全令牌时，在帐户 \"{1}\" 中找不到租户 \"{0}\"
zh_hant: 重新整理安全性權杖時，在帳戶 '{1}'中找不到租用戶 '{0}'

# mssql.noDocumentFound
source: No document found for URI {0}
de: Kein Dokument für URI "{0}" gefunden.
es: No se ha encontrado ningún documento para el URI {0}
fr: Aucun document trouvé pour l'URI {0}
it: Non sono stati trovati documenti per l'URI {0}
ja: URI のドキュメントが見つかりません {0}
ko: URI {0}에 대한 문서를 찾을 수 없음
pt_br: Nenhum documento encontrado para URI {0}
ru: Не найден документ для URI {0}
zh_hans: 找不到 URI {0} 文档
zh_hant: 找不到 URI {0} 的文件

# mssql.noConvertResult
source: No result returned from Notebook convert request
de: Von der Notebook-Konvertierungsanforderung wurde kein Ergebnis zurückgegeben.
es: No se ha devuelto ningún resultado de la solicitud de conversión de Notebook
fr: Aucun résultat n'a été renvoyé de la requête de conversion de Notebook
it: Nessun risultato restituito dalla richiesta di conversione del notebook
ja: Notebook 変換要求から結果が返されませんでした
ko: Notebook 변환 요청에서 반환된 결과가 없습니다.
pt_br: Nenhum resultado retornado da solicitação de conversão do Notebook
ru: Запрос на преобразование записной книжки не вернул результатов
zh_hans: 笔记本转换请求未返回任何结果
zh_hant: 筆記本轉換要求未傳回任何結果

# mssql.unsupportedPlatform
source: Unsupported platform {0}
de: Nicht unterstützte Plattform {0}
es: Plataforma no admitida {0}
fr: Plate-forme non prise en charge {0}
it: La piattaforma {0} non è supportata
ja: サポートされていないプラットフォーム {0}
ko: 지원되지 않는 플랫폼 {0}
pt_br: Plataforma sem suporte {0}
ru: Неподдерживаемая платформа {0}
zh_hans: 不受支持的平台 {0}
zh_hant: 不支援的平台 {0}

# mssql.tokenRefreshFailed
source: {0} AAD token refresh failed, please reconnect to enable {0}
de: {0} AAD-Token konnte nicht aktualisiert werden, bitte stellen Sie die Verbindung erneut her, um {0} zu aktivieren.
es: Error al actualizar el token de AAD {0}, vuelva a conectarse para habilitar {0}
fr: {0}L'actualisation du jeton AAD a échoué, reconnectez-vous pour activer {0}.
it: {0} l'aggiornamento del token AAD non è riuscito. Riconnettersi per abilitare {0}
ja: {0} AAD トークンの更新が失敗しました。再接続して {0} を有効にしてください
ko: {0} AAD 토큰 새로 고침에 실패했습니다. {0}을(를) 활성화하려면 다시 연결하세요.
pt_br: {0} Falha na atualização do token AAD, reconecte-se para ativar {0}
ru: {0} Не удалось обновить токен AAD. Пожалуйста, подключитесь повторно, чтобы включить {0}
zh_hans: {0} AAD 令牌刷新失败，请重新连接以启用 {0}
zh_hant: {0} AAD 權杖重新更新失敗，請重新連接以啟用 {0}

# mssql.errorConvertingToSQL
source: An error occurred converting the Notebook document to SQL. Error : {0}
de: Fehler beim Konvertieren des Notebook-Dokuments in SQL: {0}
es: Error al convertir el documento de Notebook a SQL; {0}.
fr: Erreur pendant la conversion du document Notebook au format SQL. Erreur : {0}
it: Si è verificato un errore durante la conversione del documento notebook in SQL. Errore: {0}
ja: ノートブック ドキュメントを SQL に変換中にエラーが発生しました。エラー: {0}
ko: Notebook 문서를 SQL로 변환하는 동안 오류가 발생했습니다. 오류: {0}
pt_br: Ocorreu um erro ao converter o documento do Notebook para SQL. Erro: {0}
ru: Произошла ошибка при преобразовании документа записной книжки в SQL. Ошибка: {0}
zh_hans: 将笔记本文档转换为 SQL 时出错。错误: {0}
zh_hant: 將筆記本文件轉換成 SQL 時發生錯誤。錯誤: {0}

# mssql.errorConvertingToNotebook
source: An error occurred converting the SQL document to a Notebook. Error : {0}
de: Fehler beim Konvertieren des SQL-Dokuments in ein Notebook: {0}
es: Error al convertir el documento de SQL a Notebook; {0}.
fr: Erreur pendant la conversion du document SQL au format Notebook. Erreur : {0}
it: Si è verificato un errore durante la conversione del documento SQL in un notebook. Errore: {0}
ja: SQL ドキュメントをノートブックに変換中にエラーが発生しました。エラー: {0}
ko: SQL 문서를 Notebook으로 변환하는 동안 오류가 발생했습니다. 오류: {0}
pt_br: Ocorreu um erro ao converter o documento SQL em um Notebook. Erro: {0}
ru: Произошла ошибка при преобразовании документа SQL в записную книжку. Ошибка: {0}
zh_hans: 将 SQL 文档转换为笔记本时出错。错误: {0}
zh_hant: 將 SQL 文件轉換成筆記本時發生錯誤。錯誤: {0}

# mssql.reloadChoice
source: Reload Azure Data Studio
de: Azure Data Studio neu laden
es: Vuelva a cargar Azure Data Studio
fr: Recharger Azure Data Studio
it: Scaricare Azure Data Studio
ja: Azure Data Studio の再読み込み
ko: Azure 데이터 스튜디오 다시 로드
pt_br: Recarregar o Azure Data Studio
ru: Перезагрузить Azure Data Studio
zh_hans: 重新加载 Azure Data Studio
zh_hant: 重新載入 Azure Data Studio

# mssql.searchServers
source: Search Server Names
de: Servernamen suchen
es: Buscar nombres de servidor
fr: Rechercher dans les noms de serveur
it: Nomi dei server di ricerca
ja: サーバー名を検索
ko: 서버 이름 검색
pt_br: Nomes de Servidores de Pesquisa
ru: Поиск имен серверов
zh_hans: 搜索服务器名称
zh_hant: 搜尋伺服器名稱

# mssql.reloadPrompt
source: This setting requires Azure Data Studio to be reloaded to take into effect.
de: Azure Data Studio muss neu geladen werden, damit diese Einstellung wirksam wird.
es: Esta configuración requiere la recarga de Azure Data Studio para que surta efecto.
fr: Ce paramètre nécessite le rechargement de Azure Data Studio pour prendre effet.
it: Per rendere effettiva questa impostazione, è necessario ricaricare Azure Data Studio.
ja: この設定では、Azure Data Studio を再読み込みして有効にする必要があります。
ko: 이 설정을 적용하려면 Azure Data Studio를 다시 로드해야 합니다.
pt_br: Essa configuração exige que o Azure Data Studio seja recarregado para entrar em vigor.
ru: Чтобы этот параметр вступил в силу, необходимо перезагрузить Azure Data Studio.
zh_hans: 此设置要求重新加 载Azure Data Studio 才能生效。
zh_hant: 此設定需要重新載入 Azure Data Studio 才會生效。

# objectManagement.accessKeyLabel
source: Access Key
de: Zugriffsschlüssel
es: Clave de acceso
fr: Clé d’accès
it: Chiave di accesso
ja: アクセス キー
ko: 액세스 키
pt_br: Chave de Acesso
ru: Ключ доступа
zh_hans: 访问密钥
zh_hant: 存取金鑰

# objectManagement.databaseProperties.addButton
source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
it: Aggiungi
ja: 追加
ko: 추가
pt_br: Adicionar
ru: Добавить
zh_hans: 添加
zh_hant: 新增

# objectManagement.addCredentialsLabel
source: Add Credentials
de: Anmeldeinformationen hinzufügen
es: Agregar credenciales
fr: Ajouter des informations d’identification
it: Aggiungi credenziali
ja: 資格情報の追加
ko: 자격 증명 추가
pt_br: Adicionar Credenciais
ru: Добавить учетные данные
zh_hans: 添加凭据
zh_hant: 新增認證

# objectManagement.databaseProperties.addDatabaseFilesText
source: Add Database file
de: Datenbankdatei hinzufügen
es: Agregar archivo de base de datos
fr: Ajouter un fichier de base de données
it: Aggiungi file di database
ja: データベース ファイルの追加
ko: 데이터베이스 파일 추가
pt_br: Adicionar o arquivo do banco de dados
ru: Добавить файл базы данных
zh_hans: 添加数据库文件
zh_hant: 新增資料庫檔案

# objectManagement.databaseProperties.addFilegroupButtonText
source: Add Filegroup
de: Dateigruppe hinzufügen
es: Agregar grupo de archivos
fr: Ajouter un groupe de fichiers
it: Aggiungi filegroup
ja: ファイル グループの追加
ko: 파일 그룹 추가
pt_br: Adicionar Grupo de Arquivos
ru: Добавить файловую группу
zh_hans: 添加文件组
zh_hant: 新增檔案群組

# objectManagement.objectSelectionMethodDialogTitle
source: Add Objects
de: Objekte hinzufügen
es: Agregar objetos
fr: Ajouter des objets
it: Aggiungi oggetti
ja: オブジェクトの追加
ko: 개체 추가
pt_br: Adicionar Objetos
ru: Добавление объектов
zh_hans: 添加对象
zh_hant: 新增物件

# objectManagement.addBackupFileText
source: Add backup files
de: Sicherungsdateien hinzufügen
es: Agregar archivos de copia de seguridad
fr: Ajoutez des fichiers de sauvegarde
it: Aggiungere file di backup
ja: バックアップ ファイルの追加
ko: 백업 파일 추가
pt_br: Adicionar arquivos de backup
ru: Добавить файлы резервного копирования
zh_hans: 添加备份文件
zh_hant: 新增備份檔案

# objectManagement.addFileText
source: Add database files
de: Datenbankdateien hinzufügen
es: Agregar archivos de base de datos
fr: Ajouter des fichiers de base de données
it: Aggiungi file di database
ja: データベース ファイルの追加
ko: 데이터베이스 파일 추가
pt_br: Adicionar arquivos de banco de dados
ru: Добавить файлы базы данных
zh_hans: 添加数据库文件
zh_hant: 新增資料庫檔案

# objectManagement.addMembersText
source: Add members
de: Mitglieder hinzufügen
es: Agregar miembros
fr: Ajouter des membres
it: Aggiungi membri
ja: メンバーの追加
ko: 멤버 추가
pt_br: Adicionar membros
ru: Добавить участников
zh_hans: 添加成员
zh_hant: 新增成員

# objectManagement.addSecurablesText
source: Add securables
de: Sicherungsfähige Elemente hinzufügen
es: Agregar elementos protegibles
fr: Ajouter des éléments sécurisables
it: Aggiungi entità a protezione diretta
ja: セキュリティ保護可能なリソースの追加
ko: 보안 개체 추가
pt_br: Adicionar protegíveis
ru: Добавить защищаемые объекты
zh_hans: 添加安全对象
zh_hant: 新增安全性實體

# objectManagement.advancedSectionHeader
source: Advanced
de: Erweitert
es: Opciones avanzadas
fr: Avancé
it: Avanzate
ja: 詳細設定
ko: 고급
pt_br: Avançado
ru: Дополнительно
zh_hans: 高级
zh_hant: 進階

# objectManagement.backupAlgorithm
source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
it: Algoritmo
ja: アルゴリズム
ko: 알고리즘
pt_br: Algoritmo
ru: Алгоритм
zh_hans: 算法
zh_hant: 演算法

# objectManagement.allFiles
source: All Files
de: Alle Dateien
es: Todos los archivos
fr: Tous les fichiers
it: Tutti i file
ja: すべてのファイル
ko: 모든 파일
pt_br: Todos os Arquivos
ru: Все файлы
zh_hans: 所有文件
zh_hant: 所有檔案

# objectManagement.ObjectSelectionMethodDialog_AllObjectsOfSchema
source: All objects belonging to a schema
de: Alle Objekte, die einem Schema angehören
es: Todos los objetos que pertenecen a un esquema
fr: Tous les objets appartenant à un schéma
it: Tutti gli oggetti appartenenti a uno schema:
ja: スキーマに属するすべてのオブジェクト
ko: 스키마에 속하는 모든 개체
pt_br: Todos os objetos pertencentes a um esquema
ru: Все объекты, принадлежащие схеме
zh_hans: 属于架构的所有对象
zh_hant: 屬於結構描述的所有物件

# objectManagement.ObjectSelectionMethodDialog_AllObjectsOfTypes
source: All objects of certain types
de: Alle Objekte bestimmter Typen
es: Todos los objetos de determinados tipos
fr: Tous les objets de certains types
it: Tutti gli oggetti di determinati tipi
ja: 特定の型のすべてのオブジェクト
ko: 특정 형식의 모든 개체
pt_br: Todos os objetos de certos tipos
ru: Все объекты определенных типов
zh_hans: 特定类型的所有对象
zh_hant: 特定類型的所有物件
