Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# objectManagement.scanStartupProcsLabel
source: Scan Startup Procs
de: Startprozeduren überprüfen
es: Buscar procedimientos de inicio
fr: Numériser les procs de démarrage
it: Processi di avvio analisi
ja: スタートアップ プロセスのスキャン
ko: 시작 프로시저 검색
pt_br: Verificar Processador de Inicialização
ru: Проверить процедуры, выполняемые при запуске
zh_hans: 扫描启动过程
zh_hant: 掃描啟動程序

# objectManagement.ObjectSelectionMethodDialog_SelectSchemaDropdownLabel
source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
ko: 스키마
pt_br: Esquema
ru: Схема
zh_hans: 架构
zh_hant: 結構描述

# objectManagement.schemaLabel
source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
ko: 스키마
pt_br: Esquema
ru: Схема
zh_hans: 架构
zh_hant: 結構描述

# objectManagement.scriptingFailedError
source: Script operation failed.
de: Fehler beim Skriptvorgang.
es: Se produjo un error en la operación de script.
fr: Échec de l’opération de script.
it: L'operazione Script non è riuscita.
ja: スクリプト操作に失敗しました。
ko: 스크립트 작업에 실패했습니다.
pt_br: Falha na operação do script.
ru: Сбой операции сценария.
zh_hans: 脚本操作失败。
zh_hant: 指令碼作業失敗。

# objectManagement.SearchTextLabel
source: Search Text
de: Suchtext
es: Buscar texto
fr: Rechercher le texte
it: Cerca testo
ja: 検索テキスト
ko: 텍스트 검색
pt_br: Texto da pesquisa
ru: Текст поиска
zh_hans: 搜索文本
zh_hant: 搜尋文字

# objectManagement.secretKeyLabel
source: Secret Key
de: Geheimer Schlüssel
es: Clave secreta
fr: Clé secrète
it: Chiave privata
ja: 秘密鍵
ko: 비밀 키
pt_br: Chave Secreta
ru: Секретный ключ
zh_hans: 密钥
zh_hant: 祕密金鑰

# objectManagement.securablesText
source: Securables
de: Sicherungsfähige Elemente
es: Elementos protegibles
fr: Éléments sécurisables
it: Entità a protezione diretta
ja: セキュリティ保護可能なリソース
ko: 보안 개체
pt_br: Protegíveis
ru: Защищаемые объекты
zh_hans: 安全对象
zh_hant: 安全性實體

# objectManagement.security
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
it: Sicurezza
ja: セキュリティ
ko: 보안
pt_br: Segurança
ru: Безопасность
zh_hans: 安全性
zh_hant: 安全性

# objectManagement.selectText
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выберите
zh_hans: 选择
zh_hant: 選擇

# objectManagement.SelectBackupFileLabel
source: Select Backup File
de: Sicherungsdatei auswählen
es: Seleccionar archivo de copia de seguridad
fr: Sélectionner un fichier de sauvegarde
it: Seleziona file di backup
ja: バックアップ ファイルの選択
ko: 백업 파일 선택
pt_br: Selecionar Arquivo de Backup
ru: Выбор файла резервной копии
zh_hans: 选择备份文件
zh_hant: 選取備份檔案

# objectManagement.databaseRole.SelectMemberDialogTitle
source: Select Database Role Members
de: Datenbankrollenmitglieder auswählen
es: Seleccione miembro de rol de base de datos
fr: Sélectionner des membres du rôle de base de données
it: Selezionare i membri del ruolo del database
ja: データベース ロール メンバーの選択
ko: 데이터베이스 역할 구성원 선택
pt_br: Selecionar Membros da Função de Banco de Dados
ru: Выбор элементов роли базы данных
zh_hans: 选择数据库角色成员
zh_hant: 選取資料庫角色成員

# objectManagement.databaseRole.SelectOwnerDialogTitle
source: Select Database Role Owner
de: Datenbankrollenbesitzer auswählen
es: Seleccione propietario de rol de base de datos
fr: Sélectionner le propriétaire du rôle de base de données
it: Selezionare il proprietario del ruolo del database
ja: データベース ロール所有者の選択
ko: 데이터베이스 역할 소유자 선택
pt_br: Selecione o proprietário da função do banco de dados
ru: Выбор владельца роли базы данных
zh_hans: 选择数据库角色所有者
zh_hant: 選取資料庫角色擁有者

# objectManagement.labelSelectFolder
source: Select Folder
de: Ordner auswählen
es: Seleccionar carpeta
fr: Sélectionner un dossier
it: Seleziona cartella
ja: フォルダーの選択
ko: 폴더 선택
pt_br: Selecionar Pasta
ru: Выбрать папку
zh_hans: 选择文件夹
zh_hant: 選取資料夾

# objectManagement.SelectS3BucketLabel
source: Select S3 Bucket
de: S3-Bucket auswählen
es: Seleccionar cubo S3
fr: Sélectionner le compartiment S3
it: Seleziona Bucket S3
ja: S3 バケットの選択
ko: S3 버킷 선택
pt_br: Selecionar Bucket S3
ru: Выбор контейнера S3
zh_hans: 选择 S3 存储桶
zh_hant: 選取 S3 貯體

# objectManagement.selectS3BackupFileDialogTitle
source: Select S3 Storage Backup File
de: S3-Speichersicherungsdatei auswählen
es: Seleccionar archivo de copia de seguridad de almacenamiento S3
fr: Sélectionner le fichier de sauvegarde de stockage S3
it: Seleziona file di backup dell’archiviazione S3
ja: S3 ストレージ バックアップ ファイルの選択
ko: S3 스토리지 백업 파일 선택
pt_br: Selecionar Arquivo de Backup de Armazenamento S3
ru: Выбор файла резервной копии хранилища S3
zh_hans: 选择 S3 存储备份文件
zh_hant: 選取 S3 記憶體備份檔

# objectManagement.selectSecurablesDialogTitle
source: Select Securables
de: Sicherungsfähige Elemente auswählen
es: Seleccionar elementos protegibles
fr: Sélectionner les éléments sécurisables
it: Seleziona entità a protezione diretta
ja: セキュリティ保護可能なリソースの選択
ko: 보안 개체 선택
pt_br: Selecione Protegíveis
ru: Выберите защищаемые объекты
zh_hans: 选择安全对象
zh_hant: 選取安全性實體

# objectManagement.serverRole.SelectMemberDialogTitle
source: Select Server Role Members
de: Serverrollenmitglieder auswählen
es: Seleccionar miembros del rol de servidor
fr: Sélectionner les membres du rôle serveur
it: Selezionare i membri del ruolo server
ja: サーバー ロール メンバーの選択
ko: 서버 역할 멤버 선택
pt_br: Selecionar membros da função do servidor
ru: Выбор элементов роли сервера
zh_hans: 选择服务器角色成员
zh_hant: 選取伺服器角色成員

# objectManagement.serverRole.SelectOwnerDialogTitle
source: Select Server Role Owner
de: Serverrollenbesitzer auswählen
es: Seleccionar propietario de rol de servidor
fr: Sélectionner le propriétaire du rôle serveur
it: Selezionare il proprietario del ruolo del server
ja: サーバー ロール所有者の選択
ko: 서버 역할 소유자 선택
pt_br: Selecione o proprietário da função do servidor
ru: Выбор владельца роли сервера
zh_hans: 选择服务器角色所有者
zh_hant: 選取伺服器角色擁有者

# objectManagement.restoreDatabase.restorePlan.serverText
source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器

# objectManagement.ServerDisplayName
source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器

# objectManagement.backupServerCertificate
source: Server Certificate
de: Serverzertifikat
es: Certificado de servidor
fr: Certificat de serveur
it: Certificato del server
ja: サーバー証明書
ko: 서버 인증서
pt_br: Certificado de Servidor
ru: Сертификат сервера
zh_hans: 服务器证书
zh_hant: 伺服器憑證

# objectManagement.serverCollation
source: Server Collation
de: Serversortierung
es: Intercalación del servidor
fr: Classement du serveur
it: Regole di confronto del server
ja: サーバーの照合順序
ko: 서버 데이터 정렬
pt_br: Agrupamento do Servidor
ru: Параметры сортировки сервера
zh_hans: 服务器排序规则
zh_hant: 伺服器定序

# objectManagement.ServerRoleTypeDisplayNameInTitle
source: Server Role
de: Serverrolle
es: Rol del servidor
fr: Rôle serveur
it: Ruolo del server
ja: サーバー ロール
ko: 서버 역할
pt_br: Função de Servidor
ru: Роль сервера
zh_hans: 服务器角色
zh_hant: 伺服器角色

# objectManagement.login.serverRoleSectionHeader
source: Server Roles
de: Serverrollen
es: Roles de servidor
fr: Rôles serveur
it: Ruoli del server
ja: サーバー ロール
ko: 서버 역할
pt_br: Funções de Servidor
ru: Роли сервера
zh_hans: 服务器角色
zh_hant: 伺服器角色

# objectManagement.serverAuthenticationText
source: Server authentication
de: Serverauthentifizierung
es: Autenticación de servidor
fr: Authentification du serveur
it: Autenticazione server
ja: サーバー認証
ko: 서버 인증
pt_br: Autenticação do servidor
ru: Проверка подлинности сервера
zh_hans: 服务器身份验证
zh_hant: 伺服器驗證

# objectManagement.restoreDatabase.restoreServerConnectionsOptionsText
source: Server connections
de: Serververbindungen
es: Conexiones de servidor
fr: Connexions du serveur
it: Connessioni server
ja: サーバーの接続
ko: 서버 연결
pt_br: Conexões de servidor
ru: Подключения к серверу
zh_hans: 服务器连接
zh_hant: 伺服器連線

# objectManagement.serviceTier
source: Service Tier
de: Dienstebene
es: Nivel de servicio
fr: Niveau de service
it: Livello di servizio
ja: サービス レベル
ko: 서비스 계층
pt_br: Camada de Serviço
ru: Уровень служб
zh_hans: 服务层
zh_hant: 服務層級

# objectManagement.databaseProperties.setSecondaryText
source: Set Secondary same as Primary
de: Sekundäres Element wie primär festlegen
es: Establecer secundario igual que principal
fr: Définir secondaire comme primaire
it: Imposta secondario come primario
ja: セカンダリをプライマリと同じ設定にする
ko: 보조를 주 항목과 동일하게 설정
pt_br: Definir Secundário igual ao Primário
ru: Задать вторичную так же, как первичную
zh_hans: 将辅助副本设置为与主要副本相同
zh_hant: 將次要設定為與主要相同

# objectManagement.backupCompression
source: Set backup compression
de: Sicherungskomprimierung festlegen
es: Establecer la compresión de copia de seguridad
fr: Définissez la compression de sauvegarde
it: Imposta la compressione del backup
ja: バックアップの圧縮の設定
ko: 백업 압축 설정
pt_br: Definir compactação de backup
ru: Настройка сжатия резервной копии
zh_hans: 设置备份压缩
zh_hant: 設定備份壓縮

# objectManagement.recoveryModelSimple
source: Simple
de: Einfach
it: Semplice
ja: シンプル
ko: 단순형
pt_br: Simples
ru: Простой
zh_hans: 简单
zh_hant: 簡單

# objectManagement.databaseProperties.size
source: Size (MB)
de: Größe (MB)
es: Tamaño (MB)
fr: Taille (Mo)
it: Dimensioni (MB)
ja: サイズ (MB)
ko: 크기(MB)
pt_br: Tamanho (MB)
ru: Размер (МБ)
zh_hans: 大小 (MB)
zh_hant: 大小 (MB)

# objectManagement.databaseProperties.sizeBasedCleanupModeText
source: Size Based Cleanup Mode
de: Größenbasierter Bereinigungsmodus
es: Modo de limpieza basada en tamaño
fr: Mode de nettoyage basé sur la taille
it: Modalità di pulizia basata sulle dimensioni
ja: サイズ ベース クリーンアップ モード
ko: 크기 기반 정리 모드
pt_br: Modo de Limpeza com Base em Tamanho
ru: Режим очистки на основе размера
zh_hans: 基于大小的清除模式
zh_hant: 以大小為基礎的清除模式

# objectManagement.restoreDatabase.SourceSectionText
source: Source
de: Quelle
es: Origen
it: Origine
ja: ソース
ko: 원본
pt_br: Fonte
ru: Источник
zh_hans: 源
zh_hant: 來源

# objectManagement.databaseProperties.spaceAvailable
source: Space Available
de: Verfügbarer Speicherplatz
es: Espacio disponible
fr: Espace disponible
it: Spazio disponibile
ja: 使用可能領域
ko: 사용 가능한 공간
pt_br: Espaço Disponível
ru: Доступное место
zh_hans: 可用空间
zh_hant: 可用空間

# objectManagement.ObjectSelectionMethodDialog_SpecificObjects
source: Specific objects…
de: Bestimmte Objekte...
es: Objetos específicos…
fr: Objets spécifiques...
it: Oggetti specifici...
ja: 特定のオブジェクト…
ko: 특정 개체...
pt_br: Objetos específicos…
ru: Определенные объекты...
zh_hans: 特定对象...
zh_hant: 特定物件...

# objectManagement.login.specifyOldPasswordLabel
source: Specify old password
de: Altes Kennwort angeben
es: Especificar contraseña anterior
fr: Spécifier l’ancien mot de passe
it: Specifica vecchia password
ja: 古いパスワードの指定
ko: 이전 암호 지정
pt_br: Especificar a senha antiga
ru: Укажите старый пароль
zh_hans: 指定旧密码
zh_hant: 指定舊密碼

# objectManagement.databaseProperties.staleThresholdText
source: Stale Threshold
de: Schwellenwert für Veraltung
es: Umbral de obsolescencia
fr: Seuil de péremption
it: Soglia non aggiornata
ja: 古いしきい値
ko: 오래된 임곗값
pt_br: Limite de Obsoleto
ru: Порог устаревания
zh_hans: 过时的阈值
zh_hant: 過時的閾值

# objectManagement.restoreDatabase.standbyFileText
source: Standby file
de: Standbydatei
es: Archivo en espera
fr: Fichier de secours
it: File standby
ja: スタンバイ ファイル
ko: 대기 파일
pt_br: Arquivo em espera
ru: Резервный файл
zh_hans: 备用文件
zh_hant: 待命資料庫檔案

# objectManagement.restoreDatabase.restorePlan.startDateText
source: Start Date
de: Startdatum
es: Fecha de inicio
fr: Date de début
it: Data di inizio
ja: 開始日
ko: 시작 날짜
pt_br: Data de Início
ru: Дата начала
zh_hans: 开始日期
zh_hant: 開始日期

# objectManagement.databaseProperties.stateSectionHeader
source: State
de: Zustand
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
pt_br: Estado
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# objectManagement.databaseProperties.stateQueryThresholdInDaysText
source: State Query Threshold (Days)
de: Schwellenwert für Zustandsabfragen (Tage)
es: Umbral de consulta de estado (días)
fr: Seuil de l’état de la requête (jours)
it: Soglia query dello stato (giorni)
ja: 古いクエリのしきい値 (日)
ko: 상태 쿼리 임계값(일)
pt_br: Limite de Consulta de Estado (Dias)
ru: Порог устаревания запросов (в днях)
zh_hans: 状态查询阈值(天)
zh_hant: 狀態查詢閾值 (天數)

# objectManagement.databaseProperties.statisticsCollectionInterval
source: Statistics Collection Interval
de: Statistiksammelintervall
es: Intervalo de recopilación de estadísticas
fr: Intervalle de collecte des données
it: Intervallo di raccolta statistiche
ja: 統計情報の収集間隔
ko: 통계 수집 간격
pt_br: Intervalo de Coleta de Estatísticas
ru: Интервал сбора статистики
zh_hans: 统计信息收集间隔
zh_hant: 統計資料收集間隔

# objectManagement.databaseProperties.status
source: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# objectManagement.storageSpaceUsageInMB
source: Storage Space Usage (MB)
de: Verwendeter Speicherplatz (MB)
es: Uso del espacio de almacenamiento (MB)
fr: Utilisation de l’espace de stockage (Mo)
it: Utilizzo dello spazio di archiviazione (MB)
ja: ストレージ領域の使用率 (MB)
ko: 저장소 공간 사용량(MB)
pt_br: Uso do Espaço de Armazenamento (MB)
ru: Использование места в хранилище (МБ)
zh_hans: 存储空间使用情况 (MB)
zh_hant: 儲存空間使用量 (MB)

# objectManagement.successfulLoginsOnlyText
source: Successful logins only
de: Nur erfolgreiche Anmeldungen
es: Solo inicios de sesión correctos
fr: Connexions réussies uniquement
it: Solo accessi riusciti
ja: 成功したログインのみ
ko: 성공한 로그인만
pt_br: Somente logons bem-sucedidos
ru: Только успешные попытки входа
zh_hans: 仅限成功的登录
zh_hant: 僅限成功的登入

# objectManagement.restoreDatabase.tailLogBackupFileText
source: Tail Log Backup File
de: Datei der Sicherungs des Protokollfragments
es: Archivo de copia de seguridad del final del registro
fr: Fichier de sauvegarde de la fin du journal
it: File di backup della parte finale del log
ja: ログ末尾バックアップ ファイル
ko: 비상 로그 백업 파일
pt_br: Arquivo de Backup da Parte Final do Log
ru: Файл резервной копии заключительного фрагмента журнала
zh_hans: 结尾日志备份文件
zh_hant: 結尾記錄備份備份

# objectManagement.restoreDatabase.restoreTailLogBackupOptionsText
source: Tail-log backup
de: Sicherung des Protokollfragments
es: Copia de seguridad del final del registro
fr: Sauvegarde de la fin du journal
it: Backup della parte finale del log
ja: ログ末尾のバックアップ
ko: 비상 로그 백업
pt_br: Backup da parte final do log
ru: Резервная копия заключительного фрагмента журнала
zh_hans: 结尾日志备份
zh_hant: 結尾記錄備份

# objectManagement.restoreDatabase.takeTailLogBackupBeforeRestoreText
source: Take tail-log backup before restore
de: Sicherung des Protokollfragments vor der Wiederherstellung verwenden
es: Realizar la copia del final del registro antes de la restauración
fr: Effectuer la sauvegarde de la fin du journal avant la restauration
it: Esegui il backup della parte finale del log prima del ripristino
ja: 復元の前にログ末尾のバックアップを実行する
ko: 복원하기 전에 비상 로그 백업 수행
pt_br: Fazer backup da parte final do log antes da restauração
ru: Создать резервную копию заключительного фрагмента журнала до восстановления
zh_hans: 还原前进行结尾日志备份
zh_hant: 還原前先進行結尾記錄備份

# objectManagement.databaseProperties.targetRecoveryTimeInSecondsText
source: Target Recovery Time (Seconds)
de: Zeit für Zielwiederherstellung (Sekunden)
es: Tiempo de recuperación de destino (segundos)
fr: Temps de récupération cible (secondes)
it: Tempo di recupero di destinazione (secondi)
ja: 目標復旧時間 (秒)
ko: 목표 복구 시간(초)
pt_br: Tempo de Recuperação de Destino (Segundos)
ru: Целевое время восстановления (в секундах)
zh_hans: 目标恢复时间(秒)
zh_hant: 目標復原時間 (秒)

# objectManagement.restoreDatabase.targetDatabaseText
source: Target database
de: Zieldatenbank
es: Base de datos de destino
fr: Base de données cible
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de dados de destino
ru: Целевая база данных
zh_hans: 目标数据库
zh_hant: 目標資料庫

# objectManagement.collationNotValidError
source: The selected collation '{0}' is not valid. Please choose a different collation.
de: Die ausgewählte Sortierung "{0}" ist ungültig. Wählen Sie eine andere Sortierung aus.
es: La intercalación seleccionada '{0}' no es válida. Elija una intercalación diferente.
fr: Le classement sélectionné '{0}' n'est pas valide. Veuillez choisir un classement différent.
it: Le regole di confronto selezionate '{0}' non sono valide. Scegliere regole di confronto diverse.
ja: 選択した照合順序 '{0}' は有効ではありません。別の照合順序を選択してください。
ko: 선택한 데이터 정렬 '{0}'이(가) 잘못되었습니다. 다른 데이터 정렬을 선택하세요.
pt_br: A ordenação selecionada ''{0}'' não é válida. Selecione uma diferente.
ru: Выбранная сортировка "{0}" недействительна. Выберите другое сопоставление.
zh_hans: 所选排序规则“{0}”无效，请选择其他订阅。
zh_hant: 選取的定序 '{0}' 無效，請選擇其他定序。

# objectManagement.notSupportedError
source: This command is not supported for object type '{0}'.
de: Dieser Befehl wird für den Objekttyp "{0}" nicht unterstützt.
es: Este comando no es compatible con el tipo de objeto "{0}".
fr: Cette commande n’est pas prise en charge pour le type d’objet '{0}'.
it: Questo comando non è supportato per il tipo di oggetto '{0}'.
ja: このコマンドは、オブジェクトの種類 '{0}' ではサポートされていません。
ko: 이 명령은 '{0}' 개체 유형에 대해 지원되지 않습니다.
pt_br: Esse comando não é compatível com o tipo de objeto "{0}".
ru: Эта команда не поддерживается для типа объекта {0}.
zh_hans: 对象类型“{0}”不支持此命令。
zh_hant: 物件類型 '{0}' 不支援此命令。

# objectManagement.databaseProperties.totalCompileCPUTimeInMs
source: Total Compile CPU Time (ms)
de: CPU-Kompilierzeit gesamt (ms)
es: Tiempo total de CPU de compilación (ms)
fr: Temps processeur total de compilation (ms)
it: Tempo di CPU di compilazione totale (ms)
ja: コンパイル CPU 時間の合計 (ミリ秒)
ko: 총 컴파일 CPU 시간(밀리초)
pt_br: Tempo Total de Compilação de CPU (ms)
ru: Общее время ЦП на компиляцию (мс)
zh_hans: 总编译 CPU 时间(毫秒)
zh_hant: 編譯 CPU 時間總計 (毫秒)

# objectManagement.databaseProperties.totalExecutionCPUTimeInMsText
source: Total Execution CPU Time (ms)
de: CPU-Ausführungszeit gesamt (ms)
es: Tiempo total de CPU de ejecución (ms)
fr: Temps processeur total d'exécution (ms)
it: Tempo di CPU di esecuzione totale (ms)
ja: 実行 CPU 時間の合計 (ミリ秒)
ko: 총 실행 CPU 시간(밀리초)
pt_br: Tempo Total de Execução de CPU (ms)
ru: Общее время ЦП на выполнение (мс)
zh_hans: 总执行 CPU 时间(毫秒)
zh_hant: 執行 CPU 時間總計 (毫秒)

# objectManagement.backupTransactionLog
source: Transaction Log
de: Transaktionsprotokoll
es: Registro de transacciones
fr: Journal des transactions
it: Log delle transazioni
ja: トランザクション ログ
ko: 트랜잭션 로그
pt_br: Log de Transações
ru: Журнал транзакций
zh_hans: 事务日志
zh_hant: 交易記錄

# objectManagement.transactionLogNotice
source: Transaction Log options are only available only when Backup Type is set to Tansaction Log above.
de: Transaktionsprotokolloptionen sind nur verfügbar, wenn der Sicherungstyp oben auf Tansaction Log festgelegt ist.
es: Las opciones del registro de transacciones solo están disponibles cuando el tipo de copia de seguridad está establecido en el registro de transacciones anterior.
fr: Les options du journal des transactions ne sont disponibles que lorsque le type de sauvegarde est défini sur Le journal Tansaction ci-dessus.
it: Le opzioni del log delle transazioni sono disponibili solo quando il tipo di backup è impostato su log delle transazioni precedente.
ja: トランザクション ログ オプションは、上記のバックアップの種類がトランザクション ログに設定されている場合にのみ使用できます。
ko: 트랜잭션 로그 옵션은 백업 유형이 위의 Tansaction 로그로 설정된 경우에만 사용할 수 있습니다.
pt_br: As opções de Log de Transações só estão disponíveis quando o tipo de backup está definido como Log de Transações acima.
ru: Параметры журнала транзакций доступны только в том случае, если для параметра "Тип резервного копирования" выше установлено значение "Журнал транзакций".
zh_hans: 只有当备份类型在上面设置为“事务日志”时，事务日志选项才可用。
zh_hant: 只有當以上的 [備份類型] 設定為 [交易記錄] 時，[交易記錄] 選項才可供使用。

# objectManagement.backupTruncateLog
source: Truncate the transaction log
de: Transaktionsprotokoll abschneiden
es: Truncar el registro de transacciones
fr: Tronquer le journal des transactions
it: Tronca il log delle transazioni
ja: トランザクション ログの切り捨て
ko: 트랜잭션 로그 잘라내기
pt_br: Truncar o log de transações
ru: Усечь журнал транзакций
zh_hans: 截断事务日志
zh_hant: 截斷交易記錄

# objectManagement.twoDigitYearCutoffLabel
source: Two Digit Year Cutoff
de: Umstellungsjahr für Angaben mit zwei Ziffern
es: Fecha límite de año de dos dígitos
fr: Année de coupure à deux chiffres
it: Cambio data per anno a due cifre
ja: 2 桁表記の年の基準になる年
ko: 두 자리 연도 구분
pt_br: Corte de Ano de Dois Dígitos
ru: Отсечение двух цифр года
zh_hans: 两位数年份截止
zh_hant: 兩位數年份的截止

# objectManagement.user.type
source: Type
de: Typ
es: Escribir
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# objectManagement.restoreDatabase.restorePlan.typeText
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# objectManagement.databaseFileType
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 유형
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# objectManagement.restoreDatabase.restoreFromUrlText
source: URL
ru: URL-адрес

# objectManagement.backupUrlLabel
source: URL
ru: URL-адрес

# objectManagement.databaseProperties.autoGrowthValueConversion.unlimited
source: Unlimited
de: Unbegrenzt
es: Sin límites
fr: Illimité
it: Senza limiti
ja: 無制限
ko: 무제한
pt_br: Ilimitado
ru: Без ограничений
zh_hans: 无限制
zh_hant: 無限制

# objectManagement.databaseProperties.unlimitedFileSizeText
source: Unlimited
de: Unbegrenzt
es: Sin límites
fr: Illimité
it: Senza limiti
ja: 無制限
ko: 무제한
pt_br: Ilimitado
ru: Без ограничений
zh_hans: 无限制
zh_hant: 無限制

# objectManagement.detachUpdateStatistics
source: Update statistics
de: Statistiken aktualisieren
es: Actualizar estadísticas
fr: Mettre à jour les statistiques
it: Aggiorna statistiche
ja: 統計の更新
ko: 통계 업데이트
pt_br: Atualizar estatísticas
ru: Обновить статистику
zh_hans: 更新统计信息
zh_hant: 更新統計資料

# objectManagement.updateObjectOperationName
source: Update {0} '{1}'
de: {0} „{1}“ aktualisieren
es: Actualizar {0} "{1}"
fr: Mise à jour du type {0} « {1} »
it: Aggiornamento {0} '{1}'
ja: {0} '{1}' を更新する
ko: {0} '{1}' 업데이트
pt_br: Atualizar {0} "{1}"
ru: Обновление {0} "{1}"
zh_hans: 更新 {0} "{1}"
zh_hant: 更新 {0} '{1}'

# objectManagement.databaseProperties.useFullTextIndexingText
source: Use full-text indexing
de: Volltextindizierung verwenden
es: Usar indización de texto completo
fr: Utiliser l'indexation de texte intégral
it: Utilizza indicizzazione full-text
ja: フルテキスト インデックス作成を使用する
ko: 전체 텍스트 인덱스 사용
pt_br: Usar a Indexação de Texto Completo
ru: Использовать полнотекстовое индексирование
zh_hans: 使用全文检索
zh_hant: 使用全文檢索索引

# objectManagement.backupDefaultSetting
source: Use the default server setting
de: Standardservereinstellung verwenden
es: Utilizar la configuración del servidor predeterminada
fr: Utiliser le paramètre de serveur par défaut
it: Usa l'impostazione predefinita del server
ja: 既定のサーバー設定を使用する
ko: 기본 서버 설정 사용
pt_br: Usar a configuração padrão do servidor
ru: Использовать параметр сервера по умолчанию
zh_hans: 使用默认服务器设置
zh_hant: 使用預設伺服器設定

# objectManagement.UserTypeDisplayNameInTitle
source: User
de: Benutzer
es: Usuario
fr: Utilisateur
it: Utente
ja: ユーザー
ko: 사용자
pt_br: Usuário
ru: Пользователь
zh_hans: 用户
zh_hant: 使用者

# objectManagement.restoreDatabase.restorePlan.userNameText
source: User Name
de: Benutzername
es: Nombre de usuario
fr: Nom d’utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome do Usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# objectManagement.login.mustChangePasswordLabel
source: User must change password at next login
de: Der Benutzer muss das Kennwort bei der nächsten Anmeldung ändern.
es: El usuario debe cambiar la contraseña en el siguiente inicio de sesión
fr: L'utilisateur doit changer de mot de passe lors de la prochaine ouverture de session
it: Richiedi modifica della password all'accesso successivo
ja: 次回ログイン時のパスワードの変更を必須にする
ko: 다음 로그인할 때 반드시 암호 변경
pt_br: O usuário deve alterar a senha no próximo login
ru: Пользователь должен сменить пароль при следующем входе
zh_hans: 用户在下次登录时必须更改密码
zh_hant: 使用者必須在下次登入時變更密碼
