Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
de: Gibt an, ob IntelliSense-Vorschläge in Kleinbuchstaben angezeigt werden sollen.
es: Indica si las sugerencias de IntelliSense deben estar en minúsculas.
fr: Indique si les suggestions IntelliSense doivent être en minuscules
it: Consente di indicare se applicare la formattazione in lettere minuscole ai suggerimenti di IntelliSense
ja: IntelliSense 提案を小文字にするかどうか
ko: IntelliSense 제안을 소문자로 표시할지 여부
pt_br: As sugestões do IntelliSense devem estar em letras minúsculas?
ru: Следует ли подсказкам IntelliSense использовать строчные буквы
zh_hans: 是否小写显示 IntelliSense 建议
zh_hant: 是否將 IntelliSense 建議設定為小寫

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
de: Sollen Spaltendefinitionen ausgerichtet werden?
es: Indica si las definiciones de columna deben alinearse.
fr: Spécifie si les définitions de colonne doivent être alignées
it: Consente di indicare se le definizioni di colonna devono essere allineate
ja: 列定義を揃えるかどうか
ko: 열 정의 정렬 여부
pt_br: Definições de coluna devem ser alinhadas?
ru: Должны ли определения столбцов быть выровнены?
zh_hans: 列定义是否应对齐?
zh_hant: 行定義是否一致?

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
de: Gibt an, ob Datentypen in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden sollen.
es: Indica si los tipos de datos deben formatearse como MAYÚSCULAS, minúsculas o nada (sin formato).
fr: Spécifie si la mise en forme des types de données est MAJUSCULES, minuscules ou aucune (sans mise en forme)
it: Consente di indicare se ai tipi di dati deve essere applicata la formattazione in lettere MAIUSCOLE o minuscole oppure se non deve essere applicata alcuna formattazione
ja: データ型を大文字、小文字、または 'なし' (元のまま) のいずれにフォーマットするか
ko: 데이터 형식을 대문자, 소문자 또는 없음(서식 없음)으로 지정할지 여부
pt_br: Tipos de dados devem ser formatados como letras MAIÚSCULAS, minúsculas ou nenhum (não formatado)?
ru: Следует ли форматировать типы данных в верхнем регистре, нижнем регистре или оставить без форматирования ("нет")
zh_hans: 数据类型应格式化为大写、小写还是无(不格式化)
zh_hant: 是否將資料類型轉換為大寫，小寫或無 (不轉換)

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
de: Gibt an, ob Schlüsselwörter in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden sollen.
es: Indica si las palabras clave deben formatearse como MAYÚSCULAS, minúsculas o nada (sin formato).
fr: Spécifie si la mise en forme des mots clés est MAJUSCULES, minuscules ou aucune (sans mise en forme)
it: Consente di indicare se alle parole chiave deve essere applicata la formattazione in lettere MAIUSCOLE o minuscole oppure se non deve essere applicata alcuna formattazione
ja: キーワードを大文字、小文字、または 'なし' (元のまま) のいずれにフォーマットするか
ko: 키워드를 대문자, 소문자 또는 없음(서식 없음)으로 지정할지 여부
pt_br: Palavras-chave devem ser formatadas como letras MAIÚSCULAS, minúsculas ou nenhum (não formatado)?
ru: Следует ли форматировать ключевые слова в верхнем регистре, нижнем регистре или оставить без форматирования ("нет")
zh_hans: 关键字应格式化为大写、小写还是无(不格式化)
zh_hant: 是否將關鍵字轉換為大寫，小寫或無 (不轉換)

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
de: Sollen Verweise auf Objekte in einer SELECT-Anweisung in separaten Zeilen angezeigt werden? Beispielsweise werden bei "SELECT C1, C2 FROM T1" C1 und C2 jeweils in separaten Zeilen angezeigt.
es: ¿Deben separarse en líneas distintas las referencias a objetos de las instrucciones select? Por ejemplo, en "SELECT C1, C2 FROM T1", C1 y C2 estarán en líneas separadas
fr: Spécifie si les références aux objets dans les instructions select doivent être divisées en plusieurs lignes. Par exemple, pour 'SELECT C1, C2 FROM T1', C1 et C2 sont sur des lignes distinctes
it: Consente di indicare se i riferimenti agli oggetti in istruzioni select devono essere suddivisi su righe diverse. Ad esempio per 'SELECT C1, C2 FROM T1' sia C1 che C2 saranno su righe diverse
ja: たとえば 'SELECT C1, C2 FROM T1' の場合に C1 と C2 を別々の行にするように、Select ステートメント内のオブジェクトへの参照を別々の行に分割するかどうか
ko: Select 문에서 개체에 대한 참조를 별도 줄에 분할할지 여부(예: 'SELECT C1, C2 FROM T1'의 경우 C1 및 C2를 별도의 줄에 표시함)
pt_br: Referências a objetos em uma instrução select devem ser divididas em linhas separadas? Por exemplo, para 'SELECT C1, C2 FROM T1', em que C1 e C2 deverão estar em linhas separadas?
ru: Нужно ли разделять на отдельные строки ссылки на объекты в выбранных инструкциях? Например, для "SELECT C1, C2 FROM T1" как C1, так и C2 будут находиться на отдельных строках
zh_hans: select 语句中的对象引用是否应分到不同行中? 例如，在 "SELECT C1, C2 FROM T1" 中，C1 和 C2 是否将位于不同行
zh_hant: 在 select 陳述式中參考的物件是否要分行處理? 以 'SELECT C1, C2 FROM T1' 為例，C1 與 C2 將會分行顯示

# title.showLogFile
source: Show Log File
de: Protokolldatei anzeigen
es: Mostrar archivo de registro
fr: Afficher le fichier journal
it: Mostra file di log
ja: ログ ファイルの表示
ko: 로그 파일 표시
pt_br: Mostrar o Arquivo de Log
ru: Показать файл журнала
zh_hans: 显示日志文件
zh_hant: 顯示記錄檔

# databasesListProperties.size
source: Size (MB)
de: Größe (MB)
es: Tamaño (MB)
fr: Taille (Mo)
it: Dimensioni (MB)
ja: サイズ (MB)
ko: 크기(MB)
pt_br: Tamanho (MB)
ru: Размер (МБ)
zh_hans: 大小 (MB)
zh_hant: 大小 (MB)

# mssql.connectionOptions.packetSize.description
source: Size in bytes of the network packets used to communicate with an instance of SQL Server
de: Größe der Netzwerkpakete (in Byte), die bei der Kommunikation mit einer Instanz von SQL Server verwendet werden
es: Tamaño en bytes de los paquetes de red utilizados para comunicarse con una instancia de SQL Server
fr: Taille en octets des paquets réseau utilisés pour communiquer avec une instance de SQL Server
it: Dimensioni in byte dei pacchetti di rete usati per comunicare con un'istanza di SQL Server
ja: SQL Server インスタンスとの通信に使用されるネットワーク パケットのサイズ (バイト)
ko: SQL Server 인스턴스와 통신하는 데 사용되는 네트워크 패킷의 크기(바이트)
pt_br: Tamanho em bytes dos pacotes de rede usados para comunicar-se com uma instância do SQL Server
ru: Размер (в байтах) сетевых пакетов, которые используются для взаимодействия с экземпляром SQL Server
zh_hans: 用于与 SQL Server 实例通信的网络数据包的大小(字节数)
zh_hant: 用於和 SQL Server 執行個體通訊之網路封包的大小 (位元組)

# mssql.connectionOptions.groupName.source
source: Source
de: Quelle
es: Origen
it: Origine
ja: ソース
ko: 원본
pt_br: Fonte
ru: Источник
zh_hans: 源
zh_hant: 來源

# mssql.connectionOptions.enclaveAttestationProtocol.description
source: Specifies a protocol for attesting a server-side enclave used with Always Encrypted with Secure enclaves
de: Gibt ein Protokoll zum Nachweis einer serverseitigen Enclave an, die mit Always Encrypted für Secure Enclaves verwendet wird.
es: Especifica un protocolo para la atestación de un enclave de servidor empleado con Always Encrypted con enclaves seguros
fr: Spécifie un protocole pour attester une enclave côté serveur utilisée avec Always Encrypted avec des enclaves sécurisées
it: Specifica un protocollo per l'attestazione di un enclave lato server usato con Always Encrypted con enclave sicuri
ja: セキュリティで保護されたエンクレーブでの Always Encrypted で使用する、サーバー側エンクレーブ構成証明用のプロトコルを指定します
ko: 보안 enclave를 사용한 Always Encrypted와 함께 사용되는 서버 쪽 enclave를 증명하기 위한 프로토콜 지정
pt_br: Especifica um protocolo para atestar um enclave do lado do servidor usado com Always Encrypted com enclaves Seguros
ru: Задает протокол для аттестации анклава на стороне сервера, используемого с Always Encrypted с защищенным анклавами
zh_hans: 指定用于证明与具有安全 enclave 的 Always Encrypted 结合使用的服务器端 enclave 的协议
zh_hant: 指定用來證明與有安全記憶體保護區的 Always Encrypted 一起使用的伺服器端記憶體保護區的通訊協定

# mssql.connectionOptions.enclaveAttestationUrl.description
source: Specifies an endpoint for attesting a server-side enclave used with Always Encrypted with Secure enclaves
de: Gibt einen Endpunkt zum Nachweis einer serverseitigen Enclave an, die mit Always Encrypted für Secure Enclaves verwendet wird.
es: Especifica un punto de conexión para la atestación de un enclave de servidor empleado con Always Encrypted con enclaves seguros
fr: Spécifie un point de terminaison pour attester une enclave côté serveur utilisée avec Always Encrypted avec des enclaves sécurisées
it: Specifica un endpoint per l'attestazione di un enclave lato server usato con Always Encrypted con enclavi sicuri
ja: セキュリティで保護されたエンクレーブによる Always Encrypted で使用する、サーバー側エンクレーブ構成証明用のエンドポイントを指定します
ko: 보안 enclave를 사용한 Always Encrypted와 함께 사용되는 서버 쪽 enclave를 증명하기 위한 엔드포인트 지정
pt_br: Especifica um ponto de extremidade para atestar um enclave do lado do servidor usado com Always Encrypted com enclaves Seguros
ru: Задает конечную точку для аттестации анклава на стороне сервера, используемого с Always Encrypted с защищенным анклавами
zh_hans: 指定用于证明与具有安全 enclave 的 Always Encrypted 结合使用的服务器端 enclave 的终结点
zh_hant: 指定用來證明與有安全記憶體保護區的 Always Encrypted 一起使用的伺服器端記憶體保護區的端點

# mssql.connectionOptions.authType.description
source: Specifies the method of authenticating with SQL Server
de: Gibt die Methode für die Authentifizierung bei SQL Server an.
es: Especifica el método de autenticación con SQL Server
fr: Spécifie la méthode d'authentification avec SQL Server
it: Specifica il metodo di autenticazione con SQL Server
ja: SQL Server での認証方法を指定します
ko: SQL Server로 인증하는 방법을 지정합니다.
pt_br: Especifica o método de autenticação com o SQL Server
ru: Указывает способ проверки подлинности в SQL Server
zh_hans: 指定使用 SQL Server 进行身份验证的方法
zh_hant: 指定向 SQL Server 驗證的方法

# databasesListProperties.status
source: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# mssql.connectionOptions.encrypt.categoryValues.strict
source: Strict (supported for SQL Server 2022 and Azure SQL)
de: Streng (unterstützt für SQL Server 2022 und Azure SQL)
es: Estricto (compatible con SQL Server 2022 y Azure SQL)
it: Strict (supportato per SQL Server 2022 e Azure SQL)
ja: Strict (SQL Server 2022 および Azure SQL 用にサポート)
ko: Strict(SQL Server 2022 및 Azure SQL 지원됨)
pt_br: Estrito (com suporte para SQL Server 2022 e SQL do Azure)
ru: Строгое (поддерживается для SQL Server 2022 и Azure SQL)
zh_hans: 严格(支持 SQL Server 2022 和 Azure SQL)

# mssql.connectionOptions.currentLanguage.description
source: The SQL Server language record name
de: Der Datensatzname der SQL Server-Sprache
es: El nombre del registro de idioma de SQL Server
fr: Nom d'enregistrement de la langue de SQL Server
it: Nome del record di lingua di SQL Server
ja: SQL Server 言語レコード名
ko: SQL Server 언어 레코드 이름
pt_br: O nome do registro de idioma do SQL Server
ru: Имя записи языка SQL Server
zh_hans: SQL Server 语言记录名称
zh_hant: SQL Server 語言記錄名稱

# mssql.executionPlan.expensiveOperationMetric
source: The default metric to use to highlight an expensive operation in query execution plans
de: Die Standardmetrik, die verwendet werden soll, um einen teuren Vorgang in Abfrageausführungsplänen hervorzuheben.
es: Métrica predeterminada que se va a usar para resaltar una operación costosa en los planes de ejecución de consultas
fr: Métrique par défaut à utiliser pour mettre en évidence une opération coûteuse dans les plans d’exécution de requêtes
it: Metrica predefinita da usare per evidenziare un'operazione costosa nei piani di esecuzione delle query
ja: クエリ実行プランで負荷の高い操作を強調表示するために使用する既定のメトリック
ko: 쿼리 실행 계획에서 비용이 많이 드는 작업을 강조 표시하는 데 사용할 기본 메트릭
pt_br: A métrica padrão a ser usada para realçar uma operação cara em planos de execução de consulta
ru: Метрика по умолчанию, используемая для выделения ресурсоемкой операции в планах выполнения запросов.
zh_hans: 用于在查询执行计划中突出显示高开销操作的默认指标
zh_hant: 用來在查詢執行計畫中醒目提示成本高的作業的預設計量

# mssql.connectionOptions.commandTimeout.description
source: The length of time (in seconds) to wait for a command to execute before terminating the attempt and generating an error
de: Die Zeitspanne (in Sekunden), die auf die Ausführung eines Befehls gewartet wird, bevor der Versuch beendet und ein Fehler generiert wird.
es: Intervalo de tiempo (en segundos) que se debe esperar a que se ejecute un comando antes de dejar de intentarlo y generar un error
fr: La durée (en secondes) d’attente de l’exécution d’une commande avant de mettre fin à la tentative et de générer une erreur.
it: Intervallo di tempo (in secondi) in cui attendere l'esecuzione di un comando prima di interrompere il tentativo e generare un errore
ja: 試行を終了してエラーを生成する前にコマンドの実行を待機するまでの時間 (秒単位)
ko: 시도를 종료하고 오류를 생성하기 전에 명령이 실행되기를 기다리는 시간(초)입니다.
pt_br: O período de tempo (em segundos) para aguardar a execução de um comando antes de encerrar a tentativa e gerar um erro
ru: Длительность (в секундах) ожидания выполнения команды, после чего попытка прекращается и выводится ошибка
zh_hans: 在终止尝试并生成错误之前等待命令执行的时长(秒)
zh_hant: 終止嘗試並產生錯誤前，要等待命令執行的時間長度 (以秒為單位)

# mssql.connectionOptions.connectTimeout.description
source: The length of time (in seconds) to wait for a connection to the server before terminating the attempt and generating an error
de: Die Zeitspanne (in Sekunden), die auf eine Verbindung mit dem Server gewartet wird, bevor der Versuch beendet und ein Fehler generiert wird.
es: Intervalo de tiempo (en segundos) que se debe esperar a que se establezca la conexión con el servidor antes de dejar de intentarlo y generar un error
fr: Durée d'attente (en secondes) d'une connexion au serveur avant de terminer la tentative et de générer une erreur
it: Intervallo di tempo (in secondi) in cui attendere la connessione al server prima di interrompere il tentativo e generare un errore
ja: サーバーへの接続が確立されるまでに待機する時間 (秒)。この時間が経過すると接続要求を終了し、エラーを生成します
ko: 연결 시도를 중단하고 오류를 생성하기 전 서버에 연결될 때까지의 대기 시간(초)입니다.
pt_br: O período de tempo (em segundos) para aguardar uma conexão com o servidor antes de encerrar a tentativa e gerar um erro
ru: Длительность (в секундах) ожидания при подключении к серверу, после чего попытка прекращается и выводится ошибка
zh_hans: 在终止尝试并生成错误之前等待连接到服务器的时长(秒)
zh_hant: 終止嘗試並產生錯誤前，要等待伺服器連線的時間長度 (秒)

# mssql.connectionOptions.maxPoolSize.description
source: The maximum number of connections allowed in the pool
de: Die maximal zulässige Anzahl von Verbindungen im Pool
es: El número máximo de conexiones permitidas en el grupo
fr: Nombre maximal de connexions autorisées dans le pool
it: Numero massimo di connessioni consentite nel pool
ja: プールに保持される接続の最大数
ko: 풀에서 허용되는 최대 연결 수
pt_br: O número máximo de conexões permitidas no pool
ru: Максимально допустимое число подключений в пуле
zh_hans: 池中允许的最大连接数
zh_hant: 集區中允許的連線數上限

# mssql.connectionOptions.loadBalanceTimeout.description
source: The minimum amount of time (in seconds) for this connection to live in the pool before being destroyed
de: Die Mindestzeitspanne (in Sekunden), für die diese Verbindung im Pool verbleiben soll, bevor sie zerstört wird
es: Periodo mínimo de tiempo (en segundos) que residirá esta conexión en el grupo antes de que se destruya
fr: Durée de vie minimale (en secondes) de cette connexion dans le pool avant d'être détruite
it: Tempo minimo (in secondi) in cui la connessione rimane attiva nel pool prima di essere eliminata definitivamente
ja: この接続が破棄される前にプールに存在する最小時間 (秒)
ko: 이 연결이 제거되기 전에 풀에서 활성화되어 있는 최소 시간(초)입니다.
pt_br: O período mínimo de tempo (em segundos) para que essa conexão exista no pool antes de ser destruída
ru: Минимальное время (в секундах), которое это подключение будет оставаться в пуле до уничтожения
zh_hans: 此连接在销毁前在池中生存的最短时间(秒)
zh_hant: 此連線在終結前於集區中存留的時間下限 (秒)

# mssql.connectionOptions.minPoolSize.description
source: The minimum number of connections allowed in the pool
de: Die mindestens erforderliche Anzahl von Verbindungen im Pool
es: El número mínimo de conexiones permitidas en el grupo
fr: Nombre minimal de connexions autorisées dans le pool
it: Numero minimo di connessioni consentite nel pool
ja: プールに保持される接続の最小数
ko: 풀에서 허용되는 최소 연결 수
pt_br: O número mínimo de conexões permitidas no pool
ru: Минимально допустимое число подключений в пуле
zh_hans: 池中允许的最小连接数
zh_hant: 集區中允許的連線數下限

# mssql.connectionOptions.applicationName.description
source: The name of the application
de: Der Name der Anwendung
es: El nombre de la aplicación
fr: Nom de l'application
it: Nome dell'applicazione
ja: アプリケーションの名前
ko: 애플리케이션의 이름
pt_br: O nome do aplicativo
ru: Имя приложения
zh_hans: 应用程序的名称
zh_hant: 應用程式的名稱

# mssql.connectionOptions.databaseName.description
source: The name of the initial catalog or database int the data source
de: Der Name des anfänglichen Katalogs oder der ersten Datenbank in der Datenquelle
es: Nombre del catálogo o base de datos inicial del origen de datos
fr: Nom du catalogue ou de la base de données de départ dans la source de données
it: Nome del database o del catalogo iniziale nell'origine dati
ja: データ ソース内の初期カタログまたはデータベースの名前
ko: 데이터 원본에 있는 초기 카탈로그 또는 데이터베이스의 이름
pt_br: O nome do catálogo ou do banco de dados inicial na fonte de dados
ru: Имя исходного каталога или базы данных в источнике данных
zh_hans: 数据源中初始目录或数据库的名称
zh_hant: 資料來源中，初始類別目錄或資料庫的名稱。

# mssql.connectionOptions.attachDbFilename.description
source: The name of the primary file, including the full path name, of an attachable database
de: Der Name der primären Datei einer anfügbaren Datenbank, einschließlich des vollständigen Pfadnamens.
es: Nombre del archivo principal, incluido el nombre completo de ruta, de una base de datos que se puede adjuntar
fr: Nom de fichier principal, y compris le nom de chemin complet, d'une base de données pouvant être attachée
it: Nome del file primario, incluso il nome del percorso completo, di un database collegabile
ja: 完全なパス名を含む、接続可能なデータベースのプライマリ ファイル名
ko: 연결할 수 있는 데이터베이스의 기본 파일 이름(전체 경로 이름 포함)
pt_br: O nome do arquivo principal, incluindo o nome do caminho completo, de um banco de dados anexável
ru: Имя первичного файла прикрепляемой базы данных, включая полный путь
zh_hans: 可附加数据库的主文件的名称(包括完整路径名称)
zh_hant: 主要檔案的名稱，包含可附加資料庫的完整路徑名稱

# mssql.connectionOptions.workstationId.description
source: The name of the workstation connecting to SQL Server
de: Der Name der Arbeitsstation, die eine Verbindung mit SQL Server herstellt
es: El nombre de la estación de trabajo que se conecta a SQL Server
fr: Nom de la station de travail se connectant à SQL Server
it: Nome della workstation che si connette a SQL Server
ja: SQL Server に接続しているワークステーションの名前
ko: SQL Server에 연결하는 워크스테이션의 이름
pt_br: O nome da estação de trabalho que se conecta ao SQL Server
ru: Имя рабочей станции, подключающейся к SQL Server
zh_hans: 连接到 SQL Server 的工作站的名称
zh_hant: 連線至 SQL Server 的工作站名稱

# mssql.connectionOptions.failoverPartner.description
source: The name or network address of the instance of SQL Server that acts as a failover partner
de: Der Name oder die Netzwerkadresse der SQL Server-Instanz, die als Failoverpartner fungiert
es: El nombre o la dirección de red de la instancia de SQL Server que actúa como asociado para la conmutación por error
fr: Nom ou adresse réseau de l'instance de SQL Server servant de partenaire de basculement
it: Nome o indirizzo di rete dell'istanza di SQL Server che funge da partner di failover
ja: フェールオーバー パートナーとして機能する SQL Server インスタンスの名前またはネットワーク アドレス
ko: 장애 조치(failover) 파트너 역할을 하는 SQL Server 인스턴스의 이름 또는 네트워크 주소
pt_br: O nome ou o endereço de rede da instância do SQL Server que atua como um parceiro de failover
ru: Имя или сетевой адрес экземпляра SQL Server, выступающего в роли партнера по обеспечению отработки отказа
zh_hans: 充当故障转移伙伴的 SQL Server 实例的名称或网络地址
zh_hant: 充當容錯移轉夥伴之 SQL Server 執行個體的名稱或網路位址

# json.schemas.schema.desc
source: The schema definition for the given URL. The schema only needs to be provided to avoid accesses to the schema URL.
de: Die Schemadefinition für die angegebene URL. Das Schema muss nur angegeben werden, um Zugriffe auf die Schema-URL zu vermeiden.
es: La definición de esquema de la dirección URL determinada. Solo se necesita proporcionar el esquema para evitar los accesos a la dirección URL del esquema.
fr: Définition de schéma pour l'URL indiquée. Le schéma doit être fourni uniquement pour éviter les accès à l'URL du schéma.
it: Definizione dello schema per l'URL specificato. È necessario specificare lo schema per evitare accessi all'URL dello schema.
ja: 指定された URL のスキーマ定義です。スキーマは、スキーマ URL へのアクセスを避けるためにのみ指定する必要があります。
ko: 지정된 URL의 스키마 정의입니다. 스키마는 스키마 URL에 대한 액세스 방지를 위해서만 제공해야 합니다.
pt_br: A definição de esquema para a URL fornecida. O esquema precisa ser fornecido apenas para evitar acessos à URL do esquema.
ru: Определение схемы для указанного URL-адреса. Схему необходимо указать только для того, чтобы не обращаться по URL-адресу схемы.
zh_hans: 给定 URL 的架构定义。仅当要避免访问架构 URL 时需要提供架构。
zh_hant: 指定 URL 的結構描述定義。只須提供結構描述以避免存取結構描述 URL。

# mssql.objectExplorer.expandTimeout
source: The timeout in seconds for expanding a node in Object Explorer. The default value is 45 seconds.
de: Das Timeout in Sekunden für das Erweitern eines Knotens in Objekt-Explorer. Der Standardwert ist 45 Sekunden.
es: Tiempo de espera en segundos para expandir un nodo en Explorador de objetos. El valor predeterminado es 45 segundos.
fr: Délai d’expiration en secondes pour le développement d’un nœud dans l’Explorateur d’objets. La valeur par défaut est 45 secondes.
it: Timeout in secondi per l'espansione di un nodo in Esplora oggetti. Il valore predefinito è 45 secondi.
ja: オブジェクト エクスプローラーでノードを展開する場合のタイムアウト (秒)。既定値は 45 秒。
ko: 개체 탐색기 노드를 확장하기 위한 시간 제한(초)입니다. 기본값은 45초입니다.
pt_br: O tempo limite em segundos para expandir um nó no Pesquisador de Objetos. O valor padrão é 45 segundos.
ru: Время ожидания в секундах для развертывания узла в обозревателе объектов SQL Server. Значение по умолчанию — 45 секунд.
zh_hans: 在对象资源管理器中展开节点的超时(以秒为单位)。默认值为 45 秒。
zh_hant: 在物件總管中展開節點的逾時秒數。預設值為 45 秒。

# mssql.connectionOptions.trustServerCertificate.displayName
source: Trust server certificate
de: Serverzertifikat vertrauen
es: Certificado de servidor de confianza
fr: Approuver le certificat de serveur
it: Considera attendibile il certificato del server
ja: サーバー証明書を信頼する
ko: 서버 인증서 신뢰
pt_br: Certificado do servidor de confiança
ru: Доверять сертификату сервера
zh_hans: 信任服务器证书
zh_hant: 信任伺服器憑證

# cloud.serverProperties.serverEdition
source: Type
de: Typ
es: Escribir
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# mssql.connectionOptions.typeSystemVersion.displayName
source: Type system version
de: Typsystemversion
es: Versión de sistema de tipo
fr: Version du système de type
it: Versione del sistema di tipi
ja: タイプ システムのバージョン
ko: 형식 시스템 버전
pt_br: Versão do sistema de tipos
ru: Версия системы типов
zh_hans: 类型系统版本
zh_hant: 鍵入系統版本

# mssql.connectionOptions.replication.description
source: Used by SQL Server in Replication
de: Wird von SQL Server bei der Replikation verwendet.
es: Utilizado por SQL Server en replicación
fr: Utilisé par SQL Server dans la réplication
it: Usato da SQL Server nella replica
ja: レプリケーション時に SQL Server によって使用されます
ko: 복제에서 SQL Server가 사용합니다.
pt_br: Usado pelo SQL Server na replicação
ru: Используется SQL Server при репликации
zh_hans: 由 SQL Server 在复制中使用
zh_hant: 由 SQL Server 在複寫中使用

# mssql.connectionOptions.userName.displayName
source: User name
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome do usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# cloud.serverProperties.serverVersion
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本

# onprem.serverProperties.serverVersion
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本
