Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.sku.parameters.enable.elastic
source: Enable elastic recommendation
de: Elastische Empfehlung aktivieren
es: Habilitar recomendación elástica
fr: Activer la recommandation élastique
ja: エラスティック レコメンデーションを有効にする
ko: 탄력적 권장 사항 사용
pt_br: Habilitar a recomendação elástica
ru: Включить эластичную рекомендацию
zh_hans: 启用弹性建议
zh_hant: 啟用彈性建議

# sql.migration.sku.parameters.enable.preview
source: Enable preview features
de: Vorschaufunktionen aktivieren
es: Habilitar las características de la versión preliminar
fr: Activer les fonctionnalités d’aperçu
ja: プレビュー機能を有効にする
ko: 미리 보기 기능 사용
pt_br: Habilitar os recursos de visualização
ru: Включить предварительную версию функций
zh_hans: 启用预览功能
zh_hant: 啟用預覽功能

# sql.migration.sku.parameters.enable.preview.info
source: Enabling this option will include the latest hardware generations that have significantly improved performance and scalability. These SKUs are currently in Preview and may not yet be available in all regions.
de: Das Aktivieren dieser Option umfasst die neuesten Hardwaregenerationen mit erheblich verbesserter Leistung und Skalierbarkeit. Diese SKUs befinden sich zurzeit in der Vorschau und sind möglicherweise noch nicht in allen Regionen verfügbar.
es: Si habilita esta opción, se incluirán las últimas generaciones de hardware que han mejorado significativamente el rendimiento y la escalabilidad. Estas SKU están actualmente en versión preliminar y es posible que aún no estén disponibles en todas las regiones.
fr: L’activation de cette option inclura les dernières générations de matériel qui ont considérablement amélioré les performances et l’évolutivité. Ces SKU sont actuellement en version préliminaire et peuvent ne pas encore être disponibles dans toutes les régions.
ja: このオプションを有効にすることにより、パフォーマンスとスケーラビリティが大幅に向上した最新のハードウェア世代が含まれます。これらの SKU は現在プレビュー段階であり、一部のリージョンではまだ利用できない場合があります。
ko: 이 옵션을 사용하도록 설정하면 성능과 확장성이 크게 개선된 최신 하드웨어 세대가 포함됩니다. 이러한 SKU는 현재 미리 보기 상태로 제공되며, 일부 지역에서는 아직 사용할 수 없습니다.
pt_br: A ativação dessa opção incluirá as gerações de hardware mais recentes que melhoraram significativamente o desempenho e a escalabilidade. Esses SKUs estão atualmente em visualização e podem ainda não estar disponíveis em todas as regiões.
ru: При включении этого параметра будут учтены последние поколения оборудования со значительно улучшенной производительностью и масштабируемостью. Эти номера SKU сейчас находятся на этапе предварительной версии и могут быть доступны не во всех регионах.
zh_hans: 启用此选项将包括性能和可伸缩性显著提高的最新硬件代系。这些 SKU 目前处于预览状态，并且可能尚未在所有区域中提供。
zh_hant: 啟用此選項將包括具有明顯改善效能和延展性的最新硬體世代。這些 SKU 目前位於預覽階段，可能尚未在所有區域中使用。

# sql.migration.tde.wizard.title
source: Encrypted database selected.
de: Verschlüsselte Datenbank ausgewählt.
es: Base de datos cifrada seleccionada.
fr: Base de données chiffrée sélectionnée.
ja: 暗号化されたデータベースが選択されています。
ko: 암호화된 데이터베이스를 선택했습니다.
pt_br: Banco de dados criptografado selecionado.
ru: Выбрана база данных с шифрованием.
zh_hans: 已选择加密数据库。
zh_hant: 已選取加密資料庫。

# sql.migration.encryption.label
source: Encryption
de: Verschlüsselung
es: Cifrado
fr: Chiffrement
ja: 暗号化
ko: 암호화
pt_br: Criptografia
ru: Шифрование
zh_hans: 加密
zh_hant: 加密

# sql.migration.database.already.exists.vm.info
source: Ensure that the provided database name(s) do not already exist on the target SQL Server on Azure Virtual Machine.
de: Stellen Sie sicher, dass die angegebenen Datenbanknamen nicht bereits auf dem SQL Server auf dem virtuellen Azure-Computer vorhanden sind.
es: Asegúrese de que los nombres de base de datos proporcionados aún no existen en el SQL Server de destino en la máquina virtual de Azure.
fr: Vérifiez que le ou les noms de base de données fournis n’existent pas déjà sur le SQL Server cible sur la machine virtuelle Azure.
ja: 指定されたデータベース名が Azure 仮想マシンのターゲット SQL Server にまだ存在しないことを確認してください。
ko: 제공된 데이터베이스 이름이 Azure 가상 머신의 대상 SQL Server에 없는지 확인합니다.
pt_br: Verifique se os nomes de banco de dados fornecidos não existem no SQL Server de destino na Máquina Virtual do Azure.
ru: Убедитесь, что базы данных с указанными именами еще не существуют на целевом сервере SQL Server виртуальной машины Azure.
zh_hans: 确保 Azure 虚拟机上的目标 SQL Server 上尚不存在提供的数据库名称。
zh_hant: 請確認提供的資料庫名稱並不存在於 Azure 虛擬機器的目標 SQL Server 上。

# sql.migration.service.account.info.text
source: Ensure that the service account running the source SQL Server instance has read privileges on the network share.
de: Stellen Sie sicher, dass das Dienstkonto, in dem die SQL Server-Quellinstanz ausgeführt wird, in der Netzwerkfreigabe über Schreibberechtigungen verfügt.
es: Asegúrese de que la cuenta de servicio que ejecuta la instancia de SQL Server de origen tenga privilegios de lectura en el recurso compartido de red.
fr: Vérifiez que le compte de service exécutant l'instance source de SQL Server a des privilèges de lecture sur le partage réseau.
ja: ソース SQL Server インスタンスを実行しているサービス アカウントに、ネットワーク共有に対する読み取り権限があることを確認してください。
ko: 원본 SQL Server 인스턴스를 실행하는 서비스 계정에 네트워크 공유에 대한 읽기 권한이 있는지 확인합니다.
pt_br: Certifique-se de que a conta de serviço que executa a instância do SQL Server de origem tenha privilégios de leitura no compartilhamento de rede.
ru: Убедитесь, что у учетной записи службы, в которой запущен исходный экземпляр SQL Server, есть разрешения на чтение в сетевой папке.
zh_hans: 请确保运行源 SQL Server 实例的服务帐户对网络共享拥有读取权限。
zh_hant: 請確認執行來源 SQL Server 執行個體的服務帳戶對網路共用有讀取權限。

# sql.migration.database.schema.migration.help
source: Ensure to migrate the database schema from source to target before starting the migration by using the Database Schema Migration feature ({0}) or {1} or the {2} in Azure Data Studio before selecting the list of tables to migrate.
de: Stellen Sie sicher, dass Sie das Datenbankschema von der Quelle zum Ziel migrieren, bevor Sie mit der Migration beginnen, indem Sie das Feature für die Datenbankschemamigration ({0}) oder {1} oder die {2} in Azure Data Studio verwenden, bevor Sie die Liste der zu migrierenden Tabellen auswählen.
es: Asegúrese de migrar el esquema de base de datos de origen a destino antes de iniciar la migración mediante la característica migración de esquema de base de datos ({0}) o {1} o el {2} en Azure Data Studio antes de seleccionar la lista de tablas que se van a migrar.
fr: Veillez à migrer le schéma de la base de données de la source vers la cible avant de commencer la migration en utilisant la fonctionnalité de migration de schéma de la base de données ({0}) ou {1} ou le {2} dans Azure Data Studio avant de sélectionner la liste des tables à migrer.
ja: 移行を開始する前に、移行するテーブルのリストを選択する前に、データベース スキーマ移行機能 ({0}) を使用するか、Azure Data Studio で {1} または {2} を使用して、データベース スキーマをソースからターゲットに移行してください。
ko: 마이그레이션할 테이블 목록을 선택하기 전에 데이터베이스 스키마 마이그레이션 기능({0})이나 {1} 또는 Azure Data Studio의 {2}을(를) 사용하여 마이그레이션을 시작하기 전에 원본에서 대상으로 데이터베이스 스키마를 마이그레이션해야 합니다.
pt_br: Certifique-se de migrar o esquema do banco de dados da origem para o destino antes de iniciar a migração usando o recurso de Migração do Esquema de Banco de Dados ({0}), {1} ou o {2} no Azure Data Studio antes de selecionar a lista de tabelas a serem migradas.
ru: Перед началом миграции обязательно перенесите схему базы данных из источника в цель с помощью функции миграции схемы базы данных. ({0}) или {1} или {2} в Azure Data Studio, прежде чем выбирать список таблиц для миграции.
zh_hans: 请在选择要迁移的表列表之前使用数据库架构迁移功能({0})、{1} 或 Azure Data Studio 中的 {2}，在开始迁移前，确保将数据库架构从源迁移到目标。
zh_hant: 請在選取要移轉的資料表清單之前，確保先使用資料庫結構描述移轉功能 ({0})、{1} 或 Azure Data Studio 中的 {2}，將資料庫結構描述從來源移轉至目標。

# sql.login.migration.aad.domain.name.input.box.placeholder
source: Enter AAD Domain Name
de: Name der AAD-Verwaltungsdomäne eingeben
es: Escriba el nombre de dominio de AAD
fr: Entrer un nom de domaine AAD
ja: AAD ドメイン名を入力してください
ko: AAD 도메인 이름 입력
pt_br: Insira o Nome de Domínio do AAD
ru: Введите доменное имя AAD
zh_hans: 输入 AAD 域名
zh_hant: 輸入 AAD 網域名稱

# sql.migration.invalid.service.name.error
source: Enter a valid name for the Migration Service.
de: Geben Sie einen gültigen Namen für den Migration Service ein.
es: Escriba un nombre válido para el servicio de migración.
fr: Entrez un nom valide pour le service de migration.
ja: 移行サービスに有効な名前を入力してください。
ko: 마이그레이션 서비스의 유효한 이름을 입력하세요.
pt_br: Insira um nome válido para o Serviço de Migração.
ru: Введите действительное имя для службы миграции.
zh_hans: 输入迁移服务的有效名称。
zh_hant: 為此移轉服務輸入有效的名稱。

# sql.migration.invalid.target.name.error
source: Enter a valid name for the target database.
de: Geben Sie einen gültigen Namen für die Zieldatenbank ein.
es: Escriba un nombre válido para la base de datos de destino.
fr: Entrez un nom valide pour la base de données cible.
ja: ターゲット データベースに有効な名前を入力してください。
ko: 대상 데이터베이스의 유효한 이름을 입력하세요.
pt_br: Insira um nome válido para o banco de dados de destino.
ru: Введите действительное имя для целевой базы данных.
zh_hans: 输入目标数据库的有效名称。
zh_hant: 輸入有效的目標資料庫名稱。

# sql.migration.tde.wizard.network.share.placeholder
source: Enter network path
de: Netzwerkpfad eingeben
es: Escribir ruta de acceso a la red
fr: Entrer le chemin d’accès du réseau
ja: ネットワーク パスを入力してください
ko: 네트워크 경로 입력
pt_br: Inserir caminho de rede
ru: Введите сетевой путь
zh_hans: 输入网络路径
zh_hant: 輸入網路路徑

# sql.migration.network.share.password.placeholder
source: Enter password.
de: Geben Sie das Kennwort ein.
es: Escriba la contraseña.
fr: Entrez le mot de passe.
ja: パスワードを入力します。
ko: 암호를 입력합니다.
pt_br: Digitar a senha.
ru: Введите пароль.
zh_hans: 输入密码。
zh_hant: 輸入密碼。

# sql.migration.network.share.storage.table.help
source: Enter target database name and network share path information for the selected source databases.
de: Geben Sie den Zieldatenbanknamen und die Pfadinformationen der Netzwerkfreigabe für die ausgewählten Quelldatenbanken ein.
es: Escriba el nombre de la base de datos de destino y la información de la ruta de acceso del recurso compartido de red para las bases de datos de origen seleccionadas.
fr: Entrez le nom de la base de données cible et les informations de chemin d’accès au partage réseau pour les bases de données sources sélectionnées.
ja: 選択したソース データベースのターゲット データベース名とネットワーク共有パス情報を入力します。
ko: 선택한 원본 데이터베이스에 대한 대상 데이터베이스 이름 및 네트워크 공유 경로 정보를 입력하세요.
pt_br: Insira o nome do banco de dados de destino e as informações do caminho de compartilhamento de rede para os bancos de dados de origem selecionados.
ru: Введите имя целевой базы данных и путь к общей папке для выбранных исходных баз данных.
zh_hans: 输入所选源数据库的目标数据库名称和网络共享路径信息。
zh_hant: 輸入所選源資料庫的目標資料庫名稱和網路共用路徑資訊。

# sql.migration.blob.storage.table.help
source: Enter target database name and select resource group, storage account and container for the selected source databases.
de: Geben Sie den Namen der Zieldatenbank ein, und wählen Sie die Ressourcengruppe, das Speicherkonto und den Container für die ausgewählten Quelldatenbanken aus.
es: Escriba el nombre de la base de datos de destino y seleccione el grupo de recursos, la cuenta de almacenamiento y el contenedor de las bases de datos de origen seleccionadas.
fr: Entrez le nom de la base de données cible et sélectionnez le groupe de ressources, le compte de stockage et le conteneur des bases de données sources sélectionnées.
ja: ターゲット データベース名を入力し、選択したソース データベースのリソース グループ、ストレージ アカウント、コンテナーを選択します。
ko: 대상 데이터베이스 이름을 입력하고 선택한 원본 데이터베이스에 대한 리소스 그룹, 스토리지 계정 및 컨테이너를 선택합니다.
pt_br: Inserir o nome do banco de dados de destino e selecionar grupo de recursos, conta de armazenamento e contêiner para os bancos de dados de origem selecionados.
ru: Введите имя целевой базы данных и выберите группу ресурсов, учетную запись хранения и контейнер для выбранных баз данных источника.
zh_hans: 输入目标数据库名称，并为所选源数据库选择资源组、存储帐户和容器。
zh_hant: 輸入目標資料庫名稱，然後選取所選源資料庫的資源群組、儲存體帳戶和容器。

# sql.migration.source.details.sqlAuth.nonDb
source: Enter the SQL Authentication credentials used to connect to SQL Server instance {0}. These credentials will be used to connect to the SQL Server instance and identify valid backup files.
de: Geben Sie die Anmeldeinformationen für die SQL-Authentifizierung ein, die zum Herstellen einer Verbindung mit SQL Server Instanz {0} verwendet werden. Diese Anmeldeinformationen werden verwendet, um eine Verbindung mit der SQL Server-Instanz herzustellen und gültige Sicherungsdateien zu identifizieren.
es: Escriba las credenciales de autenticación de SQL usadas para conectarse a la instancia de SQL Server{0}. Se usarán estas credenciales para conectarse a la instancia de SQL Server e identificar archivos de copia de seguridad válidos.
fr: Saisissez les identifiants d’authentification SQL utilisés pour vous connecter à l’instance SQL Server {0}. Ces informations d’identification seront utilisées pour se connecter à l’instance SQL Server et identifier les fichiers de sauvegarde valides.
ja: SQL Server インスタンス {0} への接続に使用する SQL 認証の資格情報を入力します。これらの資格情報は、SQL Server インスタンスに接続して、有効なバックアップ ファイルを識別するために使用されます。
ko: {0} SQL Server 인스턴스에 연결하는 데 사용할 SQL 인증 자격 증명을 입력합니다. SQL Server 인스턴스에 연결하고 유효한 백업 파일을 식별하는 데 이 자격 증명을 사용합니다.
pt_br: Insira as credenciais de Autenticação do SQL usadas para se conectar à Instância do SQL Server {0}. Essas credenciais serão usadas para se conectar à instância do SQL Server e identificar arquivo de backup válido.
ru: Введите учетные данные проверки подлинности SQL, используемые для подключения к экземпляру SQL Server {0}. Эти учетные данные будут использоваться для подключения к экземпляру SQL Server и определения действительных файлов резервных копий.
zh_hans: 输入用于连接到 SQL Server 实例 {0} 的 SQL 身份验证凭据。这些凭据将用于连接到 SQL Server 实例并标识有效的备份文件。
zh_hant: 輸入用來連線到 SQL Server 執行個體 {0} 的 SQL 驗證認證。這些認證將用來連線到 SQL Server 執行個體，並識別有效的備份檔案。

# sql.migration.source.details.sqlAuth.db
source: Enter the SQL Authentication credentials used to connect to SQL Server instance {0}. These credentials will be used to connect to the SQL Server instance from the self-hosted integration runtime.
de: Geben Sie die SQL-Authentifizierungsdaten ein, die für die Verbindung zur SQL Server-Instanz {0} verwendet werden. Diese Anmeldeinformationen werden für die Verbindung mit der SQL Server-Instanz von der selbst gehosteten Integrationslaufzeit aus verwendet.
es: Escriba las credenciales de autenticación de SQL utilizadas para conectarse a SQL Server instancia {0}. Estas credenciales se usarán para conectarse a la instancia de SQL Server desde el entorno de ejecución de integración autohospedado.
fr: Entrez les informations d'identification d'authentification SQL utilisées pour se connecter à l'instance SQL Server {0}. Ces informations d'identification seront utilisées pour se connecter à l'instance SQL Server à partir du runtime d'intégration auto-hébergé.
ja: SQL Server インスタンス {0} への接続に使用する SQL 認証の資格情報を入力してください。これらの資格情報は、セルフホステッド統合ランタイムから SQL Server インスタンスへの接続に使用されます。
ko: {0} SQL Server 인스턴스에 연결하는 데 사용한 SQL 인증 자격 증명을 입력합니다. 이러한 자격 증명은 자체 호스팅 통합 런타임에서 SQL Server 인스턴스에 연결하는 데 사용됩니다.
pt_br: Insira as credenciais de Autenticação do SQL usadas para conectar-se à instância do SQL Server {0}. Essas credenciais serão usadas para se conectar à instância do SQL Server a partir do runtime de integração auto-hospedada.
ru: Введите учетные данные проверки подлинности SQL, используемые для подключения к экземпляру SQL Server {0}. Эти учетные данные будут использоваться для подключения к экземпляру SQL Server из локальной среды выполнения интеграции.
zh_hans: 输入用于连接到 SQL Server 实例 {0} 的 SQL 身份验证凭据。这些凭据将用于从自承载集成运行时连接到 SQL Server 实例。
zh_hant: 輸入用來連線到 SQL Server 執行個體 {0} 的 SQL 驗證認證。這些認證將用來將自我裝載整合執行階段連線到 SQL Server 執行個體。

# sql.migration.source.details.windowAuth.nonDb
source: Enter the Windows Authentication credentials used to connect to SQL Server instance {0}. These credentials will be used to connect to the SQL Server instance and identify valid backup files.
de: Geben Sie die Anmeldeinformationen für die Windows-Authentifizierung ein, die zum Herstellen einer Verbindung mit SQL Server-Instanz {0}verwendet werden. Diese Anmeldeinformationen werden verwendet, um eine Verbindung mit der SQL Server-Instanz herzustellen und gültige Sicherungsdateien zu identifizieren.
es: Escriba las credenciales de autenticación de Windows usadas para conectarse a la instancia de SQL Server {0}. Estas credenciales se usarán para conectarse a la instancia de SQL Server e identificar archivos de copia de seguridad válidos.
fr: Entrez les informations d’identification d’authentification Windows utilisées pour se connecter à SQL Server instance {0}. Ces informations d’identification seront utilisées pour se connecter à l’instance SQL Server et identifier les fichiers de sauvegarde valides.
ja: SQL Server インスタンス {0} への接続に使用する Windows 認証の資格情報を入力します。これらの資格情報は、SQL Server インスタンスに接続して、有効なバックアップ ファイルを識別するために使用されます。
ko: SQL Server 인스턴스 {0}에 연결하는 데 사용되는 Windows 인증 자격 증명을 입력합니다. 이러한 자격 증명은 SQL Server 인스턴스에 연결하고 유효한 백업 파일을 식별하는 데 사용됩니다.
pt_br: Insira as credenciais de Autenticação do Windows usadas para se conectar à Instância do SQL Server {0}. Essas credenciais serão usadas para se conectar à instância do SQL Server e identificar arquivos de backup válidos.
ru: Введите учетные данные проверки подлинности Windows, используемые для подключения к экземпляру SQL Server {0}. Эти учетные данные будут использоваться для подключения к экземпляру SQL Server и определения действительных файлов резервных копий.
zh_hans: 输入用于连接到 SQL Server 实例 {0} 的 Windows 身份验证凭据。这些凭据将用于连接到 SQL Server 实例并标识有效的备份文件。
zh_hant: 輸入用來連線到 SQL Server 執行個體 {0} 的 Windows 驗證認證。這些認證將用來連線到 SQL Server 執行個體，並識別有效的備份檔案。

# sql.migration.source.details.windowAuth.db
source: Enter the Windows Authentication credentials used to connect to SQL Server instance {0}. These credentials will be used to connect to the SQL Server instance from the self-hosted integration runtime.
de: Geben Sie die Windows-Authentifizierungsdaten ein, die für die Verbindung zur SQL Server-Instanz {0} verwendet werden. Diese Anmeldeinformationen werden für die Verbindung mit der SQL Server-Instanz von der selbst gehosteten Integrationslaufzeit aus verwendet.
es: Escriba las credenciales de autenticación de Windows usadas para conectarse a SQL Server instancia {0}. Estas credenciales serán utilizadas para conectarse a la instancia de SQL Server desde el tiempo de ejecución de integración autohospedado.
fr: Entrez les informations d'identification d'authentification Windows utilisées pour se connecter à l'instance SQL Server {0}. Ces informations d'identification seront utilisées pour se connecter à l'instance SQL Server à partir du runtime d'intégration auto-hébergé.
ja: SQL Server インスタンス {0} への接続に使用する Windows 認証の資格情報を入力してください。これらの資格情報は、セルフホステッド統合ランタイムから SQL Server インスタンスへの接続に使用されます。
ko: {0} SQL Server 인스턴스에 연결하는 데 사용한 Windows 인증 자격 증명을 입력합니다. 이러한 자격 증명은 자체 호스팅 통합 런타임에서 SQL Server 인스턴스에 연결하는 데 사용됩니다.
pt_br: Insira as credenciais de autenticação do Windows usadas para conectar-se à instância do SQL Server {0}. Essas credenciais serão usadas para se conectar à instância do SQL Server a partir do runtime de integração auto-hospedada.
ru: Введите учетные данные проверки подлинности Windows, используемые для подключения к экземпляру SQL Server {0}. Эти учетные данные будут использоваться для подключения к экземпляру SQL Server из локальной среды выполнения интеграции.
zh_hans: 输入用于连接到 SQL Server 实例 {0} 的 Windows 身份验证凭据。这些凭据将用于从自承载集成运行时连接到 SQL Server 实例。
zh_hant: 輸入用來連線到 SQL Server 執行個體 {0} 的 Windows 驗證認證。這些認證將用來將自我裝載整合執行階段連線到 SQL Server 執行個體。

# sql.migration.enter.your.sql.cred
source: Enter the credentials for the source SQL Server instance. These credentials will be used while migrating databases to Azure SQL.
de: Geben Sie die Anmeldeinformationen für die Quelle der SQL Server-Instanz ein. Diese Anmeldeinformationen werden beim Migrieren von Datenbanken zu Azure SQL verwendet.
es: Escriba las credenciales para la instancia de SQL Server de origen. Estas credenciales se usarán al migrar las bases de datos a Azure SQL.
fr: Entrez les informations d’identification de l’instance de SQL Server source. Ces informations d’identification seront utilisées lors de la migration des bases de données vers Azure SQL.
ja: ソース SQL Server インスタンスの資格情報を入力します。これらの資格情報は、データベースを Azure SQL に移行する場合に使用されます。
ko: 원본 SQL Server 인스턴스에 대한 자격 증명을 입력합니다. 이러한 자격 증명은 데이터베이스를 Azure SQL로 마이그레이션하는 동안 사용됩니다.
pt_br: Insira as credenciais para a Instância do SQL Server de origem. Essas credenciais serão usadas ao migrar bancos de dados para o SQL do Azure.
ru: Введите учетные данные для источника экземпляра SQL Server. Эти учетные данные будут использоваться при миграции баз данных в Azure SQL.
zh_hans: 输入源 SQL Server 实例的凭据。将数据库迁移到 Azure SQL 时将使用这些凭据。
zh_hant: 輸入來源 SQL Server 執行個體的認證。將資料庫移轉到 Azure SQL 時，將會使用此認證。

# sql.migration.select.storage.account.heading
source: Enter the details below to select the Azure Storage account and save the script as template
zh_hans: 输入下面的详细信息以选择 Azure 存储帐户并将脚本另存为模板

# sql.migration.services.container.description
source: Enter the information below to add a new Azure Database Migration Service.
de: Geben Sie die folgenden Informationen ein, um einen neuen Azure Database Migration Service hinzuzufügen.
es: Escriba la información siguiente para agregar una nueva Azure Database Migration Service.
fr: Entrez les informations ci-dessous pour ajouter une nouvelle Azure Database Migration Service.
ja: 以下の情報を入力して、新しい Azure Database Migration Service を追加します。
ko: 새 Azure Database Migration Service를 추가하려면 아래 정보를 입력하세요.
pt_br: Insira as informações abaixo para adicionar um novo Serviço de Migração de Banco de Dados do Azure.
ru: Чтобы добавить новую службу Azure Database Migration Service, введите сведения ниже.
zh_hans: 在下面输入信息以添加新的 Azure 数据库迁移服务。
zh_hant: 請在下方輸入資訊，以新增 Azure 資料庫移轉服務。

# sql.migration.services.container.description.network
source: Enter the information below to add a new Azure Database Migration Service. To register self-hosted integration runtime, select 'My database backups are on a network share' on the previous page.
de: Geben Sie die folgenden Informationen ein, um eine neue Azure Database Migration Service hinzuzufügen. Um die selbstgehostete Integration Runtime zu registrieren, wählen Sie auf der vorherigen Seite "Meine Datenbanksicherungen befinden sich auf einer Netzwerkfreigabe" aus.
es: Escriba la información siguiente para agregar una nueva instancia de Azure Database Migration Service. Para registrar el entorno de ejecución de integración autohospedado, seleccione "Mis copias de seguridad de base de datos están en un recurso compartido de red" en la página anterior.
fr: Entrez les informations ci-dessous pour ajouter une nouvelle Azure Database Migration Service. Pour inscrire le runtime d’intégration auto-hébergé, sélectionnez « Mes sauvegardes de base de données se trouvent sur un partage réseau » dans la page précédente.
ja: 以下の情報を入力して、新しい Azure Database Migration Service を追加します。セルフホステッド統合ランタイムを登録するには、前のページで [データベースのバックアップがネットワーク共有上にある] を選択します。
ko: 새 Azure Database Migration Service를 추가하려면 아래에 정보를 입력하세요. 자체 호스팅 통합 런타임을 등록하려면 이전 페이지에서 '내 데이터베이스 백업이 네트워크 공유에 있음'을 선택합니다.
pt_br: Insira as informações abaixo para adicionar um novo Serviço de Migração de Banco de Dados do Azure. Para registrar o runtime de integração auto-hospedada, selecione “Meus backups de banco de dados estão em um compartilhamento de rede” na página anterior.
ru: Введите сведения ниже, чтобы добавить новую службу Azure Database Migration Service. Чтобы зарегистрировать локальную среду выполнения интеграции, выберите "Мои резервные копии базы данных находятся в сетевой папке" на предыдущей странице.
zh_hans: 输入下面的信息以添加新 Azure 数据库迁移服务。若要注册自承载集成运行时，请在上一页上选择“我的数据库备份位于网络共享上”。
zh_hant: 請在下方輸入資訊，以新增一個新的 Azure 資料庫移轉服務。若要註冊自我裝載整合執行階段，請在上一頁選取 [我的資料庫備份在網路共用上]。
