Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.datavirtualization.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# sourceNameInput
source: External Data Source Name
de: Name der externen Datenquelle
es: Nombre del origen de datos externo
fr: Nom de la source de données externe
it: Nome origine dati esterna
ja: 外部データ ソース名
ko: 외부 데이터 원본 이름
pt_br: Nome da Fonte de Dados Externa
ru: Имя внешнего источника данных
zh_hans: 外部数据源名称
zh_hant: 外部資料來源名稱

# credentialNameInput
source: New Credential Name
de: Name der neuen Anmeldeinformationen
es: Nuevo nombre de credencial
fr: Nouveau nom d'identification
it: Nome nuova credenziale
ja: 新しい資格情報名
ko: 새 자격 증명 이름
pt_br: Novo Nome da Credencial
ru: Новое имя учетных данных
zh_hans: 新的凭据名称
zh_hant: 新的認證名稱

# passwordInput
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# serverFields
source: Server Connection
de: Serververbindung
es: Conexión de servidor
fr: Connexion au serveur
it: Connessione server
ja: サーバー接続
ko: 서버 연결
pt_br: Conexão do Servidor
ru: Соединение с сервером
zh_hans: 服务器连接
zh_hant: 伺服器連接

# dataSourceHelpText
source: The name for your External Data Source.
de: Der Name für Ihre externe Datenquelle.
es: Nombre del origen de datos externo.
fr: Nom de votre source de données externe.
it: Nome dell'origine dati esterna.
ja: 外部データ ソースの名前。
ko: 외부 데이터 원본의 이름입니다.
pt_br: O nome da Fonte de dados externa.
ru: Имя внешнего источника данных.
zh_hans: 外部数据源的名称。
zh_hant: 外部資料來源的名稱。

# credNameHelpText
source: The name of the Database Scoped Credential used to securely store the login information for the External Data Source you are creating.
de: Der Name der datenbankbezogenen Anmeldeinformationen, die zum sicheren Speichern der Anmeldeinformationen für die zu erstellende externe Datenquelle verwendet werden.
es: Nombre de la credencial con ámbito de base de datos que se usa para almacenar de forma segura la información de inicio de sesión del origen de datos externo que está creando.
fr: Le nom des informations d'identification étendues à la base de données utilisées pour stocker en toute sécurité les informations de connexion pour la source de données externe que vous créez.
it: Nome delle credenziali con ambito database utilizzate per archiviare in modo sicuro le informazioni di accesso per l'origine dati esterna che si sta creando.
ja: 作成する外部データ ソースのログイン情報を安全に保存するために使用されるデータベース スコープ資格情報の名前です。
ko: 생성 중인 외부 데이터 원본에 대한 로그인 정보를 안전하게 저장하는 데 사용되는 데이터베이스 범위 자격 증명의 이름입니다.
pt_br: O nome da Credencial Incluída no Escopo do Banco de Dados usada para armazenar com segurança as informações de login da Fonte de Dados Externa que você está criando.
ru: Имя учетных данных с областью действия базы данных, используемых для безопасного хранения информации для входа в создаваемый внешний источник данных.
zh_hans: 用于安全存储正在创建的外部数据源的登录信息的数据库范围内凭据的名称。
zh_hant: 用來安全地儲存您正在建立的外部資料來源登入資訊的資料庫範圍認證名稱。

# usernameInput
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# masterKeyExistsMsg
source: A Master Key already exists for the selected database. No action is required on this page.
de: Für die ausgewählte Datenbank ist bereits ein Hauptschlüssel vorhanden. Auf dieser Seite ist keine Aktion erforderlich.
es: Ya existe una clave maestra para la base de datos seleccionada. No se requiere ninguna acción en esta página.
fr: Une clé principale existe déjà pour la base de données sélectionnée. Aucune action n'est requise sur cette page.
it: Esiste già una chiave master per il database selezionato. In questa pagina non è richiesta alcuna azione.
ja: 選択したデータベースのマスター キーは既に存在します。このページでの操作は必要ありません。
ko: 선택한 데이터베이스에 대한 마스터 키가 이미 있습니다. 이 페이지에서는 조치가 필요하지 않습니다.
pt_br: Já existe uma Chave Mestra para o banco de dados selecionado. Nenhuma ação é necessária nessa página.
ru: Для выбранной базы данных уже существует главный ключ. Действий на этой странице не требуется.
zh_hans: 所选数据库已存在主密钥。无需执行此页面上的任何操作。
zh_hant: 選取的資料庫已有主要金鑰。此頁面不需要採取任何動作。

# createMasterKeyDescription
source: A master key is required. This secures the credentials used by an External Data Source. Note that you should back up the master key by using BACKUP MASTER KEY and store the backup in a secure, off-site location.
de: Es wird ein Hauptschlüssel benötigt. Dieser schützt die von einer externen Datenquelle verwendeten Anmeldeinformationen. Hinweis: Sichern Sie den Hauptschlüssel mit BACKUP MASTER KEY, und speichern Sie die Sicherung an einem sicheren Ort außerhalb des Standorts.
es: Se requiere una clave maestra. Esto protege las credenciales utilizadas por una fuente de datos externa. Tenga en cuenta que debe hacer una copia de seguridad de la clave maestra usando BACKUP MASTER KEY y almacenar la copia de seguridad en una ubicación segura fuera del sitio.
fr: Une clé principale est requise. Cela sécurise les informations d'identification utilisées par une source de données externe. Notez que vous devez sauvegarder la clé principale à l'aide de BACKUP MASTER KEY et stocker la sauvegarde dans un emplacement sécurisé hors site.
it: È necessaria una chiave master. In questo modo vengono protette le credenziali utilizzate da un'origine dati esterna. Si noti che è necessario eseguire il backup della chiave master utilizzando BACKUP MASTER KEY e archiviare il backup in una posizione sicura all'esterno del sito.
ja: マスター キーが必要です。これにより、外部データ ソースで使用される資格情報がセキュリティで保護されます。バックアップ マスター キーを使用してマスター キーをバックアップし、バックアップを安全なオフサイトの場所に保存する必要があります。
ko: 마스터 키가 필요합니다. 이렇게 하면 외부 데이터 원본에서 사용하는 자격 증명이 보호됩니다. BACKUP MASTER KEY를 사용하여 마스터 키를 백업하고 안전한 오프사이트 위치에 백업을 저장해야 합니다.
pt_br: Uma chave mestra é necessária. Isso protege as credenciais usadas por uma Fonte de Dados Externa. Observe que você deve fazer backup da chave mestra usando uma CHAVE MESTRA DE BACKUP e armazenar o backup em um local seguro e fora do local.
ru: Требуется главный ключ. Это защищает учетные данные, используемые внешним источником данных. Обратите внимание, что вы должны создать резервную копию главного ключа с помощью BACKUP MASTER KEY и хранить резервную копию в безопасном месте за пределами сайта.
zh_hans: 主密钥是必需的。这可保护外部数据源使用的凭据。请注意，应使用 BACKUP MASTER KEY 备份主密钥，并将备份存储在安全的站点外位置。
zh_hant: 需要主要金鑰。這會保護外部資料來源使用的認證。請注意，您應使用 BACKUP MASTER KEY 備份主要金鑰，並將備份儲存在安全的非現場位置。

# masterKeyPasswordConfirmInput
source: Confirm Password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認入力
ko: 암호 확인
pt_br: Confirmar Senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# createMasterKeyTitle
source: Create Database Master Key
de: Datenbankhauptschlüssel erstellen
es: Crear clave maestra de base de datos
fr: Créer une clé principale de base de données
it: Crea chiave master del database
ja: データベース マスター キーを作成する
ko: 데이터베이스 마스터 키 생성
pt_br: Criar uma Chave Mestra de Banco de Dados
ru: Создать главный ключ базы данных
zh_hans: 创建数据库主密钥
zh_hant: 建立資料庫主要金鑰

# masterKeyPasswordInput
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# passwordMismatchWithConfirmError
source: Password values do not match.
de: Kennwörter stimmen nicht überein.
es: Los valores de contraseña no coinciden.
fr: Les valeurs de mot de passe ne correspondent pas.
it: I valori della password non corrispondono.
ja: パスワードの値が一致しません。
ko: 암호 값이 일치하지 않습니다.
pt_br: Os valores de senha não correspondem.
ru: Значения пароля не совпадают.
zh_hans: 密码值不匹配。
zh_hant: 密碼值不符。

# masterKeyPasswordLabel
source: Set the Master Key password.
de: Legen Sie das Hauptschlüsselkennwort fest.
es: Establecer la contraseña de la clave maestra.
fr: Définissez le mot de passe de la clé principale.
it: Imposta la password della chiave master.
ja: マスター キーのパスワードを設定します。
ko: 마스터 키 암호를 설정합니다.
pt_br: Defina a senha da Chave Mestra.
ru: Задайте пароль главного ключа.
zh_hans: 设置主密钥密码。
zh_hant: 設定主要金鑰密碼。

# pwdReminderText
source: Strong passwords use a combination of alphanumeric, upper, lower, and special characters.
de: Sichere Kennwörter bestehen aus einer Kombination von alphanumerischen Zeichen, Groß- und Kleinbuchstaben sowie Sonderzeichen.
es: Las contraseñas seguras usan una combinación de caracteres alfanuméricos, superiores, inferiores y especiales.
fr: Les mots de passe forts utilisent une combinaison de caractères alphanumériques, majuscules, minuscules et spéciaux.
it: Le password complesse usano una combinazione di caratteri alfanumerici, superiori, inferiori e speciali.
ja: 強力なパスワードには、英数字、大文字、小文字、特殊文字の組み合わせを使用します。
ko: 강력한 암호는 영숫자, 대문자, 소문자 및 특수 문자의 조합을 사용합니다.
pt_br: Senhas fortes usam uma combinação de caracteres alfanuméricos, letra maiúscula, letra minúscula e caracteres especiais.
ru: Надежные пароли используют сочетание букв, цифр, верхних, нижних и специальных символов.
zh_hans: 强度高的密码使用字母数字、大小写字母和特殊字符的组合。
zh_hant: 強式密碼使用英數字元、大寫、小寫和特殊字元的組合。

# mappingTableCheckboxHelpText
source: Clicking on the checkbox will select that table to be mapped.
de: Wenn Sie das Kontrollkästchen aktivieren, wird die zuzuordnende Tabelle ausgewählt.
es: Al hacer clic en la casilla, se seleccionará la tabla que se va a asignar.
fr: Cliquer sur la case à cocher sélectionnera cette table à mapper.
it: Facendo clic sulla casella di controllo verrà selezionata la tabella di cui eseguire il mapping.
ja: チェックボックスをクリックすると、マップするテーブルが選択されます。
ko: 확인란을 클릭하면 매핑할 테이블이 선택됩니다.
pt_br: Clicar na caixa de seleção selecionará a tabela a ser mapeada.
ru: При нажатии флажка будет выбрана таблица для сопоставления.
zh_hans: 点击复选框将选择要映射的表。
zh_hant: 按一下核取方塊會選取要對應的資料表。

# mappingTableHelpText
source: Clicking on the table name will show you the column mapping information for that table.
de: Wenn Sie auf den Tabellennamen klicken, werden die Spaltenzuordnungsinformationen für diese Tabelle angezeigt.
es: Al hacer clic en el nombre de la tabla, se mostrará la información de asignación de columnas para esa tabla.
fr: Cliquer sur le nom de la table vous montrera les informations de mappage de colonne pour cette table.
it: Facendo clic sul nome della tabella verranno visualizzate le informazioni di mapping delle colonne per la tabella.
ja: テーブル名をクリックすると、そのテーブルの列マッピング情報が表示されます。
ko: 테이블 이름을 클릭하면 해당 테이블에 대한 열 매핑 정보가 표시됩니다.
pt_br: Clicar no nome da tabela lhe mostrará as informações de mapeamento de coluna para essa tabela.
ru: Щелкнув имя таблицы, вы сможете просмотреть сведения о сопоставлении столбцов для этой таблицы.
zh_hans: 点击表名将显示该表的列映射信息。
zh_hant: 按一下資料表名稱會顯示該資料表的資料行對應資訊。

# mapping.collations
source: Collations
de: Sortierungen
es: Intercalaciones
it: Regole di confronto
ja: 照合順序
ko: 데이터 정렬
pt_br: Regras de comparação e ordenação
ru: Параметры сортировки
zh_hans: 排序规则
zh_hant: 定序

# externalTableMappingLabel
source: Column Mapping
de: Spaltenzuordnung
es: Asignación de columnas
fr: Mappage de colonnes
it: Mapping colonne
ja: 列マッピング
ko: 열 매핑
pt_br: Mapeamento de Coluna
ru: Сопоставление столбцов
zh_hans: 列映射
zh_hant: 資料行對應

# mapping.externalName
source: External
de: Extern
es: Externo
fr: Externe
it: Esterno
ja: 外部
ko: 외부
pt_br: Externo
ru: Внешний
zh_hans: 外部
zh_hant: 外部

# objectMappingTitle
source: Map your data source objects to your external table
de: Ordnen Sie Ihre Datenquellenobjekte der externen Tabelle zu.
es: Asignar los objetos de origen de datos a la tabla externa
fr: Mappez vos objets de source de données à votre table externe
it: Eseguire il mapping degli oggetti origine dati alla tabella esterna
ja: データ ソース オブジェクトを外部テーブルにマップする
ko: 데이터 원본 개체를 외부 테이블에 매핑
pt_br: Mapear os objetos da sua fonte de dados para a sua tabela externa
ru: Сопоставление объектов источника данных с внешней таблицей
zh_hans: 将数据源对象映射到外部表
zh_hant: 將您的資料來源物件對應到外部資料表

# noObjectSelectedMessage
source: No objects were selected.
de: Es wurden keine Objekte ausgewählt.
es: No se seleccionó ningún objeto.
fr: Aucun objet n’a été sélectionné.
it: Nessun oggetto selezionato.
ja: オブジェクトが選択されていません。
ko: 선택된 개체가 없습니다.
pt_br: Nenhum objeto foi selecionado.
ru: Объекты не выбраны.
zh_hans: 未选择对象。
zh_hant: 未選取任何物件。

# noTableError
source: No table information present for '{0}'
de: Für '{0}' sind keine Tabelleninformationen vorhanden.
es: No hay información de tabla presente para "{0}"
fr: Aucune information de table présente pour '{0}'
it: Non sono presenti informazioni sulla tabella per '{0}'
ja: '{0}' のテーブル情報が存在しません
ko: '{0}'에 대한 테이블 정보가 없습니다.
pt_br: Nenhuma informação de tabela presente para "{0}"
ru: Нет сведений о таблице для "{0}"
zh_hans: 没有“{0}”的表信息
zh_hant: '{0}' 沒有資料表資訊

# mapping.nullable
source: Nullable
de: Nullwerte zulassend
es: Acepta valores NULL
it: Ammette valori Null
ja: Null 許容
ko: 널 입력 가능
pt_br: Anulável
ru: Допускающее значение NULL
zh_hans: 可为 Null
zh_hant: 可為 Null

# mapping.sqlDataType
source: SQL Data Type
de: SQL-Datentyp
es: Tipo de datos SQL
fr: Type de données langage SQL
it: Tipo di dati SQL
ja: SQL データ型
ko: SQL 데이터 유형
pt_br: Tipo de Dados do SQL
ru: Тип данных SQL
zh_hans: SQL 数据类型
zh_hant: SQL 資料類型

# mapping.SourceName
source: Source
de: Quelle
es: Origen
it: Origine
ja: ソース
ko: 원본
pt_br: Fonte
ru: Источник
zh_hans: 源
zh_hant: 來源

# tableFolderLabel
source: Tables
de: Tabellen
es: Tablas
it: Tabelle
ja: テーブル
ko: 테이블
pt_br: Tabelas
ru: Таблицы
zh_hans: 表
zh_hant: 表格

# warning.unsupported_column_type_description
source: These column types are not supported for external tables:{0}{1}
de: Diese Spaltentypen werden für externe Tabellen nicht unterstützt:{0}{1}
es: Estos tipos de columna no se admiten para tablas externas:{0}{1}
fr: Ces types de colonnes ne sont pas compatibles avec les tables externes : {0}{1}
it: Questi tipi di colonna non sono supportati per le tabelle esterne:{0}{1}
ja: これらの列の種類は次の外部テーブルではサポートされていません:{0}{1}
ko: 다음 열 유형은 외부 테이블에서 지원되지 않습니다.{0}{1}
pt_br: Esses tipos de coluna não têm suporte para tabelas externas:{0}{1}
ru: Эти типы столбцов не поддерживаются для внешних таблиц:{0}{1}
zh_hans: 外部表不支持这些列类型:{0}{1}
zh_hant: 外部資料表不支援這些資料行類型: {0}{1}

# warning.unsupported_column_type_title
source: Unsupported Column Types found
de: Nicht unterstützte Spaltentypen gefunden
es: Se encontraron tipos de columna no admitidos
fr: Types de colonnes non pris en charge trouvés
it: Sono stati trovati tipi di colonna non supportati
ja: サポートされていない列の種類が見つかりました
ko: 지원되지 않는 열 형식
pt_br: Tipos de coluna sem suporte encontrados
ru: Найдены неподдерживаемые типы столбцов
zh_hans: 找到不受支持的列类型
zh_hant: 找到不支援的資料行類型

# viewFolderLabel
source: Views
de: Sichten
es: Vistas
fr: Vues
it: Visualizzazioni
ja: ビュー
ko: 견해
pt_br: Exibições
ru: Представления
zh_hans: 视图
zh_hant: 檢視

# noServerTypeError
source: A data source type must be selected.
de: Es muss ein Datenquellentyp ausgewählt werden.
es: Debe seleccionarse un tipo de origen de datos.
fr: Un type de source de données doit être sélectionné.
it: È necessario selezionare un tipo di origine dati.
ja: データ ソースの種類を選択する必要があります。
ko: 데이터 원본 유형을 선택해야 합니다.
pt_br: Um tipo de fonte de dados deve ser selecionado.
ru: Необходимо выбрать тип источника данных.
zh_hans: 必须选择数据源类型。
zh_hant: 必須選取資料來源類型。

# noDestDatabaseError
source: A destination database must be selected.
de: Es muss eine Zieldatenbank ausgewählt sein.
es: Debe seleccionarse una base de datos de destino.
fr: Une base de données de destination doit être sélectionnée.
it: È necessario selezionare un database di destinazione.
ja: 同期先データベースを選択する必要があります。
ko: 대상 데이터베이스를 선택해야 합니다.
pt_br: O banco de dados de destino precisa ser selecionado.
ru: Требуется выбрать целевую базу данных.
zh_hans: 必须选择目标数据库。
zh_hant: 必須選取目的地資料庫。

# defaultSourceType
source: Default
de: Standard
es: Valor predeterminado
fr: Par défaut
it: Predefinito
ja: 既定
ko: 기본값
pt_br: Padrão
ru: По умолчанию
zh_hans: 默认值
zh_hant: 預設

# selectDataSrcTitle
source: Select a Data Source
de: Datenquelle auswählen
es: Seleccionar un origen de datos
fr: Sélectionnez une source de données
it: Selezione origine dati
ja: データ ソースの選択
ko: 데이터 원본 선택
pt_br: Selecionar uma Fonte de Dados
ru: Выбор источника данных
zh_hans: 选择数据源
zh_hant: 選取資料來源

# destDBLabel
source: Select the destination database for your external table
de: Wählen Sie die Zieldatenbank für Ihre externe Tabelle aus.
es: Selección de la base de datos de destino para la tabla externa
fr: Sélectionnez la base de données de destination pour votre table externe
it: Selezionare il database di destinazione per la tabella esterna
ja: 外部テーブルの宛先データベースを選択する
ko: 외부 테이블의 대상 데이터베이스를 선택하세요.
pt_br: Selecione o banco de dados de destino para sua tabela externa
ru: Выберите конечную базу данных для внешней таблицы
zh_hans: 选择外部表的目标数据库
zh_hant: 選取外部資料表的目的地資料庫

# sourceCardsLabel
source: Select your data source type
de: Datenquellentyp auswählen
es: Seleccionar el tipo de origen de datos
fr: Sélectionnez votre type de source de données
it: Selezionare il tipo di origine dati
ja: データ ソースの種類を選択する
ko: 데이터 원본 유형 선택
pt_br: Selecionar o tipo da sua fonte de dados
ru: Выберите тип источника данных
zh_hans: 选择数据源
zh_hant: 選取資料來源類型

# destDBHelpText
source: The database in which to create your External Data Source.
de: Die Datenbank, in der Ihre externe Datenquelle erstellt werden soll.
es: Base de datos en la que se va a crear el origen de datos externo.
fr: La base de données dans laquelle créer votre source de données externe.
it: Database in cui creare l'origine dati esterna.
ja: 外部データ ソースを作成するデータベースです。
ko: 외부 데이터 원본을 생성할 데이터베이스입니다.
pt_br: O banco de dados no qual criar sua Fonte de Dados Externa.
ru: База данных для создания внешнего источника данных.
zh_hans: 要在其中创建外部数据源的数据库。
zh_hant: 要在其中建立外部資料來源的資料庫。

# summaryMasterKeyLabel
source: Database Master Key
de: Datenbankhauptschlüssel
es: Clave maestra de base de datos
fr: Clé principale de base de données
it: Chiave master database
ja: データベース マスター キー
ko: 데이터베이스 마스터 키
pt_br: Chave Mestra do Banco de Dados
ru: Главный ключ базы данных
zh_hans: 数据库主密钥
zh_hant: 資料庫主要金鑰

# summaryCredLabel
source: Database Scoped Credential
de: Datenbankbezogene Anmeldeinformationen
es: Credencial de ámbito de base de datos
fr: Informations d'identification étendues à la base de données
it: Credenziali con ambito database
ja: データベース スコープ資格情報
ko: 데이터베이스 범위 자격 증명
pt_br: Credencial Incluída no Escopo do Banco de Dados
ru: Учетные данные для базы данных
zh_hans: 数据库范围的凭据
zh_hant: 資料庫範圍認證

# summaryDestDb
source: Destination Database:
de: Zieldatenbank:
es: Base de datos de destino:
fr: Base de données de destinations :
it: Database di destinazione:
ja: 転送先データベース:
ko: 대상 데이터베이스:
pt_br: Banco de Dados de Destino:
ru: Целевая база данных:
zh_hans: 目标数据库:
zh_hant: 目的地資料庫:

# virtualizeTaskStart
source: Executing script...
de: Skript wird ausgeführt...
es: Ejecutando script...
fr: Exécution du script...
it: Esecuzione dello script in corso...
ja: スクリプトを実行しています...
ko: 스크립트 실행 중...
pt_br: Executando o script...
ru: Выполнение сценария...
zh_hans: 正在执行脚本…。
zh_hant: 正在執行指令碼...

# summaryDataSrcLabel
source: External Data Source
de: Externe Datenquelle
es: Origen de datos externo
fr: Source de données externe
it: Origine dati esterna
ja: 外部データ ソース
ko: 외부 데이터 원본
pt_br: Fonte de Dados Externa
ru: Внешний источник данных
zh_hans: 外部数据源
zh_hant: 外部資料來源

# summaryExternalTableLabel
source: External Table
de: Externe Tabelle
es: Tabla externa
fr: Table externe
it: Tabella esterna
ja: 外部テーブル
ko: 외부 테이블
pt_br: Tabela Externa
ru: Внешняя таблица
zh_hans: 外部表
zh_hant: 外部資料表

# createSourceInfo
source: External Table creation completed successfully
de: Externe Tabelle wurde erfolgreich erstellt
es: La creación de la tabla externa se completó correctamente
fr: La création de la table externe s’est terminée correctement
it: La creazione della tabella esterna è stata completata
ja: 外部テーブルの作成が正常に完了しました
ko: 외부 테이블 만들기가 완료되었습니다.
pt_br: Criação de Tabela Externa concluída com êxito
ru: Создание внешней таблицы завершено
zh_hans: 已成功完成外部表创建
zh_hant: 外部資料表建立已成功完成

# createSourceError
source: External Table creation failed
de: Fehler beim Erstellen der externen Tabelle
es: Error al crear la tabla externa
fr: La création de la table externe a échoué
it: Creazione della tabella esterna non riuscita
ja: 外部テーブルの作成に失敗しました
ko: 외부 테이블 생성 실패
pt_br: Falha na criação da Tabela Externa
ru: Не удалось создать внешнюю таблицу
zh_hans: 外部表创建失败
zh_hant: 外部資料表建立失敗

# summaryObjNameLabel
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# summaryObjTypeLabel
source: Object type
de: Objekttyp
es: Tipo de objeto
fr: Type d'objet
it: Tipo di oggetto
ja: オブジェクトの種類
ko: 개체 유형
pt_br: Tipo de Objeto
ru: Тип объекта
zh_hans: 对象类型
zh_hant: 物件類型

# summaryNewSchemaLabel
source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
ko: 스키마
pt_br: Esquema
ru: Схема
zh_hans: 架构
zh_hant: 結構描述

# summaryPageTitle
source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
it: Riepilogo
ja: 概要
ko: 요약
pt_br: Resumo
ru: Сводка
zh_hans: 摘要
zh_hant: 摘要

# summaryTitle
source: The following objects will be created in the destination database:
de: Die folgenden Objekte werden in der Zieldatenbank erstellt:
es: Se crearán los siguientes objetos en la base de datos de destino:
fr: Les objets suivants seront créés dans la base de données de destination :
it: Nel database di destinazione verranno creati gli oggetti seguenti:
ja: 次のオブジェクトが宛先データベースに作成されます。
ko: 다음 개체가 대상 데이터베이스에 만들어집니다.
pt_br: Os seguintes objetos serão criados no banco de dados de destino:
ru: В базе данных назначения будут созданы следующие объекты:
zh_hans: 将在目标数据库中创建以下对象:
zh_hant: 下列物件將會建立在目的地資料庫中:

# virtualizeTaskLabel
source: Virtualize Data
de: Daten virtualisieren
es: Virtualizar datos
fr: Virtualiser les données
it: Virtualizza dati
ja: データの仮想化
ko: 데이터 가상화
pt_br: Virtualizar Dados
ru: Виртуализация данных
zh_hans: 虚拟化数据
zh_hant: 虛擬化資料

# doneButtonLabel
source: Create
de: Erstellen
es: Crear
fr: Créer
it: Crea
ja: 作成
ko: 만들기
pt_br: Criar
ru: Создать
zh_hans: 创建
zh_hant: 建立

# openScriptMsg
source: The script has opened in a document window. You can view it once the wizard is closed.
de: Das Skript wurde in einem Dokumentfenster geöffnet. Sie können es anzeigen, sobald der Assistent geschlossen wurde.
es: El script se ha abierto en una ventana de documento. Puede verlo una vez cerrado el asistente.
fr: Le script s'est ouvert dans une fenêtre de document. Vous pouvez le visualiser une fois l'assistant fermé.
it: Lo script è stato aperto in una finestra del documento. È possibile visualizzarla dopo la chiusura della procedura guidata.
ja: スクリプトがドキュメント ウィンドウで開きました。ウィザードが閉じられると表示できます。
ko: 문서 창에서 스크립트가 열렸습니다. 마법사가 닫히면 볼 수 있습니다.
pt_br: O script foi aberto em uma janela do documento. Você poderá vê-lo assim que o assistente for fechado.
ru: Сценарий открыт в окне документа. Вы можете просмотреть его после закрытия мастера.
zh_hans: 脚本已在文档窗口中打开。关闭向导后即可查看它。
zh_hant: 指令碼已在文件視窗中開啟。一旦精靈關閉，您就可以檢視它。

# getExtDataTitle
source: Virtualize Data
de: Daten virtualisieren
es: Virtualizar datos
fr: Virtualiser les données
it: Virtualizza dati
ja: データの仮想化
ko: 데이터 가상화
pt_br: Virtualizar Dados
ru: Виртуализация данных
zh_hans: 虚拟化数据
zh_hant: 虛擬化資料

# noConnection
source: Data Virtualization requires a connection to be selected.
de: Für die Datenvirtualisierung muss eine Verbindung ausgewählt werden.
es: La virtualización de datos requiere que se seleccione una conexión.
fr: La virtualisation des données nécessite qu'une connexion soit sélectionnée.
it: La virtualizzazione dati richiede la selezione di una connessione.
ja: データ仮想化は、接続を選択する必要があります。
ko: 데이터 가상화를 사용하려면 연결을 선택해야 합니다.
pt_br: A Virtualização de Dados requer que uma conexão seja selecionada.
ru: Для виртуализации данных необходимо выбрать подключение.
zh_hans: 数据虚拟化需要选择连接。
zh_hant: 資料虛擬化需要選取連線。
