Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.apply
source: Apply
de: Anwenden
es: Aplicar
fr: Appliquer
ja: 適用
ko: 적용
pt_br: Aplicar
ru: Применить
zh_hans: 应用
zh_hant: 套用

# sql.cancel.migration.confirmation
source: Are you sure you want to cancel this migration?
de: Möchten Sie diese Migration abbrechen?
es: ¿Seguro de que desea cancelar la migración?
fr: Voulez-vous vraiment annuler cette migration ?
ja: この移行を取り消しますか?
ko: 이 마이그레이션을 취소하시겠습니까?
pt_br: Tem certeza de que deseja cancelar esta migração?
ru: Вы действительно хотите отменить эту миграцию?
zh_hans: 是否确实要取消此迁移?
zh_hant: 確定要取消此移轉嗎?

# sql.delete.migration.confirmation
source: Are you sure you want to delete this migration?
de: Möchten Sie die Migration wirklich löschen?
es: ¿Está seguro de que desea eliminar esta migración?
fr: Voulez-vous vraiment supprimer cette migration ?
ja: この移行を削除しますか?
ko: 이 마이그레이션을 삭제하시겠습니까?
pt_br: Tem certeza de que deseja excluir esta migração?
ru: Действительно удалить эту миграцию?
zh_hans: 确定要删除此迁移吗?
zh_hant: 確定要刪除此刪除嗎?

# sql.migration.migration.list.ascending.label
source: Ascending
de: Aufsteigend
es: Ascendente
fr: Ordre croissant
ja: 昇順
ko: 오름차순
pt_br: Crescente
ru: По возрастанию
zh_hans: 升序
zh_hant: 遞增

# sql.migration.database.assessment.xevents.title
source: Assess Ad-hoc or dynamic SQL
zh_hans: 评估临时或动态 SQL

# sql.migration.assessed.dbs.label
source: Assessed databases: {0}
de: Bewertete Datenbanken: {0}
es: Bases de datos evaluadas: {0}
fr: Bases de données évaluées : {0}
ja: 評価されたデータベース: {0}
ko: 평가된 데이터베이스: {0}
pt_br: Bancos de dados avaliados: {0}
ru: Оцениваемые базы данных: {0}
zh_hans: 评估的数据库: {0}
zh_hant: 評定的資料庫: {0}

# sql.migration.assessment.findings.label
source: Assessment findings
de: Bewertungsergebnisse
es: Resultados de la evaluación
fr: Résultats de l’évaluation
ja: 評価結果
ko: 평가 결과
pt_br: Resultados da avaliação
ru: Результаты оценки
zh_hans: 评估结果
zh_hant: 評定結果

# sql.migration.assessment.in.progress
source: Assessment in progress
de: Bewertung wird durchgeführt
es: Evaluación en curso
fr: Évaluation en cours
ja: 評価の実行中
ko: 평가 진행 중
pt_br: Avaliação em andamento
ru: Оценка выполняется
zh_hans: 正在进行评估
zh_hant: 評定正在進行中

# sql.migration.assessment.results
source: Assessment results
de: Bewertungsergebnisse
es: Resultados de la evaluación
fr: Résultats de l'évaluation
ja: 評価結果
ko: 평가 결과
pt_br: Resultados da avaliação
ru: Результаты оценки
zh_hans: 评估结果
zh_hant: 評定結果

# sql.migration.no.results
source: Assessment results are unavailable.
de: Bewertungsergebnisse sind nicht verfügbar.
es: Los resultados de la evaluación no están disponibles.
fr: Les résultats de l’évaluation ne sont pas disponibles.
ja: 評価結果を使用できません。
ko: 평가 결과를 사용할 수 없습니다.
pt_br: Os resultados da avaliação não estão disponíveis.
ru: Результаты оценки недоступны.
zh_hans: 评估结果不可用。
zh_hant: 評定結果無法使用。

# sql.migration.assessment
source: Assessment results for '{0}'
de: Bewertungsergebnisse für „{0}“
es: Resultados de la evaluación para "{0}"
fr: Résultats de l’évaluation pour «{0}»
ja: '{0}' の評価結果
ko: ‘{0}’에 대한 평가 결과
pt_br: Resultados da avaliação para '{0}'
ru: Результаты оценки для «{0}»
zh_hans: “{0}”的评估结果
zh_hant: '{0}' 的評定結果

# sql.migration.assessment.results.summary.label.description
source: Assessment results shows the migration readiness of the database(s)
de: Die Bewertungsergebnisse zeigen die Migrationsbereitschaft der Datenbank(en) an.
es: Los resultados de la evaluación muestran la preparación de la migración de las bases de datos
fr: Les résultats de l'évaluation montrent que la ou les bases de données sont prêtes à migrer
ja: 評価結果は、データベースの移行の準備状況を示しています
ko: 평가 결과는 데이터베이스의 마이그레이션 준비 상태를 보여 줍니다.
pt_br: Os resultados da avaliação mostram a preparação para migração do(s) banco(s) de dados
ru: Результаты оценки показывают готовность базы данных к миграции.
zh_hans: 评估结果显示数据库的迁移准备情况
zh_hant: 評定結果顯示資料庫的移轉整備程度

# sql.migration.assessment.summary.title
source: Assessment summary
de: Bewertungszusammenfassung
es: Resumen de la evaluación
fr: Résumé de l’évaluation
ja: 評価の概要
ko: 평가 요약
pt_br: Resumo da avaliação
ru: Сводка по оценке
zh_hans: 评估摘要
zh_hant: 評定摘要

# sql.migration.assessment.summary.and.recommendations.title
source: Assessment summary and SKU recommendations
de: Bewertungszusammenfassung und SKU-Empfehlungen
es: Resumen de evaluación y recomendaciones de SKU
fr: Résumé de l’évaluation et recommandations SKU
ja: 評価の概要と SKU のレコメンデーション
ko: 평가 요약 및 SKU 권장 사항
pt_br: Resumo da avaliação e recomendações de SKU
ru: Сводка по оценке и рекомендации по SKU
zh_hans: 评估摘要和 SKU 建议
zh_hant: 評定摘要和 SKU 建議

# sql.migration.authKeys.header
source: Authentication key
de: Authentifizierungsschlüssel
es: Clave de autenticación
fr: Clé d'authentification
ja: 認証キー
ko: 인증 키
pt_br: Chave de autenticação
ru: Ключ проверки подлинности
zh_hans: 身份验证密钥
zh_hant: 驗證金鑰

# sql.migration.authKeys.refresh.message
source: Authentication key '{0}' has been refreshed.
de: Der Authentifizierungsschlüssel "{0}" wurde aktualisiert.
es: La clave de autenticación "{0}" se ha actualizado.
fr: La clé d’authentification « {0} » a été actualisée.
ja: 認証キー '{0}' が更新されました。
ko: '{0}' 인증 키를 새로 고쳤습니다.
pt_br: A chave de autenticação '{0}' foi atualizada.
ru: Ключ проверки подлинности "{0}" обновлен.
zh_hans: 已刷新身份验证密钥“{0}”。
zh_hant: 已重新整理驗證金鑰 '{0}'。

# sql.migration.service.details.authKeys.label
source: Authentication keys
de: Authentifizierungsschlüssel
es: Claves de autenticación
fr: Clés d'authentification
ja: 認証キー
ko: 인증 키
pt_br: Chaves de autenticação
ru: Ключи проверки подлинности
zh_hans: 身份验证密钥
zh_hant: 驗證金鑰

# sql.migration.authentication.types
source: Authentication keys
de: Authentifizierungsschlüssel
es: Claves de autenticación
fr: Clés d'authentification
ja: 認証キー
ko: 인증 키
pt_br: Chaves de autenticação
ru: Ключи проверки подлинности
zh_hans: 身份验证密钥
zh_hant: 驗證金鑰

# sql.migration.service.details.authKeys.title
source: Authentication keys used to connect to the self-hosted integration runtime node
de: Authentifizierungsschlüssel, die zum Herstellen einer Verbindung mit dem selbstgehosteten Integration Runtime-Knoten verwendet werden
es: Claves de autenticación utilizadas para conectar con el nodo del entorno de ejecución de integración autohospedado
fr: Clés d’authentification utilisées pour se connecter au nœud de runtime d'intégration auto-hébergé
ja: セルフホステッド統合ランタイム ノードへの接続に使用される認証キー
ko: 자체 호스팅 통합 런타임 노드에 연결하는 데 사용되는 인증 키
pt_br: Chaves de autenticação usadas para se conectar ao nó de runtime de integração auto-hospedada
ru: Ключи проверки подлинности, используемые для подключения к узлу локальной среды выполнения интеграции
zh_hans: 用于连接到自承载集成运行时节点的身份验证密钥
zh_hant: 用來連線到自我裝載整合執行個體節點的驗證金鑰

# sql.migration.authentication.type
source: Authentication type
de: Authentifizierungstyp
es: Tipo de autenticación
fr: Type d'authentification
ja: 認証の種類
ko: 인증 유형
pt_br: Tipo de autenticação
ru: Тип проверки подлинности
zh_hans: 身份验证类型
zh_hant: 驗證類型

# sql.migration.available.table.count.on.target
source: Available on target ({0})
de: Auf Ziel verfügbar ({0})
es: Disponible en el destino ({0})
fr: Disponible sur la cible ({0})
ja: ターゲットで使用可能 ({0})
ko: 대상에서 사용 가능({0})
pt_br: Disponível no destino ({0})
ru: Доступно в целевом объекте ({0})
zh_hans: 在目标上提供({0})
zh_hant: 在目標上提供 ({0})

# sql.migration.dashboard.help.link.dmsGuide
source: Azure Database Migration Guides
de: Leitfäden zur Azure-Datenbankmigration
es: Guía de Azure Database Migration
fr: Guides de migration de base de données Azure
ja: Azure データベースの移行ガイド
ko: Azure 데이터베이스 마이그레이션 가이드
pt_br: Guias de migração de banco de dados do Azure
ru: Руководства по переносу баз данных Azure
zh_hans: Azure 数据库迁移指南
zh_hant: Azure 資料庫移轉指南

# sql.migration.select.service.description
source: Azure Database Migration Service
fr: Service de migration de base de données Azure
pt_br: Serviço de migração de banco de dados do Azure
zh_hans: Azure 数据库迁移服务
zh_hant: Azure 資料庫移轉服務

# sql.migration.select.service.service.label
source: Azure Database Migration Service
de: Azure-Dienst zur Datenbankmigration
fr: Service Azure Database Migration
pt_br: Serviço de Migração de Banco de Dados do Azure
ru: Служба миграции баз данных Azure
zh_hans: Azure 数据库迁移服务
zh_hant: Azure 資料庫移轉服務

# sql.migration.service.details.dialog.title
source: Azure Database Migration Service
fr: Service de migration de base de données Azure
pt_br: Serviço de migração de banco de dados do Azure
zh_hans: Azure 数据库迁移服务
zh_hant: Azure 資料庫移轉服務

# sql.migration.ir.page.title
source: Azure Database Migration Service
de: Azure-Dienst zur Datenbankmigration
fr: Service Azure Database Migration
pt_br: Serviço de Migração de Banco de Dados do Azure
ru: Служба миграции баз данных Azure
zh_hans: Azure 数据库迁移服务
zh_hant: Azure 資料庫移轉服務

# sql.migration.service.ready
source: Azure Database Migration Service '{0}' is connected to self-hosted integration runtime running on node(s) - {1} For improved performance and high availability, you can register additional nodes.
de: Azure Database Migration Service "{0}" ist mit einer selbstgehosteten Integration Runtime verbunden, die auf Knoten ausgeführt wird – {1} Um die Leistung und Hochverfügbarkeit zu verbessern, können Sie zusätzliche Knoten registrieren.
es: Azure Database Migration Service "{0}" está conectado a un entorno de ejecución de integración autohospedado que se ejecuta en nodos: {1} Para mejorar el rendimiento y la alta disponibilidad, puede registrar nodos adicionales.
fr: Azure Database Migration Service '{0}' est connecté au runtime d’intégration autohébergé exécuté sur le ou les nœuds - {1} Pour améliorer les performances et la haute disponibilité, vous pouvez inscrire des nœuds supplémentaires.
ja: Azure Database Migration Service '{0}' は、これらのノードで動作中のセルフホステッド統合ランタイムに接続されています - {1} パフォーマンスの向上と高可用性を実現したい場合は、追加のノードを登録できます。
ko: Azure Database Migration Service '{0}'이(가) 노드에서 실행되는 자체 호스팅 통합 런타임에 연결됨 - {1} 향상된 성능과 고가용성을 위해 추가 노드를 등록할 수 있습니다.
pt_br: O Serviço de Migração de Banco de Dados do Azure “{0}” está conectado ao runtime de integração auto-hospedado em execução no(s) nó(s) – {1} Para melhorar o desempenho e alta disponibilidade, você pode registrar nós adicionais.
ru: Служба Azure Database Migration Service "{0}" подключена к локальной среде выполнения интеграции, работающей на узлах: {1} Для улучшения производительности и обеспечения высокой доступности можно зарегистрировать дополнительные узлы.
zh_hans: Azure 数据库迁移服务 "{0}" 连接到在节点上运行的自承载集成运行时 - {1} 为了提高性能和高可用性，你可以注册其他节点。
zh_hant: Azure 資料庫移轉服務 '{0}' 已連線到執行自我裝載整合執行階段的節點 - {1} 為了提升效能和高可用性，您可以註冊其他節點。

# sql.migration.service.ready.below
source: Azure Database Migration Service '{0}' is connected to self-hosted integration runtime running on node(s) - {1} For improved performance and high availability, you can register additional nodes. See below for registration instructions.
de: Azure Database Migration Service '{0}' ist mit einer selbstgehosteten Integration Runtime verbunden, die auf einem oder mehreren Knoten ausgeführt wird – {1} Für bessere Leistung und Hochverfügbarkeit können Sie zusätzliche Knoten registrieren. Anweisungen zur Registrierung finden Sie unten.
es: Azure Database Migration Service "{0}" está conectado a un entorno de ejecución de integración autohospedado que se ejecuta en nodos: {1} Para mejorar el rendimiento y la alta disponibilidad, puede registrar nodos adicionales. Consulte la información siguiente para ver las instrucciones de registro.
fr: Azure Database Migration Service « {0} » est connecté au runtime d’intégration auto-hébergé exécuté sur le ou les nœuds : {1} Pour une performance améliorée et une disponibilité élevée, vous pouvez inscrire des nœuds supplémentaires. Voir ci-dessous pour les instructions d’inscription.
ja: Azure Database Migration Service '{0}' は、これらのノードで動作中のセルフホステッド統合ランタイムに接続されています - {1} パフォーマンスの向上と高可用性を実現したい場合は、追加のノードを登録できます。登録手順については以下をご覧ください。
ko: Azure Database Migration Service '{0}'이(가) 노드에서 실행되는 자체 호스팅 통합 런타임에 연결됨 - {1} 향상된 성능과 고가용성을 위해 추가 노드를 등록할 수 있습니다. 아래에서 등록 지침을 확인하세요.
pt_br: O Serviço de Migração de Banco de Dados do Azure “{0}” está conectado ao runtime de integração auto-hospedado em execução no(s) nó(s) – {1} Para melhorar o desempenho e a alta disponibilidade, você pode registrar nós adicionais. Confira abaixo as instruções de registro.
ru: Служба Azure Database Migration Service "{0}" подключена к локальной среде выполнения интеграции, работающей на узлах: {1} Для улучшения производительности и обеспечения высокой доступности можно зарегистрировать дополнительные узлы. Инструкции по регистрации см. ниже.
zh_hans: Azure 数据库迁移服务“{0}”连接到在节点上运行的自承载集成运行时 - {1} 为了提高性能和高可用性，你可以注册其他节点。请参阅下面的注册说明。
zh_hant: Azure 資料庫移轉服務 '{0}' 已連線到執行自我裝載整合執行階段的節點 - {1} 為了提升效能和高可用性，您可以註冊其他節點。請參閱下方的註冊指示。

# sql.migration.service.ready.without.nodes
source: Azure Database Migration Service '{0}' is connected to self-hosted integration runtime running on the following node(s)
zh_hans: Azure 数据库迁移服务“{0}”已连接到在以下节点上运行的自承载集成运行时

# sql.migration.service.header
source: Azure Database Migration Service "{0}" details:`
de: Details zum Azure Database Migration Service "{0}":
es: Detalles de Azure Database Migration Service "{0}":`
fr: Détails Azure Database Migration Service « {0} » :
ja: Azure Database Migration Service ファイル "{0}" の詳細:`
ko: Azure Database Migration Service "{0}" 세부 정보:'
pt_br: Detalhes do Serviço de Migração de Banco de Dados do Azure "{0}": `
ru: Сведения Azure Database Migration Service "{0}":`
zh_hans: Azure 数据库迁移服务“{0}”详细信息:
zh_hant: Azure 資料庫移轉服務 "{0}" 詳細資料:

# sql.migration.service.not.ready
source: Azure Database Migration Service is not registered. Azure Database Migration Service '{0}' needs to be registered with self-hosted integration runtime on any node.
de: Azure Database Migration Service ist nicht registriert. Azure Database Migration Service "{0}" muss bei selbstgehosteten Integration Runtime auf jedem Knoten registriert werden.
es: Azure Database Migration Service no está registrado. Azure Database Migration Service "{0}" debe registrarse con entorno de ejecución de integración autohospedado en cualquier nodo.
fr: Azure Database Migration Service n’est pas inscrit. Azure Database Migration Service « {0} » doit être inscrit auprès d’un runtime d'intégration auto-hébergé sur n’importe quel nœud.
ja: Azure Database Migration Service が登録されていません。Azure Database Migration Service '{0}' は、任意のノードでセルフホステッド統合ランタイムに登録する必要があります。
ko: Azure Database Migration Service가 등록되지 않았습니다. Azure Database Migration Service '{0}'를 노드에서 자체 호스팅 통합 런타임에 등록해야 합니다.
pt_br: O Serviço de Migração de Banco de Dados do Azure não está registrado. O Serviço de Migração de Banco de Dados do Azure '{0}' precisa ser registrado com o runtime de integração auto-hospedada em qualquer nó.
ru: Служба Azure Database Migration Service не зарегистрирована. Azure Database Migration Service "{0}" необходимо зарегистрировать в локальной среде выполнения интеграции на любом узле.
zh_hans: 未注册 Azure 数据库迁移服务。Azure 数据库迁移服务“{0}”需要向任意节点上的自承载集成运行时进行注册。
zh_hant: Azure 資料庫移轉服務未註冊。Azure 資料庫移轉服務 '{0}' 必須向在任何節點上的自我裝載整合執行階段註冊。

# sql.migration.service.not.ready.below
source: Azure Database Migration Service is not registered. Azure Database Migration Service '{0}' needs to be registered with self-hosted integration runtime on any node. See below for registration instructions.
de: Azure Database Migration Service ist nicht registriert. Azure Database Migration Service '{0}' muss mit einer selbstgehosteten Integration Runtime auf einem beliebigen Knoten registriert werden. Anweisungen zur Registrierung finden Sie unten.
es: Azure Database Migration Service no está registrado. Azure Database Migration Service "{0}" debe registrarse con integration runtime autohospedado en cualquier nodo. Consulte a continuación las instrucciones de registro.
fr: Azure Database Migration Service n’est pas inscrit. Azure Database Migration Service « {0} » doit être inscrit auprès d’un runtime d'intégration auto-hébergé sur n’importe quel nœud. Voir ci-dessous pour les instructions d’inscription.
ja: Azure Database Migration Service が登録されていません。Azure Database Migration Service '{0}' が、任意のノードのセルフホステッド統合ランタイムに登録されている必要があります。 登録手順については以下をご覧ください。
ko: Azure Database Migration Service가 등록되지 않았습니다. Azure Database Migration Service '{0}'를 노드에서 자체 호스팅 통합 런타임에 등록해야 합니다. 아래에서 등록 지침을 확인하세요.
pt_br: O Serviço de Migração de Banco de Dados do Azure não está registrado. O Serviço de Migração de Banco de Dados do Azure “{0}” precisa ser registrado com o runtime de integração auto-hospedado em qualquer nó. Confira abaixo as instruções de registro.
ru: Служба Azure Database Migration Service не зарегистрирована. Необходимо зарегистрировать Azure Database Migration Service "{0}" в локальной среде выполнения интеграции на любом узле. Инструкции по регистрации см. ниже.
zh_hans: 未注册 Azure 数据库迁移服务。Azure 数据库迁移服务“{0}”需要向任意节点上的自承载集成运行时进行注册。 请参阅下面的注册说明。
zh_hant: 未註冊 Azure 資料庫移轉服務。Azure 資料庫移轉服務 '{0} ' 必須向在任何節點上的自我裝載整合執行階段註冊。 請參閱下方的註冊指示。

# sql.migration.ir.container.description
source: Azure Database Migration Service leverages Azure Data Factory's Self-hosted Integration Runtime to upload backups from on-premise network file share to Azure. Based on the selections on the previous page you will need to setup an Self-hosted Integration Runtime.
zh_hans: Azure 数据库迁移服务利用 Azure 数据工厂的自承载集成运行时将备份从本地网络文件共享上传到 Azure。根据上一页上的选择，需要设置自承载集成运行时。

# sql.migration.service.container.container.description1
source: Azure Database Migration Service leverages Azure Data Factory's self-hosted integration runtime to handle connectivity between source and target and upload backups from an on-premises network file share to Azure (if applicable).
de: Azure Database Migration Service nutzt die selbstgehostete Integration Runtime von Azure Data Factory, um die Konnektivität zwischen Quelle und Ziel zu verarbeiten und Sicherungen von einer lokalen Netzwerkdateifreigabe in Azure hochzuladen (falls zutreffend).
es: Azure Database Migration Service aprovecha el entorno de ejecución de integración autohospedado de Azure Data Factory para controlar la conectividad entre el origen y el destino, y cargar copias de seguridad de un recurso compartido de archivos de red local en Azure (si procede).
fr: Azure Database Migration Service tire parti du runtime d’intégration auto-hébergé de Azure Data Factory pour gérer la connectivité entre la source et la cible, et charger des sauvegardes à partir d’un partage de fichiers réseau local vers Azure (le cas échéant).
ja: Azure Database Migration Service では、ソースとターゲットの間の接続の処理、および (該当する場合) オンプレミスのネットワーク ファイル共有から Azure へのバックアップのアップロードを、Azure Data Factory のセルフホステッド統合ランタイムを利用して行います。
ko: Azure Database Migration Service는 Azure Data Factory의 자체 호스팅 통합 런타임을 활용하여 원본과 대상 간의 연결을 처리하고 온-프레미스 네트워크 파일 공유에서 Azure로 백업을 업로드합니다(해당하는 경우).
pt_br: O Serviço de Migração de Banco de Dados do Azure aproveita o runtime de integração auto-hospedada do Azure Data Factory para lidar com a conectividade entre a origem e o destino e carregar backups de um compartilhamento de arquivos de rede local para o Azure (se aplicável).
ru: Azure Database Migration Service использует локальную среду выполнения интеграции Фабрики данных Azure для управления подключением между источником и назначением и для загрузки резервных копий из локальной сетевой папки в Azure (если применимо).
zh_hans: Azure 数据库迁移服务利用 Azure 数据工厂的自承载集成运行时处理源和目标之间的连接，并将备份从本地网络文件共享上传到 Azure (适用时)。
zh_hant: Azure 資料庫移轉服務利用 Azure Data Factory 的自我裝載整合執行階段，處理來源與目標之間的連線，並將內部部署網路檔案共用的備份上傳到 Azure (若適用)。

# sql.migration.services.name
source: Azure Database Migration Service name.
de: Name des Azure Database Migration Service.
es: Nombre de Azure Database Migration Service.
fr: Nom de Azure Database Migration Service.
ja: Azure Database Migration Service 名。
ko: Azure Database Migration Service 이름
pt_br: Nome do Serviço de Migração de Banco de Dados do Azure.
ru: Имя Azure Database Migration Service.
zh_hans: Azure 数据库迁移服务名称。
zh_hant: Azure 資料庫移轉服務名稱。

# sql.migration.ir.page.description
source: Azure Database Migration Service orchestrates database migration activities and tracks their progress. You can select an existing Database Migration Service if you have created one previously, or create a new one below.
de: Azure Database Migration Service orchestriert Datenbankmigrationsaktivitäten und verfolgt deren Fortschritt. Sie können einen bestehenden Datenbankmigrationsdienst auswählen, wenn Sie zuvor einen erstellt haben, oder unten einen neuen erstellen.
es: Azure Database Migration Service organiza las actividades de migración de bases de datos y realiza un seguimiento de su progreso. Puede seleccionar un Database Migration Service existente como objetivo de Azure SQL si ya creó uno anteriormente o crear uno nuevo a continuación.
fr: Azure Database Migration Service orchestre les activités de migration de base de données et suit leur progression. Vous pouvez sélectionner un Database Migration Service existant si vous en avez créé un précédemment, ou en créer un nouveau ci-dessous.
ja: Azure Database Migration Service は、データベース移行アクティビティを調整し、その進行状況を追跡します。以前に作成した場合は既存のDatabase Migration Serviceを選択するか、以下で新しいDatabase Migration Serviceを作成できます。
ko: Azure Database Migration Service는 데이터베이스 마이그레이션 활동을 오케스트레이션하고 진행 상황을 추적합니다. 기존 Database Migration Service를 이전에 생성한 경우 기존 서비스를 선택하거나 아래에서 새로 생성할 수 있습니다.
pt_br: O Serviço de Migração de Banco de Dados do Azure orquestra as atividades de migração de banco de dados e acompanha seu progresso. Você pode selecionar um Serviço de Migração de Banco de Dados existente se você já criou um anteriormente, ou criar um novo abaixo.
ru: Azure Database Migration Service координирует действия по миграции базы данных и отслеживает их ход выполнения. Вы можете выбрать существующую службу миграции базы данных, если вы уже создали ее ранее, или создать новую ниже.
zh_hans: Azure 数据库迁移服务(DMS)协调数据库迁移活动并跟踪其进度。如果之前已经创建，则可以选择现有数据库迁移服务，或在下面创建一个新的服务。
zh_hant: Azure 資料庫移轉服務可協調資料庫移轉活動並追蹤其進度。如果您之前已建立資料庫移轉服務，可選取現有的資料庫移轉服務，或是在下方建立一個新的。

# sql.migration.summary.sqldb.type
source: Azure SQL Database
de: Azure SQL-Datenbank
pt_br: Banco de Dados SQL do Azure
ru: База данных SQL Azure
zh_hans: Azure SQL 数据库

# sql.login.migration.db.title
source: Azure SQL Database
de: Azure SQL-Datenbank
pt_br: Banco de Dados SQL do Azure
ru: База данных SQL Azure
zh_hans: Azure SQL 数据库

# sql.migration.sku.sqldb.target.title
source: Azure SQL Database
de: Azure SQL-Datenbank
pt_br: Banco de dados SQL do Azure
ru: База данных SQL Azure
zh_hans: Azure SQL 数据库

# sql.migration.sku.sqldb.card.title
source: Azure SQL Database (PaaS)
es: Base de datos de Azure SQL (PaaS)
pt_br: Banco de Dados SQL do Azure (PaaS)
ru: База данных SQL Azure (PaaS)
zh_hans: Azure SQL 数据库(PaaS)

# sql.migration.azure.sql.database
source: Azure SQL Database Server
de: Azure SQL-Datenbank-Server
es: Servidor de Azure SQL Database
fr: Serveur de base de données Azure SQL
ja: Azure SQL Database サーバー
ko: Azure SQL Database 서버
pt_br: Servidor do Banco de Dados SQL do Azure
ru: Сервер Базы данных SQL Azure
zh_hans: Azure SQL 数据库服务器
zh_hant: Azure SQL Database 伺服器

# sql.migration.summary.mi.type
source: Azure SQL Managed Instance
pt_br: Instância Gerenciada de SQL do Azure
ru: Управляемый экземпляр SQL Azure
zh_hans: Azure SQL 托管实例
zh_hant: Azure SQL 受控執行個體

# sql.migration.azure.sql.database.managed.instance
source: Azure SQL Managed Instance
pt_br: Instância Gerenciada de SQL do Azure
ru: Управляемый экземпляр SQL Azure
zh_hans: Azure SQL 托管实例
zh_hant: Azure SQL 受控執行個體

# sql.login.migration.mi.title
source: Azure SQL Managed Instance
pt_br: Instância Gerenciada de SQL do Azure
ru: Управляемый экземпляр SQL Azure
zh_hans: Azure SQL 托管实例
zh_hant: Azure SQL 受控執行個體

# sql.migration.sku.mi.target.title
source: Azure SQL Managed Instance
pt_br: Instância Gerenciada de SQL do Azure
ru: Управляемый экземпляр SQL Azure
zh_hans: Azure SQL 托管实例
zh_hant: Azure SQL 受控執行個體
