Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.sku.parameters.text
source: Enter the information below to edit the recommendation parameters.
de: Geben Sie unten die Informationen ein, um die Empfehlungsparameter zu bearbeiten.
es: Escriba la información siguiente para editar los parámetros de recomendación.
fr: Entrez les informations ci-dessous pour modifier les paramètres de recommandation.
ja: レコメンデーション パラメーターを編集するには、以下の情報を入力します。
ko: 권장 사항 매개 변수를 편집하려면 아래에 정보를 입력하세요.
pt_br: Insira as informações abaixo para editar os parâmetros de recomendação.
ru: Введите ниже сведения, чтобы изменить параметры рекомендаций.
zh_hans: 输入以下信息以编辑建议参数。
zh_hant: 請在下方輸入資訊以編輯建議參數。

# sql.migration.password.placeholder
source: Enter the target password
de: Geben Sie das Zielkennwort ein
es: Introducir la contraseña de destino
fr: Entrez le mot de passe cible
ja: ターゲット パスワードを入力してください
ko: 대상 암호 입력
pt_br: Inserir a senha de destino
ru: Введите пароль целевого объекта
zh_hans: 输入目标密码
zh_hant: 輸入目標密碼

# sql.migration.port.placeholder
source: Enter the target port
de: Geben Sie den Zielport ein
es: Introducir el puerto de destino
fr: Entrer le port cible
ja: ターゲット ポートを入力してください
ko: 대상 포트 입력
pt_br: Insira a porta de destino
ru: Укажите целевой порт
zh_hans: 输入目标端口
zh_hant: 輸入目標連接埠

# sql.migration.username.placeholder
source: Enter the target user name
de: Geben Sie den Zielbenutzernamen ein
es: Introduzca el nombre de usuario de destino
fr: Entrez le nom d'utilisateur cible
ja: ターゲット ユーザー名を入力してください
ko: 대상 사용자 이름 입력
pt_br: Insira o nome do usuário de destino.
ru: Введите имя пользователя целевого объекта
zh_hans: 输入目标用户名
zh_hant: 輸入目標使用者名稱

# sql.migration.tde.validation.error
source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
pt_br: Erro
ru: Ошибка
zh_hans: 错误
zh_hant: 錯誤

# sql.migration.error
source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
pt_br: Erro
ru: Ошибка
zh_hans: 错误
zh_hant: 錯誤

# sql.migration.wizard.target.login.error
source: Error getting login information: {0}
de: Fehler beim Abrufen der Anmeldeinformationen: {0}
es: Error al obtener la información de inicio de sesión: {0}
fr: Erreur lors de l’obtention des informations de connexion : {0}
ja: ログイン情報の取得中にエラーが発生しました: {0}
ko: 로그인 정보를 가져오는 동안 오류 발생: {0}
pt_br: Ocorreu um erro ao obter as informações de logon: {0}
ru: Ошибка при получении сведений об учетных данных: {0}
zh_hans: 获取登录信息时出错: {0}
zh_hant: 取得登入資訊時發生錯誤: {0}

# sql.migration.load.migration.list.error
source: Error loading migrations list
de: Fehler beim Laden der Migrationsliste
es: Error al cargar la lista de migraciones
fr: Erreur lors du chargement de la liste des migrations
ja: 移行一覧の読み込みエラー
ko: 마이그레이션 목록 로드 중 오류 발생
pt_br: Erro ao carregar a lista de migrações
ru: Ошибка при загрузке списка миграций
zh_hans: 加载迁移列表时出错
zh_hant: 載入移轉清單時發生錯誤

# sql.migration.starting.migration.dberror
source: Error migrating certificate for database {0}. {1}
de: Fehler beim Migrieren des Zertifikats für die Datenbank {0}. {1}
es: Error al migrar el certificado para la base de datos {0}. {1}
fr: Erreur lors de la migration du certificat pour la base de données {0}. {1}
ja: データベース {0} の証明書を移行中にエラーが発生しました。{1}
ko: {0} 데이터베이스 인증서를 마이그레이션하는 동안 오류가 발생했습니다. {1}
pt_br: Erro ao migrar o certificado para o banco de dados {0}. {1}
ru: Ошибка миграции сертификата для базы данных {0}. {1}
zh_hans: 迁移数据库 {0} 的证书时出错。{1}
zh_hant: 移轉資料庫的憑證時發生錯誤 {0}。{1}

# sql.migration.open.migration.destails.error
source: Error opening migration details dialog
de: Fehler beim Öffnen des Dialogfelds "Migrationsdetails"
es: Error al abrir el cuadro de diálogo de detalles de la migración
fr: Erreur lors de l’ouverture de la boîte de dialogue détails de la migration
ja: 移行の詳細ダイアログ オープン時エラー
ko: 마이그레이션 세부 정보 대화 상자를 여는 중 오류 발생
pt_br: Erro ao abrir a caixa de diálogo de detalhes da migração
ru: Ошибка при открытии диалогового окна сведений о миграции
zh_hans: 打开迁移详细信息对话框时出错
zh_hant: 開啟移轉詳細資料對話方塊時發生錯誤

# sql.migration.open.migration.service.error
source: Error opening migration service dialog
de: Fehler beim Öffnen des Dialogfelds "Migrationsdienst"
es: Error al abrir el cuadro de diálogo del servicio de migración
fr: Erreur lors de l’ouverture de la boîte de dialogue du service de migration
ja: 移行サービス ダイアログのオープン時エラー
ko: 마이그레이션 서비스 대화 상자를 여는 중 오류 발생
pt_br: Erro ao abrir a caixa de diálogo do serviço de migração
ru: Ошибка при открытии диалоговое окно службы миграции
zh_hans: 打开迁移服务对话框时出错
zh_hant: 開啟移轉服務對話方塊時發生錯誤

# sql.migration.open.migration.target.error
source: Error opening migration target
de: Fehler beim Öffnen des Migrationsziels
es: Error al abrir el destino de migración
fr: Erreur lors de l’ouverture de la cible de migration
ja: 移行ターゲット オープン時エラー
ko: 마이그레이션 대상을 여는 중 오류 발생
pt_br: Erro ao abrir destino de migração
ru: Ошибка при открытии цели миграции
zh_hans: 打开迁移目标时出错
zh_hant: 開啟移轉目標本時發生錯誤

# sql.migration.wizard.perfCollection.error
source: Error(s) occurred while collecting performance data for the server '{0}'. If these issues persist, try restarting the data collection process: {1}
de: Fehler beim Erfassen von Leistungsdaten für den Server '{0}'. Wenn diese Probleme weiterhin bestehen, starten Sie den Datensammlungsprozess neu: {1}
es: Se produjeron errores al recopilar datos de rendimiento para el servidor '{0}'. Si estos problemas persisten, intente reiniciar el proceso de recopilación de datos: {1}
fr: Des erreurs se sont produites lors de la collecte des données de performances pour le serveur '{0}'. Si ces problèmes persistent, essayez de redémarrer le processus de collecte de données : {1}
ja: サーバー `{0}` のパフォーマンス データの収集中にエラーが発生しました。これらの問題が解決しない場合は、 データ収集プロセスをリスタートしてみてください: {1}
ko: '{0}' 서버의 성능 데이터를 수집하는 동안 오류가 발생했습니다. 이 문제가 계속되면 데이터 수집 프로세스를 다시 시작해 보세요. {1}
pt_br: Ocorreram erros ao coletar os dados de desempenho do servidor ''{0}''. Se esses problemas persistirem, tente reiniciar o processo de coleta de dados: {1}
ru: Произошли ошибки при сборе данных производительности для сервера "{0}". Если эти проблемы не устранены, попробуйте перезапустить процесс сбора данных: {1}
zh_hans: 收集服务器“{0}”的性能数据时出错。如果这些问题仍然存在，请尝试重启数据收集过程: {1}
zh_hant: 收集伺服器 '{0}' 的效能資料時發生錯誤。如果這些問題持續發生，請嘗試重新啟動資料收集程式: {1}

# sql.migration.select.azure.mi.db.count.threshold.exceeds.error
source: Error: Azure SQL Managed Instance supports maximum {0} user databases per instance. Select {0} or less database(s) to proceed further.
de: Fehler: Azure SQL Managed Instance unterstützt maximal {0} Benutzerdatenbanken pro Instanz. Wählen Sie {0} oder weniger Datenbanken aus, um den Vorgang fortzusetzen.
es: Error: Azure SQL Managed Instance admite un máximo de {0} bases de datos de usuario por instancia. Seleccione {0} o menos bases de datos para continuar.
fr: Erreur : Azure SQL Managed Instance prend en charge un maximum de {0} bases de données utilisateur par instance. Sélectionnez {0} ou moins de bases de données pour continuer.
ja: エラー: Azure SQL Managed Instance でサポートされるインスタンスあたりのユーザー データベースは、最大 {0} 個までです。続行するには、選択するデータベース数を {0} 個以下にします。
ko: 오류: Azure SQL Managed Instance 인스턴스당 최대 사용자 데이터베이스 {0}개를 지원합니다. 계속 진행하려면 {0}개 이하의 데이터베이스를 선택하세요.
pt_br: Erro: A Instância Gerenciada de SQL do Azure dá suporte a no máximo {0} bancos de dados de usuários por instância. Selecione {0} ou menos bancos de dados para prosseguir.
ru: Ошибка: Управляемый экземпляр SQL Azure поддерживает не более {0} баз данных на экземпляр. Выберите {0} или меньше баз данных, чтобы продолжить.
zh_hans: 错误: Azure SQL 托管实例支持每个实例的最大 {0} 用户数据库数。选择 {0} 或减少数据库数量以继续。
zh_hant: 錯誤: Azure SQL 受控執行個體的每個執行個體最多支援 {0} 個使用者資料庫。請選取 {0} 個以下的資料庫才能繼續。

# sql.login.migration.migrate.server.roles.and.set.permissions
source: Establishing user mappings completed. Currently, migrating server roles, establishing server mappings and setting permissions. This will take some time.
de: Das Einrichten von Benutzerzuordnungen wurde abgeschlossen. Aktuell werden Serverrollen migriert, Serverzuordnungen eingerichtet und Berechtigungen festgelegt. Dies nimmt einige Zeit in Anspruch.
es: Se completó el establecimiento de asignaciones de usuario. Actualmente, migrando roles de servidor, estableciendo asignaciones de servidor y estableciendo permisos. Esto tardará algún tiempo.
fr: Établissement des mappages d'utilisateurs terminé. Actuellement, migration des rôles de serveur, établissement des mappages de serveur et définition des autorisations. Cela prendra un certain temps.
ja: ユーザー マッピングの確立が完了しました。 現在、サーバーの役割を移行し、サーバー マッピングを確立し、アクセス許可を設定しています。これには時間がかかります。
ko: 사용자 매핑 설정이 완료되었습니다. 현재 서버 역할을 마이그레이션하고, 서버 매핑을 설정하고, 권한을 설정하는 중입니다. 이 작업은 시간이 걸릴 수 있습니다.
pt_br: O estabelecimento de mapeamentos de usuários foi concluído. Atualmente, migrando as funções de servidor, estabelecendo mapeamentos de servidores e definindo permissões. Isso levará algum tempo.
ru: Установка сопоставлений пользователей завершена. В настоящее время выполняется миграция ролей сервера, установка сопоставлений серверов и настройка разрешений. Это займет некоторое время.
zh_hans: 建立用户映射已完成。 当前正在迁移服务器角色、建立服务器映射和设置权限。这需要一些时间。
zh_hant: 建立使用者對應已完成。 目前正在移轉伺服器角色、建立伺服器對應及設定權限。這需要一些時間。

# sql.login.migration.establish.user.mappings.failed
source: Establishing user mappings failed
de: Fehler beim Einrichten von Benutzerzuordnungen.
es: Error al establecer asignaciones de usuario
fr: Échec de l’établissement du mappage d'utilisateur
ja: ユーザー マッピングの確立に失敗しました
ko: 사용자 매핑을 설정하지 못 함
pt_br: Ocorreu um erro ao estabelecer os mapeamentos de usuários
ru: Сбой установки сопоставлений пользователей
zh_hans: 建立用户映射失败
zh_hant: 建立使用者對應失敗

# sql.ir.powershellscript
source: Execute script
zh_hans: 执行脚本

# sql.ir.executing.powershellscript
source: Execution started and monitor the PowerShell window opened.
zh_hans: 已开始执行并监视打开的 PowerShell 窗口。

# sql.migration.support.resources.description
source: Explore documentation
de: Dokumentation erkunden
es: Explorar la documentación
fr: Explorer la documentation
ja: ドキュメントの探索
ko: 설명서 살펴보기
pt_br: Explorar a documentação
ru: Обзор документации
zh_hans: 浏览文档
zh_hant: 探索文件

# sql.migration.tde.wizard.optionads
source: Export my certificates and private keys to the target.
de: Exportieren Sie meine Zertifikate und privaten Schlüssel in das Ziel.
es: Exportar mis certificados y claves privadas al destino.
fr: Exportez mes certificats et clés privées vers la cible.
ja: 証明書と秘密キーをターゲットにエクスポートします。
ko: 내 인증서와 프라이빗 키를 대상으로 내보냅니다.
pt_br: Exporte meus certificados e minha chave privada para o destino.
ru: Экспорт сертификатов и закрытых ключей в целевой объект.
zh_hans: 将我的证书和私钥导出到目标。
zh_hant: 將我的憑證和私密金鑰匯出到目標。

# sql.migration.state.failed
source: Failed
de: Fehlerhaft
es: Erróneo
fr: Échec
ja: 失敗
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

# sql.migration.restore.status.failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
ja: 失敗
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

# sql.migration.copy.status.failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
ja: 失敗
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 已失败
zh_hant: 失敗

# sql.migration.status.failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
ja: 失敗
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

# sql.migration.details.serverobjects.failed.tables.label
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
ja: 失敗
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

# sql.migration.validation.state.failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
ja: 失敗しました
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

# sql.login.migration.status.failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
ja: 失敗
ko: 실패
pt_br: Ocorreu um erro
ru: Сбой
zh_hans: 已失败
zh_hant: 失敗

# sql.login.migration.status.page.description.failed
source: Failed migrating {0} logins to {1} '{2}'
de: Fehler beim Migrieren von {0} Anmeldungen zu {1} „{2}“
es: Error al migrar los inicios de sesión de {0} a {1} "{2}"
fr: Échec de la migration des connexions {0} vers {1} « {2} »
ja: {0} 件のログインを {1} '{2}' への移行が失敗しました
ko: {0} 로그인을 {1} '{2}'(으)로 마이그레이션하지 못 함
pt_br: Ocorreu um erro ao migrar {0} logons para {1} '{2}'
ru: Не удалось перенести учетные данные ({0}) в {1} "{2}"
zh_hans: 将 {0} 个登录迁移到 {1} "{2}" 失败
zh_hant: 無法將 {0} 登入移轉至 {1} '{2}'

# sql.migration.notebook.open.error
source: Failed to open the migration notebook.
de: Fehler beim Öffnen des Migrationsnotebooks.
es: No se pudo abrir el cuaderno de migración.
fr: Échec de l’ouverture du bloc-notes de migration.
ja: 移行ノートブックを開けませんでした。
ko: 마이그레이션 노트북을 열지 못했습니다.
pt_br: Falha ao abrir o bloco de anotações de migração.
ru: Не удалось открыть записную книжку миграции.
zh_hans: 未能打开迁移笔记本。
zh_hant: 無法開啟移轉筆記本。

# sql.migration.dms.provision.failed
source: Failed to provision a Database Migration Service. Wait a few minutes and then try again.
de: Fehler beim Bereitstellen eines Database Migration Service. Warten Sie einige Minuten, und versuchen Sie es dann erneut.
es: No se pudo aprovisionar el Database Migration Service. Espere unos minutos y vuelva a intentarlo.
fr: Échec de la mise en service d’un Database Migration Service. Patientez quelques minutes, puis réessayez.
ja: Database Migration Service をプロビジョニングできませんでした。数分待ってからもう一度やり直してください。
ko: 데이터베이스 마이그레이션 서비스를 프로비전하지 못했습니다. 몇 분 기다렸다가 다시 시도하세요.
pt_br: Falha ao provisional um Serviço de Migração de Banco de Dados. Aguarde alguns minutos e tente novamente.
ru: Не удалось подготовить Database Migration Service. Подождите несколько минут и повторите попытку.
zh_hans: 未能预配数据库迁移服务。请等待几分钟，然后重试。
zh_hant: 無法佈建資料庫移轉服務。請稍待幾分鐘後再試一次。

# sql.migration.target.provisioning.save.template.fail
source: Failed to save ARM Template
zh_hans: 未能保存 ARM 模板

# sql.migration.target.provisioning.upload.template.fail
source: Failed to upload ARM Template
zh_hans: 未能上传 ARM 模板

# sql.migration.tab.button.feedback.description
source: Feedback
es: Comentarios
fr: Commentaires
ja: フィードバック
ko: 피드백
pt_br: Comentários
ru: Отзывы
zh_hans: 反馈
zh_hant: 意見反應

# sql.migration.tab.button.feedback.label
source: Feedback
es: Comentarios
fr: Commentaires
ja: フィードバック
ko: 피드백
pt_br: Comentários
ru: Отзывы
zh_hans: 反馈
zh_hant: 意見反應

# sql.migration.feedback.issue.title
source: Feedback on the migration experience
de: Feedback zur Migrationserfahrung
es: Comentarios sobre la experiencia de migración
fr: Commentaires sur l'expérience de la migration
ja: 移行エクスペリエンスのフィードバック
ko: 마이그레이션 환경에 대한 피드백
pt_br: Comentários sobre a experiência de migração
ru: Отзывы об интерфейсе миграции
zh_hans: 有关迁移体验的反馈
zh_hant: 對移轉體驗的意見反應

# sql.migration.restore.backuptype.file
source: File
de: Datei
es: Archivo
fr: Fichier
ja: ファイル
ko: 파일
pt_br: Arquivo
ru: Файл
zh_hans: 文件
zh_hant: 檔案

# sql.migration.file.name
source: File name
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier
ja: ファイル名
ko: 파일 이름
pt_br: Nome do arquivo
ru: Имя файла
zh_hans: 文件名
zh_hant: 檔案名稱

# sql.migration.backup.file.name
source: File name
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier
ja: ファイル名
ko: 파일 이름
pt_br: Nome do arquivo
ru: Имя файла
zh_hans: 文件名
zh_hant: 檔案名稱

# sql.migration.backup.file.status
source: File status
de: Dateistatus
es: Estado del archivo
fr: Statut du fichier
ja: ファイルの状態
ko: 파일 상태
pt_br: Status do arquivo
ru: Состояние файла
zh_hans: 文件状态
zh_hant: 檔案狀態

# sql.migration.search.for.migration
source: Filter migration results
de: Migrationsergebnisse filtern
es: Filtrar los resultados de la migración
fr: Filtrer les résultats de la migration
ja: 移行結果のフィルター処理
ko: 마이그레이션 결과 필터링
pt_br: Filtrar resultados da migração
ru: Фильтровать результаты миграции
zh_hans: 筛选迁移结果
zh_hant: 篩選移轉結果

# sql.migration.details.serverobjects.filter.label
source: Filter table migration results
de: Ergebnisse der Tabellenmigration filtern
es: Filtrar los resultados de la migración de la tabla
fr: Filtrer les résultats de migration de table
ja: テーブル移行結果のフィルター処理
ko: 테이블 마이그레이션 결과 필터링
pt_br: Filtrar resultados de migração de tabela
ru: Фильтрация результатов миграции таблицы
zh_hans: 筛选表迁移结果
zh_hant: 篩選資料表移轉結果

# sql.migration.details.serverobjects.filter.aria.label
source: Filter table migration results using keywords
de: Tabellenmigrationsergebnisse anhand von Schlüsselwörtern filtern
es: Filtrar los resultados de la migración de la tabla mediante palabras clave
fr: Filtrer les résultats de migration de table à l’aide de mots clés
ja: キーワードを使用してテーブル移行の結果をフィルター処理する
ko: 키워드를 사용하여 테이블 마이그레이션 결과 필터링
pt_br: Filtre os resultados da migração da tabela usando palavras-chave
ru: Фильтрация результатов миграции таблицы с использованием ключевых слов
zh_hans: 使用关键字筛选表迁移结果
zh_hant: 使用關鍵字篩選資料表移轉結果

# sql.migration.table.selection.filter
source: Filter tables
de: Filtern von Tabellen
es: Filtrar tablas
fr: Filtrer les tables
ja: フィルター テーブル
ko: 테이블 필터링
pt_br: Filtrar tabelas
ru: Фильтровать таблицы
zh_hans: 筛选表
zh_hant: 篩選資料表

# sql.migration.select.service.heading
source: Filter the migration list by Database Migration Service
de: Migrationsliste nach Database Migration Service filtern
es: Filtrar la lista de migración por Database Migration Service
fr: Filtrer la liste de migration par Database Migration Service
ja: Database Migration Service で移行リストをフィルター処理する
ko: Database Migration Service 기준으로 마이그레이션 목록 필터링
pt_br: Filtrar a lista de migração por Serviço de Migração de Banco de Dados
ru: Фильтрация списка миграции по Database Migration Service
zh_hans: 按数据库迁移服务筛选迁移列表
zh_hant: 依資料庫移轉服務篩選移轉清單

# sql.migration.findings.label
source: Findings
de: Ergebnisse
es: Conclusiones
fr: Résultats
ja: 検出結果
ko: 발견 사항
pt_br: Conclusões
ru: Результаты
zh_hans: 发现
zh_hant: 結果

# sql.migration.severity.findings.label
source: Findings by severity
de: Ergebnisse nach Schweregrad
es: Resultados por gravedad
fr: Résultats par gravité
ja: 重大度別の結果
ko: 심각도별 검색
pt_br: Descobertas por gravidade
ru: Результаты по степени серьезности
zh_hans: 结果(按严重性)
zh_hant: 依嚴重性排序的結果

# sql.migration.finish.time
source: Finish time
de: Zeitpunkt der Fertigstellung
es: Hora de finalización
fr: Heure de fin
ja: 終了時刻
ko: 종료 시간
pt_br: Hora da conclusão
ru: Время завершения
zh_hans: 结束时间
zh_hant: 完成時間

# sql.migration.first.lsn
source: First LSN
de: Erste LSN
es: Primer LSN
fr: Premier NSE
ja: 最初の LSN
ko: 첫 번째 LSN
pt_br: Primeiro LSN
ru: Первый номер LSN
zh_hans: 第一个 LSN
zh_hant: 第一個 LSN

# sql.migration.blob.container.folder.label
source: Folder
de: Ordner
es: Carpeta
fr: Dossier
ja: フォルダー
ko: 폴더
pt_br: Pasta
ru: Папка
zh_hans: 文件夹
zh_hant: 資料夾

# sql.migration.azureRecommendation.folder.name
source: Folder name
de: Ordnername
es: Nombre de la carpeta
fr: Nom du dossier
ja: フォルダー名
ko: 폴더 이름
pt_br: Nome da pasta
ru: Имя папки
zh_hans: 文件夹名
zh_hant: 資料夾名稱

# sql.migration.service.container.container.description2
source: Follow the instructions below to set up self-hosted integration runtime.
de: Befolgen Sie die nachstehenden Anweisungen, um selbst gehostete Integration Runtime einzurichten.
es: Siga estas instrucciones para configurar un entorno de ejecución de integración autohospedado.
fr: Suivez les instructions ci-dessous pour configurer le runtime d’intégration auto-hébergé.
ja: セルフホステッド統合ランタイムをセットアップするには、以下の手順に従ってください。
ko: 아래 지침에 따라 자체 호스팅 통합 런타임을 설정합니다.
pt_br: Siga as instruções abaixo para configurar o runtime de integração auto-hospedada.
ru: Настройте локальную среду выполнения интеграции, следуя инструкциям ниже.
zh_hans: 按照下面的说明安装自承载集成运行时。
zh_hant: 請遵循下方的指示，設定自我裝載整合執行階段。

# sql.migration.database.table.selection.description
source: For each database below, click Edit to select the tables to migrate from source to target. Then, before clicking Next, validate the provided configuration by clicking 'Run validation'.
de: Klicken Sie unten für jede Datenbank auf Bearbeiten, um die Tabellen auszuwählen, die von der Quelle zum Ziel migriert werden sollen. Überprüfen Sie dann die angegebene Konfiguration, bevor Sie auf „Weiter“ klicken, indem Sie auf „Validierung ausführen“ klicken.
es: Para cada base de datos a continuación, haz clic en Editar para seleccionar las tablas que se migrarán del origen al destino. A continuación, antes de hacer clic en Siguiente, valida la configuración proporcionada haciendo clic en "Ejecutar validación".
fr: Pour chaque base de données ci-dessous, cliquez sur Modifier pour sélectionner les tables à migrer de la source vers la cible. Puis, avant de cliquer sur Next, validez la configuration fournie en cliquant sur 'Run validation'.
ja: 以下の各データベースについて、[編集] をクリックし、ソースからターゲットへの移行対象にするテーブルを選択してください。その後、[検証の実行] をクリックして指定の構成を検証してから、[次へ] をクリックしてください。
ko: 아래의 각 데이터베이스에 대해 편집을 클릭하여 원본에서 대상으로 마이그레이션할 테이블을 선택합니다. 그런 다음 '유효성 검사 실행'을 클릭하여 제공된 구성의 유효성을 검사한 후 다음을 클릭합니다.
pt_br: Para cada banco de dados abaixo, clique em Editar para selecionar as tabelas a serem migradas da origem para o destino. Em seguida, antes de clicar em Avançar, valide a configuração fornecida clicando em 'Executar validação'.
ru: Для каждой базы данных ниже нажмите кнопку "Изменить", чтобы выбрать таблицы для миграции из источника в целевую базу данных. Перед нажатием кнопки "Далее" проверьте указанную конфигурацию, нажав кнопку "Выполнить проверку".
zh_hans: 对于下面的每个数据库，单击“编辑”以选择要从源迁移到目标的表。然后，在单击“下一步”之前，单击“运行验证”来验证提供的配置。
zh_hant: 針對下列每個資料庫，按一下 [編輯] 以選取要從來源移轉至目標的資料表。然後，在按一下 [下一步] 之前，請按一下 [執行驗證] 以驗證提供的設定。
