Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.sku.mi.card.title
source: Azure SQL Managed Instance (PaaS)
pt_br: Instância Gerenciada de SQL do Azure (PaaS)
ru: Управляемый экземпляр SQL Azure (PaaS)
zh_hans: Azure SQL 托管实例(PaaS)
zh_hant: Azure SQL 受控執行個體 (PaaS)

# sql.migration.dashboard.title
source: Azure SQL Migration
es: Migración de Azure SQL
fr: Migration Azure SQL
ja: Azure SQL の移行
ko: Azure SQL 마이그레이션
pt_br: Migração do SQL do Azure
ru: Миграция SQL Azure
zh_hans: Azure SQL 迁移
zh_hant: Azure SQL 移轉

# sql.migration.wizard.target.title
source: Azure SQL target
de: Azure SQL-Ziel
es: Destino de Azure SQL
fr: Cible Azure SQL
ja: Azure SQL のターゲット
ko: Azure SQL 대상
pt_br: SQL do Azure de destino
ru: Целевой объект Azure SQL
zh_hans: Azure SQL 目标
zh_hant: Azure SQL 目標

# sql.login.migration.target.title
source: Azure SQL target
de: Azure SQL-Ziel
es: Destino de Azure SQL
fr: Cible Azure SQL
ja: Azure SQL のターゲット
ko: Azure SQL 대상
pt_br: SQL do Azure de destino
ru: Целевой объект Azure SQL
zh_hans: Azure SQL 目标
zh_hant: Azure SQL 目標

# sql.migration.wizard.cancel.reason.source.azure.sql.target.not.ready
source: Azure SQL target not ready
de: Azure SQL Ziel nicht bereit
es: El destino de Azure SQL no está listo
fr: La cible Azure SQL n'est pas prête
ko: Azure SQL 대상이 준비되지 않음
ru: Целевой объект Azure SQL не готов
zh_hans: Azure SQL 目标未就绪
zh_hant: Azure SQL 目標未就緒

# sql.migration.services.target
source: Azure SQL target selected as default.
de: Azure SQL-Ziel als Standard ausgewählt.
es: Destino de Azure SQL seleccionado como predeterminado.
fr: Cible Azure SQL sélectionnée par défaut.
ja: 既定として Azure SQL ターゲットが選択されました。
ko: Azure SQL 대상이 기본값으로 선택됨
pt_br: SQL do Azure de destino selecionado como padrão.
ru: Целевой объект Azure SQL выбран по умолчанию.
zh_hans: Azure SQL 目标选择为默认。
zh_hant: Azure SQL 目標已選取為預設值。

# sql.login.migration.wizard.target.type.title
source: Azure SQL target type
de: Azure SQL-Zieltyp
es: Tipo de destino de Azure SQL
fr: Type de cible Azure SQL
ja: Azure SQL ターゲット型
ko: Azure SQL 대상 유형
pt_br: Tipo de destino do SQL do Azure
ru: Тип целевого объекта Azure SQL
zh_hans: Azure SQL 目标类型
zh_hant: Azure SQL 目標類型

# sql.migration.blob.storage.header.text
source: Azure Storage Blob Container details
es: Detalles del contenedor de Azure Storage Blob
fr: Azure Storage Blob les détails du conteneur
ja: Azure Storage Blob コンテナーの詳細
ko: Azure Storage Blob 컨테이너 세부 정보
pt_br: Detalhes do contêiner do Azure Storage Blob
ru: Сведения о контейнере Azure Storage Blob
zh_hans: Azure 存储 Blob 容器详细信息
zh_hant: Azure 儲存體 Blob 容器詳細資料

# sql.migration.azure.storage.account.to.upload.backups
source: Azure Storage account to upload backups
de: Azure Storage-Konto zum Hochladen von Sicherungen
es: Cuenta de Azure Storage para cargar las copias de seguridad
fr: Compte de stockage Azure pour charger des sauvegardes
ja: バックアップをアップロードする Azure Storage アカウント
ko: 백업을 업로드할 Azure Storage 계정
pt_br: Conta de Armazenamento do Microsoft Azure para carregar backups
ru: Учетная запись службы хранилища Azure для отправки резервных копий
zh_hans: 要上传备份的 Azure 存储帐户
zh_hant: 要上傳備份的 Azure 儲存體帳戶

# sql.migration.wizard.account.title
source: Azure account
de: Azure-Konto
es: Cuenta de Azure
fr: Compte Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Conta do Azure
ru: Учетная запись Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶

# sql.migration.sku.azureConfiguration
source: Azure configuration
de: Azure-Konfiguration
es: Configuración de Azure
fr: Configuration Azure
ja: Azure の構成
ko: Azure 구성
pt_br: Configuração do Azure
ru: Конфигурация Azure
zh_hans: Azure 配置
zh_hant: Azure 組態

# sql.migration.sku.recommendation
source: Azure recommendation (PREVIEW)
de: Azure-Empfehlung
es: Recomendación de Azure (VERSIÓN PRELIMINAR)
fr: Recommandation Azure (PRÉVERSION)
ja: Azure のレコメンデーション (プレビュー)
ko: Azure 권장 사항(미리 보기)
pt_br: Recomendação do Azure (VERSÃO PRÉVIA)
ru: Рекомендация Azure (ПРЕДВАРИТЕЛЬНАЯ ВЕРСИЯ)
zh_hans: Azure 建议(预览版)
zh_hant: Azure 建議 (預覽)

# sql.migration.sku.azureRecommendation.status.notEnabled
source: Azure recommendation collects and analyzes performance data and then recommends an appropriate sized target in Azure for your workload.
de: Die Azure-Empfehlung erfasst und analysiert Leistungsdaten und empfiehlt dann ein Ziel der geeigneten Größe in Azure für Ihren Workload.
es: La recomendación de Azure recopila y analiza los datos de rendimiento y recomienda un destino de tamaño adecuado en Azure para la carga de trabajo.
fr: La recommandation Azure collecte et analyse les données de performances, puis recommande une cible dimensionnée appropriée dans Azure pour votre charge de travail.
ja: Azure のレコメンデーションでは、パフォーマンス データを収集して分析し、ワークロードに適したサイズのターゲットを Azure で推奨します。
ko: Azure 권장 사항은 성능 데이터를 수집하고 분석한 다음 워크로드에 적합한 크기의 Azure 대상을 권장합니다.
pt_br: A recomendação do Azure coleta e analisa dados de desempenho e depois recomenda um destino de tamanho apropriado no Azure para sua carga de trabalho.
ru: Рекомендации Azure собирают и анализируют данные о производительности, а затем рекомендуют целевые объекты Azure соответствующего размера для вашей рабочей нагрузки.
zh_hans: Azure 建议收集和分析性能数据，然后在 Azure 中为工作负载推荐适当大小的目标。
zh_hant: Azure 建議會收集及分析效能資料，然後為您的工作負載建議 Azure 中適當大小的目標。

# sql.migration.sku.azureRecommendation.status.imported
source: Azure recommendation has been applied using the provided data. Import or collect additional data to refine the recommendation.
de: Die Azure-Empfehlung wurde mithilfe der angegebenen Daten angewendet. Importieren oder erfassen Sie zusätzliche Daten, um die Empfehlung zu verfeinern.
es: La recomendación de Azure se ha aplicado con los datos proporcionados. Importe o recopile datos adicionales para restringir la recomendación.
fr: La recommandation Azure a été appliquée à l’aide des données fournies. Importez ou collectez des données supplémentaires pour affiner la recommandation.
ja: 提供されたデータを使用して Azure のレコメンデーションが適用されています。追加のデータをインポートまたは収集して、レコメンデーションを絞り込みます。
ko: 제공된 데이터를 사용하여 Azure 권장 사항을 적용했습니다. 권장 사항을 구체화하려면 추가 데이터를 가져오거나 수집하세요.
pt_br: A recomendação do Azure foi aplicada usando os dados fornecidos. Importe ou colete dados adicionais para refinar a recomendação.
ru: Рекомендация Azure применена с использованием предоставленных данных. Импортируйте или соберите дополнительные данные для уточнения рекомендации.
zh_hans: 已使用提供的数据应用 Azure 建议。导入或收集其他数据以优化建议。
zh_hant: 已使用提供的資料套用 Azure 建議。匯入或收集其他資料以精簡建議。

# sql.migration.sku.card.azureRecommendation.notEnabled
source: Azure recommendation is not available. Click 'Start data collection' button above to get started.
de: Die Azure-Empfehlung ist nicht verfügbar. Klicken Sie oben auf die Schaltfläche "Datensammlung starten", um zu beginnen.
es: La recomendación de Azure no está disponible. Haga clic en el botón "Iniciar recopilación de datos" anterior para empezar.
fr: La recommandation Azure n’est pas disponible. Cliquez sur le bouton « Démarrer la collecte de données » ci-dessus pour commencer.
ja: Azure のレコメンデーションは使用できません。開始するには、上の [データ収集の開始] ボタンをクリックします。
ko: Azure 권장 사항을 사용할 수 없습니다. 시작하려면 위의 '데이터 수집 시작' 단추를 클릭하세요.
pt_br: A recomendação do Azure não está disponível. Clique no botão “Iniciar coleta de dados” acima para começar.
ru: Рекомендация Azure недоступна. Чтобы начать, щелкните кнопку "Начать сбор данных" выше.
zh_hans: Azure 建议不可用。单击上面的“开始数据收集”按钮以开始使用。
zh_hant: Azure 建議無法使用。按一下上方的 [開始資料收集] 按鈕以開始使用。

# sql.migration.sku.azureRecommendation.description
source: Azure recommendation requires performance data of SQL server instance to provide target recommendation. Enable performance data collection to receive the target recommendation for the databases you want to migrate. The longer this will be enabled the better the recommendation. You can disable performance data collection at any time.
de: Um eine Zielempfehlung für die Azure-Empfehlung bereitzustellen, sind Leistungsdaten der SQL Server-Instanz erforderlich. Aktivieren Sie die Leistungsdatensammlung, um die Zielempfehlung für die Datenbanken zu erhalten, die Sie migrieren möchten. Je länger dies aktiviert wird, desto besser ist die Empfehlung. Sie können die Leistungsdatensammlung jederzeit deaktivieren.
es: La recomendación de Azure requiere datos de rendimiento de la instancia de SQL Server para proporcionar la recomendación de destino. Habilite la recopilación de datos de rendimiento para recibir la recomendación de destino para las bases de datos que quiere migrar. Cuanto más tiempo se habilite, mejor será la recomendación. Puede deshabilitar la recopilación de datos de rendimiento en cualquier momento.
fr: La recommandation Azure nécessite des données de performances de l’instance de serveur SQL pour fournir une recommandation cible. Activez la collecte de données de performances pour recevoir la recommandation cible pour les bases de données que vous souhaitez migrer. Plus cette durée sera activée, meilleure sera la recommandation. Vous pouvez désactiver la collecte des données de performances à tout moment.
ja: Azure のレコメンデーションでは、ターゲット レコメンデーションを提供するために SQL Server インスタンスのパフォーマンス データが必要です。パフォーマンス データの収集を有効にして、移行するデータベースのターゲット レコメンデーションを受け取ります。これを長くすればするほど、より良いレコメンデーションが得られます。パフォーマンス データ収集はいつでも無効にできます。
ko: 대상 권장 사항을 제공하려면 Azure 권장 사항에 따라 SQL Server 인스턴스의 성능 데이터가 필요합니다. 마이그레이션할 데이터베이스에 대한 대상 권장 사항을 받으려면 성능 데이터 수집을 사용하도록 설정하세요. 오래 사용할수록 더 정확한 권장 사항이 제공됩니다. 언제든지 성능 데이터 수집을 사용하지 않도록 설정할 수 있습니다.
pt_br: A recomendação do Azure requer dados de desempenho da instância do SQL Server para fornecer recomendações de destino. Ative a coleta de dados de desempenho para receber a recomendação de destino para os bancos de dados que você deseja migrar. Quanto mais tempo isso for ativado, melhor será a recomendação. Você pode desativar a coleta de dados de desempenho a qualquer momento.
ru: Для выработки целевой рекомендации Azure требуются данные производительности экземпляра SQL Server. Включите сбор данных производительности, чтобы получить целевую рекомендацию для баз данных, которые вы хотите перенести. Чем дольше он будет включен, тем лучше будет рекомендация. Отключить сбор данных производительности можно в любое время.
zh_hans: Azure 建议需要 SQL Server 实例的性能数据来提供目标建议。启用性能数据收集以接收要迁移的数据库的目标建议。启用此功能的时间越长，建议就越好。可以随时禁用性能数据收集。
zh_hant: Azure 建議需要 SQL Server 執行個體的效能資料，才能提供目標建議。啟用效能資料收集，以接收您要移轉之資料庫的目標建議。啟用的時間越長，建議越好。您可以隨時停用效能資料收集。

# sql.migration.sku.card.azureRecommendation.inProgress
source: Azure recommendation will be displayed once data collection is complete.
de: Die Azure-Empfehlung wird angezeigt, sobald die Datensammlung abgeschlossen ist.
es: Una vez completada la recopilación de datos, se mostrará la recomendación de Azure.
fr: La recommandation Azure s’affichera une fois la collecte de données terminée.
ja: データ収集が完了すると、Azure のレコメンデーションが表示されます。
ko: 데이터 수집이 완료되면 Azure 권장 사항이 표시됩니다.
pt_br: A recomendação do Azure será exibida assim que a coleta de dados for concluída.
ru: Рекомендация Azure будет отображаться после завершения сбора данных.
zh_hans: 数据收集完成后，将显示 Azure 建议。
zh_hant: 資料收集完成後，將會顯示 Azure 建議。

# sql.migration.dms.location
source: Azure region for your Azure Database Migration Service. Only regions that contain a service will be shown.
de: Azure-Region für Ihre Azure Database Migration Service. Es werden nur Regionen angezeigt, die einen Dienst enthalten.
es: Región de Azure para su servicio de Azure Database Migration Service. Solo se mostrarán las regiones que contienen un servicio.
fr: Région Azure pour votre Azure Database Migration Service. Seules les régions qui contiennent un service sont affichées.
ja: Azure Database Migration Service における Azure リージョン。サービスを含むリージョンのみが表示されます。
ko: Azure Database Migration Service의 Azure 지역입니다. 서비스를 포함하는 지역만 표시합니다.
pt_br: Região do Azure para seu Serviço de Migração de Banco de Dados do Azure. Somente as regiões que contêm um serviço serão mostradas.
ru: Регион Azure для Azure Database Migration Service. Будут показаны только регионы, содержащие службу.
zh_hans: Azure 数据库迁移服务的 Azure 区域。将仅显示包含服务的区域。
zh_hant: 您的 Azure 資料庫移轉服務的 Azure 區域。只會顯示包含服務的區域。

# sql.migration.services.location
source: Azure region for your Azure Database Migration Service. This should be the same region as your target Azure SQL.
de: Azure-Region für Ihren Azure Database Migration Service. Dies sollte die gleiche Region sein wie Ihre Ziel-Azure SQL.
es: Región de Azure para su Azure Database Migration Service. Debe ser la misma región que el Azure SQL de destino.
fr: Région Azure pour votre Azure Database Migration Service. Il doit s’agir de la même région que votre Azure SQL cible.
ja: Azure Database Migration Service の Azure リージョン。これは、ターゲット Azure SQL と同じリージョンである必要があります。
ko: Azure Database Migration Service의 Azure 지역입니다. 대상 Azure SQL과 동일한 지역이어야 합니다.
pt_br: Região do Azure para seu Serviço de Migração de Banco de Dados do Azure. Essa deve ser a mesma região que o SQL do Azure de destino.
ru: Регион Azure для Azure Database Migration Service. Это должен быть тот же регион, что и целевой экземпляр Azure SQL.
zh_hans: 适用于 Azure 数据库迁移服务的 Azure 区域。此区域应与目标 Azure SQL 相同。
zh_hant: Azure 資料庫移轉服務的 Azure 區域。這應該是與目標 Azure SQL 相同的區域。

# sql.migration.sku.location
source: Azure region for your Azure SQL target. Only regions that contain a target eligible for migration will be shown.
de: Azure-Region für Ihr Azure SQL-Ziel. Es werden nur Regionen angezeigt, die ein für die Migration geeignetes Ziel enthalten.
es: Región de Azure para el destino de Azure SQL. Solo se mostrarán las regiones que contienen un destino apto para la migración.
fr: Région Azure pour votre cible Azure SQL. Seules les régions qui contiennent une cible éligible pour la migration sont affichées.
ja: Azure SQL ターゲット用途の Azure リージョン。移行先として適しているターゲットを含むリージョンのみが表示されます。
ko: Azure SQL 대상의 Azure 지역입니다. 마이그레이션에 적합한 대상을 포함하는 지역만 표시합니다.
pt_br: Região do Azure para seu destino SQL do Azure. Somente as regiões que contêm um destino qualificado para migração serão mostradas.
ru: Регион Azure для целевого Azure SQL. Будут показаны только регионы, в которых есть целевые объекты, подходящие для миграции.
zh_hans: Azure SQL 目标的 Azure 区域。将仅显示包含符合迁移条件的目标的区域。
zh_hant: 您的 Azure SQL 目標的 Azure 區域。只會顯示包含符合移轉目標的區域。

# sql.migration.storage.account.location
source: Azure region for your Storage Account. Only regions that contain a storage account will be shown.
zh_hans: 存储帐户的 Azure 区域。将仅显示包含存储帐户的区域。

# sql.migration.summary.azure.storage
source: Azure storage
de: Azure-Speicher
fr: Stockage Azure
pt_br: Armazenamento do Azure
ru: Служба хранилища Azure
zh_hans: Azure 存储
zh_hant: Azure 儲存體

# sql.migration.validate.ir.validation.result.label.storage
source: Azure storage connectivity
de: Azure-Speicherkonnektivität
es: Conectividad de Azure Storage
fr: Connectivité du stockage Azure
ja: Azure Storage の接続性
ko: Azure Storage 연결
pt_br: Conectividade de armazenamento do Azure
ru: Подключение к службе хранилища Azure
zh_hans: Azure 存储连接
zh_hant: Azure 儲存體連線能力

# sql.migration.summary.azure.storage.subscription
source: Azure storage subscription
de: Azure-Speicherabonnement
es: Suscripción de Azure Storage
fr: Abonnement au stockage Azure
ja: Azure ストレージ サブスクリプション
ko: Azure Storage 구독
pt_br: Assinatura de armazenamento do Azure
ru: Подписка на службу хранилища Azure
zh_hans: Azure 存储订阅
zh_hant: Azure 儲存體訂用帳戶

# sql.migration.backup.restore
source: Backup and restore
de: Sichern und Wiederherstellen
es: Copia de seguridad y restauración
fr: Sauvegarde et restauration
ja: バックアップと復元
ko: 백업 및 복원
pt_br: Backup e restauração
ru: Резервное копирование и восстановление
zh_hans: 备份和还原
zh_hant: 備份與還原

# sql.migration.backup.location
source: Backup location
de: Sicherungsspeicherort
es: Ubicación de copia de seguridad
fr: Emplacement de sauvegarde
ja: バックアップの場所
ko: 백업 위치
pt_br: Local do backup
ru: Расположение резервной копии
zh_hans: 备份位置
zh_hant: 備份位置

# sql.migration.wizard.cancel.reason.backup.location.not.ready
source: Backup location not ready
de: Sicherungsspeicherort nicht bereit
es: La ubicación de la copia de seguridad no está lista
fr: L'emplacement de sauvegarde n'est pas prêt
ko: 백업 위치가 준비되지 않음
ru: Расположение резервной копии не готово
zh_hans: 备份位置未就绪
zh_hant: 備份位置未就緒

# sql.migration.backup.file.backup.size
source: Backup size (MB)
de: Größe der Sicherungsdatei (MB)
es: Tamaño de copia de seguridad (MB)
fr: Taille de sauvegarde (Mo)
ja: バックアップ サイズ (MB)
ko: 백업 크기(MB)
pt_br: Tamanho do Backup (MB)
ru: Размер резервной копии (МБ)
zh_hans: 备份大小(MB)
zh_hant: 備份大小 (MB)

# sql.migration.backup.start.time
source: Backup start time
de: Startzeitpunkt für Sicherung
es: Hora de inicio de copia de seguridad
fr: Heure de début de la sauvegarde
ja: バックアップ開始時刻
ko: 백업 시작 시간
pt_br: Hora de início do backup
ru: Время начала резервного копирования
zh_hans: 备份开始时间
zh_hant: 備份開始時間

# sql.migration.wizard.sku.all
source: Based on the assessment results, all {0} of your databases in an online state can be migrated to Azure SQL.
de: Basierend auf den Bewertungsergebnissen können alle {0} Ihrer Datenbanken in einem Onlinezustand zu Azure SQL migriert werden.
es: Según los resultados de la evaluación, las {0} bases de datos en estado de conexión se pueden migrar a Azure SQL.
fr: En fonction des résultats de l’évaluation, toutes les {0} de vos bases de données dans un état en ligne peuvent être migrées vers Azure SQL.
ja: 評価結果に基づくと、オンライン状態のデータベースのすべての {0} を Azure SQL に移行できます。
ko: 평가 결과에 따라 온라인 상태의 모든 {0} 데이터베이스를 Azure SQL로 마이그레이션할 수 있습니다.
pt_br: Com base nos resultados da avaliação, todos os {0} de seus bancos de dados em um estado online podem ser migrados para o SQL do Azure.
ru: Исходя из результатов оценки, все {0} из ваших баз данных в подключенном состоянии можно перенести в Azure SQL.
zh_hans: 根据评估结果，你的联机状态下的所有 {0} 个数据库都可以迁移到 Azure SQL。
zh_hant: 根據評定結果，您所有在線上狀態的 {0} 個資料庫都可以移轉到 Azure SQL。

# sql.migration.target.provisioning.description
source: Below is the ARM script for the recommended target SKU. You can save the script as template.
zh_hans: 下面是建议的目标 SKU 的 ARM 脚本。可以将脚本另存为模板。

# sql.migration.sku.targetStorageConfiguration.info
source: Below is the target storage configuration required to meet your storage performance needs.
de: Unten finden Sie die Zielspeicherkonfiguration, die zur Erfüllung Ihrer Speicherleistungsanforderungen erforderlich ist.
es: A continuación se muestra la configuración de almacenamiento de destino necesaria para satisfacer sus necesidades de rendimiento de almacenamiento.
fr: Vous trouverez ci-dessous la configuration de stockage cible requise pour répondre à vos besoins en termes de performances de stockage.
ja: ストレージ パフォーマンスのニーズを満たすために必要なターゲット ストレージ構成を次に示します。
ko: 다음은 스토리지 성능 요구 사항을 충족하는 데 필요한 대상 스토리지 구성입니다.
pt_br: Abaixo está a configuração de armazenamento de destino necessária para atender suas necessidades de desempenho de armazenamento.
ru: Ниже приведена целевая конфигурация хранилища, необходимая для выполнения ваших требований к производительности хранилища.
zh_hans: 下面是满足存储性能需求所需的目标存储配置。
zh_hant: 以下是滿足儲存體效能需求所需的目標儲存體設定。

# sql.migration.blob.container.title
source: Blob container
es: Contenedor de blobs
fr: Conteneur d'objets blob
ja: BLOB コンテナー
ko: BLOB 컨테이너
pt_br: Contêiner de blob
ru: Контейнер BLOB-объектов
zh_hans: Blob 容器
zh_hant: Blob 容器

# sql.migration.blob.container.label
source: Blob container resource group
de: Blob-Container-Ressourcengruppe
es: Grupo de recursos de contenedor de blobs
fr: Groupe de ressources du conteneur d’objets BLOB
ja: BLOB コンテナー リソース グループ
ko: Blob 컨테이너 리소스 그룹
pt_br: Grupo de recursos de contêiner de blob
ru: Группа ресурсов контейнера BLOB-объектов
zh_hans: Blob 容器资源组
zh_hant: Blob 容器資源群組

# sql.migration.blob.container.storage.account.label
source: Blob container storage account
de: Blob-Container-Speicherkonto
es: Cuenta de almacenamiento de contenedor de blobs
fr: Compte de stockage de conteneur d’objets blob
ja: BLOB コンテナー ストレージ アカウント
ko: Blob 컨테이너 스토리지 계정
pt_br: Conta de armazenamento de contêiner de blobs
ru: Учетная запись хранения контейнера BLOB-объектов
zh_hans: Blob 容器存储账户
zh_hant: Blob 容器儲存體帳戶

# sql.migration.restore.status.blocked
source: Blocked
de: Gesperrt
es: Bloqueado
fr: Bloqué
ja: ブロックされている
ko: 차단됨
pt_br: Bloqueado
ru: Заблокировано
zh_hans: 已阻止
zh_hant: 已封鎖

# sql.migration.ready
source: Blockers
de: Blockaden
es: Bloqueadores
fr: Bloquants
ja: ブロッカー
ko: 차단기
pt_br: Bloqueadores
ru: Блокировщики
zh_hans: 阻止程序
zh_hant: 封鎖程式

# sql.migration.issue.aria.label
source: Blocking Issue: {0}
de: Blockierproblem: {0}
es: Problema de bloqueo: {0}
fr: Problème bloquant : {0}
ja: 障害となっている問題: {0}
ko: 차단 문제: {0}
pt_br: Problema de Bloqueio: {0}
ru: Блокирующая проблема: {0}
zh_hans: 阻塞性问题: {0}
zh_hant: 執行問題: {0}

# sql.migration.issues.label
source: Blocking issues
de: Blockierprobleme
es: Problemas de bloqueo
fr: Erreurs majeures
ja: 妨げている問題:
ko: 차단 문제
pt_br: Problemas de bloqueio
ru: Блокирующие проблемы
zh_hans: 阻止问题
zh_hant: 中止安裝的問題

# sql.migration.browse
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
ja: 参照
ko: 찾아보기
pt_br: Procurar
ru: Обзор
zh_hans: 浏览
zh_hant: 瀏覽

# sql.migration.sku.azureConfiguration.businessCritical
source: Business critical
de: Unternehmenskritisch
es: Crítico para la empresa
fr: Critique pour l’entreprise
ko: 중요 비즈니스용
pt_br: Comercialmente crítico
ru: Критически важный для бизнеса
zh_hans: 业务关键
zh_hant: 業務關鍵

# sql.migration.sku.cpu.requirement
source: CPU requirement
de: CPU-Anforderung
es: Requisito de CPU
fr: Configuration requise pour le processeur
ja: CPU 要件
ko: CPU 요구 사항
pt_br: Requisito de CPU
ru: Требования к центральному процессору
zh_hans: CPU 要求
zh_hant: CPU 需求

# sql.migration.saved.assessment.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# sql.migration.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# sql.migration.table.selection.update.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# sql.migration.cancel.migration
source: Cancel migration
de: Migration abbrechen
es: Cancelar migración
fr: Annuler la migration
ja: 移行のキャンセル
ko: 마이그레이션 취소
pt_br: Cancelar migração
ru: Отменить миграцию
zh_hans: 取消迁移
zh_hant: 取消移轉

# sql.migration.cancel.feedback.dialog.title
source: Cancel migration
de: Migration abbrechen
es: Cancelar migración
fr: Annuler la migration
ja: 移行のキャンセル
ko: 마이그레이션 취소
pt_br: Cancelar migração
ru: Отменить миграцию
zh_hans: 取消迁移
zh_hant: 取消移轉

# sql.migration.state.canceled
source: Canceled
de: Abgebrochen
es: Cancelado
fr: Annulé
ja: 取り消されました
ko: 취소됨
pt_br: Cancelado
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消

# sql.migration.copy.status.canceled
source: Canceled
de: Abgebrochen
es: Cancelada
fr: Annulé
ja: 取り消し
ko: 취소됨
pt_br: Cancelado
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消

# sql.migration.status.canceled
source: Canceled
de: Abgebrochen
es: Cancelada
fr: Annulé
ja: 取り消し
ko: 취소됨
pt_br: Cancelado
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消

# sql.migration.validation.state.canceled
source: Canceled
de: Abgebrochen
es: Cancelado
fr: Annulé
ja: 取り消されました
ko: 취소함
pt_br: Cancelado
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消

# sql.migration.status.canceling
source: Canceling
de: Vorgang wird abgebrochen
es: Cancelando
fr: Annulation en cours
ja: 取り消しています
ko: 취소 중
pt_br: Cancelando
ru: Выполняется отмена
zh_hans: 正在取消
zh_hant: 正在取消

# sql.migration.restore.status.cancelled
source: Cancelled
de: Abgebrochen
es: Cancelado
fr: Annulé
ja: キャンセル済み
ko: 취소됨
pt_br: Cancelado
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消

# sql.migration.copy.status.cancelled
source: Cancelled
de: Abgebrochen
es: Cancelado
fr: Annulé
ja: 取り消されました
ko: 취소됨
pt_br: Cancelada
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消
