Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.login.migration.get.logins.query
source: SELECT sp.name as login, sp.type_desc as login_type, sp.default_database_name, case when sp.is_disabled = 1 then 'Disabled' else 'Enabled' end as status FROM sys.server_principals sp LEFT JOIN sys.sql_logins sl ON sp.principal_id = sl.principal_id WHERE sp.type NOT IN ('G', 'R') AND sp.type_desc IN ('SQL_LOGIN', 'WINDOWS_LOGIN') ORDER BY sp.name;
es: SELECT sp.name como inicio de sesión, sp.type_desc como login_type, sp.default_database_name, case when sp.is_disabled = 1 then 'Disabled' else 'Enabled' end as status FROM sys.server_principals sp LEFT JOIN sys.sql_logins sl ON sp.principal_id = sl.principal_id WHERE sp.type NOT IN ('G', 'R') AND sp.type_desc IN ('SQL_LOGIN', 'WINDOWS_LOGIN') ORDER BY sp.name;
fr: SÉLECTIONNER sp.name as login, sp.type_desc as login_type, sp.default_database_name, case when sp.is_disabled = 1 then 'Disabled' else 'Enabled' end as status FROM sys.server_principals sp LEFT JOIN sys.sql_logins sl ON sp.principal_id = sl.principal_id WHERE sp.type NOT IN ('G', 'R') AND sp.type_desc IN ('SQL_LOGIN', 'WINDOWS_LOGIN') ORDER BY sp.name;

# sql.migration.sku.sql.temp
source: SQL tempdb
es: Tempdb de SQL
fr: base de données SQL
pt_br: Tempdb do SQL

# sql.login.migration.get.connection.string
source: data source={0};initial catalog=master;user id={1};password={2};TrustServerCertificate=True;Integrated Security=false;
ko: 데이터 원본={0};초기 카탈로그=마스터;사용자 ID={1};암호={2};TrustServerCertificate=True;통합 보안=false;

# sql.migration.azure.sql
source: Azure SQL
pt_br: SQL do Azure

# sql.migration.network.share.path.format
source: \\Servername.domainname.com\Backupfolder
de: \\Servername.Domaenenname.com\Sicherungsordner
