Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.sql.vm.page.blob.info
source: For target servers running SQL Server 2014 or below, you must store your database backups in an Azure Storage Blob Container instead of uploading them using the network share option. Additionally, you must store the backup files as page blobs, as block blobs are supported only for targets running SQL Server 2016 or later. Learn more: {0}
de: Für Zielserver, auf denen SQL Server 2014 oder niedriger ausgeführt wird, müssen Sie Ihre Datenbanksicherungen in einem Azure Storage Blob Container speichern, anstatt sie mithilfe der Netzwerkfreigabeoption hochzuladen. Darüber hinaus müssen Sie die Sicherungsdateien als Seitenblobs speichern, da Blockblobs nur für Ziele unterstützt werden, die SQL Server 2016 oder höher ausführen. Weitere Informationen: {0}
es: Para los servidores de destino que ejecutan SQL Server 2014 o inferior, debe almacenar las copias de seguridad de la base de datos en un contenedor de Azure Storage Blob en lugar de cargarlas mediante la opción de recurso compartido de red. Además, debe almacenar los archivos de copia de seguridad como blobs en páginas, ya que los blobs en bloques solo se admiten para destinos que ejecutan SQL Server 2016 o posterior. Más información: {0}
fr: Pour les serveurs cibles exécutant SQL Server 2014 ou une version antérieure, vous devez stocker vos sauvegardes de base de données dans un conteneur Azure Storage Blob au lieu de les charger à l’aide de l’option de partage réseau. En outre, vous devez stocker les fichiers de sauvegarde sous forme d’objets blob de pages, car les objets blob de blocs sont pris en charge uniquement pour les cibles qui exécutent SQL Server 2016 ou version ultérieure. En savoir plus : {0}
ja: SQL Server 2014 以下を実行しているターゲット サーバーでは、ネットワーク共有オプションを使用してデータベース バックアップをアップロードするのではなく、Azure Storage Blob コンテナーに格納する必要があります。また、ブロック BLOB はSQL Server 2016 以降を実行しているターゲットでのみサポートされているため、バックアップ ファイルをページ BLOB として保存する必要があります。詳細情報: {0}
ko: SQL Server 2014 이하를 실행하는 대상 서버의 경우 데이터베이스를 백업할 때 네트워크 공유 옵션을 사용하여 업로드하는 대신 Azure Storage Blob 컨테이너에 저장해야 합니다. 또한 블록 Blob은 SQL Server 2016 이상을 실행하는 대상에만 지원되므로 백업 파일을 페이지 Blob으로 저장해야 합니다. 자세한 정보: {0}
pt_br: Para servidores de destino que executam o SQL Server 2014 ou inferior, você deve armazenar seus backups de banco de dados em um contêiner do Azure Storage Blob em vez de carregá-los usando a opção de compartilhamento de rede. Além disso, você deve armazenar os arquivos de backup como blobs de páginas, pois os blobs de blocos têm suporte apenas para destinos que executam o SQL Server 2016 ou posterior. Saiba mais: {0}
ru: Для целевых серверов с SQL Server 2014 или более поздней версии необходимо хранить резервные копии баз данных в контейнере Azure Storage Blob, а не отправлять их с помощью сетевой папки. Кроме того, файлы резервных копий должны храниться как страничные BLOB-объекты, так как блочные BLOB-объекты поддерживаются только для целевых объектов с SQL Server 2016 или более поздней версии. Дополнительные сведения: {0}
zh_hans: 对于运行 SQL Server 2014 或更低版本的目标服务器，必须将数据库备份存储在 Azure 存储 Blob 容器中，而不是使用网络共享选项上传它们。此外，必须将备份文件存储为页 Blob，因为运行 SQL Server 2016 或更高版本的目标仅支持块 blob。要了解详细信息，请访问: {0}
zh_hant: 對於執行 SQL Server 2014 或更低版本的目標伺服器，您必須將資料庫備份儲存在 Azure 儲存體 Blob 容器中，而非使用網路共用選項將其上傳。此外，您必須將備份檔案儲存為分頁 Blob，因為只有執行 SQL Server 2016 或更新版本的目標才支援區塊 Blob。深入了解: {0}

# sql.migration.database.assessment.xevents.description
source: For the selected databases, optionally provide extended event session files to assess ad-hoc or dynamic SQL queries or any DML statements initiated through the application data layer.
zh_hans: 对于所选数据库，可选择提供扩展事件会话文件以评估临时或动态 SQL 查询或通过应用程序数据层启动的任何 DML 语句。

# sql.migration.full.backup.files
source: Full backup file(s)
de: Vollständige Sicherungsdatei(en)
es: Archivos de copia de seguridad completos
fr: Fichier(s) de sauvegarde complète
ja: 完全バックアップ ファイル
ko: 전체 백업 파일
pt_br: Arquivo(s) de backup completo(s)
ru: Файлы полной резервной копии
zh_hans: 一个或多个完整备份文件
zh_hant: 完整備份檔案

# sql.migration.sku.azureConfiguration.generalPurpose
source: General purpose
de: Allgemein
es: Uso general
fr: Usage général
ja: 汎用
ko: 범용
pt_br: Uso geral
ru: Общее назначение
zh_hans: 常规用途
zh_hant: 一般目的

# sql.migration.target.provisioning.generate.template
source: Generate Template
zh_hans: 生成模板

# sql.migration.status.generatingscript
source: Generating script
de: Skript wird generiert
es: Generando script
fr: Génération du script
ja: スクリプトを生成しています
ko: 스크립트 생성
pt_br: Gerando script
ru: Создается скрипт
zh_hans: 正在生成脚本
zh_hant: 產生指令碼

# sql.migration.status.generatingcompleted
source: Generating script completed
de: Generieren des Skripts abgeschlossen
es: Generación de script completada
fr: Génération du script terminée
ja: スクリプトの生成が完了しました
ko: 스크립트 생성 완료
pt_br: Geração de script concluída
ru: Создание скрипта завершено
zh_hans: 脚本生成已完成
zh_hant: 產生指令碼完成

# sql.migration.sku.get.recommendation
source: Get Azure recommendation
de: Azure-Empfehlung abrufen
es: Obtener recomendación de Azure
fr: Obtenir la recommandation Azure
ja: Azure のレコメンデーションを取得する
ko: Azure 권장 사항 가져오기
pt_br: Obter recomendações do Azure
ru: Получить рекомендацию Azure
zh_hans: 获取 Azure 建议
zh_hant: 取得 Azure 建議

# sql.migration.status.getdependency
source: Get dependency
de: Abhängigkeit abrufen
es: Obtener dependencia
fr: Obtenir la dépendance
ja: 依存関係を取得する
ko: 종속성 가져오기
pt_br: Obter dependência
ru: Получить зависимость
zh_hans: 获取依赖项
zh_hant: 取得相依性

# sql.migration.recommended.configuration.summary.label.description
source: Get the right-sized SKU recommendations for Azure SQL Targets.
de: Erhalten Sie die Empfehlungen zur richtigen SKU-Größe für Azure SQL-Ziele.
es: Obtenga las recomendaciones de SKU de tamaño correcto para los destinos de Azure SQL.
fr: Obtenez les recommandations SKU adaptées à Azure SQL Targets.
ja: Azure SQL ターゲットに適したサイズの SKU レコメンデーションを取得します。
ko: Azure SQL 대상에 적합한 크기의 SKU 권장 사항을 가져옵니다.
pt_br: Obtenha as recomendações de SKU do tamanho certo para os Destinos do SQL do Azure.
ru: Получите рекомендации по SKU подходящего размера для целевых объектов Azure SQL.
zh_hans: 获取适用于 Azure SQL 目标的适当大小的 SKU 建议。
zh_hant: 取得 Azure SQL 目標的適當大小 SKU 建議。

# sql.migration.table.selection.status.column
source: Has rows
de: Hat Zeilen
es: Tiene filas
fr: A des lignes
ja: 行を含む
ko: 행 있음
pt_br: Tem linhas
ru: Содержит строки
zh_hans: 具有行
zh_hant: 有資料列

# sql.migration.help.support.title
source: Help + Support
de: Hilfe und Support
es: Ayuda y soporte técnico
fr: Aide + support
ja: ヘルプ + サポート
ko: 도움말 + 지원
pt_br: Ajuda + Suporte
ru: Справка и поддержка
zh_hans: 帮助和支持
zh_hant: 說明與支援

# sql.migration.tab.button.help.support.description
source: Help + Support
de: Hilfe und Support
es: Ayuda y soporte técnico
fr: Aide + support
ja: ヘルプ + サポート
ko: 도움말 + 지원
pt_br: Ajuda + Suporte
ru: Справка и поддержка
zh_hans: 帮助和支持
zh_hant: 說明與支援

# sql.migration.tab.button.help.support.label
source: Help + Support
de: Hilfe und Support
es: Ayuda y soporte técnico
fr: Aide + support
ja: ヘルプ + サポート
ko: 도움말 + 지원
pt_br: Ajuda + Suporte
ru: Справка и поддержка
zh_hans: 帮助和支持
zh_hant: 說明與支援

# sql.migration.dashboard.help.title
source: Help articles and video links
de: Links zu Hilfeartikeln und Videos
es: Artículos de ayuda y vínculos de vídeos
fr: Articles d’aide et liens vidéo
ja: ヘルプ記事とビデオ リンク
ko: 도움말 및 비디오 링크
pt_br: Artigos de ajuda e links de vídeo
ru: Статьи справки и ссылки на видео
zh_hans: 帮助文章和视频链接
zh_hant: 說明文章及影片連結

# sql.migration.sku.targetStorageConfiguration.caching
source: Host caching
de: Hostzwischenspeicherung
es: Almacenamiento en caché del host
fr: Mise en cache de l’hôte
ja: ホスト キャッシュ
ko: 호스트 캐싱
pt_br: Cache do host
ru: Кэширование узлов
zh_hans: 主机缓存
zh_hant: 主機快取

# sql.migration.sku.azureConfiguration.hyperscale
source: Hyperscale
es: Hiperescala
ja: ハイパースケール
ko: 하이퍼스케일
pt_br: Hiperescala
ru: Гипермасштабирование
zh_hans: 超大规模
zh_hant: 超大規模資料庫

# sql.migration.sku.azureRecommendation.openExisting.method
source: I already have the performance data
de: Ich habe bereits die Leistungsdaten.
es: Ya tengo los datos de rendimiento
fr: J’ai déjà les données de performance
ja: パフォーマンス データが既にあります
ko: 성능 데이터가 이미 있습니다.
pt_br: Já tenho os dados de desempenho
ru: У меня уже есть данные производительности
zh_hans: 我已有性能数据
zh_hant: 我已經擁有效能資料

# sql.migration.confirm.checkbox.message
source: I confirm there are no additional log backups to provide and want to complete cutover.
de: Ich bestätige, dass keine zusätzlichen Protokollsicherungen zur Verfügung stehen und der Cutover abgeschlossen werden soll.
es: Confirmo que no hay copias de seguridad de registros adicionales para proporcionar y deseo completar la transición.
fr: Je confirme qu’il n’existe aucune sauvegarde de journal supplémentaire à fournir et que je souhaite effectuer le basculement.
ja: 提供する追加のログ バックアップがないことを確認し、一括移行の完了を希望します。
ko: 제공할 추가 로그 백업이 없음을 확인하고 컷오버를 완료하려고 함을 확인합니다.
pt_br: Confirmo que não há backups de log adicionais para fornecer e desejo concluir a substituição.
ru: Я подтверждаю отсутствие дополнительных резервных копий журналов и хочу завершить прямую миграцию.
zh_hans: 我确认没有要提供的其他日志备份，并且希望完成直接转换。
zh_hant: 我確認沒有其他記錄備份可提供並想要完成完全移轉。

# sql.migration.tde.wizard.optionadsconfirm
source: I give consent to use my credentials for accessing the certificates.
de: Ich stimme zu, dass meine Anmeldeinformationen für den Zugriff auf die Zertifikate verwendet werden dürfen.
es: Doy mi consentimiento para usar mis credenciales para acceder a los certificados.
fr: J’accepte d’utiliser mes informations d’identification pour accéder aux certificats.
ja: 証明書へのアクセスに自分の資格情報を使用することに同意します。
ko: 인증서에 액세스하기 위해 내 자격 증명을 사용하는 데 동의합니다.
pt_br: Eu dou consentimento para usar minhas credenciais para acessar os certificados.
ru: Я даю согласие на использование моих учетных данных для доступа к сертификатам.
zh_hans: 我同意使用我的凭据访问证书。
zh_hant: 我同意使用我的登入資訊來存取憑證。

# sql.migration.tde.wizard.optionmanual
source: I have already migrated my certificates and private keys to the target.
de: Ich habe meine Zertifikate und privaten Schlüssel bereits zum Ziel migriert.
es: Ya he migrado mis certificados y claves privadas al destino.
fr: J'ai déjà migré mes certificats et clés privées vers la cible.
ja: 証明書と秘密鍵は既にターゲットに移行しています。
ko: 이미 인증서와 프라이빗 키를 대상으로 마이그레이션했습니다.
pt_br: Já migrei meus certificados e chaves privadas para o destino.
ru: Мои сертификаты и закрытые ключи уже перенесены в целевой объект.
zh_hans: 我已将证书和私钥迁移到目标。
zh_hant: 我已經將憑證和私密金鑰移轉到目標。

# sql.ir.local.ir.definition
source: I want to setup self-hosted integration runtime on another Windows machine that is not my local machine.
zh_hans: 我想在另一台 Windows 计算机上设置自承载集成运行时，该计算机不是我的本地计算机。

# sql.migration.sku.io.memory.requirement
source: IO latency requirement
de: E/A-Latenzanforderung
es: Requisito de latencia de E/S
fr: Exigence de latence d’E/S
ja: IO 待機時間の要件
ko: IO 대기 시간 요구 사항
pt_br: Requisitos de latência de E/S
ru: Требование задержки ввода-вывода
zh_hans: IO 延迟要求
zh_hant: IO 延遲需求

# sql.ir.ip.address
source: IP address
zh_hans: IP 地址

# sql.ir.config.type
source: IR configuration type
zh_hans: IR 配置类型

# sql.ir.ir.version
source: IR version
zh_hans: IR 版本

# sql.migration.empty.table.subtext
source: If results were expected, verify the connection to the SQL Server instance.
de: Wenn Ergebnisse erwartet wurden, überprüfen Sie die Verbindung mit der SQL Server-Instanz.
es: Si esperaba ver resultados, compruebe la conexión a la instancia de SQL Server.
fr: Si des résultats étaient attendus, vérifiez la connexion à l’instance SQL Server.
ja: 結果が期待通りだった場合、SQL Server インスタンスへの接続を確認します。
ko: 결과가 예상되는 경우 SQL Server 인스턴스에 대한 연결을 확인하세요.
pt_br: Para atingir os resultados esperados, verifique a conexão com a Instância do SQL Server.
ru: Если ожидались результаты, проверьте подключение к экземпляру SQL Server.
zh_hans: 如果结果在预期内，请验证与 SQL Server 实例的连接。
zh_hant: 如果預期結果，請驗證 SQL Server 執行個體的連線。

# sql.migration.wizard.cancel.reason.others.input.box.note
source: If you selected others, please write a short note.
de: Wenn Sie andere ausgewählt haben, schreiben Sie bitte eine kurze Notiz.
es: Si seleccionó a otros usuarios, escriba una nota breve.
fr: Si vous en avez sélectionné d’autres, veuillez rédiger une courte note.
ko: 기타를 선택한 경우 간단히 메모해 주세요.
ru: Если вы выбрали других пользователей, напишите краткую заметку.
zh_hans: 如果选择了“其他”，请撰写简短备注。
zh_hant: 如果您選取其他項目，請撰寫簡短備註。

# sql.migration.impact
source: Impact
de: Auswirkung
es: Impacto
ko: 영향
pt_br: Impacto
ru: Воздействие
zh_hans: 影响
zh_hant: 影響

# sql.migration.impacted.objects
source: Impacted objects
de: Betroffene Objekte
es: Objetos afectados
fr: Objets impactés
ja: 影響を受けたオブジェクト
ko: 영향을 받는 개체
pt_br: Objetos afetados
ru: Затронутые объекты
zh_hans: 受影响的对象
zh_hant: 受影響的物件

# sql.migration.import
source: Import
de: Importieren
es: Importar
fr: Importer
ja: インポート
ko: 가져오기
pt_br: Importar
ru: Импорт
zh_hans: 导入
zh_hant: 匯入

# sql.migration.tab.import.migration.label
source: Import assessment
de: Bewertung importieren
es: Importar evaluación
fr: Importer l’évaluation
ja: 評価のインポート
ko: 평가 가져오기
pt_br: Importar avaliação
ru: Импортировать оценку
zh_hans: 导入评估
zh_hant: 匯入評定

# sql.migration.tab.import.migration.description
source: Import assessment to Azure SQL
de: Bewertung in Azure SQL importieren
es: Importar la evaluación a Azure SQL
fr: Importer l’évaluation dans Azure SQL
ja: 評価を Azure SQL にインポートします
ko: 평가를 Azure SQL로 가져오기
pt_br: Importar avaliação para SQL do Azure
ru: Импорт оценки в Azure SQL
zh_hans: 将评估导入到 Azure SQL
zh_hant: 將評定匯入 Azure SQL

# sql.migration.sku.import.performance.data
source: Import performance data
de: Leistungsdaten importieren
es: Importar datos de rendimiento
fr: Importer des données de performances
ja: パフォーマンス データのインポート
ko: 성능 데이터 가져오기
pt_br: Importar dados de desempenho
ru: Импорт данных производительности
zh_hans: 导入性能数据
zh_hant: 匯入效能資料

# sql.migration.sku.import.performance.data.dialog.description
source: Import this data file from an existing folder, if you have already collected it using Data Migration Assistant.
de: Importieren Sie diese Datendatei aus einem vorhandenen Ordner, wenn Sie diese Daten bereits mit dem Datenmigrations-Assistenten gesammelt haben.
es: Importe este archivo de datos desde una carpeta existente, si ya lo ha recopilado mediante Data Migration Assistant.
fr: Importez ce fichier de données à partir d'un dossier existant, si vous l'avez déjà collecté à l'aide de Data Migration Assistant.
ja: Data Migration Assistant を使用してこのデータ ファイルを既に収集している場合は、既存のフォルダーからインポートします。
ko: Data Migration Assistant를 사용하여 이미 수집한 경우 기존 폴더에서 이 데이터 파일을 가져옵니다.
pt_br: Importe esse arquivo de dados de uma pasta existente, se você já o tiver coletado usando o Assistente de Migração de Dados.
ru: Импортируйте этот файл данных из существующей папки, если вы уже собрали его с помощью Помощника по миграции данных.
zh_hans: 如果已使用“数据迁移助手”收集此数据文件，请从现有文件夹导入此数据文件。
zh_hant: 從現有資料夾匯入此資料檔案 (如果您已使用 Data Migration Assistant 收集)。

# sql.ir.important
source: Important
zh_hans: 重要说明

# sql.migration.database.migration.migration.mode.tool.tip
source: In Azure Database Migration Service, you can migrate your databases offline or while they are online. In an offline migration, application downtime starts when the migration starts. To limit downtime to the time it takes you to cut over to the new environment after the migration, use an online migration.
de: In Azure Database Migration Service können Sie Ihre Datenbanken offline oder online migrieren. Bei einer Offline-Migration beginnt die Downtime der Anwendung, wenn die Migration beginnt. Um die Downtime auf die Zeit zu begrenzen, die Sie benötigen, um nach der Migration auf die neue Umgebung umzuschalten, verwenden Sie eine Online-Migration.
es: En Azure Database Migration Service, puede migrar las bases de datos sin conexión o mientras están en línea. En una migración sin conexión, el tiempo de inactividad de la aplicación se inicia cuando se inicia la migración. Para limitar el tiempo de inactividad al tiempo que se tarda en pasar al nuevo entorno después de la migración, use una migración en línea.
fr: Dans Azure Database Migration Service, vous pouvez migrer vos bases de données hors connexion ou lorsqu'elles sont en ligne. Dans une migration hors ligne, le temps d'arrêt de l'application commence au démarrage de la migration. Pour limiter les temps d'arrêt au temps qu'il vous faut pour basculer vers le nouvel environnement après la migration, utilisez une migration en ligne.
ja: Azure Database Migration Service では、データベースをオフラインにして移行するか、オンライン状態のまま移行することができます。オフライン移行では、移行の開始時にアプリケーションのダウンタイムが開始されます。ダウンタイムの長さを、移行後の新しい環境へのカットオーバー時間のみに限定するには、オンライン移行を使用します。
ko: Azure Database Migration Service에서 오프라인 또는 온라인 상태일 때 데이터베이스를 마이그레이션할 수 있습니다. 오프라인 마이그레이션에서는 마이그레이션이 시작될 때 애플리케이션 가동 중지 시간이 시작됩니다. 가동 중지 시간을 마이그레이션 후 새 환경으로 컷오버하는 데 걸리는 시간으로 제한하려면 온라인 마이그레이션을 사용하세요.
pt_br: No Serviço de Migração de Banco de Dados do Azure, você pode migrar seus bancos de dados offline ou enquanto estiverem online. Em uma migração offline, o tempo de inatividade do aplicativo começa quando a migração é iniciada. Para limitar o tempo de inatividade ao tempo que leva para mudar para o novo ambiente após a migração, use uma migração online.
ru: В Azure Database Migration Service вы можете перенести базы данных в автономном режиме или при их подключении к сети. При автономной миграции время простоя приложения начинается при запуске миграции. Чтобы ограничить время простоя временем, необходимым для перехода в новую среду после миграции, используйте миграцию по сети.
zh_hans: 在 Azure 数据库迁移服务中，可以在脱机或联机时迁移数据库。脱机迁移期间，应用程序停机时间在迁移开始时开始。如果要在迁移后将故障时间限制为要直接转换到新环境的时间，请使用联机迁移。
zh_hant: 在 Azure 資料移轉服務中，您可以離線或在連線時移轉您的資料庫。在離線移轉中，應用程式停機時間會在移轉開始時開始。若要將停機時間限制為移轉後移轉至新環境所需的時間，請使用線上移轉。

# sql.migration.tde.validation.requirements.message
source: In order for certificate migration to succeed, you must meet all of the requirements listed below. Click "Run validation" to check that requirements are met.
de: Damit die Zertifikatmigration erfolgreich ist, müssen Sie alle unten aufgeführten Anforderungen erfüllen. Klicken Sie auf "Überprüfung ausführen", um zu überprüfen, ob die Anforderungen erfüllt sind.
es: Para que la migración del certificado tenga éxito, debe cumplir todos los requisitos que se indican a continuación. Haga clic en "Ejecutar validación" para comprobar que se cumplen los requisitos.
fr: Pour que la migration des certificats réussisse, vous devez remplir toutes les conditions répertoriées ci-dessous. Cliquez sur « Exécuter la validation » pour vérifier que les exigences sont remplies.
ja: 証明書の移行を成功させるには、以下に示す要件をすべて満たしている必要があります。 [検証の実行] をクリックして、要件が満たされていることを確認します。
ko: 인증서 마이그레이션이 성공하려면 아래 나열된 모든 요구 사항을 충족해야 합니다. "유효성 검사 실행"을 클릭하여 요구 사항을 충족하는지 확인하세요.
pt_br: Para que a migração de certificado seja bem-sucedida, você deve atender a todos os requisitos listados abaixo. Clique em "Executar validação" para verificar se os requisitos foram atendidos.
ru: Чтобы миграция сертификата была успешной, необходимо выполнить все требования, указанные ниже. Нажмите "Запустить проверку", чтобы проверить выполнение требований.
zh_hans: 为了使证书迁移成功，必须满足下面列出的所有要求。 单击“运行验证”以检查是否满足要求。
zh_hant: 為了讓憑證移轉成功，您必須符合下列所有需求。 按一下 [執行驗證] 以檢查是否符合需求。

# sql.migration.copy.status.inprogress
source: In progress
de: In Bearbeitung
es: En curso
fr: En cours
ja: 進行中
ko: 진행 중
pt_br: Em andamento
ru: Выполняется
zh_hans: 进行中
zh_hant: 進行中

# sql.migration.status.inprogress
source: In progress
de: In Bearbeitung
es: En curso
fr: En cours
ja: 進行中
ko: 진행 중
pt_br: Em andamento
ru: Выполняется
zh_hans: 进行中
zh_hant: 進行中

# sql.migration.details.serverobjects.inprogress.tables.label
source: In progress
de: In Bearbeitung
es: En curso
fr: En cours
ja: 進行中
ko: 진행 중
pt_br: Em andamento
ru: Выполняется
zh_hans: 进行中
zh_hant: 進行中

# sql.login.migration.status.in.progress
source: In progress
de: In Bearbeitung
es: En curso
fr: En cours
ja: 進行中
ko: 진행 중
pt_br: Em andamento
ru: Выполняется
zh_hans: 正在进行
zh_hant: 進行中

# sql.migration.restore.status.initializing
source: Initializing
de: Initialisierung
es: Inicializando
fr: Initialisation en cours
ja: 初期化しています
ko: 초기화하는 중
pt_br: Inicializando
ru: Инициализация
zh_hans: 正在初始化
zh_hant: 正在初始化

# sql.migration.inline.migration.notebook.title
source: Inline migration
es: Migración en línea
fr: Migration en ligne
ja: インライン移行
ko: 인라인 마이그레이션
pt_br: Migração embutida
ru: Встроенная миграция
zh_hans: 内联迁移
zh_hant: 內嵌移轉

# sql.migration.instance
source: Instance
de: Instanz
es: Instancia
ja: インスタンス
ko: 인스턴스
pt_br: Instância
ru: Экземпляр
zh_hans: 实例
zh_hant: 執行個體

# sql.migration.different.ir.version.error
source: Integration Runtime versions [{0}] are not the same. Please have the same version of Integration Runtime across all nodes for consistency and optimal performance.
de: Integration Runtime-Versionen [{0}] sind nicht identisch. Verwenden Sie auf allen Knoten die gleiche Version von Integration Runtime, um Konsistenz und optimale Leistung zu gewährleisten.
es: Integration Runtime versiones [{0}] no son las mismas. Tenga la misma versión de Integration Runtime en todos los nodos para obtener coherencia y un rendimiento óptimo.
fr: Les versions Integration Runtime [{0}] ne sont pas les mêmes. Veuillez utiliser la même version de Integration Runtime sur tous les nœuds pour des raisons de cohérence et de performances optimales.
ja: Integration Runtime バージョン [{0}] は同じではありません。一貫性と最適なパフォーマンスを実現するために、すべてのノードで同じバージョンの Integration Runtime を使用してください。
ko: Integration Runtime 버전 [{0}]이(가) 다릅니다. 일관성과 최적의 성능을 위해 모든 노드에서 동일한 버전의 Integration Runtime을 사용합니다.
pt_br: As versões do Integration Runtime [{0}] não são iguais. Tenha a mesma versão do Integration Runtime em todos os nós para obter consistência e desempenho ideal.
ru: Версии Integration Runtime [{0}] не совпадают. Для обеспечения согласованности и оптимальной производительности используйте одинаковую версию Integration Runtime во всех узлах.
zh_hans: Integration Runtime 版本 [{0}] 是不同的。请在所有节点上使用具有相同版本的 Integration Runtime，以实现一致性和最佳性能。
zh_hant: Integration Runtime 版本 [{0}] 不同。請在所有節點上使用相同版本的 Integration Runtime，以取得一致性和最佳效能。

# sql.migration.validate.ir.validation.result.label.shir
source: Integration runtime connectivity
de: Integration Runtime-Konnektivität
es: Conectividad del entorno de ejecución de integración
fr: Connectivité du runtime d’intégration
ja: 統合ランタイムの接続性
ko: 통합 런타임 연결
pt_br: Conectividade de runtime de integração
ru: Возможность подключения среды выполнения интеграции
zh_hans: 集成运行时连接
zh_hant: 整合執行階段連線能力

# sql.migration.invalid.network.share.location
source: Invalid network share location format. Example: {0}
de: Ungültiges Speicherortformat für die Netzwerkfreigabe. Beispiel: {0}
es: Formato de ubicación del recurso compartido de red no válido. Ejemplo: {0}
fr: Format d’emplacement du partage réseau non valide. Exemple : {0}
ja: 無効なネットワーク共有の場所の形式です。例: {0}
ko: 네트워크 공유 위치 형식이 잘못되었습니다. 예: {0}
pt_br: Formato do local de compartilhamento de rede inválido. Exemplo: {0}
ru: Недопустимый формат расположения сетевой папки. Пример: {0}
zh_hans: 网络共享位置格式无效。示例: {0}
zh_hant: 網路共用位置格式無效。範例: {0}

# sql.migration.sku.parameters.scale.factor.invalid
source: Invalid scale factor. Enter a positive integer value.
de: Ungültiger Skalierungsfaktor. Geben Sie einen positiven ganzzahligen Wert ein.
es: Factor de escala no válido. Escriba un valor entero positivo.
fr: Facteur d’échelle non valide. Entrez une valeur entière positive.
ja: 倍率が無効です。正の整数値を入力してください。
ko: 배율이 잘못되었습니다. 양의 정수 값을 입력하세요.
pt_br: Fator de escala inválido. Insira um valor inteiro positivo.
ru: Недопустимый масштаб. Введите положительное целое значение.
zh_hans: 比例因子无效。请输入正整数值。
zh_hant: 縮放比例無效。輸入正整數值。
