Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.restore.backuptype.transactionlog
source: Transaction log
de: Transaktionsprotokoll
es: Registro de transacciones
fr: Journal des transactions
ja: トランザクション ログ
ko: 트랜잭션 로그
pt_br: Log de transações
ru: Журнал транзакций
zh_hans: 事务日志
zh_hant: 交易記錄

# sql.migration.tde.validation.troubleshooting.tips
source: Troubleshooting tips
de: Tipps zur Problembehandlung
es: Consejos para la solución de problemas
fr: Des conseils de dépannage
ja: トラブルシューティングのヒント
ko: 문제 해결 팁
pt_br: Dicas de solução de problemas
ru: Советы по устранению неполадок
zh_hans: 故障排除提示
zh_hant: 疑難排解提示

# sql.migration.dashboard.help.link.mi
source: Tutorial: Migrate to Azure SQL Managed Instance (online)
de: Tutorial: Zu Azure SQL Managed Instance migrieren (online)
es: Tutorial: Migración a Azure SQL Managed Instance (en línea)
fr: Didacticiel : migrer vers Azure SQL Managed Instance (en ligne)
ja: チュートリアル: Azure SQL Managed Instance への移行 (オンライン)
ko: 자습서: Azure SQL Managed Instance(온라인)로 마이그레이션
pt_br: Tutorial: Migrar para Instância Gerenciada de SQL do Azure (online)
ru: Учебник. Миграция в Управляемый экземпляр SQL Azure (по сети)
zh_hans: 教程: 迁移到 Azure SQL 托管实例(联机)
zh_hant: 教學課程: 移轉至 Azure SQL 受控執行個體 (線上)

# sql.migration.dashboard.help.link.sqldb
source: Tutorial: Migrate to SQL Server on Azure SQL Database (offline)
de: Tutorial: Migrieren zu SQL Server auf Azure SQL Database (offline)
es: Tutorial: Migración a SQL Server en Azure SQL Database (sin conexión)
fr: Tutoriel : Migrer vers SQL Server sur Azure SQL Database (hors ligne)
ja: チュートリアル: Azure SQL Database でSQL Serverに移行する (オフライン)
ko: 자습서: Azure SQL Database의 SQL Server로 마이그레이션(오프라인)
pt_br: Tutorial: Migrar para o SQL Server no Banco de Dados SQL do Azure (offline)
ru: Учебник. Миграция в SQL Server в Базе данных SQL Azure (автономная)
zh_hans: 教程: 迁移到 Azure SQL 数据库上的 SQL Server (脱机)
zh_hant: 教學課程: 移轉至 Azure SQL Database 上的 SQL Server (離線)

# sql.migration.dashboard.help.link.vm
source: Tutorial: Migrate to SQL Server on Azure Virtual Machines (online)
de: Tutorial: In Azure Virtual Machines (online) zu SQL Server migrieren
es: Tutorial: Migración a SQL Server en Azure Virtual Machines (en línea)
fr: Didacticiel : migrer vers SQL Server sur des machines virtuelles Azure (en ligne)
ja: チュートリアル: Azure Virtual Machines 上の SQL Server に移行する (オンライン)
ko: 자습서: Azure Virtual Machines에서 SQL Server로 마이그레이션(온라인)
pt_br: Tutorial: Migrar para SQL Server em Máquinas Virtuais do Azure (online)
ru: Учебник. Миграция в SQL Server на Виртуальных машинах Microsoft Azure (по сети)
zh_hans: 教程: 迁移到 Azure 虚拟机上的 SQL Server (联机)
zh_hant: 教學課程: 在 Azure 虛擬機器上移轉至 SQL Server (線上)

# sql.migration.type
source: Type
de: Typ
es: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# sql.migration.type.label
source: Type:
de: Typ:
es: Escriba:
ja: 入力:
ko: 형식:
pt_br: Tipo:
ru: Введите следующее:
zh_hans: 类型:
zh_hant: 類型:

# sql.migration.impact.object.type
source: Type: {0}
de: Typ: {0}
es: Tipo: {0}
ja: 種類: {0}
ko: 형식: {0}
pt_br: Tipo: {0}
ru: Тип: {0}
zh_hans: 类型: {0}
zh_hant: 類型: {0}

# sql.migration.sku.targetStorageConfiguration.disktype.UltraSsd
source: Ultra SSD
de: SSD Ultra
es: SSD Ultra
fr: SSD Ultra
ko: 울트라 SSD
pt_br: SSD Ultra
ru: SSD (цен. категория "Ультра")
zh_hans: 超级 SSD
zh_hant: Ultra 磁碟儲存體

# sql.migration.table.unavailable.count
source: Unavailable for data migration ({0})
de: Nicht verfügbar für Datenmigration ({0})
es: No disponible para la migración de datos ({0})
fr: Non disponible pour la migration des données ({0})
ja: データ移行に使用できません ({0})
ko: 데이터 마이그레이션에 사용할 수 없음({0})
pt_br: Indisponível para migração de dados ({0})
ru: Недоступно для переноса данных ({0})
zh_hans: 不可用于数据迁移({0})
zh_hant: 無法進行資料移轉 ({0})

# sql.migration.restore.backuptype.unknown
source: Unknown
de: Unbekannt
es: Desconocidas
fr: Inconnu
ja: 不明
ko: 알 수 없음
pt_br: Desconhecido
ru: Неизвестно
zh_hans: 未知
zh_hant: 未知

# sql.migration.sku.targetStorageConfiguration.disktype.unknown
source: Unknown disk type
de: Unbekannter Datenträgertyp
es: Tipo de Disco desconocido
fr: Type de disque inconnu
ja: 不明なディスクの種類
ko: 알 수 없는 디스크 유형
pt_br: Tipo de disco desconhecido
ru: Неизвестный тип диска
zh_hans: 未知磁盘类型
zh_hant: 未知的磁碟類型

# sql.migration.field.label.unrestorable.files
source: Unrestorable files
de: Nicht erreichbare Dateien
es: Archivos que no se pueden restaurar
fr: Fichiers non récupérables
ja: 復元不可能なファイル
ko: 복원할 수 없는 파일
pt_br: Arquivos irrecuperáveis
ru: Невосстановимые файлы
zh_hans: 无法还原的文件
zh_hant: 不可還原的檔案

# sql.migration.table.selection.update.button
source: Update
de: Aktualisieren
es: Actualizar
fr: Mettre à jour
ja: 更新
ko: 업데이트
pt_br: Atualizar
ru: Обновить
zh_hans: 更新
zh_hant: 更新

# sql.migration.sku.parameters.update
source: Update
de: Aktualisieren
es: Actualizar
fr: Mettre à jour
ja: 更新
ko: 업데이트
pt_br: Atualizar
ru: Обновить
zh_hans: 更新
zh_hant: 更新

# sql.migration.status.uploadingfullbackup
source: Uploading full backup
de: Vollständige Sicherung wird hochgeladen
es: Cargando copia de seguridad completa
fr: Chargement de la sauvegarde complète
ja: 完全バックアップをアップロードしています
ko: 전체 백업 업로드
pt_br: Carregando backup completo
ru: Выкладывается полная резервная копия
zh_hans: 正在上传完整备份
zh_hant: 正在上傳完整備份

# sql.migration.status.uploadinglogbackup
source: Uploading log backup(s)
de: Protokollsicherung/en wird/werden hochgeladen.
es: Cargando copias de seguridad de registros
fr: Chargement de la ou des sauvegardes de fichier journal
ja: ログ バックアップをアップロードしています
ko: 로그 백업 업로드
pt_br: Carregando backups de log
ru: Выполняется отправка файлов журнала
zh_hans: 上传日志备份
zh_hant: 正在上傳記錄備份

# sql.migration.sqldb.column.usedparallelcopies
source: Used parallel copies
de: Verwendete parallele Kopien
es: Copias en paralelo utilizadas
fr: Copies parallèles utilisées
ja: 並列コピーが使用されました
ko: 사용된 병렬 복사본
pt_br: Cópias paralelas usadas
ru: Использованные параллельные копии
zh_hans: 已用并行副本
zh_hant: 使用的平行複本數

# sql.migration.path.user.account
source: User account
de: Benutzerkonto
es: Cuenta de usuario
fr: Compte utilisateur
ja: ユーザー アカウント
ko: 사용자 계정
pt_br: Conta de usuário
ru: Учетная запись пользователя
zh_hans: 用户帐户
zh_hant: 使用者帳戶

# sql.migration.network.share.user.account.label
source: User account
zh_hans: 用户帐户

# sql.migration.username
source: User name
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome do usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# sql.migration.database.assessment.qds.label
source: Using Query Data Store (this option is available for Microsoft SQL Server 2016 and later)
zh_hans: 使用查询数据存储(此选项适用于 Microsoft SQL Server 2016 及更高版本)

# sql.migration.database.assessment.xevents.label
source: Using extended event session
zh_hans: 使用扩展事件会话

# sql.migration.starting.login
source: Validating and migrating logins are in progress
de: Überprüfen und Migrieren der Anmeldungen ist in Bearbeitung
es: Validación y migración de inicios de sesión en curso
fr: La validation et la migration des connexions sont en cours
ja: ログインの検証と移行が進行中です
ko: 로그인을 확인하고 마이그레이션하는 중입니다.
pt_br: A validação e a migração de logons estão em andamento
ru: Выполняется проверка и миграция учетных данных
zh_hans: 正在验证和迁移登录
zh_hant: 正在驗證及移轉登入

# sql.login.migration.establish.user.mappings
source: Validating and migrating logins completed. Establishing user mappings.
de: Das Überprüfen und Migrieren von Anmeldungen wurde abgeschlossen. Benutzerzuordnungen werden eingerichtet.
es: Se completó la validación y migración de inicios de sesión. Estableciendo asignaciones de usuario.
fr: Validation et migration des identifiants terminées. Établir des mappages d'utilisateurs.
ja: ログインの検証と移行が完了しました。 ユーザー マッピングを確立しています。
ko: 로그인 확인 및 마이그레이션이 완료되었습니다. 사용자 매핑을 설정하는 중입니다.
pt_br: A validação e a migração de logons foram concluídas. Estabelecendo os mapeamentos de usuários.
ru: Проверка и миграция учетных данных завершена. Установка сопоставлений пользователей.
zh_hans: 已完成验证和迁移登录。 正在建立用户映射。
zh_hant: 驗證及移轉登入已完成。 正在建立使用者對應。

# sql.migration.starting.login.failed
source: Validating and migrating logins failed
de: Fehler beim Überprüfen und Migrieren von Anmeldungen.
es: Error al validar y migrar inicios de sesión
fr: Échec de la validation et de la migration des connexions
ja: ログインの検証と移行に失敗しました
ko: 로그인 확인 및 마이그레이션하지 못 함
pt_br: Ocorreu um erro ao validar e migrar os logons
ru: Сбой проверки и миграции учетных данных
zh_hans: 验证和迁移登录失败
zh_hant: 驗證及移轉登入失敗

# sql.migration.tde.validation.title
source: Validation
de: Überprüfung
es: Validación
ja: 検証
ko: 유효성 검사
pt_br: Validação
ru: Проверка
zh_hans: 验证
zh_hant: 驗證

# sql.migration.validate.ir.validation.camceled
source: Validation check canceled
de: Validierungsprüfung abgebrochen
es: Comprobación de validación cancelada
fr: Vérification de validation annulée
ja: 検証チェックが取り消されました
ko: 유효성 검사 취소됨
pt_br: Verificação de validação cancelada
ru: Проверка отменена
zh_hans: 验证检查已取消
zh_hant: 已取消驗證檢查

# sql.migration.validate.ir.validation.result.api.error
source: Validation check error{0}Database:{1}{0}Error: {2} - {3}
de: Validierungsprüfungsfehler{0}Datenbank:{1}{0}Fehler: {2} – {3}
es: Error de comprobación de validación{0}Base de datos:{1}{0}Error: {2} - {3}
fr: Erreur de vérification de validation{0}Base de données :{1}{0}Erreur : {2} – {3}
ja: データベース {0} の検証チェック エラー: {1}{0}エラー: {2} - {3}
ko: 유효성 검사 오류{0}데이터베이스:{1}{0}오류: {2} - {3}
pt_br: Erro de verificação de validação{0}Banco de dados:{1}{0}Erro: {2} - {3}
ru: Ошибка проверки{0}База данных:{1}{0}Ошибка: {2} - {3}
zh_hans: 验证检查错误{0}数据库:{1}{0}错误: {2} - {3}
zh_hant: 驗證檢查錯誤{0}資料庫:{1}{0}錯誤: {2} - {3}

# sql.migration.validate.ir.validation.result.error
source: Validation check error{0}Source database: {1}{0}File share path: {2}{0}Error: {3} - {4}
de: Validierungsprüfungsfehler{0}Quelldatenbank: {1}{0}Dateifreigabepfad: {2}{0}Fehler: {3} – {4}
es: Error de comprobación de validación{0}Base de datos de origen: {1}{0}Ruta de acceso del recurso compartido de archivos: {2}{0}Error: {3} - {4}
fr: Erreur de vérification de validation{0}Base de données source : {1}{0}Chemin d’accès du partage de fichiers : {2}{0}Erreur : {3} – {4}
ja: ソース データベース {0} の検証チェック エラー: {1}{0}ファイル共有パス: {2}{0}エラー: {3} - {4}
ko: 유효성 검사 오류{0}원본 데이터베이스: {1}{0}파일 공유 경로: {2}{0}오류: {3} - {4}
pt_br: Erro de verificação de validação{0}Banco de dados de origem: {1}{0}Caminho de compartilhamento de arquivo: {2}{0}Erro: {3} - {4}
ru: Ошибка проверки{0}База данных-источник: {1}{0}Путь к общей папке: {2}{0}Ошибка: {3} - {4}
zh_hans: 源数据库验证检查错误{0}: {1}{0}文件分享路径: {2}{0}错误: {3} - {4}
zh_hant: 驗證檢查錯誤{0}來源資料庫: {1}{0}檔案共用路徑: {2}{0}錯誤: {3} - {4}

# sql.migration.validate.ir.sqldb.validation.result.error
source: Validation check error{0}Source database: {1}{0}Target database: {2}{0}Error: {3} - {4}
de: Validierungsprüfungsfehler{0}Quelldatenbank: {1}{0}Zieldatenbank: {2}{0}Fehler: {3} – {4}
es: Error de comprobación de validación{0}Base de datos de origen: {1}{0}Datos de destino: {2}{0}Error: {3} - {4}
fr: Erreur de vérification de validation{0}Base de données source : {1}{0}Base de données cible : {2}{0}Erreur : {3} – {4}
ja: ソース データベース {0} の検証チェック エラー: {1}{0}ターゲット データベース: {2}{0} エラー: {3} - {4}
ko: 유효성 검사 오류{0}원본 데이터베이스: {1}{0}대상 데이터베이스: {2}{0}오류: {3} - {4}
pt_br: Erro de verificação de validação{0}Banco de dados de origem: {1}{0}Banco de dados de destino: {2}{0}Erro: {3} - {4}
ru: Ошибка проверки{0}Базы данных-источник: {1}{0}Целевая база данных: {2}{0}Ошибка: {3} - {4}
zh_hans: 源数据库验证检查错误{0}: {1}{0}目标数据库: {2}{0}错误: {3} - {4}
zh_hant: 驗證檢查錯誤{0}來源資料庫: {1}{0}目標資料庫: {2}{0}錯誤: {3} - {4}

# sql.migration.validate.ir.validation.completed
source: Validation completed successfully.
de: Die Validierung wurde erfolgreich abgeschlossen.
es: La validación se completó correctamente.
fr: Validation réussie.
ja: 検証が正常に完了しました。
ko: 유효성 검사가 완료되었습니다.
pt_br: A validação foi concluída com êxito.
ru: Проверка пройдена.
zh_hans: 已成功完成验证。
zh_hant: 已成功完成驗證。

# sql.migration.validation.success
source: Validation completed successfully. Please click Next to proceed with the migration.
de: Die Validierung wurde erfolgreich abgeschlossen. Bitte klicken Sie auf „Weiter“, um mit der Migration fortzufahren.
es: La validación se completó correctamente. Haga clic en Siguiente para continuar con la migración.
fr: La validation s’est terminée correctement. Veuillez cliquer sur Suivant pour poursuivre la migration.
ja: 検証が正常に完了しました。 移行を続行するには、[次へ] をクリックしてください。
ko: 유효성 검사가 완료되었습니다. 마이그레이션을 계속하려면 [다음]을 클릭하세요.
pt_br: Validação concluída com êxito. Clique em Avançar para continuar com a migração.
ru: Проверка успешно завершена. Нажмите кнопку "Далее", чтобы продолжить миграцию.
zh_hans: 验证已成功完成。 请单击“下一步”继续迁移。
zh_hant: 驗證已成功完成。 請按 [下一步] 繼續移轉。

# sql.migration.validate.ir.completed.errors
source: Validation completed with the following error(s):{0}{1}
de: Die Validierung wurde mit folgenden Fehlern abgeschlossen: {0}{1}
es: La validación se completó con los siguientes errores:{0}{1}
fr: La validation s’est terminée avec les erreurs suivantes :{0}{1}
ja: 検証は次のエラーで完了しました: {0}{1}
ko: 다음 오류로 유효성 검사가 완료되었습니다. {0}{1}
pt_br: Validação concluída com o(s) seguinte(s) erros:{0}{1}
ru: Проверка завершена со следующими ошибками:{0}{1}
zh_hans: 验证已完成，出现以下错误:{0}{1}
zh_hant: 驗證完成，錯誤如下:{0}{1}

# sql.migration.validation.not.run
source: Validation has not been run for the current configuration. Please run and validate the migration settings to continue.
de: Die Validierung wurde für die aktuelle Konfiguration nicht ausgeführt. Bitte führen Sie diese aus und validieren Sie die Migrationseinstellungen, um fortzufahren.
es: No se ha ejecutado la validación para la configuración actual. Ejecute y valide la configuración de migración para continuar.
fr: La validation n’a pas été exécutée pour la configuration actuelle. Veuillez exécuter et valider les paramètres de migration pour continuer.
ja: 現在の構成に対して検証が実行されていません。続行するには、移行設定を実行して検証してください。
ko: 현재 구성에 대해 유효성 검사가 실행되지 않았습니다. 계속하려면 마이그레이션 설정을 실행하고 유효성을 검사하세요.
pt_br: A validação não foi executada para a configuração atual. Execute e valide as configurações de migração para continuar.
ru: Проверка текущей конфигурации не выполнялась. Запустите и подтвердите параметры миграции, чтобы продолжить.
zh_hans: 尚未对当前配置运行验证。请运行并验证迁移设置以继续。
zh_hant: 尚未針對目前的設定執行驗證。請執行並驗證移轉設定以繼續。

# sql.migration.validate.ir.status
source: Validation status: {0}
de: Überprüfungsstatus: {0}
es: Estado de la validación: {0}
fr: Statut de validation : {0}
ja: 検証状態: {0}
ko: 유효성 검사 상태: {0}
pt_br: Status de validação: {0}
ru: Состояние проверки: {0}
zh_hans: 验证状态: {0}
zh_hant: 驗證狀態: {0}

# sql.migration.validate.ir.status.errors
source: Validation status: {0}{1}{2}
de: Validierungsstatus: {0}{1}{2}
es: Estado de la validación: {0}{1}{2}
fr: Statut de validation : {0}{1}{2}
ja: 検証状態: {0}{1}{2}
ko: 유효성 검사 상태: {0}{1}{2}
pt_br: Status de validação: {0}{1}{2}
ru: Состояние проверки: {0}{1}{2}
zh_hans: 验证状态: {0}{1}{2}
zh_hant: 驗證狀態: {0}{1}{2}

# sql.migration.validate.ir.results.heading
source: Validation step details
de: Details zum Validierungsschritt
es: Detalles del paso de validación
fr: Détails de l’étape de validation
ja: 検証手順の詳細
ko: 유효성 검사 단계 세부 정보
pt_br: Detalhes da etapa de validação
ru: Сведения о шаге проверки
zh_hans: 验证步骤详细信息
zh_hant: 驗證步驟詳細資料

# sql.migration.validate.ir.column.validation.steps
source: Validation steps
de: Validierungsschritte
es: Pasos de la validación
fr: Étapes de validation
ja: 検証手順
ko: 유효성 검사 단계
pt_br: Etapas de validação
ru: Шаги проверки
zh_hans: 验证步骤
zh_hant: 驗證步驟

# sql.migration.tde.migrate.canceled.errors
source: Validation was canceled with the following error(s):{0}{1}
de: Die Validierung wurde mit dem/den folgenden Fehler(n) abgebrochen: {0}{1}
es: Se canceló la validación con los siguientes errores: {0}{1}
fr: La validation a été annulée avec la ou les erreurs suivantes :{0}{1}
ja: 次のエラーで検証が取り消されました: {0}{1}
ko: 다음 오류로 유효성 검사가 취소되었습니다. {0}{1}
pt_br: A validação foi cancelada com o(s) seguinte(s) erro(s):{0}{1}
ru: Проверка была отменена со следующими ошибками:{0}{1}
zh_hans: 验证已取消，出现以下错误:{0}{1}
zh_hant: 已取消驗證，錯誤如下: {0}{1}

# sql.migration.validation.canceled.errors
source: Validation was canceled with the following error(s):{0}{1}
de: Die Validierung wurde mit dem/den folgenden Fehler(n) abgebrochen: {0}{1}
es: Se canceló la validación con los siguientes errores: {0}{1}
fr: La validation a été annulée avec la ou les erreurs suivantes :{0}{1}
ja: 次のエラーで検証が取り消されました: {0}{1}
ko: 다음 오류로 유효성 검사가 취소되었습니다. {0}{1}
pt_br: A validação foi cancelada com o(s) seguinte(s) erro(s):{0}{1}
ru: Проверка была отменена со следующими ошибками:{0}{1}
zh_hans: 验证已取消，出现以下错误:{0}{1}
zh_hant: 已取消驗證，錯誤如下: {0}{1}

# sql.migration.validation.canceled
source: Validation was canceled. Please run and validate the migration settings to continue.
de: Die Validierung wurde abgebrochen. Bitte führen Sie diese aus und validieren Sie die Migrationseinstellungen, um fortzufahren.
es: Se canceló la validación. Ejecute y valide la configuración de migración para continuar.
fr: La validation a été annulée. Veuillez exécuter et valider les paramètres de migration pour continuer.
ja: 検証が取り消されました。続行するには、移行設定を実行して検証してください。
ko: 유효성 검사가 취소되었습니다. 계속하려면 마이그레이션 설정을 실행하고 유효성을 검사하세요.
pt_br: A validação foi cancelada. Execute e valide as configurações de migração para continuar.
ru: Проверка отменена. Чтобы продолжить, запустите и проверьте параметры миграции.
zh_hans: 验证已取消。请运行并验证迁移设置以继续。
zh_hant: 驗證已取消。請執行並驗證移轉設定以繼續。

# sql.migration.sku.recommended.value
source: Value
de: Wert
es: Valor
fr: Valeur
ja: 値
ko: 값
pt_br: Valor
ru: Значение
zh_hans: 值
zh_hant: 值

# sql.migration.wizard.assessment.summary.and.sku.for.targets.label
source: View assessment summary and SKU recommendations for Azure SQL targets
de: Bewertungszusammenfassung und SKU-Empfehlungen für Azure SQL-Ziele anzeigen
es: Ver el resumen de evaluación y las recomendaciones de SKU para los destinos de Azure SQL
fr: Afficher le résumé de l’évaluation et les recommandations SKU pour les cibles Azure SQL
ja: Azure SQL ターゲットの評価の概要と SKU のレコメンデーションを表示する
ko: Azure SQL 대상에 대한 평가 요약 및 SKU 권장 사항 보기
pt_br: Exibir o resumo da avaliação e as recomendações de SKU para destinos SQL do Azure
ru: Просмотр сводки оценки и рекомендаций по SKU для целевых объектов Azure SQL
zh_hans: 查看 Azure SQL 目标的评估摘要和 SKU 建议
zh_hant: 檢視 Azure SQL 目標的評定摘要和 SKU 建議

# sql.migration.sku.viewDetails
source: View details
de: Details anzeigen
es: Ver detalles
fr: Afficher les détails
ja: 詳細の表示
ko: 세부 정보 보기
pt_br: Exibir os detalhes
ru: Просмотр сведений
zh_hans: 查看详细信息
zh_hant: 檢視詳細資料

# sql.migration.view.select.button.label
source: View/Select
de: Anzeigen/auswählen
es: Ver o seleccionar
fr: Afficher/sélectionner
ja: 表示/選択
ko: 보기/선택
pt_br: Exibir/selecionar
ru: Просмотреть или выбрать
zh_hans: 查看/选择
zh_hant: 檢視/選取

# sql.migration.restore.status.waiting
source: Waiting
de: Warten
es: Esperando
fr: En attente
ja: 待機中
ko: 대기 중
pt_br: Esperando
ru: Ожидание
zh_hans: 正在等待
zh_hant: 正在等候

# sql.migration.wizard.cancel.reason.waiting.for.downtime.window
source: Waiting for downtime window
de: Auf Downtime-Zeitfenster warten
es: Esperando ventana de tiempo de inactividad
fr: En attente de la fenêtre de temps d'arrêt
ko: 가동 중지 시간 기간 대기 중
ru: Ожидание периода простоя
zh_hans: 正在等待故障时间窗口
zh_hant: 正在等候停機視窗

# waitingForService
source: Waiting for {0} component to start.
de: Es wird auf den Start der {0}-Komponente gewartet.
es: Esperando a que se inicie el componente {0}.
fr: En attente du démarrage du composant {0}.
ja: {0} コンポーネントの開始を待機しています。
ko: {0} 구성 요소가 시작하기를 기다리는 중입니다.
pt_br: Aguardando o componente {0} iniciar.
ru: Ожидание запуска компонента {0}.
zh_hans: 正在等待{0}组件启动。
zh_hant: 正在等候 {0} 元件啟動。

# sql.migration.warning
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
ja: 警告
ko: 경고
pt_br: Aviso
ru: Предупреждение
zh_hans: 警告
zh_hant: 警告

# sql.migration.warnings
source: Warnings
de: Warnungen
es: Advertencias
fr: Avertissements
ja: 警告
ko: 경고
pt_br: Avisos
ru: Предупреждения
zh_hans: 警告
zh_hant: 警告

# sql.migration.warnings.count
source: Warnings ({0})
de: Warnungen ({0})
es: Advertencias ({0})
fr: Avertissements ({0})
ja: 警告 ({0})
ko: 경고({0})
pt_br: Avisos ({0})
ru: Предупреждения ({0})
zh_hans: 警告({0})
zh_hant: 警告 ({0})

# sql.migration.warnings.details
source: Warnings details
de: Details zu Warnungen
es: Detalles de las advertencias
fr: Détails des avertissements
ja: 警告の詳細
ko: 경고 세부 정보
pt_br: Detalhes de avisos
ru: Сведения о предупреждениях
zh_hans: 警告详细信息
zh_hant: 警告詳細資料

# sql.migration.assessment.in.progress.content
source: We are assessing the databases in your SQL Server instance {0} to identify the right Azure SQL target. This may take some time.
de: Wir bewerten die Datenbanken in Ihrer SQL Server-Instanz "{0}", um das richtige Azure SQL-Ziel zu identifizieren. Dies kann einige Zeit dauern.
es: Estamos evaluando las bases de datos de la instancia de SQL Server {0} para identificar el destino de Azure SQL correcto. Esta operación puede tardar varios minutos.
fr: Nous évaluons les bases de données de votre instance SQL Server {0} pour identifier la bonne cible Azure SQL. Cela peut prendre un certain temps.
ja: 適切な Azure SQL ターゲットを特定するために、SQL Server インスタンス {0} でデータベースを評価しています。 これには時間がかかることがあります。
ko: 올바른 Azure SQL 대상을 식별하기 위해 SQL Server 인스턴스 {0}의 데이터베이스를 평가하고 있습니다. 평가하는 데 시간이 걸릴 수 있습니다.
pt_br: Estamos avaliando os bancos de dados em sua instância do SQL Server {0} para identificar o alvo SQL do Azure correto. Isto pode levar algum tempo.
ru: Идет оценка баз данных в экземпляре SQL Server {0} для идентификации правильного целевого объекта Azure SQL. Это может занять некоторое время.
zh_hans: 我们正在评估 SQL Server 实例 {0} 中的数据库，以识别正确的 Azure SQL 目标。 这可能需要一些时间才能完成。
zh_hant: 我們正在評估您 SQL Server 執行個體 {0} 中的資料庫，以識別正確的 Azure SQL 目標。 這可能需要一些時間。

# sql.migration.running.multi.steps.heading
source: We are running the following steps:
de: Wir führen die folgenden Schritte aus:
es: Estamos ejecutando los pasos siguientes:
fr: Nous exécutons les étapes suivantes :
ja: 次のステップを実行しています:
ko: 다음 단계를 실행하고 있습니다.
pt_br: Estamos executando as seguintes etapas:
ru: Выполняются следующие шаги:
zh_hans: 我们正在运行以下步骤:
zh_hant: 我們正在執行以下步驟:

# sql.migration.validate.ir.heading
source: We are validating the following:
de: Wir überprüfen Folgendes:
es: Estamos validando lo siguiente:
fr: Nous validons les éléments suivants :
ja: 次を検証しています:
ko: 다음의 유효성을 검사하는 중입니다.
pt_br: Estamos validando o seguinte:
ru: Выполняется проверка следующего:
zh_hans: 我们正在验证以下内容:
zh_hant: 正在驗證下列內容:

# sql.migration.generic.congratulations
source: We have completed the assessment of your SQL Server instance '{0}'.
de: Wir haben die Bewertung Ihrer SQL Server-Instanz "{0}" abgeschlossen.
es: Hemos completado la evaluación de la instancia de SQL Server "{0}".
fr: Nous avons terminé l’évaluation de votre instance de SQL Server «{0}».
ja: SQL Server インスタンス '{0}' の評価が完了しました。
ko: SQL Server 인스턴스 '{0}'에 대한 평가를 완료했습니다.
pt_br: Concluímos a avaliação da sua instância do SQL Server ' {0} '.
ru: Оценка экземпляра SQL Server "{0}" завершена.
zh_hans: 我们已完成对 SQL Server 实例“{0}”的评估。
zh_hant: 我們已對您的 SQL Server 執行個體 '{0}' 完成評定。

# sql.migration.completed.multi.steps.heading
source: We ran the following steps:
de: Wir haben die folgenden Schritte ausgeführt:
es: Hemos ejecutado los pasos siguientes:
fr: Nous avons exécuté les étapes suivantes :
ja: 次のステップを実行しました:
ko: 다음 단계를 실행했습니다:
pt_br: Executamos as seguintes etapas:
ru: Были выполнены следующие шаги:
zh_hans: 我们运行了以下步骤:
zh_hant: 我們已執行以下步驟:
