Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.newSupportRequest
source: New support request
de: Neue Supportanfrage
es: Nueva solicitud de soporte técnico
fr: Nouvelle demande de support
ja: 新しいサポート リクエスト
ko: 새 지원 요청
pt_br: Nova solicitação de suporte
ru: Новый запрос на поддержку
zh_hans: 新建支持请求
zh_hant: 新增支援要求

# sql.migration.saved.assessment.next
source: Next
de: Weiter
es: Siguiente
fr: Suivant
ja: 次へ
ko: 다음
pt_br: Próximo
ru: Далее
zh_hans: 下一步
zh_hant: 下一步

# sql.migration.sku.azureConfiguration.nextGenGeneralPurpose
source: Next-gen General Purpose
zh_hans: 下一代常规用途

# sql.migration.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# sql.migration.no.sqldatabaseserver.found
source: No Azure SQL database servers found.
de: Es wurden keine Azure SQL-Datenbank-Server gefunden.
es: No se encontraron servidores de base de datos de Azure SQL.
fr: Aucun serveur de base de données Azure SQL trouvé.
ja: Azure SQL データベース サーバーが見つかりません。
ko: Azure SQL 데이터베이스 서버를 찾을 수 없습니다.
pt_br: Nenhum servidor de banco de dados SQL do Azure foi encontrado.
ru: Серверы баз данных SQL Azure не найдены.
zh_hans: 找不到 Azure SQL 数据库服务器。
zh_hant: 找不到 Azure SQL Database 伺服器。

# sql.migration.no.sqldatabase.found
source: No Azure SQL databases found.
de: Es wurden keine Azure SQL-Datenbanken gefunden.
es: No se encontraron bases de datos Azure SQL.
fr: Aucune base de données Azure SQL trouvée.
ja: Azure SQL データベースが見つかりません。
ko: Azure SQL 데이터베이스를 찾을 수 없습니다.
pt_br: Nenhum banco de dados SQL do Azure foi encontrado.
ru: Базы данных SQL Azure не найдены.
zh_hans: 找不到 Azure SQL 数据库。
zh_hant: 找不到 Azure SQL 資料庫。

# sql.migration.ir.page.sql.migration.service.not.found
source: No Database Migration Service found. Create a new one.
de: Es wurde kein Database Migration Service gefunden. Erstellen Sie einen neuen.
es: No se encontró ningún Database Migration Service. Cree uno nuevo
fr: Aucun Database Migration Service trouvé. Créez-en un.
ja: Database Migration Service が見つかりません。新しいのを作成します。
ko: 데이터베이스 마이그레이션 서비스를 찾을 수 없습니다. 새로 만드세요.
pt_br: Nenhum Serviço de Migração de Banco de Dados encontrado. Criar um novo.
ru: Служба Database Migration Service не найдена. Создайте новую службу.
zh_hans: 找不到数据库迁移服务。请新建一个。
zh_hant: 找不到任何資料庫移轉服務。建立新的。

# sql.migration.service.not.found
source: No Migration Services found. To continue, create a new one.
de: Es wurden keine Migrationsdienste gefunden. Um fortzufahren, erstellen Sie einen Neuen.
es: No se encontraron servicios de migración. Para continuar, cree uno nuevo.
fr: Aucun service de migration trouvé. Pour continuer, créez-en un.
ja: Migration Services が見つかりません。新しく作成してください。
ko: 마이그레이션 서비스를 찾을 수 없습니다. 계속하려면 새 항목을 만드세요.
pt_br: Nenhum Serviço de Migração encontrado. Para continuar, crie um novo.
ru: Службы миграции не найдены. Чтобы продолжить, создайте новую.
zh_hans: 未找到迁移服务。若要继续，请新建一个。
zh_hant: 找不到任何移轉服務。若要繼續，請建立一個新的。

# sql.migration.wizard.sku.error.noRecommendation.reason
source: No SKU recommendations were generated, as there were no SKUs which could satisfy the performance characteristics of your source. Try selecting a different target platform, adjusting recommendation parameters, selecting a different set of databases to assess, or changing the recommendation model.
de: Es wurden keine SKU-Empfehlungen generiert, da keine SKUs vorhanden waren, die die Leistungseigenschaften Ihrer Quelle erfüllen konnten. Wählen Sie eine andere Zielplattform aus, passen Sie die Empfehlungsparameter an, wählen Sie eine andere Gruppe zu bewertender Datenbanken aus, oder ändern Sie das Empfehlungsmodell.
es: No se generaron recomendaciones de SKU, ya que no había SKU que pudieran satisfacer las características de rendimiento del origen. Intente seleccionar una plataforma de destino diferente, ajustar los parámetros de recomendación, seleccionar un conjunto diferente de bases de datos para evaluar o cambiar el modelo de recomendación.
fr: Aucune recommandation de référence SKU n’a été générée, car il n’y avait aucune référence SKU pouvant satisfaire les caractéristiques de performances de votre source. Essayez de sélectionner une autre plateforme cible, d’ajuster les paramètres de recommandation, de sélectionner un autre ensemble de bases de données à évaluer ou de modifier le modèle de recommandation.
ja: ソースのパフォーマンス特性を満たす SKU がないため、SKU のレコメンデーションは生成されませんでした。別のターゲット プラットフォームの選択、推奨事項パラメーターの調整、評価するデータベースの別のセットの選択、または推奨事項モデルの変更を試してください。
ko: 원본의 성능 특성을 만족할 SKU가 없어 SKU 권장 사항이 생성되지 않았습니다. 다른 대상 플랫폼을 선택하거나, 권장 사항 매개 변수를 조정하거나, 평가할 다른 데이터베이스 집합을 선택하거나 권장 모델을 변경해 보세요.
pt_br: Nenhuma recomendação de SKU foi gerada, pois não havia SKUs que pudessem satisfazer as características de desempenho de sua fonte. Tente selecionar uma plataforma de destino diferente, ajustando os parâmetros de recomendação, selecionando um conjunto diferente de bancos de dados para avaliar, ou mudando o modelo de recomendação.
ru: Рекомендации по SKU не созданы, так как нет номеров SKU, которые могли бы удовлетворять характеристикам производительности источника. Попробуйте выбрать другую целевую платформу, изменить параметры рекомендаций, выбрать другой набор баз данных для оценки или изменить модель рекомендаций.
zh_hans: 未生成 SKU 建议，因为没有可以满足源性能特征的 SKU。尝试选择其他目标平台、调整建议参数，选择一组不同的数据库来进行评估或改变建议模型。
zh_hant: 未產生 SKU 建議，因為沒有可滿足您來源效能特性的 SKU。請嘗試選取不同的目標平台、調整建議參數、選取不同的資料庫集進行評估或變更建議模型。

# sql.migration.empty.table.text
source: No backup files
de: Keine Sicherungsdateien
es: No hay archivos de copia de seguridad
fr: Aucun fichier de sauvegarde
ja: バックアップ ファイルなし
ko: 백업 파일 없음
pt_br: Nenhum arquivos de backup encontrado
ru: Файлы резервного копирования отсутствуют
zh_hans: 无备份文件
zh_hant: 無備份檔案

# sql.migration.no.blobContainers.found
source: No blob containers found.
de: Es wurden keine Blobcontainer gefunden.
es: No se encontraron contenedores de blobs.
fr: Aucun conteneur de blobs détecté.
ja: BLOB コンテナーが見つかりません。
ko: Blob 컨테이너를 찾을 수 없습니다.
pt_br: Nenhum contêiner de blob encontrado.
ru: Контейнеры BLOB-объектов не найдены.
zh_hans: 找不到任何 blob 容器。
zh_hant: 找不到任何 Blob 容器。

# sql.migration.no.blobFiles.found
source: No blob files found.
de: Es wurden keine BLOB-Dateien gefunden.
es: No se ha encontrado ningún archivo de blob.
fr: Aucun objet blob trouvé.
ja: BLOB ファイルが見つかりません。
ko: BLOB 파일을 찾을 수 없습니다.
pt_br: Nenhum arquivo blob encontrado.
ru: Файлы больших двоичных объектов не найдены.
zh_hans: 未找到 Blob 文件。
zh_hant: 找不到任何 BLOb 檔案。

# sql.migration.no.blobFolders.found
source: No blob folders found.
de: Es wurden keine Blobordner gefunden.
es: No se encontraron carpetas de blobs.
fr: Dossiers d’objets blob introuvables.
ja: BLOB フォルダーが見つかりません。
ko: BLOb 폴더를 찾을 수 없습니다.
pt_br: Nenhuma pasta de blob encontrada.
ru: Папки BLOB-объектов не найдены.
zh_hans: 找不到 Blob 文件夹。
zh_hant: 找不到 Blob 資料夾。

# sql.migration.tde.msg.empty
source: No encrypted database selected.
de: Keine verschlüsselte Datenbank ausgewählt.
es: No se ha seleccionado ninguna base de datos cifrada.
fr: Base de données chiffrée sélectionnée.
ja: 暗号化されたデータベースは選択されていません。
ko: 암호화된 데이터베이스를 선택하지 않았습니다.
pt_br: Nenhum banco de dados criptografado selecionado.
ru: База данных с шифрованием не выбрана.
zh_hans: 未选择加密数据库。
zh_hant: 未選取加密資料庫。

# sql.migration.no.fileShares.found
source: No file shares found.
de: Es wurden keine Dateifreigaben gefunden.
es: No se encontraron recursos compartidos de archivos.
fr: Aucun partage de fichiers trouvé.
ja: ファイル共有が見つかりません。
ko: 파일 공유를 찾을 수 없습니다.
pt_br: Nenhum compartilhamento de arquivos encontrado.
ru: Файловые ресурсы не найдены.
zh_hans: 找不到文件共享。
zh_hant: 找不到任何檔案共用。

# sql.migration.no.issues.sqldb
source: No issues found for migrating to Azure SQL Database.
de: Für die Migration zu Azure SQL-Datenbank wurden keine Probleme gefunden.
es: No se encontraron problemas para migrar a Azure SQL Database.
fr: Aucun problème trouvé pour la migration vers Azure SQL Database.
ja: Azure SQL Database への移行に関する問題は見つかりませんでした。
ko: Azure SQL 데이터베이스로 마이그레이션하는 데 문제가 없습니다.
pt_br: Nenhum problema encontrado para migrar para o Banco de Dados SQL do Azure.
ru: Не обнаружены проблемы для миграции на Базы данных SQL Azure.
zh_hans: 未发现有关迁移到 Azure SQL 数据库的任何问题。
zh_hant: 找不到移轉到 Azure SQL Database 的問題。

# sql.migration.no.issues.mi
source: No issues found for migrating to Azure SQL Managed Instance.
de: Für die Migration zu Azure SQL Managed Instance wurden keine Probleme gefunden.
es: No se encontraron problemas para migrar a Azure SQL Managed Instance.
fr: Aucun problème trouvé pour la migration vers Azure SQL Managed Instance.
ja: Azure SQL Managed Instance への移行に関する問題は見つかりませんでした。
ko: Azure SQL Managed Instance로 마이그레이션하는 데 문제가 없습니다.
pt_br: Nenhum problema encontrado para migrar para a Instância Gerenciada de SQL do Azure.
ru: Не обнаружены проблемы для миграции на Управляемый экземпляр SQL Azure.
zh_hans: 未发现有关迁移到 Azure SQL 托管实例的任何问题。
zh_hant: 找不到移轉到 Azure SQL 受控執行個體的問題。

# sql.migration.no.issues.vm
source: No issues found for migrating to SQL Server on Azure Virtual Machine.
de: Für die Migration zu SQL Server auf dem virtuellen Azure-Computer wurden keine Probleme gefunden.
es: No se encontraron problemas para migrar a SQL Server en la máquina virtual de Azure
fr: Aucun problème trouvé pour la migration vers SQL Server sur une machine virtuelle Azure.
ja: Azure Virtual Machine 上で SQL Server への移行に関する問題は見つかりませんでした。
ko: Azure Virtual Machine에서 SQL Server로 마이그레이션하는 데 문제가 없습니다.
pt_br: Nenhum problema encontrado para a migração para o SQL Server na Máquina Virtual do Azure.
ru: Не найдены проблемы миграции в SQL Server на виртуальной машине Azure.
zh_hans: 在 Azure 虚拟机上未发现迁移到 SQL Server 的问题。
zh_hant: 找不到在 Azure 虛擬機器上移轉到 SQL Server 的問題。

# sql.migration.no.location.found
source: No locations found.
de: Keine Speicherorte gefunden.
es: No se han encontrado ubicaciones.
fr: Emplacements introuvables.
ja: 場所が見つかりません。
ko: 위치를 찾을 수 없음.
pt_br: Nenhum local encontrado.
ru: Расположения не найдены.
zh_hans: 找不到位置。
zh_hant: 找不到任何位置。

# sql.migration.no.managedInstance.found
source: No managed instances found.
de: Keine verwalteten Instanzen gefunden.
es: No se han encontrado instancias administradas.
fr: Aucune instance managée trouvée.
ja: マネージド インスタンスが見つかりません。
ko: 관리되는 인스턴스를 찾을 수 없음.
pt_br: Nenhuma instância gerenciada encontrada.
ru: Управляемые экземпляры не найдены.
zh_hans: 找不到托管实例。
zh_hant: 找不到任何受控執行個體。

# sql.ir.no.node.found
source: No node found
zh_hans: 未找到节点

# sql.migration.no.pending.backups
source: No pending backups. Click refresh to check current status.
de: Keine ausstehenden Sicherungen. Klicken Sie auf "Aktualisieren", um den aktuellen Status zu prüfen.
es: No hay copias de seguridad pendientes. Haga clic en actualizar para comprobar el estado actual.
fr: Aucune sauvegarde en attente. Cliquez sur Actualiser pour vérifier l’état actuel.
ja: 保留中のバックアップはありません。[最新の情報に更新] をクリックして、現在の状態を確認します。
ko: 보류 중인 백업이 없습니다. 새로 고침을 클릭하여 현재 상태를 확인합니다.
pt_br: Nenhum backup pendente. Clique em Atualizar para verificar o status atual.
ru: Ожидающие резервные копии отсутствуют. Нажмите кнопку Обновить, чтобы проверить текущее состояние.
zh_hans: 没有挂起的备份。请单击“刷新”以检查当前状态。
zh_hant: 沒有擱置的備份。按一下 [重新整理] 以檢查目前的狀態。

# sql.migration.cancel.feedback.no.reason.selected
source: No reason selected
de: Kein Grund ausgewählt
es: No se seleccionó ningún motivo
fr: Aucune raison sélectionnée
ko: 이유 선택 안 함
ru: Причина не выбрана
zh_hans: 未选择原因
zh_hant: 未選取原因

# sql.migration.wizard.sku.error.noRecommendation
source: No recommendation available
de: Keine Empfehlung verfügbar
es: No hay ninguna recomendación disponible.
fr: Aucune recommandation disponible
ja: 利用可能なレコメンデーションはありません
ko: 사용할 수 있는 권장 사항 없음
pt_br: Nenhuma recomendação disponível
ru: Нет доступных рекомендаций
zh_hans: 无可用建议
zh_hant: 沒有可用的建議

# sql.migration.resource.group.not.found
source: No resource groups found.
de: Keine Ressourcengruppen gefunden.
es: No se han encontrado grupos de recursos.
fr: Aucun groupe de ressources trouvé.
ja: リソース グループが見つかりません。
ko: 리소스 그룹을 찾을 수 없습니다.
pt_br: Nenhum grupo de recursos encontrado.
ru: Группы ресурсов не найдены.
zh_hans: 未找到资源组。
zh_hant: 找不到任何資源群組。

# sql.migration.schema.full.missing
source: No schema was found on target. This option must be selected to migrate this database. No tables selected will migrate missing schema only.
de: Am Ziel wurde kein Schema gefunden. Diese Option muss ausgewählt werden, um diese Datenbank zu migrieren. Wenn Sie keine Tabellen auswählen, wird nur das fehlende Schema migriert.
es: No se encontró ningún esquema en el destino. Esta opción debe estar seleccionada para migrar esta base de datos. Ninguna de las tablas seleccionadas migrará solo el esquema que falta.
fr: Désolé, aucun schéma n’a été trouvé dans la cible. Cette option doit être sélectionnée pour migrer cette base de données. Désolé, aucune table sélectionnée ne migre le schéma manquant uniquement.
ja: ターゲットにスキーマが見つかりませんでした。このデータベースを移行するには、このオプションを選択する必要があります。テーブルが選択されていないと、不足しているスキーマのみが移行されます。
ko: 대상에서 스키마를 찾을 수 없습니다. 이 데이터베이스를 마이그레이션하려면 이 옵션을 선택해야 합니다. 선택한 테이블이 없으면 누락된 스키마만 마이그레이션됩니다.
pt_br: Nenhum esquema foi encontrado no destino. Essa opção deve ser selecionada para migrar esse banco de dados. Nenhuma tabela selecionada migrará apenas o esquema ausente.
ru: Не найдена схема в целевом объекте. Для миграции этой базы данных необходимо выбрать этот параметр. Ни одна из выбранных таблиц не перенесет только отсутствующую схему.
zh_hans: 在目标上找不到架构。必须选择此选项才能迁移此数据库。不选择任何表将仅迁移缺少的架构。
zh_hant: 在目標上找不到結構描述。必須選取此選項，才能移轉此資料庫。未選取資料表將只會移轉遺失的結構描述。

# sql.migration.no.storageAccount.found
source: No storage accounts found.
de: Keine Speicherkonten gefunden.
es: No se ha encontrado ninguna cuenta de almacenamiento.
fr: Aucun compte de stockage trouvé.
ja: ストレージ アカウントが見つかりません。
ko: 스토리지 계정을 찾을 수 없음.
pt_br: Nenhuma conta de armazenamento encontrada.
ru: Учетные записи хранения не найдены.
zh_hans: 找不到存储帐户。
zh_hant: 找不到任何儲存體帳戶。

# sql.migration.no.subscription.found
source: No subscriptions found.
de: Keine Abonnements gefunden.
es: No se han encontrado suscripciones.
fr: Aucun abonnement trouvé.
ja: サブスクリプションが見つかりません。
ko: 구독을 찾을 수 없음.
pt_br: Nenhuma assinatura encontrada.
ru: Подписки не найдены.
zh_hans: 找不到订阅。
zh_hant: 找不到任何訂用帳戶。

# sql.migration.select.target.label
source: No target selected. Select target to view the assessment summary.
de: Kein Ziel ausgewählt. Wählen Sie ein Ziel aus, um die Bewertungszusammenfassung anzuzeigen.
es: No se seleccionó ningún destino. Seleccione el destino para ver el resumen de la evaluación.
fr: Aucune cible sélectionnée. Sélectionnez la cible pour afficher le résumé de l’évaluation.
ja: ターゲットが選択されていません。評価の概要を表示するには、ターゲットを選択します。
ko: 대상을 선택하지 않았습니다. 평가 요약을 보려면 대상을 선택하세요.
pt_br: Nenhum alvo selecionado. Selecione o alvo para exibir o resumo da avaliação.
ru: Цель не выбрана. Выберите целевой объект, чтобы просмотреть сводку оценки.
zh_hans: 未选择目标。选择目标以查看评估摘要。
zh_hant: 未選取目標。選取目標以檢視評定摘要。

# sql.migration.no.virtualMachine.found
source: No virtual machines found.
de: Keine VMs gefunden.
es: No se encontró ninguna máquina virtual.
fr: Aucune machine virtuelle trouvée.
ja: 仮想マシンが見つかりません。
ko: 가상 머신이 없습니다.
pt_br: Nenhuma máquina virtual encontrada.
ru: Виртуальные машины не найдены
zh_hans: 找不到任何虚拟机。
zh_hant: 找不到任何虛擬機器。

# sql.ir.node.name
source: Node name
zh_hans: 节点名称

# sql.migration.restore.status.none
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
ja: なし
ko: 없음
pt_br: Nenhum
ru: Нет
zh_hans: 无
zh_hant: 無

# sql.migration.restore.backupset.status.none
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
ja: なし
ko: 없음
pt_br: Nenhum
ru: Нет
zh_hans: 无
zh_hant: 無

# sql.migration.parallel.copy.type.none
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
ja: なし
ko: 없음
pt_br: Nenhum
ru: Нет
zh_hans: 无
zh_hant: 無

# sql.migration.sku.targetStorageConfiguration.caching.none
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
ja: なし
ko: 없음
pt_br: Nenhum
ru: Нет
zh_hans: 无
zh_hant: 無

# sql.migration.sku.targetStorageConfiguration.caching.na
source: Not applicable
de: Nicht zutreffend
es: No aplicable
fr: Non applicable
ja: 適用なし
ko: 해당 사항 없음
pt_br: Não aplicável
ru: Неприменимо
zh_hans: 不适用
zh_hant: 不適用

# sql.migration.not.exist.in.target.table.name.column
source: Not exist on target
de: Fehlt in Ziel
es: No existe en el destino
fr: N’existe pas sur la cible
ja: ターゲットに存在しません
ko: 대상에 없음
pt_br: Não existe no destino
ru: Не существует в целевом объекте
zh_hans: 目标上不存在
zh_hant: 不存在於目標上

# sql.migration.not.ready
source: Not ready
de: Nicht bereit
es: No está listo
fr: Pas prêt
ja: 準備ができていません
ko: 준비되지 않음
pt_br: Não está pronto
ru: Не готово
zh_hans: 未就绪
zh_hant: 未就緒

# sql.migration.restore.status.not.started
source: Not started
de: Nicht gestartet
es: No iniciado
fr: Non démarré
ja: 未開始
ko: 시작되지 않음
pt_br: Não foi iniciado
ru: Не запущено
zh_hans: 未启动
zh_hant: 未啟動

# sql.login.migration.steps.not.started
source: Not started
de: Nicht gestartet
es: No iniciado
fr: Non démarré
ja: 未開始
ko: 시작되지 않음
pt_br: Não iniciado
ru: Не запущено
zh_hans: 未启动
zh_hant: 未啟動

# sql.ir.recommended.link
source: Note: Refer Self-hosted IR recommendations
zh_hans: 注意: 请参阅自承载 IR 建议

# sql.migration.backup.file.number.of.stripes
source: Number of stripes
de: Anzahl von Bereichsstreifen
es: Número de franjas
fr: Nombre de franges
ja: ストライプの数
ko: 스트라이프 수
pt_br: Número de faixas
ru: Число полос
zh_hans: 条带数
zh_hant: 條紋數

# sql.migration.offline.caps
source: OFFLINE
es: DESCONECTADO
ko: 오프라인
zh_hans: 脱机

# sql.migration.ok
source: OK
es: Aceptar
ko: 확인
ru: ОК
zh_hans: 确定
zh_hant: 確定

# sql.migration.object.details
source: Object details
de: Objektdetails
es: Detalles del objeto
fr: Détails de l'objet
ja: オブジェクトの詳細
ko: 개체 세부 정보
pt_br: Detalhes do objeto
ru: Сведения об объекте
zh_hans: 对象详细信息
zh_hant: 物件詳細資料

# sql.migration.schema.objects.collection
source: Objects collected
de: Gesammelte Objekte
es: Objetos recopilados
fr: Objets collectés
ja: 収集されたオブジェクト
ko: 수집된 개체
pt_br: Objetos coletados
ru: Собранные объекты
zh_hans: 对象已收集
zh_hant: 物件已收集

# sql.migration.offline
source: Offline
es: Sin conexión
fr: Hors connexion
ja: オフライン
ko: 오프라인
ru: Вне сети
zh_hans: 脱机
zh_hant: 離線

# sql.migration.database.migration.mode.offline.label
source: Offline migration
es: Migración sin conexión
fr: Migration hors connexion
ja: オフライン移行
ko: 오프라인 마이그레이션
pt_br: Migração offline
ru: Автономная миграция
zh_hans: 脱机迁移
zh_hant: 離線移轉

# sql.ir.powershellscript.definition
source: Once executed in powershell, the unique script shown below will download, and install the self-hosted integration runtime and register it with the Azure Database Migration Service. You will need to have PowerShell installed on the target machine.
zh_hans: 在 PowerShell 中执行后，下面显示的唯一脚本将下载并安装自承载集成运行时，并向 Azure 数据库迁移服务注册它。需要在目标计算机上安装 PowerShell。

# sql.migration.online
source: Online
es: En línea
fr: En ligne
ja: オンライン
ko: 온라인
ru: В Интернете
zh_hans: 联机
zh_hant: 上線

# sql.migration.database.migration.mode.online.label
source: Online migration
es: Migración en línea
fr: Migration en ligne
ja: オンライン移行
ko: 온라인 마이그레이션
pt_br: Migração online
ru: Миграция по сети
zh_hans: 联机迁移
zh_hant: 線上移轉

# sql.migration.open
source: Open
de: Öffnen
es: Abrir
fr: Ouvrir
ja: 開く
ko: 열기
pt_br: Abrir
ru: Открыть
zh_hans: 打开
zh_hant: 開啟

# sql.migration.sqldb.column.parallelcopytype
source: Parallel copy type
de: Typ des parallelen Kopierens
es: Tipo de copia en paralelo
fr: Type de copie parallèle
ja: 並列コピー タイプ
ko: 병렬 복사 형식
pt_br: Tipo de cópia paralela
ru: Тип параллельного копирования
zh_hans: 并行复制类型
zh_hant: 平行複製類型

# sql.migration.restore.backuptype.partial
source: Partial
de: Partiell
es: Parcial
fr: Partiel
ja: 部分的
ko: 부분
pt_br: Parcial
ru: Частично
zh_hans: 分部
zh_hant: 部分

# sql.migration.network.share.password.label
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# sql.migration.state.pending
source: Pending
de: Ausstehend
es: Pendiente
fr: En attente
ja: 保留中
ko: 보류 중
pt_br: Pendente
ru: Ожидание
zh_hans: 挂起
zh_hant: 擱置中

# sql.migration.tde.validation.status.pending
source: Pending
de: Ausstehend
es: Pendiente
fr: En attente
ja: 保留中
ko: 보류 중
pt_br: Pendente
ru: Ожидание
zh_hans: 挂起
zh_hant: 擱置中

# sql.migration.validation.state.pending
source: Pending
de: Ausstehend
es: Pendiente
fr: En attente
ja: 保留中
ko: 보류 중
pt_br: Pendente
ru: Ожидание
zh_hans: 挂起
zh_hant: 擱置

# sql.migration.field.label.pending.differential.backups
source: Pending differential backups
de: Ausstehende differenzielle Sicherungen
es: Copias de seguridad diferenciales pendientes
fr: Sauvegardes différentielles en attente
ja: 保留中の差分バックアップ
ko: 보류 중인 차등 백업
pt_br: Backups diferenciais pendentes
ru: Ожидающие разностные резервные копии
zh_hans: 挂起的差异备份
zh_hant: 擱置的差異備份

# sql.migration.sku.parameters.percentage.utilization
source: Percentage utilization
de: Prozentuale Auslastung
es: Porcentaje de uso
fr: Utilisation en pourcentage
ja: 使用率
ko: 사용률(%)
pt_br: Utilização percentual
ru: Процент использования
zh_hans: 利用率百分比
zh_hant: 百分比使用率

# sql.migration.sku.parameters.percentage.utilization.tooltip
source: Percentile of data points to be used during aggregation of the performance data.
de: Perzentil von Datenpunkten, die während der Aggregation der Leistungsdaten verwendet werden sollen.
es: Percentil de puntos de datos que se usarán durante la agregación de los datos de rendimiento.
fr: Centile des points de données à utiliser lors de l’agrégation des données de performances.
ja: パフォーマンス データの集計中に使用されるデータ ポイントのパーセンタイル。
ko: 성능 데이터를 집계하는 동안 사용할 데이터 요소의 백분위수입니다.
pt_br: Percentual de pontos de dados a serem usados durante a agregação dos dados de desempenho.
ru: Процентиль точек данных, используемых при агрегации данных производительности.
zh_hans: 在聚合性能数据期间要使用的数据点的百分位数。
zh_hant: 在彙總效能資料期間要使用的資料點百分位數。

# sql.migration.cutover.help.main
source: Perform the following steps before you complete cutover.
de: Führen Sie die folgenden Schritte aus, bevor Sie den Cutover abschließen.
es: Realice los pasos siguientes antes de completar la transición.
fr: Effectuez les étapes suivantes avant de terminer le basculement.
ja: 一括移行を完了する前に、次の手順を実行してください。
ko: 컷오버를 완료하기 전에 다음 단계를 수행합니다.
pt_br: Execute as etapas a seguir antes de concluir a substituição.
ru: Перед выполнением прямой миграции сделайте следующее.
zh_hans: 在完成直接转换之前，请执行以下步骤。
zh_hant: 完成完全移轉前，請執行下列步驟。

# sql.migration.parallel.copy.type.physical
source: Physical partitions
de: Physische Partitionen
es: Particiones físicas
fr: Partitions physiques
ja: 物理パーティション
ko: 실제 파티션
pt_br: Partições físicas
ru: Физические разделы
zh_hans: 物理分区
zh_hant: 實體分割區

# sql.migration.sku.targetStorageConfiguration.ephemeralTempdb
source: Place tempdb on the local ephemeral SSD (default D:\) drive
de: Platzieren von tempdb auf dem lokalen kurzlebigen SSD-Laufwerk (Standard-D:\)
es: Coloque tempdb en la unidad SSD efímera local (predeterminada D:\)
fr: Placez tempdb sur le lecteur SSD éphémère local (par défaut D:\)
ja: ローカル エフェメラル SSD (既定の D:\) ドライブに tempdb を配置する
ko: tempdb를 로컬 임시 SSD(기본값 D:\) 드라이브에 배치합니다.
pt_br: Coloque tempdb na unidade SSD efêmera local (padrão D:)
ru: Разместить tempdb на локальном временном диске SSD (по умолчанию D:\)
zh_hans: 将 tempdb 置于本地临时 SSD (默认为 D: \)驱动器上
zh_hant: 將 tempdb 放在本機暫時 SSD (預設 D:\) 磁碟機上
