Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.azurecore.*.xlf
Languages: de, ja, pt_br, ru, zh_hans, zh_hant

# azure.accounts.getResourceGroups.queryError
source: Error fetching resource groups for account {0} ({1}) subscription {2} ({3}) tenant {4} : {5}
de: Fehler beim Abrufen von Ressourcengruppen für das Konto "{0}" ({1}), Abonnement "{2}" ({3}), Mandant "{4}": {5}
ja: アカウント {0} ({1}) サブスクリプション {2} ({3}) テナント {4} のリソース グループの取り込みでエラーが発生しました: {5}
pt_br: Erro ao buscar os grupos de recursos para a conta {0} ({1}), assinatura {2} ({3}) e locatário {4} : {5}
ru: Ошибка при получении групп ресурсов для учетной записи {0} ({1}) в подписке {2} ({3}) и клиенте {4}: {5}
zh_hans: 为帐户 {0} ({1})订阅 {2} ({3})租户 {4} 提取资源组时出错: {5}
zh_hant: 擷取帳戶 {0} ({1}) 訂閱 {2} ({3}) 租用戶 {4} 的資源群組時發生錯誤: {5}

# azure.accounts.getSelectedSubscriptions.queryError
source: Error fetching subscriptions for account {0} : {1}
de: Fehler beim Abrufen von Abonnements für das Konto "{0}": {1}
ja: アカウント {0} のサブスクリプションの取り込みでエラーが発生しました: {1}
pt_br: Erro ao buscar as assinaturas para a conta {0} : {1}
ru: Ошибка при получении подписок для учетной записи {0}: {1}
zh_hans: 为帐户 {0} 提取订阅时出错: {1}
zh_hant: 擷取帳戶 {0} 的訂閱時發生錯誤: {1}

# azure.accounts.getSubscriptions.queryError
source: Error fetching subscriptions for account {0} tenant {1} : {2}
de: Fehler beim Abrufen von Abonnements für das Konto "{0}", Mandant "{1}": {2}
ja: アカウント {0} テナント {1} のサブスクリプションの取り込みでエラーが発生しました: {2}
pt_br: Erro ao buscar as assinaturas para a conta {0}, locatário {1} : {2}
ru: Ошибка при получении подписок для учетной записи {0} в клиенте {1}: {2}
zh_hans: 为帐户 {0} 租户 {1} 提取订阅时出错: {2}
zh_hant: 擷取帳戶 {0} 租用戶 {1} 的訂閱時發生錯誤: {2}

# azure.resource.error
source: Error: {0}
de: Fehler: {0}
ja: エラー: {0}
pt_br: Erro: {0}
ru: Ошибка: {0}
zh_hans: 错误: {0}
zh_hant: 錯誤: {0}

# azure.accounts.runResourceQuery.errors.invalidQuery
source: Invalid query
de: Ungültige Abfrage
ja: 無効なクエリ
pt_br: Consulta inválida
ru: Недопустимый запрос
zh_hans: 查询无效
zh_hant: 查詢無效

# azurecore.australiacentral
source: Australia Central
de: Australien, Mitte
ja: オーストラリア中部
pt_br: Austrália Central
ru: Центральная Австралия
zh_hans: 澳大利亚中部
zh_hant: 澳洲中部

# azurecore.australiacentral2
source: Australia Central 2
de: Australien, Mitte 2
ja: オーストラリア中部 2
pt_br: Austrália Central 2
ru: Центральная Австралия — 2
zh_hans: 澳大利亚中部 2
zh_hant: 澳洲中部 2

# azurecore.australiaeast
source: Australia East
de: Australien, Osten
ja: オーストラリア東部
pt_br: Leste da Austrália
ru: Восточная Австралия
zh_hans: 澳大利亚东部
zh_hant: 澳洲東部

# azurecore.australiasoutheast
source: Australia Southeast
de: Australien, Südosten
ja: オーストラリア南東部
pt_br: Sudeste da Austrália
ru: Юго-Восточная Австралия
zh_hans: 澳大利亚东南部
zh_hant: 澳洲東南部

# azurecore.extensionName
source: Azure Accounts
de: Azure-Konten
ja: Azure アカウント
pt_br: Contas do Azure
ru: Учетные записи Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶

# azurecore.azureArcPostgres
source: Azure Arc-enabled PostgreSQL Hyperscale
de: PostgreSQL Hyperscale mit Azure Arc-Unterstützung
ja: Azure Arc 対応 PostgreSQL Hyperscale
pt_br: Hiperescala de PostgreSQL habilitada para Azure Arc
ru: Гипермасштабирование PostgreSQL с поддержкой Azure Arc
zh_hans: 启用 Azure Arc 的 PostgreSQL 超大规模
zh_hant: 已啟用 Azure Arc 的 PostgreSQL 超大規模資料庫

# azurecore.postgresFlexibleServer
source: Azure Database for PostgreSQL flexible servers
de: Flexible Server für Azure Database for PostgreSQL
ja: Azure Database for PostgreSQL のフレキシブル サーバー
pt_br: Servidores flexíveis do Banco de Dados do Azure para PostgreSQL
ru: Гибкие серверы Базы данных Azure для PostgreSQL
zh_hans: Azure Database for PostgreSQL 灵活服务器
zh_hant: 適用於 PostgreSQL 的 Azure 資料庫彈性伺服器

# azurecore.postgresServer
source: Azure Database for PostgreSQL servers
de: Azure Database for PostgreSQL-Server
ja: Azure Database for PostgreSQL
pt_br: Servidores do Banco de Dados do Azure para PostgreSQL
ru: Серверы Базы данных Azure для PostgreSQL
zh_hans: Azure Database for PostgreSQL 服务器
zh_hant: 適用於 PostgreSQL 伺服器的 Azure 資料庫

# azure.azureResourcesGridTitle
source: Azure Resources (Preview)
de: Azure-Ressourcen (Vorschau)
ja: Azure リソース (プレビュー)
pt_br: Recursos do Azure (Versão Prévia)
ru: Ресурсы Azure (предварительная версия)
zh_hans: Azure 资源(预览)
zh_hant: Azure 資源 (預覽)

# azurecore.brazilsouth
source: Brazil South
de: Brasilien, Süden
ja: ブラジル南部
pt_br: Sul do Brasil
ru: Южная Бразилия
zh_hans: 巴西南部
zh_hant: 巴西南部

# azurecore.brazilsoutheast
source: Brazil Southeast
de: Brasilien, Südosten
ja: ブラジル南東部
pt_br: Sudeste do Brasil
ru: Юго-Восточная Бразилия
zh_hans: 巴西东南部
zh_hant: 巴西東南部

# azurecore.canadacentral
source: Canada Central
de: Kanada, Mitte
ja: カナダ中部
pt_br: Canadá Central
ru: Центральная Канада
zh_hans: 加拿大中部
zh_hant: 加拿大中部

# azurecore.canadaeast
source: Canada East
de: Kanada, Osten
ja: カナダ東部
pt_br: Leste do Canadá
ru: Восточная Канада
zh_hans: 加拿大东部
zh_hant: 加拿大東部

# azurecore.reload
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# azurecore.centralindia
source: Central India
de: Indien, Mitte
ja: インド中部
pt_br: Índia Central
ru: Центральная Индия
zh_hans: 印度中部
zh_hant: 印度中部

# azurecore.centralus
source: Central US
de: USA, Mitte
ja: 米国中部
pt_br: EUA Central
ru: Центральная часть США
zh_hans: 美国中部
zh_hant: 美國中部

# azurecore.centraluseuap
source: Central US EUAP
de: USA, Mitte EUAP
ja: 米国中部 EUAP
pt_br: EUA Central EUAP
ru: Центральная часть США (EUAP)
zh_hans: 美国中部 EUAP
zh_hant: 美國中部 EUAP

# azurecore.azureArcService
source: Data Service - Azure Arc
de: Datendienst – Azure Arc
pt_br: Serviço de Dados – Azure Arc
ru: Служба данных — Azure Arc
zh_hans: 数据服务 - Azure Arc
zh_hant: 資料服務 - Azure Arc

# azurecore.disable
source: Disable
de: Deaktivieren
ja: 無効
pt_br: Desativar
ru: Отключить
zh_hans: 禁用
zh_hant: 停用

# azurecore.dismiss
source: Dismiss
de: Schließen
ja: 却下
pt_br: Liberar
ru: Закрыть
zh_hans: 忽略
zh_hant: 關閉

# azurecore.eastasia
source: East Asia
de: Asien, Osten
ja: 東アジア
pt_br: Leste da Ásia
ru: Восточная Азия
zh_hans: 东亚
zh_hant: 東亞

# azurecore.eastus
source: East US
de: USA, Osten
ja: 米国東部
pt_br: Leste dos EUA
ru: Восточная часть США
zh_hans: 美国东部
zh_hant: 美國東部

# azurecore.eastus2
source: East US 2
de: USA, Osten 2
ja: 米国東部 2
pt_br: Leste dos EUA 2
ru: Восточная часть США — 2
zh_hans: 美国东部 2
zh_hant: 美國東部 2

# azurecore.eastus2euap
source: East US 2 EUAP
de: USA, Osten 2 (EUAP)
ja: 米国東部 2 EUAP
pt_br: Leste dos EUA 2 EUAP
ru: Восточная часть США 2 (EUAP)
zh_hans: 美国东部 2 EUAP
zh_hant: 美國東部 2 EUAP

# azurecore.francecentral
source: France Central
de: Frankreich, Mitte
ja: フランス中部
pt_br: França Central
ru: Центральная Франция
zh_hans: 法国中部
zh_hant: 法國中部

# azurecore.francesouth
source: France South
de: Frankreich, Süden
ja: フランス南部
pt_br: Sul da França
ru: Южная Франция
zh_hans: 法国南部
zh_hant: 法國南部

# azurecore.germanynorth
source: Germany North
de: Deutschland, Norden
ja: ドイツ北部
pt_br: Norte da Alemanha
ru: Северная Германия
zh_hans: 德国北部
zh_hant: 德國北部

# azurecore.germanywestcentral
source: Germany West Central
de: Deutschland, Westen-Mitte
ja: ドイツ中西部
pt_br: Centro-Oeste da Alemanha
ru: Центрально-Западная Германия
zh_hans: 德国中西部
zh_hant: 德國中西部

# azurecore.invalidAzureAccount
source: Invalid account
de: Ungültiges Konto.
ja: 無効なアカウント
pt_br: Conta inválida
ru: Недопустимая учетная запись
zh_hans: 帐户无效
zh_hant: 帳戶無效

# azurecore.invalidTenant
source: Invalid tenant for subscription
de: Ungültiger Mandant für Abonnement.
ja: サブスクリプションの無効なテナント
pt_br: Locatário inválido para assinatura
ru: Недопустимый клиент для подписки
zh_hans: 订阅的租户无效
zh_hant: 訂閱的租用戶無效

# azurecore.japaneast
source: Japan East
de: Japan, Osten
ja: 東日本
pt_br: Leste do Japão
ru: Восточная Япония
zh_hans: 日本东部
zh_hant: 日本東部

# azurecore.japanwest
source: Japan West
de: Japan, Westen
ja: 西日本
pt_br: Oeste do Japão
ru: Западная Япония
zh_hans: 日本西部
zh_hant: 日本西部

# azure.credStoreSaveFailedError
source: Keys for token cache could not be saved in credential store, this may cause Azure access token persistence issues and connection instabilities. It's likely that SqlTools has reached credential storage limit on Windows, please clear at least 2 credentials that start with "Microsoft.SqlTools|" in Windows Credential Manager and reload.
de: Die Schlüssel für den Tokencache konnten nicht im Anmeldeinformationsspeicher gespeichert werden. Dies kann zu Problemen bei der Persistenz des Azure-Zugriffstokens und zu Verbindungsinstabilitäten führen. Wahrscheinlich hat SqlTools das Speicherlimit für Anmeldeinformationen unter Windows erreicht. Löschen Sie in der Windows-Anmeldeinformationsverwaltung mindestens 2 Anmeldeinformationen, die mit „Microsoft.SqlTools|“ beginnen, und wiederholen Sie den Ladevorgang.
ja: トークン キャッシュのキーを資格情報ストアに保存できませんでした。Azure アクセス トークンの永続化に問題が発生して接続が不安定になる可能性があります。SqlTools が Windows の資格情報ストレージ制限に達していると考えられる場合は、Windows 資格情報マネージャーで、"Microsoft.SqlTools|" から始まる資格情報を少なくとも 2 つクリアし、再読み込みしてください。
pt_br: As chaves para cache de token não puderam ser salvas no armazenamento de credenciais, isso pode causar problemas de persistência de token de acesso do Azure e instabilidades de conexão. É provável que o SqlTools tenha atingido o limite de armazenamento de credenciais no Windows, limpe pelo menos 2 credenciais que comecem com "Microsoft.SqlTools|" no Gerenciador de Credenciais do Windows e recarregue.
ru: Не удалось сохранить ключи для кэша маркеров в хранилище учетных данных, что может привести к проблемам с сохранением маркера доступа Azure и нестабильности подключения. Вполне вероятно, что SqlTools достиг предела хранения учетных данных в Windows. Очистите по крайней мере 2 записи учетных данных, которые начинаются с «Microsoft.SqlTools|» в диспетчере учетных данных Windows и перезагрузите.
zh_hans: 无法在凭据存储中保存令牌缓存的密钥，这可能会导致 Azure 访问令牌持久性问题和连接不稳定。SqlTools 可能已达到 Windows 上的凭据存储限制，请清除至少 2 个以 Windows 凭据管理器中的“Microsoft.SqlTools|”开头的凭据，然后重新加载。
zh_hant: 權杖快取的金鑰無法儲存在認證存放區中，這可能會導致 Azure 存取權杖持續性問題和連線不穩定。SqlTools 可能已達到 Windows 的認證儲存限制，請清除 Windows 認證管理員中以 「Microsoft.SqlTools|」 開始的至少 2 個認證，然後重新載入。

# azurecore.koreacentral
source: Korea Central
de: Südkorea, Mitte
ja: 韓国中部
pt_br: Coreia Central
ru: Республика Корея, центральный регион
zh_hans: 韩国中部
zh_hant: 南韓中部

# azurecore.koreasouth
source: Korea South
de: Südkorea, Süden
ja: 韓国南部
pt_br: Sul da Coreia
ru: Республика Корея, южный регион
zh_hans: 韩国南部
zh_hant: 南韓南部

# azurecore.location
source: Location
de: Speicherort
ja: 場所
pt_br: Localização
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# azurecore.requiresReload
source: Modifying this setting requires reloading the window for all changes to take effect.
de: Bei Änderung dieser Einstellung muss das Fenster neu geladen werden, damit alle Änderungen wirksam werden.
ja: この設定を変更するには、すべての変更を有効にするためにウィンドウを再読み込みする必要があります。
pt_br: Modificar esta configuração requer o recarregamento da janela para que todas as alterações entrem em vigor.
ru: При изменении этого ресурса необходимо перезагрузить окно, чтобы все изменения вступили в силу.
zh_hans: 修改此设置需要重新加载窗口，以使所有更改生效。
zh_hant: 修改此設定需要重新載入視窗，使所有變更生效。

# azurecore.name
source: Name
ja: 名前
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# azure.noCloudsEnabled
source: No clouds are enabled, please enable a cloud to continue.
de: Es sind keine Clouds aktiviert. Aktivieren Sie eine Cloud, um den Vorgang fortzusetzen.
ja: クラウドが有効になっていません。続行するにはクラウドを有効にしてください。
pt_br: Nenhuma nuvem está habilitada. Habilite uma nuvem para continuar.
ru: Облака не включены. Включите облако, чтобы продолжить.
zh_hans: 未启用云，请启用云以继续。
zh_hant: 未啟用雲端，請啟用雲端以繼續。

# azurecore.northcentralus
source: North Central US
de: USA, Norden-Mitte
ja: 米国中北部
pt_br: Centro-Norte dos EUA
ru: Центрально-северная часть США
zh_hans: 美国中北部
zh_hant: 美國中北部

# azurecore.northeurope
source: North Europe
de: Europa, Norden
ja: 北ヨーロッパ
pt_br: Norte da Europa
ru: Северная Европа
zh_hans: 北欧
zh_hant: 北歐

# azurecore.norwayeast
source: Norway East
de: Norwegen, Osten
ja: ノルウェー東部
pt_br: Leste da Noruega
ru: Восточная Норвегия
zh_hans: 挪威东部
zh_hant: 挪威東部

# azurecore.norwaywest
source: Norway West
de: Norwegen, Westen
ja: ノルウェー西部
pt_br: Oeste da Noruega
ru: Западная Норвегия
zh_hans: 挪威西部
zh_hant: 挪威西部

# azurecore.reloadChoice
source: Reload Azure Data Studio
de: Azure Data Studio neu laden
ja: Azure Data Studio の再読み込み
pt_br: Recarregar o Azure Data Studio
ru: Перезагрузить Azure Data Studio
zh_hans: 重新加载 Azure Data Studio
zh_hant: 重新載入 Azure Data Studio

# azurecore.resourceGroup
source: Resource group
de: Ressourcengruppe
ja: リソース グループ
pt_br: Grupo de recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# azurecore.resourceType
source: Resource type
de: Ressourcentyp
ja: リソースの種類
pt_br: Tipo de recurso
ru: Тип ресурса
zh_hans: 资源类型
zh_hant: 資源類型

# azurecore.sqlDatabase
source: SQL database
de: SQL-Datenbank
pt_br: Banco de dados SQL
ru: База данных SQL
zh_hans: SQL 数据库
zh_hant: SQL 資料庫

# azurecore.sqlManagedInstance
source: SQL managed instance
de: Verwaltete SQL-Instanz
ja: SQL マネージド インスタンス
pt_br: Instância gerenciada de SQL
ru: Управляемый экземпляр SQL
zh_hans: SQL 托管实例
zh_hant: SQL 受控執行個體

# azurecore.azureArcsqlManagedInstance
source: SQL managed instance - Azure Arc
de: Verwaltete SQL-Instanz – Azure Arc
ja: SQL マネージド インスタンス - Azure Arc
pt_br: Instância gerenciada do SQL – Azure Arc
ru: Управляемый экземпляр SQL — Azure Arc
zh_hans: SQL 托管实例 - Azure Arc
zh_hant: SQL 受控執行個體 - Azure Arc

# azurecore.sqlServer
source: SQL server
ru: Сервер SQL Server
zh_hans: SQL 服务器
zh_hant: SQL 伺服器

# azurecore.southafricanorth
source: South Africa North
de: Südafrika, Norden
ja: 南アフリカ北部
pt_br: Norte da África do Sul
ru: Северная часть ЮАР
zh_hans: 南非北部
zh_hant: 南非北部

# azurecore.southafricawest
source: South Africa West
de: Südafrika, Westen
ja: 南アフリカ西部
pt_br: Oeste da África do Sul
ru: Западная часть ЮАР
zh_hans: 南非西部
zh_hant: 南非西部

# azurecore.southcentralus
source: South Central US
de: USA, Süden-Mitte
ja: 米国中南部
pt_br: Centro-Sul dos EUA
ru: Центрально-южная часть США
zh_hans: 美国中南部
zh_hant: 美國中南部

# azurecore.southindia
source: South India
de: Indien, Süden
ja: インド南部
pt_br: Sul da Índia
ru: Южная Индия
zh_hans: 印度南部
zh_hant: 印度南部

# azurecore.southeastasia
source: Southeast Asia
de: Asien, Südosten
ja: 東南アジア
pt_br: Sudeste da Ásia
ru: Юго-Восточная Азия
zh_hans: 东南亚
zh_hant: 東南亞

# azurecore.subscription
source: Subscription
de: Abonnement
ja: サブスクリプション
pt_br: Assinatura
ru: Подписка
zh_hans: 订阅
zh_hant: 訂用帳戶

# azurecore.switchMsal
source: Switch to MSAL
de: Zu MSAL wechseln
ja: MSAL に切り替える
pt_br: Alternar para MSAL
ru: Переключиться на MSAL
zh_hans: 切换到 MSAL
zh_hant: 切換到 MSAL

# azurecore.switzerlandnorth
source: Switzerland North
de: Schweiz, Norden
ja: スイス北部
pt_br: Norte da Suíça
ru: Северная Швейцария
zh_hans: 瑞士北部
zh_hant: 瑞士北部

# azurecore.switzerlandwest
source: Switzerland West
de: Schweiz, Westen
ja: スイス西部
pt_br: Oeste da Suíça
ru: Западная Швейцария
zh_hans: 瑞士西部
zh_hant: 瑞士西部

# azurecore.reloadPromptCacheClear
source: Token cache has been cleared successfully, please reload Azure Data Studio.
de: Der Tokencache wurde erfolgreich gelöscht. Laden Sie Azure Data Studio neu.
ja: トークン キャッシュが正常にクリアされました。Azure Data Studio をもう一度読み込んでください。
pt_br: O cache de token foi limpo com êxito, recarregue o Azure Data Studio.
ru: Кэш маркеров успешно очищен. Перезагрузите Azure Data Studio.
zh_hans: 令牌缓存已成功清除，请重新加载 Azure Data Studio。
zh_hant: 已成功清除權杖快取，請重載 Azure Data Studio。

# azurecore.typeIcon
source: Type Icon
de: Typsymbol
ja: 種類アイコン
pt_br: Ícone de Tipo
ru: Значок типа
zh_hans: 类型图标
zh_hant: 類型圖示

# azurecore.uaecentral
source: UAE Central
de: VAE, Mitte
ja: アラブ首長国連邦中部
pt_br: EAU Central
ru: Центральная часть ОАЭ
zh_hans: 阿拉伯联合酋长国中部
zh_hant: 阿拉伯聯合大公國中部

# azurecore.uaenorth
source: UAE North
de: VAE, Norden
ja: アラブ首長国連邦北部
pt_br: Norte dos EAU
ru: Северная часть ОАЭ
zh_hans: 阿拉伯联合酋长国北部
zh_hant: 阿拉伯聯合大公國北部

# azurecore.uksouth
source: UK South
de: Vereinigtes Königreich, Süden
ja: 英国南部
pt_br: Sul do Reino Unido
ru: Южная часть Соединенного Королевства
zh_hans: 英国南部
zh_hant: 英國南部

# azurecore.ukwest
source: UK West
de: Vereinigtes Königreich, Westen
ja: 英国西部
pt_br: Oeste do Reino Unido
ru: Западная часть Соединенного Королевства
zh_hans: 英国西部
zh_hant: 英國西部

# azurecore.unableToFetchToken
source: Unable to get token for tenant {0}
de: Für den Mandanten "{0}" kann kein Token abgerufen werden.
ja: テナント {0} のトークンを取得できません
pt_br: Não é possível obter um token para o locatário {0}
ru: Не удается получить токен для клиента {0}
zh_hans: 无法获取租户 {0} 的令牌
zh_hant: 無法取得租用戶 {0} 的權杖

# azure.unableToOpenAzureLink
source: Unable to open link, missing required values
de: Der Link kann nicht geöffnet werden, weil erforderliche Werte fehlen.
ja: リンクを開けません。必要な値がありません
pt_br: Não é possível abrir o link, os valores necessários estão ausentes
ru: Не удается открыть ссылку, отсутствуют обязательные значения
zh_hans: 无法打开链接，缺少所需的值
zh_hant: 無法開啟連結，缺少必要值

# azurecore.piiLogging.warning
source: Warning: Azure PII Logging is enabled. Enabling this option allows personally identifiable information to be logged and should only be used for debugging purposes.
de: Warnung: Die Azure-PII-Protokollierung ist aktiviert. Wenn Sie diese Option aktivieren, können personenbezogene Informationen protokolliert werden. Sie dürfen nur zu Debugzwecken verwendet werden.
ja: 警告: Azure PII ログが有効になっています。このオプションを有効にすると、個人を特定できる情報をログに記録でき、デバッグ目的でのみ使用する必要があります。
pt_br: Aviso: o Log de PII do Azure está habilitado. Habilitar essa opção permite que informações de identificação pessoal sejam registradas em log e só devem ser usadas para fins de depuração.
ru: Внимание! Ведение журнала личных сведений Azure включено. Включение этого параметра позволяет регистрировать личные сведения. Это следует использовать только для отладки.
zh_hans: 警告: 已启用 Azure PII 日志记录。启用此选项可允许记录个人身份信息，并且只能用于调试目的。
zh_hant: 警告: Azure PII 記錄已啟用。啟用此選項後即可記錄個人識別資訊，且只能用於偵錯用途。

# azurecore.westcentralus
source: West Central US
de: USA, Westen-Mitte
ja: 米国中西部
pt_br: Centro-Oeste dos EUA
ru: Центрально-западная часть США
zh_hans: 美国中西部
zh_hant: 美國中西部

# azurecore.westeurope
source: West Europe
de: Europa, Westen
ja: 西ヨーロッパ
pt_br: Oeste da Europa
ru: Западная Европа
zh_hans: 西欧
zh_hant: 西歐

# azurecore.westindia
source: West India
de: Indien, Westen
ja: インド西部
pt_br: Oeste da Índia
ru: Западная Индия
zh_hans: 印度西部
zh_hant: 印度西部

# azurecore.westus
source: West US
de: USA, Westen
ja: 米国西部
pt_br: Oeste dos EUA
ru: Западная часть США
zh_hans: 美国西部
zh_hant: 美國西部

# azurecore.westus2
source: West US 2
de: USA, Westen 2
ja: 米国西部 2
pt_br: Oeste dos EUA 2
ru: Западная часть США — 2
zh_hans: 美国西部 2
zh_hant: 美國西部 2

# azurecore.reloadPrompt
source: {0} setting changed, please reload Azure Data Studio.
de: {0} Einstellung geändert wurde, laden Sie Azure Data Studio neu.
ja: {0} 設定が変更されました。Azure Data Studio をもう一度読み込んでください。
pt_br: {0} configuração alterada, recarregue o Azure Data Studio..
ru: Параметр {0} изменен, перезагрузите Azure Data Studio.
zh_hans: {0} 设置已更改，请重新加载 Azure Data Studio。
zh_hant: {0} 設定已變更，請重載 Azure Data Studio。

# providerSettings.error
source: Could not load endpoints from settings, please check the logs for more details.
de: Endpunkte konnten nicht aus den Einstellungen geladen werden. Weitere Informationen finden Sie in den Protokollen.
ja: 設定からエンドポイントを読み込めませんでした。詳細については、ログを確認してください。
pt_br: Não foi possível carregar os pontos de extremidade das configurações, verifique os logs para obter mais detalhes.
ru: Не удалось загрузить конечные точки из параметров. Проверьте журналы для получения дополнительных сведений.
zh_hans: 无法从设置加载终结点，请检查日志以了解更多详细信息。
zh_hant: 無法從設定載入端點，請查看記錄檔以取得詳細資料。

# providerSettings.success
source: Successfully loaded custom endpoints from settings
de: Benutzerdefinierte Endpunkte wurden erfolgreich aus den Einstellungen geladen.
ja: 設定からカスタム エンドポイントを正常に読み込みました
pt_br: Pontos de extremidade personalizados carregados com êxito das configurações
ru: Пользовательские конечные точки успешно загружены из параметров
zh_hans: 已成功从设置加载自定义终结点
zh_hant: 已成功從設定載入自訂端點

# config.providerSettings.endpoints.armResource
source: ARM Resource Endpoint
de: ARM-Ressourcenendpunkt
ja: ARM リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do ARM
ru: Конечная точка ресурса ARM
zh_hans: ARM 资源终结点
zh_hant: ARM 資源端點

# azure.resource.connectsqldb.title
source: Add to Servers
de: Zu Servern hinzufügen
ja: サーバーに追加
pt_br: Adicionar aos Servidores
ru: Добавить к серверам
zh_hans: 添加到服务器
zh_hant: 新增至伺服器

# azure.displayName
source: Azure (Core)
ja: Azure (コア)
ru: Azure (ядро)
zh_hans: Azure (核心)
zh_hant: Azure (核心)

# azure.resource.view.title
source: Azure (Preview)
de: Azure (Vorschau)
ja: Azure (プレビュー)
pt_br: Azure (Versão Prévia)
ru: Azure (предварительная версия)
zh_hans: Azure (预览)
zh_hant: Azure (預覽)

# config.azureAccountConfigurationSection
source: Azure Account Configuration
de: Azure-Kontokonfiguration
ja: Azure アカウント構成
pt_br: Configuração da Conta do Azure
ru: Конфигурация учетной записи Azure
zh_hans: Azure 帐户配置
zh_hant: Azure 帳戶組態

# config.azureAuthMethodConfigurationSection
source: Azure Authentication Method
de: Azure-Authentifizierungsmethode
ja: Azure 認証方法
pt_br: Método de Autenticação do Azure
ru: Метод проверки подлинности Azure
zh_hans: Azure 身份验证方法
zh_hant: Azure 驗證方法

# config.providerSettings.endpoints.azureKeyVaultResource
source: Azure KeyVault Resource Endpoint
de: Azure KeyVault-Ressourcenendpunkt
ja: Azure KeyVault リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do Azure KeyVault
ru: Конечная точка ресурса Azure KeyVault
zh_hans: Azure KeyVault 资源终结点
zh_hant: Azure KeyVault 資源端點

# config.providerSettings.endpoints.azureKustoResource
source: Azure Kusto Resource Endpoint
de: Azure Kusto-Ressourcenendpunkt
ja: Azure Kusto リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do Azure Kusto
ru: Конечная точка ресурса Azure Kusto
zh_hans: Azure Kusto 资源终结点
zh_hant: Azure Kusto 資源端點

# config.providerSettings.endpoints.logAnalytics
source: Azure Log Analytics Endpoint
de: Azure Log Analytics-Endpunkt
ja: Azure Log Analytics エンドポイント
pt_br: Ponto de Extremidade do Azure Log Analytics
ru: Конечная точка Azure Log Analytics
zh_hans: Azure Log Analytics 终结点
zh_hant: Azure Log Analytics 端點

# config.providerSettings.endpoints.portal
source: Azure Portal Endpoint
de: Azure-Portalendpunkt
ja: Azure portal エンドポイント
pt_br: Ponto de Extremidade do Portal do Azure
ru: Конечная точка портала Azure
zh_hans: Azure 门户终结点
zh_hant: Azure 入口網站端點

# config.providerSettings.endpoints.azureStorageResource
source: Azure Storage Resource Endpoint
de: Azure Storage-Ressourcenendpunkt
ja: Azure Storage リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do Armazenamento do Azure
ru: Конечная точка ресурса службы хранилища Azure
zh_hans: Azure 存储资源终结点
zh_hant: Azure 儲存體資源端點

# config.providerSettings.endpoints.azureStorageResourceSuffix
source: Azure Storage Resource Endpoint Suffix
de: Suffix für Azure Storage-Ressourcenendpunkt
ja: Azure Storage リソース エンドポイント サフィックス
pt_br: Sufixo do Ponto de Extremidade de Recurso do Armazenamento do Azure
ru: Суффикс конечной точки ресурса службы хранилища Azure
zh_hans: Azure 存储资源终结点后缀
zh_hant: Azure 儲存體資源端點尾碼

# azure.resource.refreshall.title
source: Azure: Refresh All Accounts
de: Azure: Alle Konten aktualisieren
ja: Azure: すべてのアカウントを更新する
pt_br: Azure: Atualizar Todas as Contas
ru: Azure: обновление всех учетных записей
zh_hans: Azure: 刷新所有帐户
zh_hant: Azure: 重新整理所有帳戶

# azure.resource.signin.title
source: Azure: Sign In
de: Azure: Anmelden
ja: Azure: サインイン
pt_br: Azure: Entrar
ru: Azure: вход
zh_hans: Azure: 登录
zh_hant: Azure: 登入

# azure.description
source: Browse and work with Azure resources
de: Durchsuchen und Arbeiten mit Azure-Ressourcen
ja: Azure リソースを参照して作業します
pt_br: Navegar e trabalhar com recursos do Azure
ru: Обзор ресурсов Azure и работа с ними
zh_hans: 浏览和使用 Azure 资源
zh_hant: 瀏覽並使用 Azure 資源
