Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.wizard.target.mapping.error.duplicate
source: Database mapping error. Target database '{0}' cannot be selected to as a migration target for database '{1}'. Target database '{2}' is already selected as a migration target for database '{3}'. Please select a different target database.
de: Datenbankzuordnungsfehler. Die Zieldatenbank „{0}“ kann nicht als Migrationsziel für die Datenbank „{1}“ ausgewählt werden. Die Zieldatenbank „{2}“ ist bereits als Migrationsziel für die Datenbank „{3}“ ausgewählt. Bitte wählen Sie eine andere Zieldatenbank aus.
es: Error de asignación de base de datos. No se puede seleccionar la base de datos de destino "{0}" como destino de migración para la base de datos "{1}". La base de datos de destino "{2}" ya está seleccionada como destino de migración para la base de datos "{3}". Seleccione otra base de datos de destino.
fr: Erreur de mappage de base de données. La base de données cible '{0}' ne peut pas être sélectionnée comme cible de migration pour la base de données '{1}'. La base de données cible '{2}' est déjà sélectionnée comme cible de migration pour la base de données '{3}'. Veuillez sélectionner une autre base de données cible.
ja: データベース マッピング エラーです。ターゲット データベース '{0}' は、データベース '{1}' の移行ターゲットとして選択できません。 ターゲット データベース '{2}' は、データベース '{3}' の移行ターゲットとして既に選択されています。 別のターゲット データベースを選択してください。
ko: 데이터베이스 매핑 오류입니다. 대상 데이터베이스 '{0}'을(를) 데이터베이스 '{1}'의 마이그레이션 대상으로 선택할 수 없습니다. 대상 데이터베이스 '{2}'이(가) 데이터베이스 '{3}'의 마이그레이션 대상으로 이미 선택되었습니다. 다른 대상 데이터베이스를 선택하세요.
pt_br: Erro de mapeamento do banco de dados. O banco de dados de destino '{0}' não pode ser selecionado como um destino de migração para o banco de dados '{1}'. O banco de dados de destino '{2}' já está selecionado como um destino de migração para o banco de dados '{3}'. Selecione outro banco de dados de destino.
ru: Ошибка сопоставления базы данных. Невозможно выбрать целевую базу данных "{0}" в качестве цели миграции для базы "{1}". Целевая база данных "{2}" уже выбрана в качестве цели миграции для базы "{3}". Выберите другую целевую базу данных.
zh_hans: 数据库映射错误。无法将目标数据库“{0}”选为数据库“{1}”的迁移目标。已将目标数据库“{2}”选为数据库“{3}”的迁移目标。请选择其他目标数据库。
zh_hant: 資料庫對應錯誤。無法選取目標資料庫 '{0}' 做為資料庫 '{1}' 的移轉目標。已選取目標資料庫 '{2}' 做為資料庫 '{3}' 的移轉目標。請選取其他目標資料庫。

# sql.migration.database.migration.status
source: Database migration status
de: Status der Datenbankmigration
es: Estado de la migración de bases de datos
fr: État de la migration de base de données
ja: データベースの移行状態
ko: 데이터베이스 마이그레이션 상태
pt_br: Status da migração de banco de dados
ru: Состояние миграции базы данных
zh_hans: 数据库迁移状态
zh_hant: 資料庫移轉狀態

# sql.migration.migration.completed
source: Database migrations completed
de: Datenbankmigrationen abgeschlossen
es: Migraciones de bases de datos completadas
fr: Migrations de base de données terminées
ja: データベースの移行が完了しました
ko: 데이터베이스 마이그레이션 완료
pt_br: Migrações de banco de dados concluídas
ru: Миграции баз данных выполнены
zh_hans: 已完成数据库迁移
zh_hant: 資料庫移轉已完成

# sql.migration.cutover.card
source: Database migrations completing cutover
de: Datenbankmigrationen, die die Umstellung abschließen
es: Migraciones de bases de datos que completan la transición
fr: Migrations de base de données effectuant le basculement
ja: 一括移行を完了するデータベースの移行
ko: 컷오버를 완료하는 데이터베이스 마이그레이션
pt_br: Migrações de banco de dados concluindo a transição
ru: Миграции баз данных завершают прямую миграцию
zh_hans: 数据库迁移完成直接转换
zh_hant: 完成完全移轉的資料庫移轉

# sql.migration.failed
source: Database migrations failed
de: Fehler bei der Datenbankmigration
es: Error en las migraciones de bases de datos
fr: Échec des migrations de base de données
ja: データベースの移行に失敗しました
ko: 데이터베이스 마이그레이션 실패
pt_br: Falha nas migrações de banco de dados
ru: Сбой миграции баз данных
zh_hans: 数据库迁移失败
zh_hant: 資料庫移轉失敗。

# sql.migration.migration.in.progress
source: Database migrations in progress
de: Datenbankmigrationen werden ausgeführt
es: Migraciones de base de datos en curso
fr: Migrations de base de données en cours
ja: データベースの移行が進行中
ko: 데이터베이스 마이그레이션 진행 중
pt_br: Migrações de banco de dados em andamento
ru: Выполняются миграции базы данных
zh_hans: 正在进行数据库迁移
zh_hant: 資料庫移轉正在進行中

# sql.migration.database.to.be.migrated
source: Database to be migrated
de: Zu migrierende Datenbank
es: Base de datos que se va a migrar
fr: Base de données à migrer
ja: 移行されるデータベース
ko: 마이그레이션할 데이터베이스
pt_br: Banco de dados a ser migrado
ru: База данных для миграции
zh_hans: 要迁移的数据库
zh_hant: 要移轉的資料庫

# sql.migration.db.readiness.section.title
source: Database {0} migration readiness
de: Migrationsbereitschaft der Datenbank "{0}"
es: Preparación para la migración de la base de datos {0}
fr: Préparation à la migration {0} de la base de données
ja: データベース {0} 移行の準備
ko: {0} 데이터베이스 마이그레이션 준비 상태
pt_br: Preparação para migração do banco de dados {0}
ru: Готовность баз данных {0} к миграции
zh_hans: 数据库 {0} 迁移就绪情况
zh_hant: 資料庫 {0} 移轉整備程度

# sql.migration.database.assessed.label
source: Database(s) assessed
de: Bewertete Datenbank(en)
es: Bases de datos evaluadas
fr: Base(s) de données évaluée(s)
ja: 評価されたデータベース
ko: 데이터베이스 평가됨
pt_br: Banco(s) de dados avaliado(s)
ru: Оценено баз данных
zh_hans: 已评估数据库
zh_hant: 評定的資料庫

# sql.migration.tde.migrate.column.databases
source: Databases
de: Datenbanken
es: Bases de datos
fr: Bases de données
ja: データベース
ko: 데이터베이스
pt_br: Bancos de dados
ru: Базы данных
zh_hans: 数据库
zh_hant: 資料庫

# sql.migration.databases.table.title
source: Databases
de: Datenbanken
es: Bases de datos
fr: Bases de données
ja: データベース
ko: 데이터베이스
pt_br: Bancos de dados
ru: Базы данных
zh_hans: 数据库
zh_hant: 資料庫

# sql.migration.databases
source: Databases ({0}/{1})
de: Datenbanken ({0}/{1})
es: Bases de datos ({0}/{1})
fr: Bases de données ({0}/{1})
ja: データベース ({0}/{1})
ko: 데이터베이스({0}/{1})
pt_br: Bancos de dados ({0}/{1})
ru: Базы данных ({0}/{1})
zh_hans: 数据库({0}/{1})
zh_hant: 資料庫 ({0}/{1})

# sql.migration.database.assessment.title
source: Databases for assessment
de: Datenbanken für die Bewertung
es: Bases de datos para evaluación
fr: Bases de données pour l’évaluation
ja: 評価用のデータベース
ko: 평가용 데이터베이스
pt_br: Bancos de dados para avaliação
ru: Базы данных для оценки
zh_hans: 用于评估的数据库
zh_hant: 要評定的資料庫

# sql.migration.summary.database.count
source: Databases for migration
de: Datenbanken für die Migration
es: Bases de datos para migración
fr: Bases de données pour la migration
ja: 移行用のデータベース
ko: 마이그레이션할 데이터베이스
pt_br: Banco de dados para migração
ru: Базы данных для миграции
zh_hans: 要迁移的数据库
zh_hant: 要移轉的資料庫

# sql.migration.assessment.migration.warning.sqldb
source: Databases that are not ready for migration to Azure SQL Database can be migrated to SQL Server on Azure Virtual Machines. Alternatively, review assessment results for Azure SQL Managed Instance migration readiness.
de: Datenbanken, die nicht für die Migration zu Azure SQL-Datenbank bereit sind, können zu SQL Server auf Microsoft Azure Virtual Machines migriert werden. Alternativ können Sie die Bewertungsergebnisse für die Azure SQL Managed Instance-Migrationsbereitschaft überprüfen.
es: Las bases de datos que no están listas para la migración a Azure SQL Database se pueden migrar a SQL Server en Azure Virtual Machines. Como alternativa, revise los resultados de la evaluación para la preparación para la migración a Azure SQL Managed Instance.
fr: Les bases de données qui ne sont pas prêtes pour la migration vers Azure SQL Database peuvent être migrées vers SQL Server sur des machines virtuelles Azure. Vous pouvez également examiner les résultats de l’évaluation pour la préparation à la migration Azure SQL Database.
ja: Azure SQL Database への移行準備が整っていないデータベースは、Azure Virtual Machines の SQL Server に移行できます。または、Azure SQL Managed Instance 移行の準備度に関する評価結果を確認します。
ko: Azure SQL Database로 마이그레이션할 준비가 되지 않은 데이터베이스는 Azure Virtual Machines의 SQL Server로 마이그레이션할 수 있습니다. 또는 Azure SQL Managed Instance 마이그레이션 준비에 대한 평가 결과를 검토하세요.
pt_br: Bancos de dados que não estão prontos para migração para o Banco de Dados SQL do Azure podem ser migrados para o SQL Server nas Máquinas Virtuais do Azure. Como alternativa, examine os resultados da avaliação para a preparação da migração da Instância Gerenciada de SQL do Azure.
ru: Базы данных, которые не готовы к миграции в Базу данных SQL Azure, можно перенести в SQL Server на Виртуальных машинах Azure. Также можно просмотреть результаты оценки готовности к миграции в Управляемый экземпляр SQL Azure.
zh_hans: 可将尚未准备好迁移到 Azure SQL 数据库的数据库迁移到 Azure 虚拟机上的 SQL Server。或查看 Azure SQL 托管实例迁移就绪情况的评估结果。
zh_hant: 尚未準備好移轉至 Azure SQL Database 的資料庫可以移轉至 Azure 虛擬機器上的 SQL Server。或者，檢閱 Azure SQL 受控執行個體移轉整備程度的評定結果。

# sql.migration.assessment.migration.warning.sqlmi
source: Databases that are not ready for migration to Azure SQL Managed Instance can be migrated to SQL Server on Azure Virtual Machines. Alternatively, review assessment results for Azure SQL Database migration readiness.
de: Datenbanken, die nicht für die Migration zu Azure SQL Managed Instance bereit sind, können zu SQL Server auf Microsoft Azure Virtual Machines migriert werden. Alternativ können Sie die Bewertungsergebnisse für die Azure SQL-Datenbank-Migrationsbereitschaft überprüfen.
es: Las bases de datos que no están listas para la migración a Azure SQL Managed Instance se pueden migrar a SQL Server en Azure Virtual Machines. Como alternativa, revise los resultados de la evaluación para la preparación para la migración a Azure SQL Database.
fr: Les bases de données qui ne sont pas prêtes pour la migration vers Azure SQL Managed Instance peuvent être migrées vers SQL Server sur des machines virtuelles Azure. Vous pouvez également examiner les résultats de l’évaluation pour Azure SQL Database préparation à la migration.
ja: Azure SQL Managed Instance への移行準備が整っていないデータベースは、Azure Virtual Machines の SQL Serverに移行できます。または、Azure SQL Managed Instance 移行の準備度に関する評価結果を確認します。
ko: Azure SQL Managed Instance로 마이그레이션할 준비가 되지 않은 데이터베이스는 Azure Virtual Machines의 SQL Server로 마이그레이션할 수 있습니다. 또는 Azure SQL Database 마이그레이션 준비에 대한 평가 결과를 검토하세요.
pt_br: Bancos de dados que não estão prontos para migração para a Instância Gerenciada de SQL do Azure podem ser migrados para o SQL Server nas Máquinas Virtuais do Azure. Como alternativa, examine os resultados da avaliação para a preparação da migração do Banco de Dados SQL.
ru: Базы данных, которые не готовы к миграции в Управляемый экземпляр SQL Azure, можно перенести в SQL Server на Виртуальных машинах Azure. Также можно просмотреть результаты оценки готовности к миграции в Базу данных SQL Azure.
zh_hans: 可将尚未准备好迁移到 Azure SQL 托管实例的数据库迁移到 Azure 虚拟机上的 SQL Server。或查看 Azure SQL 数据库迁移就绪情况的评估结果。
zh_hant: 尚未準備好移轉至 Azure SQL 受控執行個體的資料庫可以移轉至 Azure 虛擬機器上的 SQL Server。或者，檢閱 Azure SQL Database 移轉整備程度的評定結果。

# sql.migration.assessment.migration.warning
source: Databases that are not ready for migration to Azure SQL Managed Instance or Azure SQL Database can be migrated to SQL Server on Azure Virtual Machines.
de: Datenbanken, die nicht für die Migration zu Azure SQL Managed Instance oder Azure SQL-Datenbank bereit sind, können zu SQL Server auf Microsoft Azure Virtual Machines migriert werden.
es: Las bases de datos que no están listas para la migración a Azure SQL Managed Instance o Azure SQL Database se pueden migrar a SQL Server en Azure Virtual Machines.
fr: Les bases de données qui ne sont pas prêtes pour la migration vers Azure SQL Managed Instance ou Azure SQL Database peuvent être migrées vers SQL Server sur des machines virtuelles Azure.
ja: Azure SQL Managed Instance または Azure SQL Database への移行準備が整っていないデータベースは、Azure Virtual Machines の SQL Server に移行させることができます。
ko: Azure SQL Managed Instance 또는 Azure SQL Database로의 마이그레이션이 준비가 되지 않은 데이터베이스는 Azure Virtual Machines SQL Server에서 마이그레이션할 수 있습니다.
pt_br: Os bancos de dados que não estão prontos para migração para a Instância Gerenciada de SQL do Azure ou para o Banco de Dados SQL podem ser migrados para o SQL Server em Máquinas Virtuais do Azure.
ru: Базы данных, которые не готовы к миграции в Управляемый экземпляр SQL Azure или в Базу данных SQL Azure, можно перенести в SQL Server на Виртуальных машинах Azure.
zh_hans: 可将尚未准备好迁移到 Azure SQL 托管实例或 Azure SQL 数据库的数据库迁移到 Azure 虚拟机上的 SQL Server。
zh_hant: 尚未準備好移轉到 Azure SQL 受控執行個體或 Azure SQL Database 的資料庫，可以在 Azure 虛擬機器上移轉到 SQL Server。

# sql.migration.default.database
source: Default database
de: Standarddatenbank
es: Base de datos predeterminada
fr: Base de données par défaut
ja: 既定のデータベース
ko: 기본 데이터베이스
pt_br: Banco de dados padrão
ru: База данных по умолчанию
zh_hans: 默认数据库
zh_hant: 預設資料庫

# sql.migration.sku.azureRecommendation.data.collection.default.path
source: Default path
de: Standardpfad
es: Ruta de acceso predeterminada
fr: Chemin par défaut
ja: 既定のパス
ko: 기본 경로
pt_br: Caminho padrão
ru: Путь по умолчанию
zh_hans: 默认路径
zh_hant: 預設路徑

# sql.migration.delete.migration
source: Delete migration
de: Migration löschen
es: Eliminar migración
fr: Supprimer une migration
ja: 移行の削除
ko: 마이그레이션 삭제
pt_br: Excluir migração
ru: Удалить миграцию
zh_hans: 删除迁移
zh_hant: 刪除移轉

# sql.migration.status.deploying.schema
source: Deploying schema
de: Schema wird bereitgestellt
es: Implementando esquema
fr: Déploiement du schéma
ja: スキーマをデプロイしています
ko: 스키마 배포
pt_br: Implantando esquema
ru: Развертывается схема
zh_hans: 正在部署架构
zh_hant: 部署結構描述

# sql.migration.status.deployment.completed
source: Deployment completed
de: Die Bereitstellung wurde abgeschlossen.
es: Implementación completada
fr: Déploiement achevé
ja: デプロイが完了しました
ko: 배포 완료
pt_br: Implantação concluída
ru: Развертывание завершено
zh_hans: 部署已完成
zh_hant: 部署完成

# sql.migration.schema.script.deployment.count
source: Deployment count
de: Bereitstellungsanzahl
es: Recuento de implementaciones
fr: Nombre de déploiements
ja: デプロイ数
ko: 배포 수
pt_br: Contagem de implantação
ru: Количество развертываний
zh_hans: 部署计数
zh_hant: 部署計數

# sql.migration.schema.script.deployment.ended
source: Deployment ended
de: Bereitstellung beendet
es: Implementación finalizada
fr: Déploiement terminé
ja: デプロイが終了しました
ko: 배포 종료됨
pt_br: A implantação terminou
ru: Развертывание завершено
zh_hans: 部署已结束
zh_hant: 部署已結束

# sql.migration.schema.script.deployment.error.count
source: Deployment error count
de: Anzahl der Bereitstellungsfehler
es: Recuento de errores de implementación
fr: Nombre d’erreurs de déploiement
ja: デプロイ エラー数
ko: 배포 오류 수
pt_br: Contagem de erros de implantação
ru: Количество ошибок развертывания
zh_hans: 部署错误计数
zh_hant: 部署錯誤計數

# sql.migration.schema.script.deployment.started
source: Deployment started
de: Die Bereitstellung wurde gestartet
es: Implementación iniciada
fr: Déploiement démarré
ja: デプロイが開始されました
ko: 배포 시작됨
pt_br: Implantação iniciada
ru: Развертывание запущено
zh_hans: 部署已启动
zh_hant: 部署已開始

# sql.migration.tde.validation.description
source: Description
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
pt_br: Descrição
ru: Описание
zh_hans: 说明
zh_hant: 描述

# sql.migration.description
source: Description
de: Beschreibung
es: Descripción
ja: 説明
ko: 설명
pt_br: Descrição
ru: Описание
zh_hans: 说明
zh_hant: 描述

# sql.migration.details.title
source: Details
es: Detalles
fr: Détails
ja: 詳細
ko: 세부 정보
pt_br: Detalhes
ru: Сведения
zh_hans: 详细信息
zh_hant: 詳細資料

# sql.migration.details.copied
source: Details copied
de: Details kopiert
es: Detalles copiados
fr: Détails copiés
ja: 詳細をコピー済み
ko: 세부 정보 복사됨
pt_br: Detalhes copiados
ru: Сведения скопированы
zh_hans: 已复制详细信息
zh_hant: 已複製詳細資料

# sql.migration.validate.ir.error.message
source: Details for {0} are mandatory and missing.
zh_hans: 必须提供 {0} 详细信息，但缺少此信息。

# sql.migration.field.label.deteected.files
source: Detected files
de: Erkannte Dateien
es: Archivos detectados
fr: Fichiers détectés
ja: 検出されたファイル
ko: 검색된 파일
pt_br: Arquivos detectados
ru: Обнаруженные файлы
zh_hans: 检测到的文件
zh_hant: 偵測到的檔案

# sql.migration.dashboard.description
source: Determine the migration readiness of your SQL Server instances, identify a recommended Azure SQL target, and complete the migration of your SQL Server instance to Azure SQL Managed Instance, SQL Server on Azure Virtual Machines or Azure SQL Database.
de: Ermitteln Sie die Migrationsbereitschaft Ihrer SQL Server-Instanzen, identifizieren Sie ein empfohlenes Azure SQL-Ziel, und schließen Sie die Migration Ihrer SQL Server-Instanz zu Azure SQL Managed Instance, SQL Server auf Azure Virtual Machines oder Azure SQL-Datenbank ab.
es: Determine la preparación de la migración de sus instancias de SQL Server, identifique un destino de Azure SQL recomendado y complete la migración de la instancia de SQL Server a Azure SQL Managed Instance, SQL Server en Azure Virtual Machines o Azure SQL Database.
fr: Déterminez la préparation de la migration de vos instances de SQL Server, identifiez une cible de Azure SQL recommandée et terminez la migration de votre instance de SQL Server vers Azure SQL Managed Instance, SQL Server sur des machines virtuelles Azure ou Azure SQL Database.
ja: SQL Server インスタンスの移行準備状況を判断し、推奨されるAzure SQLターゲットを特定し、SQL Server インスタンスの Azure SQL Managed Instance への移行、Azure Virtual Machines または Azure SQL Database でのSQL Serverを完了します。
ko: SQL Server 인스턴스의 마이그레이션 준비 상태를 확인하고, 권장되는 Azure SQL 대상을 식별하고, SQL Server 인스턴스를 Azure SQL Managed Instance, SQL Server on Azure Virtual Machines 또는 Azure SQL Database로 마이그레이션을 완료합니다.
pt_br: Determine a prontidão da migração de suas instâncias do SQL Server, identifique um destino de SQL do Azure recomendado e conclua a migração da sua instância do SQL Server para a Instância Gerenciada de SQL do Azure, SQL Server em Máquinas Virtuais do Azure ou Banco de Dados SQL do Azure.
ru: Определите готовность своих экземпляров SQL Server к миграции, определите рекомендуемую цель Azure SQL и завершите миграцию своего экземпляра SQL Server в Управляемый экземпляр SQL Azure, SQL Server на виртуальных машинах Azure или базу данных SQL Azure.
zh_hans: 确定 SQL Server 实例的迁移准备情况，确定建议的 Azure SQL 目标，并完成 SQL Server 实例向 Azure SQL 托管实例、Azure 虚拟机上的 SQL Server 或 Azure SQL 数据库的迁移。
zh_hant: 判斷您 SQL Server 執行個體的移轉整備度、識別建議的 Azure SQL 目標，並完成將您的 SQL Server 執行個體移轉到 Azure SQL 受控執行個體、Azure 虛擬機器上的 SQL Server 或 Azure SQL Database。

# sql.migration.restore.backuptype.differentialdatabase
source: Differential database
de: Differenzielle Datenbank
es: Base de datos diferencial
fr: Base de données différentielle
ja: 差分データベース
ko: 데이터베이스 차등
pt_br: Banco de dados diferencial
ru: Разностное копирование базы данных
zh_hans: 差异数据库
zh_hant: 差異資料庫

# sql.migration.restore.backuptype.differentialfile
source: Differential file
de: Differenzielle Datei
es: Archivo diferencial
fr: Fichier différentiel
ja: 差分ファイル
ko: 파일 차등
pt_br: Arquivo diferencial
ru: Разностное копирование файлов
zh_hans: 差异文件
zh_hant: 差異檔案

# sql.migration.restore.backuptype.differentialpartial
source: Differential partial
de: Teilweise differenziell
es: Parcial diferencial
fr: Différentiel partiel
ja: 部分的な差分
ko: 부분 차등
pt_br: Diferencial parcial
ru: Частичное разностное
zh_hans: 部分差异
zh_hant: 差異部份

# sql.migration.sku.storage.dimension
source: Dimension
es: Dimensión
ja: ディメンション
ko: 차원
pt_br: Dimensão
ru: Измерение
zh_hans: 维度
zh_hant: 維度

# sql.migration.cancel.feedback.dialog.description
source: Do you want to cancel migration? Your unsaved changes will be discarded.
de: Möchten Sie die Migration abbrechen? Ihre nicht gespeicherten Änderungen werden verworfen.
es: ¿Desea cancelar la migración? Se descartarán los cambios guardados.
fr: Voulez-vous annuler la migration ? Vos modifications non enregistrées seront ignorées.
ko: 마이그레이션을 취소하시겠습니까? 저장하지 않은 변경 내용은 취소됩니다.
ru: Отменить миграцию? Несохраненные изменения будут потеряны.
zh_hans: 是否要取消迁移?将丢弃未保存的更改。
zh_hant: 要取消移轉嗎?未儲存的變更將會捨棄。

# sql.retry.migration.prompt
source: Do you want to retry the failed table migrations?
de: Möchten Sie die fehlerhaften Tabellenmigrationen wiederholen?
es: ¿Desea reintentar las migraciones de tablas con errores?
fr: Voulez-vous réessayer les migrations de table ayant échoué ?
ja: 失敗したテーブルの移行を再試行しますか?
ko: 실패한 테이블 마이그레이션을 다시 시도하시겠습니까?
pt_br: Deseja repetir as migrações de tabela com falha?
ru: Повторить миграцию таблиц со сбоем?
zh_hans: 是否要重试失败的表迁移?
zh_hant: 您是否要重試失敗的資料表移轉?

# sql.migration.windows.user.account
source: Domain\username
de: Domäne\Benutzername
es: Dominio\nombre de usuario
fr: Domaine\nom d'utilisateur
ja: ドメイン\ユーザー名
ko: 도메인\사용자 이름
pt_br: Domínio\nome de usuário
ru: Домен\имя_пользователя
zh_hans: 域\用户名
zh_hant: 網域\使用者名稱

# sql.migration.tde.migrate.done.button
source: Done
de: Fertig
es: Hecho
fr: Terminé
ja: 完了
ko: 완료
pt_br: Concluído
ru: Готово
zh_hans: 完成
zh_hant: 完成

# sql.migration.validate.ir.done.button
source: Done
de: Fertig
es: Listo
fr: Terminé
ja: 完了
ko: 완료
pt_br: Concluído
ru: Готово
zh_hans: 完成
zh_hant: 完成

# sql.migration.option
source: Download and install integration runtime
de: Laden Sie die Integration Runtime herunter, und installieren Sie sie.
es: Descargue e instale el entorno de ejecución de integración.
fr: Télécharger et installer le runtime d'intégration
ja: 統合ランタイムのダウンロードとインストール
ko: 통합 런타임 다운로드 및 설치
pt_br: Baixar e instalar o runtime de integração
ru: Скачайте и установите среду выполнения интеграции.
zh_hans: 下载并安装集成运行时
zh_hant: 下載並安裝整合執行階段

# sql.migration.duration
source: Duration
de: Dauer
es: Duración
fr: Durée
ja: 時間
ko: 기간
pt_br: Duração
ru: Длительность
zh_hans: 持续时间
zh_hant: 持續時間

# sql.migration.parallel.copy.type.dynamic
source: Dynamic range
de: Dynamischer Bereich
es: Intervalo dinámico
fr: Plage dynamique
ja: 動的範囲
ko: 동적 범위
pt_br: Intervalo dinâmico
ru: Динамический диапазон
zh_hans: 动态范围
zh_hant: 動態範圍

# sql.migration.tde.button.caption
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 편집
pt_br: Editar
ru: Изменить
zh_hans: 编辑
zh_hant: 編輯

# sql.migration.table.selection.edit
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 편집
pt_br: Editar
ru: Изменить
zh_hans: 编辑
zh_hant: 編輯

# sql.migration.sku.parameters.edit
source: Edit parameters
de: Parameter bearbeiten
es: Editar parámetros
fr: Modifier les paramètres
ja: パラメーターの編集
ko: 매개 변수 편집
pt_br: Editar os parâmetros
ru: Изменить параметры
zh_hans: 编辑参数
zh_hant: 編輯參數

# sql.migration.sku.parameters.edit.title
source: Edit recommendation parameters
de: Empfehlungsparameter bearbeiten
es: Editar los parámetros de recomendación
fr: Modifier les paramètres de recommandation
ja: レコメンデーション パラメーターの編集
ko: 권장 사항 매개 변수 편집
pt_br: Editar os parâmetros de recomendação
ru: Изменить параметры рекомендаций
zh_hans: 编辑建议参数
zh_hant: 編輯建議參數

# sql.migration.sku.parameters.enable.elastic.info
source: Elastic recommendation uses an alternate recommendation model which utilizes personalized price-performance profiling against existing on-cloud customers.
de: Für die elastische Empfehlung wird ein alternatives Empfehlungsmodell verwendet, das eine personalisierte Preis-Leistungs-Profilerstellung für vorhandene Kunden in der Cloud verwendet.
es: La recomendación elástica usa un modelo de recomendación alternativo que usa la generación de perfiles de rendimiento de precios personalizados en los clientes en la nube existentes.
fr: La recommandation élastique utilise un autre modèle de recommandation qui utilise un profilage personnalisé des performances tarifaires par rapport aux clients existants sur le cloud.
ja: エラスティック レコメンデーションでは、既存のクラウド顧客に対してパーソナライズされた価格パフォーマンス プロファイリングを利用する代替の推奨モデルが使用されます。
ko: 탄력적 권장 사항은 기존 온클라우드 고객에 대한 개인 설정된 가격 대비 성능 프로파일링을 활용하는 대체 추천 모델을 사용합니다.
pt_br: A recomendação elástica utiliza um modelo alternativo de recomendação que utiliza um perfil de preço-desempenho personalizado em relação aos clientes existentes na nuvem.
ru: Эластичная рекомендация использует альтернативную модель рекомендаций, которая использует персонализированное профилирование цены и производительности по сравнению с существующими клиентами в облаке.
zh_hans: 弹性建议使用替代建议模型，该模型针对现有的云客户使用个性化的性价比分析。
zh_hant: 彈性建議使用替代建議模型，其針對現有的雲端客戶使用個人化的價格效能分析。
