Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# mssql.parallelMessageProcessingLimit
source: Maximum number of requests that should be handled in parallel by the backend SQL Tools Service. This brings performance benefits to MSSQL queries and connections. This limit is applicable only when `MSSQL: Parallel Message Processing` is enabled. The default value is 100, and can be adjusted as needed as per OS support. Azure Data Studio is required to be relaunched when the value is changed.
de: Maximale Anzahl von Anforderungen, die von der Back-End-Instanz von SQL Tools Service parallel verarbeitet werden sollen. Dies bietet Leistungsvorteile für MSSQL-Abfragen und -Verbindungen. Dieser Grenzwert gilt nur, wenn "MSSQL: Parallele Nachrichtenverarbeitung" aktiviert ist. Der Standardwert ist 100 und kann der Betriebssystemunterstützung entsprechend nach Bedarf angepasst werden. Azure Data Studio muss nach dem Ändern des Werts neu gestartet werden.
es: Número máximo de solicitudes que el servicio de herramientas de SQL de back-end debe controlar en paralelo. Esto aporta ventajas de rendimiento a las consultas y conexiones de MSSQL. Este límite solo es aplicable cuando está habilitado "MSSQL: Procesamiento de mensajes paralelos". El valor predeterminado es 100 y se puede ajustar según sea necesario según la compatibilidad con el sistema operativo. Azure Data Studio es necesario volver a iniciar cuando se cambia el valor.
fr: Nombre maximum de requêtes qui doivent être traitées en parallèle par le service SQL Tools back-end. Cela apporte des avantages en termes de performances aux requêtes et connexions MSSQL. Cette limite s'applique uniquement lorsque « MSSQL : traitement parallèle des messages » est activé. La valeur par défaut est 100 et peut être ajustée selon les besoins selon la prise en charge du système d'exploitation. Azure Data Studio doit être relancé lorsque la valeur est modifiée.
it: Numero massimo di richieste che devono essere gestite in parallelo dal servizio strumenti SQL di back-end. Ciò offre vantaggi a livello di prestazioni per le query e le connessioni MSSQL. Questo limite è applicabile solo quando è abilitato 'MSSQL: Parallel Message Processing'. Il valore predefinito è 100 e può essere modificato secondo le necessità in base al supporto del sistema operativo. È necessario riavviare Azure Data Studio quando il valore viene modificato.
ja: バックエンド SQL Tools サービスが並列で処理する必要がある要求の最大数。これにより、MSSQL クエリと接続にパフォーマンス上の利点がもたらされます。この制限は、'MSSQL: 並列メッセージ処理' が有効な場合にのみ適用されます。既定値は 100 で、OS のサポートに応じて必要に応じて調整できます。Azure Data Studio は、値が変更されたときに再起動する必要があります。
ko: 백 엔드 SQL Tools Service에서 병렬로 처리해야 하는 최대 요청 수입니다. 이렇게 하면 MSSQL 쿼리 및 연결에 성능상의 이점이 있습니다. 이 제한은 'MSSQL: 병렬 메시지 처리'를 사용하도록 설정한 경우에만 적용됩니다. 기본값은 100이며 OS 지원에 따라 필요에 따라 조정할 수 있습니다. 값이 변경되면 Azure Data Studio를 다시 시작해야 합니다.
pt_br: Número máximo de solicitações que devem ser tratadas em paralelo pelo Serviço de Ferramentas SQL de back-end. Isso traz benefícios de desempenho para consultas e conexões MSSQL. Esse limite é aplicável somente quando “MSSQL: Processamento de Mensagens paralelas” está habilitado. O valor padrão é 100 e pode ser ajustado conforme necessário de acordo com o suporte do Sistema Operacional. O Azure Data Studio deve ser reinicializado quando o valor é alterado.
ru: Максимальное число запросов, которые должны обрабатываться параллельно внутренней службой SQL Tools. Это повышает производительность запросов и соединений MSSQL. Это ограничение применимо, только если включена опция "MSSQL: параллельная обработка сообщений". Значение по умолчанию — 100, и его можно изменять по мере необходимости в соответствии с поддержкой ОС. Azure Data Studio необходимо перезапустить при изменении значения.
zh_hans: 后端 SQL 工具服务应并行处理的最大请求数。这会为 MSSQL 查询和连接带来性能优势。仅当启用了`MSSQL: Parallel Message Processing`时，此限制才适用。默认值为 100，可以根据 OS 支持根据需要进行调整。更改值时，需要重新启动 Azure Data Studio。
zh_hant: 後端 SQL Tools Service 應該平行處理的要求數目上限。這會為 MSSQL 查詢和連線帶來效能優點。只有在啟用 `MSSQL: Parallel Message Processing` 時，才適用此限制。預設值為 100，而且可以按照作業系統支援來調整。值變更時，需要重新啟動 Azure Data Studio。

# mssql.query.setRowCount
source: Maximum number of rows to return before the server stops processing your query.
de: Maximale Anzahl von Zeilen, die zurückgegeben werden sollen, bevor der Server die Verarbeitung Ihrer Abfrage beendet.
es: Número máximo de filas para devolver antes de que el servidor deje de procesar la consulta.
fr: Nombre maximal de lignes à retourner avant que le serveur arrête le traitement de votre requête.
it: Numero massimo di righe da restituire prima che il server arresti l'elaborazione della query.
ja: サーバーがクエリの処理を停止する前に返す行の最大数。
ko: 서버가 쿼리 처리를 중지하기 전에 반환할 최대 행 수입니다.
pt_br: O número máximo de linhas a serem retornadas antes que o servidor pare de processar sua consulta.
ru: Максимальное число строк, которые будут возвращены перед тем, как сервер перестанет обрабатывать ваш запрос.
zh_hans: 在服务器停止处理查询之前要返回的最大行数。
zh_hant: 要在伺服器停止處理查詢前傳回的資料列數上限。

# mssql.query.textSize
source: Maximum size of text and ntext data returned from a SELECT statement
de: Maximale Größe von text- und ntext-Daten, die von einer SELECT-Anweisung zurückgegeben werden
es: Tamaño máximo del texto y datos de ntext devueltos por una instrucción SELECT
fr: Taille maximale des données text et ntext retournées par une instruction SELECT
it: Dimensioni massime dei dati di tipo text e ntext restituiti da un'istruzione SELECT
ja: SELECT ステートメントから返されるテキストおよび ntext データの最大サイズ
ko: SELECT 문에서 반환되는 text 및 ntext 데이터의 최대 크기
pt_br: O tamanho máximo de dados text e ntext retornados de uma instrução SELECT
ru: Максимальный размер текста и данных ntext, возвращаемых инструкцией SELECT
zh_hans: 从 SELECT 语句返回的 text 和 ntext 数据的大小上限
zh_hant: SELECT 陳述式所傳回 text 與 Ntext 資料的大小上限

# mssql.connectionOptions.authType.categoryValues.azureMFA
source: Microsoft Entra ID - Universal with MFA support
de: Microsoft Entra ID – Universell mit MFA-Unterstützung
es: Microsoft Entra ID: Universal con soporte MFA
fr: Microsoft Entra ID – Universel avec prise en charge MFA
it: ID Microsoft Entra - Universale con supporto MFA
ja: Microsoft Entra ID - MFA サポート付きユニバーサル
ko: Microsoft Entra ID - MFA 지원으로 유니버설
pt_br: Microsoft Entra ID - Universal com suporte para MFA
ru: Microsoft Entra ID — универсальный с поддержкой MFA
zh_hans: Microsoft Entra ID - 具有 MFA 支持的通用
zh_hant: Microsoft Entra ID - 通用與 MFA 支援

# mssql.connectionOptions.minPoolSize.displayName
source: Min pool size
de: Minimale Poolgröße
es: Tamaño mínimo del grupo
fr: Taille minimale du pool
it: Dimensioni minime del pool
ja: 最小プール サイズ
ko: 최소 풀 크기
pt_br: Tamanho mínimo do pool
ru: Минимальный размер пула
zh_hans: 最小池大小
zh_hant: 集區大小下限

# mssql.connectionOptions.multiSubnetFailover.displayName
source: Multi subnet failover
de: Multisubnetzfailover
es: Conmutación por error de varias subredes
fr: Basculement de plusieurs sous-réseaux
it: Failover su più subnet
ja: マルチ サブネット フェールオーバー
ko: 다중 서브넷 장애 조치(failover)
pt_br: Failover de várias sub-redes
ru: Отработка отказа в нескольких подсетях
zh_hans: 多子网故障转移
zh_hant: 多重子網路容錯移轉

# mssql.connectionOptions.multipleActiveResultSets.displayName
source: Multiple active result sets
de: Mehrere aktive Resultsets
es: Conjuntos de resultados activos múltiples (MARS)
fr: MARS (Multiple Active Result Set)
it: Multiple Active Result Set
ja: 複数のアクティブな結果セット
ko: 여러 개의 활성 결과 집합
pt_br: Conjuntos de resultados ativos múltiplos
ru: Множественные активные результирующие наборы
zh_hans: 多重活动结果集
zh_hant: Multiple Active Result Set

# objectsListProperties.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# databasesListProperties.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# mssql.connectionOptions.connectionName.displayName
source: Name (optional)
es: Nombre (opcional)
fr: Nom (facultatif)
it: Nome (facoltativo)
ja: 名前 (省略可能)
ko: 이름(선택 사항)
pt_br: Nome (opcional)
ru: Имя (необязательно)
zh_hans: 名称(可选)
zh_hant: 名稱 (選用)

# mssql.connectionOptions.serverName.description
source: Name of the SQL Server instance
de: Name der SQL Server-Instanz
es: Nombre de la instancia de SQL Server
fr: Nom de l'instance SQL Server
it: Nome dell'istanza di SQL Server
ja: SQL Server インスタンスの名前
ko: SQL Server 인스턴스의 이름
pt_br: Nome da instância do SQL Server
ru: Имя экземпляра SQL Server
zh_hans: SQL Server 实例的名称
zh_hant: SQL Server 執行個體的名稱

# title.newApplicationRole
source: New Application Role (Preview)
de: Neue Anwendungsrolle (Vorschau)
es: Nuevo rol de aplicación (versión preliminar)
fr: Nouveau rôle d’application (préversion)
it: Nuovo ruolo applicazione (anteprima)
ja: 新しいアプリケーション ロール (プレビュー)
ko: 새 애플리케이션 역할(미리 보기)
pt_br: Nova função de aplicativo (versão prévia)
ru: Новая роль приложения (предварительная версия)
zh_hans: 新应用程序角色(预览版)
zh_hant: 新增應用程式角色 (預覽)

# title.newDatabase
source: New Database (Preview)
de: Neue Datenbank (Vorschau)
es: Nueva base de datos (versión preliminar)
fr: Base de données KQL (préversion)
it: Nuovo database (anteprima)
ja: 新しいデータベース (プレビュー)
ko: 새 데이터베이스(미리 보기)
pt_br: Novo Banco de Dados (Versão Prévia)
ru: Новая база данных (предварительная версия)
zh_hans: 新建数据库 (预览版)
zh_hant: 新資料庫 (預覽)

# title.newDatabaseRole
source: New Database Role (Preview)
de: Neue Datenbankrolle (Vorschau)
es: Nuevo rol de base de datos (versión preliminar)
fr: Nouveau rôle de base de données (préversion)
it: Nuovo ruolo del database (anteprima)
ja: 新しいデータベース ロール (プレビュー)
ko: 새 데이터베이스 역할(미리 보기)
pt_br: Nova função do banco de dados (versão prévia)
ru: Новая роль базы данных (предварительная версия)
zh_hans: 新数据库角色(预览版)
zh_hant: 新增資料庫角色 (預覽)

# title.newLogin
source: New Login (Preview)
de: Neue Anmeldung (Vorschau)
es: Nuevo inicio de sesión (versión preliminar)
fr: Nouvelle connexion (préversion)
it: Nuovo account di accesso (anteprima)
ja: 新しいログイン (プレビュー)
ko: 새 로그인(미리 보기)
pt_br: Novo logon (versão prévia)
ru: Новый вход в систему (предварительная версия)
zh_hans: 新登录(预览版)
zh_hant: 新增登入 (預覽)

# title.newServerRole
source: New Server Role (Preview)
de: Neue Serverrolle (Vorschau)
es: Nuevo rol de servidor (versión preliminar)
fr: Nouveau rôle serveur (préversion)
it: Nuovo ruolo server (anteprima)
ja: 新しいサーバー ロール (プレビュー)
ko: 새 서버 역할(미리 보기)
pt_br: Nova função de servidor (versão prévia)
ru: Новая роль сервера (предварительная версия)
zh_hans: 新服务器角色(预览版)
zh_hant: 新增伺服器角色 (預覽)

# title.newTable
source: New Table
de: Neue Tabelle
es: Nueva tabla
fr: Nouvelle table
it: Nuova tabella
ja: 新しいテーブル
ko: 새 테이블
pt_br: Nova Tabela
ru: Создать таблицу
zh_hans: 新建表
zh_hant: 新增資料表

# title.newUser
source: New User (Preview)
de: Neuer Benutzer (Vorschau)
es: Nuevo usuario (versión preliminar)
fr: Nouvel utilisateur (préversion)
it: Nuovo utente (anteprima)
ja: 新しいユーザー (プレビュー)
ko: 새 사용자(미리 보기)
pt_br: Novo usuário (versão prévia)
ru: Новый пользователь (предварительная версия)
zh_hans: 新用户(预览版)
zh_hant: 新增使用者 (預覽)

# mssql.connectionOptions.enclaveAttestationProtocol.categoryValues.None
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
it: Nessuno
ja: なし
ko: 없음
pt_br: Nenhum
ru: Нет
zh_hans: 无
zh_hant: 無

# mssql.connectionOptions.connectRetryCount.description
source: Number of attempts to restore connection
de: Anzahl der Versuche zur Verbindungswiederherstellung
es: Número de intentos para restaurar la conexión
fr: Nombre de tentatives de restauration de connexion
it: Numero di tentativi di ripristino della connessione
ja: 接続を復元するための試行回数
ko: 연결 복구 시도의 횟수
pt_br: Número de tentativas para restaurar a conexão
ru: Число попыток восстановления подключения
zh_hans: 尝试还原连接的次数
zh_hant: 嘗試還原連線的次數

# mssql.logRetentionMinutes
source: Number of minutes to retain log files for backend services. Default is 1 week.
de: Anzahl von Minuten, für die Protokolldateien für Back-End-Dienste aufbewahrt werden sollen. Der Standardwert ist 1 Woche.
es: Número de minutos para conservar los archivos de registro para los servicios back-end. El valor predeterminado es 1 semana.
fr: Nombre de minutes de conservation des fichiers journaux pour les services de back-end. La durée par défaut est 1 semaine.
it: Numero di minuti per la conservazione dei file di log per i servizi di back-end. L'impostazione predefinita è 1 settimana.
ja: バックエンド サービスのログ ファイルを保持する分単位の時間。既定値は 1 週間です。
ko: 백 엔드 서비스의 로그 파일을 유지하는 시간(분)입니다. 기본값은 1주일입니다.
pt_br: O número de minutos para reter os arquivos de log dos serviços de back-end. O padrão é uma semana.
ru: Срок хранения файлов журналов (в минутах) для серверных служб. По умолчанию задана 1 неделя.
zh_hans: 将后端服务的日志文件保留的时长(分钟数)。默认为 1 周。
zh_hant: 為後端服務保留記錄檔的分鐘數。預設為 1 週。

# onprem.serverProperties.osVersion
source: OS Version
de: Betriebssystemversion
es: Versión del sistema operativo
fr: Version de système d'exploitation
it: Versione del sistema operativo
ja: OS バージョン
ko: OS 버전
pt_br: Versão do Sistema Operacional
ru: Версия ОС
zh_hans: OS 版本
zh_hant: 作業系統版本

# mssql.connectionOptions.encrypt.categoryValues.false
source: Optional
es: Opcional
fr: Facultatif
it: Facoltativo
ja: オプション
ko: 선택적
pt_br: Opcional
ru: Необязательно
zh_hans: 可选
zh_hant: 選擇性

# cloud.databaseProperties.owner
source: Owner
de: Besitzer
es: Propietario
fr: Propriétaire
it: Proprietario
ja: 所有者
ko: 소유자
pt_br: Proprietário
ru: Владелец
zh_hans: 所有者
zh_hant: 擁有者

# onprem.databaseProperties.owner
source: Owner
de: Besitzer
es: Propietario
fr: Propriétaire
it: Proprietario
ja: 所有者
ko: 소유자
pt_br: Proprietário
ru: Владелец
zh_hans: 所有者
zh_hant: 擁有者

# mssql.connectionOptions.packetSize.displayName
source: Packet size
de: Paketgröße
es: Tamaño del paquete
fr: Taille de paquet
it: Dimensioni del pacchetto
ja: パケット サイズ
ko: 패킷 크기
pt_br: Tamanho do pacote
ru: Размер пакета
zh_hans: 数据包大小
zh_hant: 封包大小

# mssql.connectionOptions.password.displayName
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# mssql.connectionOptions.persistSecurityInfo.displayName
source: Persist security info
de: Sicherheitsinformationen dauerhaft speichern
es: Información de seguridad persistente
fr: Conserver les informations de sécurité
it: Salva in modo permanente le informazioni di sicurezza
ja: セキュリティ情報を保持する
ko: 보안 정보 유지
pt_br: Persistir as informações de segurança
ru: Сохранение сведений о безопасности
zh_hans: 持久安全信息
zh_hant: 持續安全性資訊

# mssql.connectionOptions.groupName.pooling
source: Pooling
es: Agrupación
fr: Regroupement
ja: プーリング
ko: 풀링
ru: Объединение в пул
zh_hans: 池
zh_hant: 共用

# mssql.connectionOptions.pooling.displayName
source: Pooling
es: Agrupación
fr: Regroupement
ja: プーリング
ko: 풀링
ru: Объединение в пул
zh_hans: 池
zh_hant: 共用

# mssql.connectionOptions.port.displayName
source: Port
es: Puerto
it: Porta
ja: ポート
ko: 포트
pt_br: Porta
ru: Порт
zh_hans: 端口
zh_hant: 連接埠

# cloud.databaseProperties.serviceLevelObjective
source: Pricing Tier
de: Tarif
es: Plan de tarifa
fr: Niveau tarifaire
it: Piano tariffario
ja: 価格レベル
ko: 가격 책정 계층
pt_br: Tipo de Preço
ru: Ценовая категория
zh_hans: 定价层
zh_hant: 定價層

# title.objectProperties
source: Properties (Preview)
de: Eigenschaften (Vorschau)
es: Propiedades (versión preliminar)
fr: Propriétés (Préversion)
it: Proprietà (anteprima)
ja: プロパティ (プレビュー)
ko: 속성(미리 보기)
pt_br: Propriedades (Versão prévia)
ru: Свойства (предварительная версия)
zh_hans: 属性(预览版)
zh_hant: 屬性 (預覽)

# onprem.databaseProperties.recoveryModel
source: Recovery Model
de: Wiederherstellungsmodell
es: Modelo de recuperación
fr: Mode de récupération
it: Modello di recupero
ja: 復旧モデル
ko: 복구 모델
pt_br: Modelo de Recuperação
ru: Модель восстановления
zh_hans: 恢复模式
zh_hant: 復原模式

# title.renameObject
source: Rename (Preview)
de: Umbenennen (Vorschau)
es: Cambiar nombre (versión preliminar)
fr: Renommer (Aperçu)
it: Rinomina (anteprima)
ja: 名前の変更 (プレビュー)
ko: 이름 바꾸기(미리 보기)
pt_br: Renomear (Versão Prévia)
ru: Переименовать (предварительная версия)
zh_hans: 重命名 (预览)
zh_hant: 重新命名 (預覽)

# mssql.connectionOptions.groupName.replication
source: Replication
de: Replikation
es: Replicación
fr: Réplication
it: Replica
ja: レプリケーション
ko: 복제
pt_br: Replicação
ru: Репликация
zh_hans: 副本
zh_hant: 複寫

# mssql.connectionOptions.replication.displayName
source: Replication
de: Replikation
es: Replicación
fr: Réplication
it: Replica
ja: レプリケーション
ko: 복제
pt_br: Replicação
ru: Репликация
zh_hans: 副本
zh_hant: 複寫

# title.restoreDatabase
source: Restore Database (Preview)
de: Datenbank wiederherstellen (Vorschau)
es: Restaurar base de datos (versión preliminar)
fr: Restaurer la base de données (préversion)
it: Ripristina database (anteprima)
ja: データベースの復元 (プレビュー)
ko: 데이터베이스 복원 (미리 보기)
pt_br: Restaurar o Banco de Dados (Versão Prévia)
ru: Восстановление базы данных (предварительная версия)
zh_hans: 还原数据库(预览版)
zh_hant: 還原資料庫 (預覽)

# mssql.connectionOptions.authType.categoryValues.sqlLogin
source: SQL Login
de: SQL-Anmeldung
es: Inicio de sesión SQL
fr: Connexion SQL
it: Account di accesso SQL
ja: SQL ログイン
ko: SQL 로그인
pt_br: Login do SQL
ru: Имя входа SQL
zh_hans: SQL 登录
zh_hant: SQL 登入

# mssql.objectExplorer.disableGroupBySchemaTitle
source: SQL Server: Disable Group By Schema
de: SQL Server: „Nach Schema gruppieren“ deaktivieren
es: SQL Server: deshabilitar Agrupar por esquema
fr: SQL Server : désactiver le regroupement par schéma
it: SQL Server: disabilitare raggruppamento per schema
ja: SQL Server: スキーマによるグループの無効化
ko: SQL Server: 스키마별 그룹화 비활성화
pt_br: SQL Server: Desabilitar Agrupar por Esquema
ru: SQL Server: отключить группирование по схеме
zh_hans: SQL Server: 禁用分组依据架构
zh_hant: SQL Server: 依結構描述停用群組

# mssql.objectExplorer.enableGroupBySchemaTitle
source: SQL Server: Enable Group By Schema
de: SQL Server: „Nach Schema gruppieren“ aktivieren
es: SQL Server: habilitar Agrupar por esquema
fr: SQL Server : Activer le schéma Grouper par
it: SQL Server: abilitare raggruppamento per schema
ja: SQL Server: スキーマによるグループの有効化
ko: SQL Server: 스키마별 그룹화 사용
pt_br: SQL Server: Habilitar Agrupar por Esquema
ru: SQL Server: включить группирование по схеме
zh_hans: SQL Server: 按架构启用分组
zh_hant: SQL Server: 依結構描述啟用群組

# title.clearSearchServerResult
source: Search: Clear Search Server Results
de: Suche: Suchserverergebnisse löschen
es: Buscar: Borrar los resultados del servidor de búsqueda
fr: Recherche : Effacer les résultats du serveur de recherche
it: Ricerca: Cancella risultati del server di ricerca
ja: 検索: 検索サーバーの結果を消去する
ko: 검색: 검색 서버 결과 지우기
pt_br: Pesquisar: Limpar os Resultados do Search Server
ru: Поиск: очистить результаты поиска сервера
zh_hans: 搜索: 清除搜索服务器结果
zh_hant: 搜尋: 清除搜尋伺服器結果

# title.searchServers
source: Search: Servers
de: Suche: Server
es: Buscar: Servidores
fr: Recherche : Serveurs
it: Ricerca: Server
ja: 検索: サーバー
ko: 검색: 서버
pt_br: Pesquisar: Servidores
ru: Поиск: серверы
zh_hans: 搜索: 服务器
zh_hant: 搜尋: 伺服器

# mssql.connectionOptions.secureEnclaves.displayName
source: Secure enclaves
de: Sichere Enklaven
es: Enclaves seguros
fr: Enclaves sécurisées
it: Enclave sicuri
ja: セキュリティで保護されたエンクレーブ
ko: 보안 enclave
pt_br: Enclaves seguros
ru: Защищенные анклавы
zh_hans: 安全 enclave
zh_hant: 安全記憶體保護區

# mssql.connectionOptions.groupName.security
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
it: Sicurezza
ja: セキュリティ
ko: 보안
pt_br: Segurança
ru: Безопасность
zh_hans: 安全性
zh_hant: 安全性

# mssql.connectionOptions.serverName.displayName
source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器

# mssql.provider.serverProcessId
source: Server Process ID
de: Serverprozess-ID
es: Id. de proceso del servidor
fr: ID de processus serveur
it: ID processo server
ja: サーバー プロセス ID
ko: 서버 프로세스 ID
pt_br: ID de processo do servidor
ru: Идентификатор серверного процесса
zh_hans: 服务器进程 ID
zh_hant: 伺服器處理序識別碼

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
de: BIT-Spalten als Zahlen (1 oder 0) anzeigen? Bei Festlegung auf FALSE werden BIT-Spalten als TRUE oder FALSE angezeigt.
es: ¿Deben mostrarse las columnas BIT como números (1 o 0)? Si es false, las columnas BIT se mostrarán como "true" o "false".
fr: Spécifie si les colonnes BIT doivent être affichées sous forme de nombre (1 ou 0). Si la valeur est false, les colonnes BIT sont affichées sous la forme 'true' ou 'false'
it: Consente di indicare se le colonne di tipo BIT devono essere visualizzate come numeri (1 o 0). Se è 'false', verranno visualizzate come 'true' o 'false'
ja: ビット列を数値 (1 または 0) として表示するかどうか。False の場合、ビット列は 'true' または 'false' として表示されます
ko: BIT 열을 숫자(1 또는 0)로 표시할지 여부. False이면 BIT 열을 'true' 또는 'false'로 표시합니다.
pt_br: Colunas do tipo BIT devem ser exibidas como números (1 ou 0)? Se false, colunas do tipo BIT serão exibidas como 'true' ou 'false'
ru: Нужно ли отображать столбцы BIT как числа (1 или 0)? Если задано значение FALSE, столбцы BIT будут отображаться как "TRUE" или "FALSE"
zh_hans: 是否应将 BIT 列显示为数字(1 或 0)? 若否，则 BIT 列将显示为 "true" 或 "false"
zh_hant: BIT 資料行是否顯示為數字 (1 或 0)? 若為 False，BIT 資料行將會顯示為 'True' 或 'False'

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
de: Gibt an, ob IntelliSense aktiviert werden soll.
es: Indica si debe habilitarse IntelliSense.
fr: Indique s'il faut activer IntelliSense
it: Consente di indicare se IntelliSense deve essere abilitato
ja: IntelliSense を有効にするかどうか
ko: IntelliSense 사용 여부
pt_br: O IntelliSense deve estar habilitado?
ru: Должен ли быть включен IntelliSense
zh_hans: 是否应启用 IntelliSense
zh_hant: 是否啟用 IntelliSense

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
de: Gibt an, ob die IntelliSense-Fehlerüberprüfung aktiviert werden soll.
es: Indica si debe habilitarse la comprobación de errores de IntelliSense.
fr: Indique s'il faut activer la vérification des erreurs IntelliSense
it: Consente di indicare se il controllo degli errori di IntelliSense deve essere abilitato
ja: IntelliSense エラー チェックを有効にするかどうか
ko: IntelliSense 오류 검사 사용 여부
pt_br: A verificação de erros do IntelliSense deve estar habilitada?
ru: Должна ли быть включена проверка ошибок IntelliSense
zh_hans: 是否应启用 IntelliSense 错误检查
zh_hant: 是否啟用 IntelliSense 錯誤檢查

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
de: Gibt an, ob IntelliSense-QuickInfo aktiviert werden soll.
es: Indica si debe habilitarse la información rápida de IntelliSense.
fr: Indique s'il faut activer Info express IntelliSense
it: Consente di indicare se le informazioni rapide di IntelliSense devono essere abilitate
ja: IntelliSense クイック ヒントを有効にするかどうか
ko: IntelliSense 빠른 정보 사용 여부
pt_br: As informações rápidas do IntelliSense devem estar habilitadas?
ru: Должны ли быть включены краткие сведения IntelliSense
zh_hans: 是否应启用 IntelliSense 快速信息
zh_hant: 是否啟用 IntelliSense 快速諮詢

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
de: Gibt an, ob IntelliSense-Vorschläge aktiviert werden sollen.
es: Indica si deben habilitarse las sugerencias de IntelliSense.
fr: Indique s'il faut activer les suggestions IntelliSense
it: Consente di indicare se i suggerimenti IntelliSense devono essere abilitati
ja: IntelliSense 提案を有効にするかどうか
ko: IntelliSense 제안 사용 여부
pt_br: As sugestões do IntelliSense devem ser habilitadas?
ru: Должны ли быть включены подсказки IntelliSense
zh_hans: 是否应启用 IntelliSense 建议
zh_hant: 是否啟用 IntelliSense 建議
