Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# objectManagement.denyColumnHeader
source: Deny
de: Verweigern
es: Denegar
fr: Refuser
it: Nega
ja: 拒否
ko: 거부
pt_br: Negar
ru: Запретить
zh_hans: 拒绝
zh_hant: 拒絕

# objectManagement.restoreDatabase.DestinationSectionText
source: Destination
de: Ziel
es: Destino
it: Destinazione
ja: 宛先
ko: 대상
pt_br: Destino
ru: Назначение
zh_hans: 目标
zh_hant: 目的地

# objectManagement.detachButtonLabel
source: Detach
de: Trennen
es: Desasociar
fr: Détacher
it: Scollega
ja: デタッチ
ko: 분리
pt_br: Desanexar
ru: Отключить
zh_hans: 拆离
zh_hant: 中斷連結

# objectManagement.detachDatabaseDialogTitle
source: Detach Database - {0} (Preview)
de: Datenbank trennen – {0} (Vorschau)
es: Desvincular base de datos -{0} (versión preliminar)
fr: Détacher la base de données - {0} (préversion)
it: Scollega database - {0} (anteprima)
ja: データベースのデタッチ - {0} (プレビュー)
ko: 데이터베이스 분리 - {0} (미리 보기)
pt_br: Desanexar Banco de Dados - {0} (Versão Prévia)
ru: Отсоединения базы данных — {0} (предварительная версия)
zh_hans: 拆离数据库 - {0}(预览版)
zh_hant: 卸離資料庫 - {0} (預覽)

# objectManagement.detachDatabaseOptions
source: Detach Database Options
de: Optionen zum Trennen von Datenbanken
es: Opciones de eliminación de bases de datos
fr: Détacher les options de base de données
it: Opzioni di scollegamento del database
ja: データベースのデタッチ オプション
ko: 데이터베이스 분리 옵션
pt_br: Desanexar Opções de Banco de Dados
ru: Параметры отсоединения базы данных
zh_hans: 拆离数据库选项
zh_hant: 卸離資料庫選項

# objectManagement.detachDatabaseOperationName
source: Detach database '{0}'
de: Datenbank "{0}" trennen
es: Desasociar base de datos "{0}"
fr: Détacher la base de données '{0}'
it: Rimuovi il database '{0}'
ja: データベースのデタッチ '{0}'
ko: ‘{0}’ 데이터베이스 분리
pt_br: Desanexar banco de dados "{0}"
ru: Отсоединение базы данных {0}
zh_hans: 分离数据库“{0}”
zh_hant: 將資料庫 '{0}' 中斷連結

# objectManagement.backupDifferential
source: Differential
de: Differenziell
es: Diferencial
fr: Différentielle
it: Differenziale
ja: 差分
ko: 차등
pt_br: Diferencial
ru: Разностное
zh_hans: 差异
zh_hant: 差異

# objectManagement.backupDiskLabel
source: Disk
de: Datenträger
es: Disco
fr: Disque
it: Disco
ja: ディスク
ko: 디스크
ru: Диск
zh_hans: 磁盘
zh_hant: 磁碟

# objectManagement.dontCompressBackup
source: Do not compress backup
de: Sicherung nicht komprimieren
es: No comprimir copia de seguridad
fr: Ne pas compresser la sauvegarde
it: Non comprimere il backup
ja: バックアップを圧縮しない
ko: 백업 압축 안 함
pt_br: Não compactar backup
ru: Не сжимать резервные копии
zh_hans: 不压缩备份
zh_hant: 不要壓縮備份

# objectManagement.dropButtonLabel
source: Drop
de: Löschen
es: Quitar
fr: Déposer
it: Escludi
ja: 削除
ko: 삭제
pt_br: Remover
ru: Удалить
zh_hans: 放置
zh_hant: 刪除

# objectManagement.dropDatabaseDialogTitle
source: Drop Database - {0} (Preview)
de: Datenbank löschen: {0} (Vorschau)
es: Quitar base de datos: {0} (Versión preliminar)
fr: Supprimer la base de données - {0} (préversion)
it: Escludi database - {0} (anteprima)
ja: データベースの削除 ‐ {0} (プレビュー)
ko: 데이터베이스 삭제 - {0}(미리 보기)
pt_br: Descartar Banco de Dados: {0} (Versão Prévia)
ru: Удалить базу данных — {0} (предварительная версия)
zh_hans: 删除数据库 - {0}(预览版)
zh_hant: 刪除資料庫 - {0} (預覽)

# objectManagement.dropDatabaseOptions
source: Drop Database Options
de: Optionen zum Löschen von Datenbanken
es: Quitar opciones de base de datos
fr: Supprimer les options de base de données
it: Escludi opzioni database
ja: データベースの削除オプションの設定
ko: 데이터베이스 옵션 삭제
pt_br: Remover Opções de Banco de Dados
ru: Параметры удаления базы данных
zh_hans: 删除数据库选项
zh_hant: 刪除資料庫選項

# objectManagement.detachDropConnections
source: Drop connnections
de: Ablageverbindungen
es: Colocación de conexiones
fr: Supprimer les connexions
it: Eliminare le connessioni
ja: 接続の削除
ko: 연결 삭제
pt_br: Remover conotações
ru: Удалить подключения
zh_hans: 删除连接
zh_hant: 卸載連線

# objectManagement.dropObjectOperationName
source: Drop {0} '{1}'
de: {0} "{1}" löschen
es: Quitar {0} '{1}'
fr: Supprimer {0} '{1}'
it: Escludi {0} '{1}'
ja: 削除 {0} '{1}'
ko: {0} '{1}' 삭제
pt_br: Remover {0} "{1}"
ru: Удалить {0} "{1}"
zh_hans: 删除 {0}“{1}”
zh_hant: 刪除 {0} '{1}'

# objectManagement.dropLoginConfirmation
source: Dropping server logins does not drop the database users associated with the logins. To complete the process, drop the users in each database. It may be necessary to first transfer the ownership of schemas to new users.
de: Durch das Löschen von Serveranmeldenamen werden nicht zugleich die den Anmeldenamen zugeordneten Datenbankbenutzer*innen gelöscht. Löschen Sie die Benutzer*innen in den einzelnen Datenbanken, um den Vorgang abzuschließen. Möglicherweise müssen Sie zuerst Schemabesitzrechte auf neue Benutzer*innen übertragen.
es: Al quitar los inicios de sesión del servidor, no se quitan los usuarios de base de datos asociados a los inicios de sesión. Para completar el proceso, quite los usuarios de cada base de datos. Puede ser necesario transferir primero la propiedad de los esquemas a los nuevos usuarios.
fr: La suppression des connexions au serveur ne supprime pas les utilisateurs de base de données associés aux connexions. Pour terminer le processus, supprimez les utilisateurs dans chaque base de données. Il peut être nécessaire de transférer d’abord la propriété des schémas aux nouveaux utilisateurs.
it: L'esclusione degli accessi ai server non comporta l'esclusione degli utenti di database associati agli accessi. Per completare l'operazione è necessario escludere gli utenti in ogni database. Potrebbe essere prima necessario trasferire la proprietà degli schemi a nuovi utenti.
ja: サーバー ログインを削除しても、そのログインに関連付けられたデータベース ユーザーは削除されません。処理を完了するには、各データベースでユーザーを削除してください。場合によっては、スキーマの所有権を新しいユーザーに移す必要があります。
ko: 서버 로그인을 삭제해도 로그인과 연결된 데이터베이스 사용자는 삭제되지 않습니다. 프로세스를 완료하려면 각 데이터베이스에 사용자를 삭제합니다. 먼저 스키마의 소유권을 새 사용자에게 이전해야 할 수 있습니다.
pt_br: A exclusão de logons do servidor não exclui os usuários de banco de dados associados aos logons. Para concluir o processo, exclua os usuários em cada banco de dados. Pode ser necessário primeiro transferir a propriedade de esquemas aos novos usuários.
ru: Удаление имен для входа на сервер не удаляет пользователей базы данных, связанных с этими именами для входа. Чтобы выполнить этот процесс, удалите пользователей в каждой базе данных. Возможно, необходимо сначала передать права владения схемами новым пользователям.
zh_hans: 删除服务器登录名并不会删除与该登录名关联的数据库用户。若要完成此过程，请在每个数据库中删除用户。可能需要首先将架构所有权转移到新用户。
zh_hant: 刪除伺服器登入不會刪除與登入相關聯的資料庫使用者。若要完成流程，請刪除每個資料庫中的使用者。可能必須先將結構描述的擁有權轉移給新使用者。

# objectManagement.databaseProperties.editButton
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
pt_br: Editar
ru: Изменить
zh_hans: 编辑
zh_hant: 編輯

# objectManagement.databaseProperties.editDatabaseFilesText
source: Edit Database file - {0}
de: Datenbankdatei bearbeiten – {0}
es: Editar archivo de base de datos - {0}
fr: Modifier le fichier de base de données – {0}
it: Modifica file di database - {0}
ja: データベース ファイルの編集 - {0}
ko: 데이터베이스 파일 편집 - {0}
pt_br: Editar o arquivo do Banco de Dados - {0}
ru: Изменить файл базы данных — {0}
zh_hans: 编辑数据库文件 - {0}
zh_hant: 編輯資料庫檔案 - {0}

# objectManagement.editionLabel
source: Edition
es: Edición
fr: Édition
it: Edizione
ja: エディション
ko: 버전
pt_br: Edição
ru: Выпуск
zh_hans: 版本
zh_hant: 版本

# objectManagement.effectivePermissionsTableLabel
source: Effective permissions for selected securable
de: Effektive Berechtigungen für ausgewählte sicherungsfähige Elemente
es: Permisos efectivos para el elemento protegible seleccionado
fr: Autorisations d’accès efficaces pour le sécurisable sélectionné
it: Autorizzazioni valide per l'entità a protezione diretta selezionata
ja: 選択したセキュリティ保護可能なリソースに対する有効なアクセス許可
ko: 선택한 보안 개체에 대한 유효 권한
pt_br: Permissões efetivas para protegível selecionado
ru: Действующие разрешения для выбранного защищаемого объекта
zh_hans: 所选安全对象的有效权限
zh_hant: 已選取安全性實體的有效權限

# objectManagement.effectivePermissionsTableLabelSelected
source: Effective permissions for: {0}
de: Effektive Berechtigungen für: {0}
es: Permisos efectivos para: {0}
fr: Autorisations d’accès effectives pour : {0}
it: Autorizzazioni valide per: {0}
ja: 有効なアクセス許可: {0}
ko: 다음의 유효 사용 권한: {0}
pt_br: Permissões efetivas para: {0}
ru: Действующие разрешения для: {0}
zh_hans: 有效权限: {0}
zh_hant: 適用於 {0} 的有效權限

# objectManagement.databaseProperties.enableAutogrowthText
source: Enable Autogrowth
de: Automatische Vergrößerung aktivieren
es: Habilitar crecimiento automático
fr: Activer la croissance automatique
it: Abilita aumento automatico dimensioni
ja: 自動拡張を有効にする
ko: 자동 증가 사용
pt_br: Habilitar o Aumento Automático
ru: Разрешить автоматическое увеличение
zh_hans: 启用自动增长
zh_hant: 啟用自動成長

# objectManagement.enabledLabel
source: Enabled
de: Aktiviert
es: Habilitado
fr: Activée
it: Abilitato
ja: 有効
ko: 사용
pt_br: Habilitado
ru: Включено
zh_hans: 已启用
zh_hant: 已啟用

# objectManagement.encryptBackup
source: Encrypt backup
de: Sicherung verschlüsseln
es: Cifrar copia de seguridad
fr: Chiffrez la sauvegarde
it: Crittografia backup
ja: バックアップを暗号化する
ko: 백업 암호화
pt_br: Criptografar backup
ru: Зашифровать резервную копию
zh_hans: 加密备份
zh_hant: 加密備份

# objectManagement.backupEncryption
source: Encryption
de: Verschlüsselung
es: Cifrado
fr: Chiffrement
it: Crittografia
ja: 暗号化
ko: 암호화
pt_br: Criptografia
ru: Шифрование
zh_hans: 加密
zh_hant: 加密

# objectManagement.databaseProperties.encryptionEnabledText
source: Encryption Enabled
de: Verschlüsselung aktiviert
es: Cifrado habilitado
fr: Chiffrement activé
it: Crittografia abilitata
ja: 暗号化有効
ko: 암호화 사용
pt_br: Criptografia Habilitada
ru: Шифрование включено
zh_hans: 启用加密
zh_hant: 加密已啟用

# objectManagement.backupEncryptNotice
source: Encryption options are only available when 'Back up to a new media set' is selected above.
de: Verschlüsselungsoptionen sind nur verfügbar, wenn oben die Option "In einem neuen Mediensatz sichern" ausgewählt ist.
es: Las opciones de cifrado solo están disponibles cuando la opción "Hacer copia de seguridad en un nuevo conjunto de medios" está seleccionada más arriba.
fr: Les options de chiffrement ne sont disponibles que lorsque « Sauvegarder sur un nouveau support » est sélectionné ci-dessus.
it: Le opzioni di crittografia sono disponibili solo quando sopra è selezionato 'Esegui backup in un nuovo set di supporti'.
ja: 暗号化オプションは、上で [新しいメディア セットにバックアップ] が選択されている場合にのみ使用できます。
ko: 암호화 옵션은 위에서 '새 미디어 세트에 백업'을 선택한 경우에만 사용할 수 있습니다.
pt_br: As opções de criptografia só estão disponíveis quando “Fazer backup em um novo conjunto de mídias” está selecionado acima.
ru: Параметры шифрования доступны, только если выше выбран параметр "Резервное копирование на новый набор носителей".
zh_hans: 只有在上面选择了“备份到新媒体集”时，加密选项才可用。
zh_hant: 只有在以上選取 [備份至新的媒體集] 時，[加密] 選項才可供使用。

# objectManagement.login.enforcePasswordExpirationLabel
source: Enforce password expiration
de: Kennwortablauf erzwingen
es: Aplicar la expiración de contraseña
fr: Appliquer l’expiration du mot de passe
it: Imponi scadenza password
ja: パスワードの期限を適用します
ko: 암호 만료 적용
pt_br: Impor validade de senha
ru: Обеспечить срок действия пароля
zh_hans: 强制密码过期
zh_hant: 強制執行密碼逾期

# objectManagement.login.enforcePasswordPolicyLabel
source: Enforce password policy
de: Kennwortrichtlinie erzwingen
es: Aplicar la directiva de contraseñas
fr: Appliquer la stratégie de mot de passe
it: Applica criteri password
ja: パスワード ポリシーを適用します
ko: 암호 정책 적용
pt_br: Impor política de senha
ru: Требовать использование политики паролей.
zh_hans: 强制实施密码策略
zh_hant: 強制執行密碼原則

# objectManagement.renameObjectDialogTitle
source: Enter new name
de: Neuen Namen eingeben
es: Escriba un nombre nuevo
fr: Entrez le nouveau nom
it: Immetti un nuovo nome
ja: 新しい名前の入力
ko: 새 이름 입력
pt_br: Inserir novo nome
ru: Введите новое имя
zh_hans: 输入新名称
zh_hant: 請輸入新名稱

# objectManagement.databaseProperties.executionCountText
source: Execution Count
de: Anzahl von Ausführungen
es: Recuento de ejecuciones
fr: Nombre d’exécutions
it: Conteggio esecuzioni
ja: 実行回数
ko: 실행 수
pt_br: Contagem de Execução
ru: Счетчик выполнения
zh_hans: 执行计数
zh_hant: 執行計數

# objectManagement.restoreDatabase.restorePlan.expirationText
source: Expiration
de: Ablauf
es: Expiración
it: Scadenza
ja: 有効期限
ko: 만료
pt_br: Validade
ru: Окончание срока действия
zh_hans: 过期
zh_hant: 到期

# objectManagement.backupExpiration
source: Expiration
de: Ablauf
es: Expiración
it: Scadenza
ja: 有効期限
ko: 만료
pt_br: Expiração
ru: Окончание срока действия
zh_hans: 过期
zh_hant: 到期日

# objectManagement.explicitPermissionsTableLabel
source: Explicit permissions for selected securable
de: Explizite Berechtigungen für ausgewählte sicherungsfähige Elemente
es: Permisos explícitos para el elemento protegible seleccionado
fr: Autorisations d’accès explicites pour le sécurisable sélectionné
it: Autorizzazioni esplicite per l'entità a protezione diretta selezionata
ja: 選択したセキュリティ保護可能なリソースに対する明示的なアクセス許可
ko: 선택한 보안 개체에 대한 명시적 권한
pt_br: Permissões explícitas para o protegível selecionado
ru: Явные разрешения для выбранного защищаемого объекта
zh_hans: 所选安全对象的显式权限
zh_hant: 已選取安全性實體的明確權限

# objectManagement.explicitPermissionsTableLabelSelected
source: Explicit permissions for: {0}
de: Explizite Berechtigungen für: {0}
es: Permisos explícitos para: {0}
fr: Autorisations d’accès explicites pour : {0}
it: Autorizzazioni esplicite per: {0}
ja: 明示的なアクセス許可: {0}
ko: 다음에 대한 명시적 권한: {0}
pt_br: Permissões explícitas para: {0}
ru: Явные разрешения для: {0}
zh_hans: 显式权限: {0}
zh_hant: 適用於 {0} 的明確權限

# objectManagement.databaseProperties.filestreamFileType
source: FILESTREAM Data
de: FILESTREAM-Daten
es: Datos de FILESTREAM
fr: Données FILESTREAM
it: Dati FILESTREAM
ja: FILESTREAM データ
ko: 파일 스트림 데이터
pt_br: Dados FILESTREAM
ru: Данные ФАЙЛОВОГО ПОТОКА
zh_hans: FILESTREAM 数据
zh_hant: FILESTREAM 資料

# objectManagement.failedLoginsOnlyText
source: Failed logins only
de: Nur fehlerhafte Anmeldungen
es: Solo inicios de sesión erróneos
fr: Échecs de connexion uniquement
it: Solo accessi non riusciti
ja: 失敗したログインのみ
ko: 실패한 로그인만
pt_br: Somente logons com falha
ru: Только неудачные попытки входа
zh_hans: 仅限失败的登录
zh_hant: 僅限失敗的登入

# objectManagement.noConnectionUriError
source: Failed to retrieve the connection information, please reconnect and try again.
de: Fehler beim Abrufen der Verbindungsinformationen. Stellen Sie die Verbindung wieder her, und versuchen Sie es noch einmal.
es: No se pudo recuperar la información de conexión. Vuelva a conectarse e inténtelo de nuevo.
fr: Échec de la récupération des informations de connexion. Veuillez vous reconnecter et réessayez.
it: Non è stato possibile recuperare le informazioni sulla connessione. Riconnettersi e riprovare.
ja: 接続情報を取得できませんでした。再接続して、もう一度お試しください。
ko: 연결 정보를 검색하지 못했습니다. 다시 연결하고 다시 시도하세요.
pt_br: Falha ao recuperar as informações de conexão, reconecte e tente novamente.
ru: Не удалось получить сведения о подключении. Восстановите подключение и повторите попытку.
zh_hans: 无法检索连接信息，请重新连接，然后重试。
zh_hant: 無法擷取連線資訊，請重新連線，然後再試一次。

# objectManagement.databaseFileGroup
source: File Group
de: Dateigruppe
es: Grupo de archivos
fr: Groupe de fichiers
it: Gruppo di file
ja: ファイル グループ
ko: 파일 그룹
pt_br: Grupo de Arquivos
ru: Группа файлов
zh_hans: 文件组
zh_hant: 檔案群組

# objectManagement.databaseProperties.fileGrowthText
source: File Growth
de: Dateivergrößerung
es: Crecimiento de archivos
fr: Croissance des fichiers
it: Aumento dimensioni file
ja: ファイル拡張
ko: 파일 증가
pt_br: Aumento do Arquivo
ru: Увеличение размера файлов
zh_hans: 文件增长
zh_hant: 檔案成長

# objectManagement.databaseProperties.fileNameText
source: File Name
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier
it: Nome file
ja: ファイル名
ko: 파일 이름
pt_br: Nome do Arquivo
ru: Имя файла
zh_hans: 文件名
zh_hant: 檔案名稱

# objectManagement.databaseProperties.fileTypeText
source: File Type
de: Dateityp
es: Tipo de archivo
fr: Type de fichier
it: Tipo file
ja: ファイルの種類
ko: 파일 형식
pt_br: Tipo de Arquivo
ru: Тип файла
zh_hans: 文件类型
zh_hant: 檔案類型

# objectManagement.databaseProperties.FilegroupExistsError
source: File group '{0}' could not be added to the collection, because it already exists.
de: Die Dateigruppe "{0}" konnte der Auflistung nicht hinzugefügt werden, da sie bereits vorhanden ist.
es: No se pudo agregar el grupo de archivos "{0}" a la colección porque ya existe.
fr: Impossible d’ajouter le groupe de fichiers '{0}' à la collection, car il existe déjà.
it: Impossibile aggiungere gruppo di file "{0}" alla raccolta perché esiste già.
ja: ファイル グループ '{0}' は既に存在するため、コレクションに追加できませんでした。
ko: '{0}' 파일 그룹이 이미 있으므로 컬렉션에 추가할 수 없습니다.
pt_br: O grupo de arquivo "{0}" não pôde ser adicionado à coleção, porque ele já existe.
ru: Не удалось добавить файловую группу "{0}" в коллекцию, так как она уже существует.
zh_hans: 无法将文件组 "{0}" 添加到集合中，因为它已存在。
zh_hant: 因為檔案群組 '{0}' 已存在，所以無法將其新增至集合中。

# objectManagement.databaseProperties.fileStreamFileGroupsSectionText
source: FileStream
es: Secuencia de archivos
pt_br: Fluxo de arquivos
ru: Файловый поток

# objectManagement.databaseProperties.filegroupText
source: Filegroup
de: Dateigruppe
es: Grupo de archivos
fr: Groupe de fichiers
ja: ファイル グループ
ko: 파일 그룹
pt_br: Grupo de arquivos
ru: Группа файлов
zh_hans: 文件组
zh_hant: 檔案群組

# objectManagement.filegroupsNameInput
source: Filegroup Name
de: Dateigruppenname
es: Nombre del grupo de archivos
fr: Nom du groupe de fichiers
it: Nome filegroup
ja: ファイル グループ名
ko: 파일 그룹 이름
pt_br: Nome do Grupo de Arquivos
ru: Имя файловой группы
zh_hans: 文件组名称
zh_hant: 檔案群組名稱

# objectManagement.filegroupsSectionHeader
source: Filegroups
de: Dateigruppen
es: Grupos de archivos
fr: Groupes de fichiers
it: Filegroup
ja: ファイル グループ
ko: 파일 그룹
pt_br: Grupos de arquivos
ru: Файловые группы
zh_hans: 文件组
zh_hant: 檔案群組

# objectManagement.databaseProperties.filegrowthLimitError
source: Filegrowth cannot be greater than the Maximum file size for a file
de: Die Dateivergrößerung darf die maximale Dateigröße für eine Datei nicht überschreiten.
es: El crecimiento del archivo no puede ser mayor que el tamaño máximo de archivo de un archivo
fr: La croissance du fichier ne peut pas être supérieure à la taille maximale d'un fichier.
it: L'aumento delle dimensioni del file non può essere maggiore della dimensione massima per un file
ja: Filegrowth をファイルの最大ファイル サイズより大きくすることはできません
ko: Filegrowth는 파일의 최대 파일 크기보다 클 수 없습니다.
pt_br: O aumento do arquivo não pode ser maior que o tamanho máximo do arquivo de um arquivo
ru: Увеличение размера файла не может превышать максимальный размер файла
zh_hans: 文件增长不能大于文件的最大文件大小
zh_hant: Filegrowth 不能大於檔案的檔案大小上限

# objectManagement.databaseProperties.filesText
source: Files
de: Dateien
es: Archivos
fr: Fichiers
it: File
ja: ファイル
ko: 파일
pt_br: Arquivos
ru: Файлы
zh_hans: 文件
zh_hant: 檔案

# objectManagement.optionsSectionHeader
source: Files
es: Archivos
fr: Fichiers
ru: Файлы
zh_hant: 檔案

# objectManagement.databaseProperties.filestreamFilesText
source: Filestream Files
de: Filestream-Dateien
es: Archivos de secuencia de archivos
fr: Fichiers filestream
it: File FileStream
ja: filestream ファイル
ko: 파일 스트림 파일
pt_br: Arquivos do fluxo de arquivos
ru: Файлы файлового потока
zh_hans: 文件流文件
zh_hant: Filestream 檔案

# objectManagement.filterSectionTitle
source: Filters
de: Filter
es: Filtros
fr: Filtres
it: Filtri
ja: フィルター
ko: 필터
pt_br: Filtros
ru: Фильтры
zh_hans: 筛选器
zh_hant: 篩選

# objectManagement.findText
source: Find
de: Suchen
es: Buscar
fr: Rechercher
it: Trova
ja: 検索
ko: 찾기
pt_br: Encontrar
ru: Найти
zh_hans: 查找
zh_hant: 尋找

# objectManagement.restoreDatabase.restorePlan.FinishDateText
source: Finish Date
de: Endtermin
es: Fecha de finalización
fr: Date de fin
it: Data di fine
ja: 終了日
ko: 완료 날짜
pt_br: Data de Término
ru: Дата окончания
zh_hans: 完成日期
zh_hant: 完成日期

# objectManagement.restoreDatabase.restorePlan.firstLSNText
source: First LSN
de: Erste LSN
es: Primer LSN
fr: Premier LSN
it: Primo LSN
ja: 最初の LSN
ko: 첫 번째 LSN
pt_br: Primeiro LSN
ru: Первый номер LSN
zh_hans: 第一个 LSN
zh_hant: 第一個 LSN

# objectManagement.backupFull
source: Full
de: Vollständig
es: Completa
fr: Complet
it: Completo
ja: 完全
ko: 전체
pt_br: Completo
ru: Полные
zh_hans: 完整
zh_hant: 完整

# objectManagement.restoreDatabase.restorePlan.FullLSNText
source: Full LSN
de: Vollständige LSN
es: LSN completo
fr: Tous les NSE
it: LSN completo
ja: 全 LSN
ko: 전체 LSN
pt_br: LSN Completo
ru: Полный номер LSN
zh_hans: 完整 LSN
zh_hant: 完整 LSN

# objectManagement.fullTextUpgradeOptionLabel
source: Full-Text Upgrade Option
de: Volltextupgrade-Option
es: Opción de actualización de texto completo
fr: Option de mise à niveau du catalogue de texte intégral
it: Opzione di aggiornamento full-text
ja: フルテキストのアップグレード オプション
ko: 전체 텍스트 업그레이드 옵션
pt_br: Opção de Atualização de Texto Completo
ru: Режим обновления полнотекстового каталога
zh_hans: 全文升级选项
zh_hant: 全文檢索升級選項

# objectManagement.generalSectionHeader
source: General
de: Allgemein
fr: Général
it: Generale
ja: 全般
ko: 일반
pt_br: Geral
ru: Общие
zh_hans: 常规
zh_hant: 一般

# objectManagement.grantColumnHeader
source: Grant
de: Zuweisung
es: Conceder
fr: Accorder
it: Concedi
ja: 許可
ko: 권한 부여
pt_br: Conceder
ru: Предоставить
zh_hans: 授予
zh_hant: 授與

# objectManagement.grantorColumnHeader
source: Grantor
de: Berechtigender
es: Otorgante
fr: Fournisseur d’autorisations
it: Utente che concede le autorizzazioni
ja: 権限の許可者
ko: 부여자
pt_br: Concessor
ru: Разрешение предоставил
zh_hans: 授权者
zh_hant: 授與者

# objectManagement.hardwareGeneration
source: Hardware Generation
es: Generación de hardware
fr: Génération de matériel
it: Generazione hardware
ja: ハードウェアの世代
ko: 하드웨어 세대
pt_br: Geração de Hardware
ru: Поколение оборудования
zh_hans: 硬件生成
zh_hant: 硬體世代

# objectManagement.ObjectSelectionMethodDialog_TypeLabel
source: How do you want to add objects?
de: Wie möchten Sie Objekte hinzufügen?
es: ¿Cómo desea agregar objetos?
fr: Comment voulez-vous ajouter des objets ?
it: Scegliere la modalità per aggiungere gli oggetti
ja: オブジェクトをどのように追加しますか?
ko: 개체를 추가하려면 어떻게 해야 합니까?
pt_br: Como você deseja adicionar objetos?
ru: Как вы хотите добавить объекты?
zh_hans: 你希望如何添加对象?
zh_hant: 您要如何新增物件?

# objectManagement.processorIOAffinityColumn
source: I/O Affinity
de: E/A-Affinität
es: Afinidad de E/S
fr: Affinité d'E/S
it: Affinità I/O
ja: I/O アフィニティ
ko: I/O 선호도
pt_br: Afinidade de E/S
ru: Привязка ввода-вывода
zh_hans: I/O 关联
zh_hant: I/O 親和性

# objectManagement.databaseProperties.inMegabytesAutogrowthText
source: In Megabytes
de: In Megabyte
es: En megabytes
fr: En mégaoctets
it: In megabyte
ja: メガバイト単位
ko: 메가바이트 단위
pt_br: Em Megabytes
ru: В мегабайтах
zh_hans: 以兆字节为单位
zh_hant: 以 MB 為單位

# objectManagement.databaseProperties.inPercentAutogrowthText
source: In Percent
de: In Prozent
es: En porcentaje
fr: En pourcentage
it: In percentuale
ja: パーセント単位
ko: 백분율 단위
pt_br: Em Porcentagem
ru: В процентах
zh_hans: 按百分比
zh_hant: 以百分比為單位

# objectManagement.InvalidS3UrlError
source: Invalid S3 endpoint
de: Ungültiger S3-Endpunkt
es: Punto de conexión S3 no válido
fr: Point de terminaison S3 non valide
it: Endpoint S3 non valido
ja: 無効な S3 エンドポイント
ko: 잘못된 S3 엔드포인트
pt_br: Ponto de extremidade S3 inválido
ru: Недопустимая конечная точка S3
zh_hans: S3 终结点无效
zh_hant: S3 端點無效

# objectManagement.isClustered
source: Is Clustered
de: Ist gruppiert
es: En clúster
fr: Est un cluster
it: In cluster
ja: クラスター化済み
ko: 클러스터형 여부
pt_br: Está Clusterizado
ru: Кластеризованный
zh_hans: 是否群集化
zh_hant: 已叢集化

# objectManagement.isHadrEnabled
source: Is HADR Enabled
de: Ist HADR-fähig
es: Está habilitado para HADR
it: HADR abilitato
ja: HADR が有効
ko: HADR 사용
pt_br: É Habilitado para HADR
ru: Подключение HADR
zh_hans: 是否启用 HADR
zh_hant: 已啟用 HADR

# objectManagement.databaseProperties.isLedgerDatabaseText
source: Is Ledger Database
de: Ist Ledgerdatenbank
es: Es base de datos de libro de contabilidad
fr: Est la base de données du grand livre
it: Database libro mastro
ja: 台帳データベースです
ko: 원장 데이터베이스임
pt_br: É o Banco de Dados Razão
ru: Базы данных реестра
zh_hans: 是账本数据库
zh_hant: 為總帳資料庫
