Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# objectManagement.isPolyBaseInstalled
source: Is PolyBase Installed
de: Mit PolyBase-Installation
es: Está instalada la característica PolyBase
fr: PolyBase installé
it: PolyBase installato
ja: PolyBase インストール済み
ko: PolyBase 설치됨
pt_br: O PolyBase Está Instalado?
ru: Наличие PolyBase
zh_hans: 已安装 PolyBase
zh_hant: 已安裝 PolyBase

# objectManagement.isXTPSupported
source: Is XTP Supported
de: Mit XTP-Unterstützung
es: Es compatible con XTP
fr: XTP pris en charge
it: XTP supportato
ja: XTP サポート対象
ko: XTP 지원됨
pt_br: Compatível com XTP
ru: Поддержка XTP
zh_hans: 是否支持 XTP
zh_hant: 支援 XTP

# objectManagement.databaseProperties.logfiletype
source: LOG
es: REGISTRO
fr: ENREGISTRER
ko: 로그
ru: ЖУРНАЛ
zh_hans: 日志
zh_hant: 記錄

# objectManagement.language
source: Language
de: Sprache
es: Lenguaje
fr: Langue
it: Lingua
ja: 言語
ko: 언어
pt_br: Linguagem
ru: Язык
zh_hans: 语言
zh_hant: 語言

# objectManagement.lastDatabaseBackup
source: Last Database Backup
de: Letzte Datenbanksicherung
es: Última copia de seguridad de la base de datos
fr: Dernière sauvegarde de base de données
it: Ultimo backup del database
ja: 前回のデータベース バックアップ
ko: 마지막 데이터베이스 백업
pt_br: Último Backup de Banco de Dados
ru: Последнее резервное копирование базы данных
zh_hans: 上次数据库备份
zh_hant: 上次資料庫備份

# objectManagement.lastDatabaseLogBackup
source: Last Database Log Backup
de: Letzte Datenbankprotokoll-Sicherung
es: Última copia de seguridad del registro de base de datos
fr: Dernière sauvegarde du journal de la base de données
it: Ultimo backup log database
ja: 最終データベース ログ バックアップ
ko: 마지막 데이터베이스 로그 백업
pt_br: Último Backup de Log do Banco de Dados
ru: Последнее резервное копирование журналов базы данных
zh_hans: 数据库日志上次备份时间
zh_hant: 上次資料庫記錄備份

# objectManagement.restoreDatabase.restorePlan.lastLSNText
source: Last LSN
de: Letzte LSN
es: Último LSN
fr: Dernier LSN
it: Ultimo LSN
ja: 最後の LSN
ko: 마지막 LSN
pt_br: Último LSN
ru: Последний номер LSN
zh_hans: 最后一个 LSN
zh_hant: 最後一個 LSN

# objectManagement.restoreDatabase.leaveSourceDBText
source: Leave source database in the restoring state (WITH NORECOVERY)
de: Quelldatenbank im Wiederherstellungsstatus belassen (WITH NORECOVERY)
es: Dejar la base de datos de origen en estado de restauración (CON NORECOVERY)
fr: Laisser la base de données source dans l'état de restauration (WITH NORECOVERY)
it: Lascia il database di origine nello stato di ripristino (WITH NORECOVERY)
ja: ソース データベースを復元中の状態にしておく (WITH NORECOVERY)
ko: 복원 중인 상태(WITH NORECOVERY)에서 원본 데이터베이스 유지
pt_br: Deixar o banco de dados de origem no estado de restauração (WITH NORECOVERY)
ru: Оставить базу данных-источник в состоянии восстановления (WITH NORECOVERY)
zh_hans: 保持源数据库处于正在还原状态(WITH NORECOVERY)
zh_hant: 將來源資料庫保持在還原狀態 (WITH NORECOVERY)

# objectManagement.databaseProperties.ledgerSectionHeader
source: Ledger
es: Libro de contabilidad
fr: Classeur
it: Libro mastro
ja: 台帳
ko: 원장
pt_br: Livro Razão
ru: Реестр
zh_hans: 账本
zh_hant: 總帳

# objectManagement.databaseProperties.limitedToMBFileSizeText
source: Limited to (MB)
de: Beschränkt auf (MB)
es: Limitado a (MB)
fr: Limité à (Mo)
it: Limitate a (MB)
ja: 制限付き (MB)
ko: 제한(MB)
pt_br: Limitado a (MB)
ru: Ограничено (МБ)
zh_hans: 限制为(MB)
zh_hant: 限制為 (MB)

# objectManagement.databaseProperties.autoGrowthValueConversion.limitation
source: Limited to {0} MB
de: Auf {0} MB beschränkt
es: Limitado a {0} MB
fr: Limitée à {0} Mo
it: Limitato a {0} MB
ja: {0} MB に制限
ko: {0}MB로 제한됨
pt_br: Limitado a {0} MB
ru: Ограничено {0} МБ
zh_hans: 限制为 {0} MB
zh_hant: 限制為 {0} MB

# objectManagement.loadingObjectsCompletedLabel
source: Loading objects completed, {0} objects found
de: Laden von Objekten abgeschlossen, {0} Objekte gefunden
es: Carga de objetos completada, {0} objetos encontrados
fr: Chargement des objets terminé, {0} objets trouvés
it: Caricamento degli oggetti completato, {0} oggetti trovati
ja: オブジェクトの読み込みが完了しました。 {0} 個オブジェクトが見つかりました
ko: 개체 로드가 완료되었습니다. {0} 개체를 찾았습니다.
pt_br: Carregamento de objetos concluído, {0} objetos encontrados
ru: Загрузка объектов завершена, объекты {0} найдены
zh_hans: 已完成加载对象，找到 {0} 对象
zh_hant: 載入物件已完成，找到 {0} 個物件

# objectManagement.loadingObjectsLabel
source: Loading objects…
de: Objekte werden geladen...
es: Cargando de los objetos en curso...
fr: Chargement des objets en cours…
it: Caricamento di oggetti in corso...
ja: オブジェクトを読み込んでいます…
ko: 개체 로드 중...
pt_br: Carregando objetos…
ru: Загрузка объектов...
zh_hans: 正在加载对象...
zh_hant: 正在載入物件...

# objectManagement.locksLabel
source: Locks
de: Sperren
es: Bloqueos
fr: Verrous
it: Blocchi
ja: ロック
ko: 잠금
pt_br: Bloqueios
ru: Блокировки
zh_hans: 锁
zh_hant: 鎖定

# objectManagement.logLocationText
source: Log
de: Protokoll
es: Registro
fr: Journal
ja: ログ
ko: 로그
ru: Журнал
zh_hans: 日志
zh_hant: 記錄

# objectManagement.logFileLabel
source: Log
de: Protokoll
es: Registro
fr: Journal
ja: ログ
ko: 로그
ru: Журнал
zh_hans: 日志
zh_hant: 記錄

# objectManagement.restoreDatabase.logFileFolderText
source: Log File Folder
de: Protokolldateiordner
es: Carpeta de archivos de registro
fr: Dossier du fichier journal
it: Cartella file di registro
ja: ログ ファイルのフォルダー
ko: 로그 파일 폴더
pt_br: Pasta do Arquivo de Log
ru: Папка файлов журнала
zh_hans: 日志文件文件夹
zh_hant: 記錄檔資料夾

# objectManagement.restoreDatabase.restorePlan.logicalFileNameText
source: Logical File Name
de: Logischer Dateiname
es: Nombre de archivo lógico
fr: Nom du fichier logique
it: Nome file logico
ja: 論理ファイル名
ko: 논리적 파일 이름
pt_br: Nome do Arquivo Lógico
ru: Логическое имя файла
zh_hans: 逻辑文件名
zh_hant: 邏輯檔案名稱

# objectManagement.databaseProperties.logicalNameText
source: Logical Name
de: Logischer Name
es: Nombre lógico
fr: Nom logique
it: Nome logico
ja: 論理名
ko: 논리적 이름
pt_br: Nome Lógico
ru: Логическое имя
zh_hans: 逻辑名称
zh_hant: 邏輯名稱

# objectManagement.user.loginLabel
source: Login
de: Anmelden
es: Iniciar sesión
fr: Connexion
it: Accesso
ja: ログイン
ko: 로그인
pt_br: Logon
ru: Вход
zh_hans: 登录
zh_hant: 登入

# objectManagement.LoginTypeDisplayNameInTitle
source: Login
de: Anmelden
es: Iniciar sesión
fr: Connexion
it: Accesso
ja: ログイン
ko: 로그인
pt_br: Logon
ru: Вход
zh_hans: 登录
zh_hant: 登入

# objectManagement.loginAuditingText
source: Login auditing
de: Anmeldungsüberwachung
es: Auditoría de inicio de sesión
fr: Audit de connexion
it: Controllo accessi
ja: ログインの監査
ko: 로그인 감사
pt_br: Auditoria de logon
ru: Аудит входа
zh_hans: 登录审核
zh_hant: 登入稽核

# objectManagement.login.lockedOutLabel
source: Login is locked out
de: Anmeldung ist gesperrt
es: Inicio de sesión bloqueado
fr: La connexion est verrouillée
it: Account di accesso bloccato
ja: ログインがロックアウトされています
ko: 로그인 잠겨 있음
pt_br: O logon está bloqueado
ru: Имя для входа заблокировано
zh_hans: 登录已锁定
zh_hant: 登入已經鎖定

# objectManagement.loginNotSelectedError
source: Login is not selected.
de: Die Anmeldung ist nicht ausgewählt.
es: No se ha seleccionado el inicio de sesión.
fr: La connexion n’est pas sélectionnée.
it: L'account di accesso non è selezionato.
ja: ログインが選択されていません。
ko: 로그인이 선택되지 않았습니다.
pt_br: Login não selecionado.
ru: Имя для входа не выбрано.
zh_hans: 未选择登录名。
zh_hant: 未選取登入。

# objectManagement.mdfFileLocation
source: MDF File Location
de: Speicherort für MDF-Datei
es: Ubicación del archivo MDF
fr: Emplacement du fichier MDF
it: Percorso file MDF
ja: MDF ファイルの場所
ko: MDF 파일 위치
pt_br: Local do Arquivo MDF
ru: Расположение файла MDF
zh_hans: MDF 文件位置
zh_hant: MDF 檔案位置

# objectManagement.user.windowsUser
source: Mapped to a Windows user/group
de: Einem Windows-Benutzer/einer Windows-Gruppe zugeordnet
es: Asignado a un usuario o grupo de Windows
fr: Mappé à un utilisateur/groupe Windows
it: Mappato a un utente/gruppo Windows
ja: Windows ユーザー/グループにマップ済み
ko: Windows 사용자/그룹에 매핑됨
pt_br: Mapeado para um usuário/grupo do Windows
ru: Сопоставлено с пользователем или группой Windows
zh_hans: 映射到 Windows 用户/组
zh_hant: 對應至 Windows 使用者/群組

# objectManagement.user.loginMapped
source: Mapped to a server login
de: Einer Serveranmeldung zugeordnet
es: Asignado a un inicio de sesión de servidor
fr: Mappé à une connexion au serveur
it: Mappato a un account di accesso del server
ja: サーバー ログインにマップされました
ko: 서버 로그인에 매핑됨
pt_br: Mapeado para um login do servidor
ru: Сопоставлено с входом на сервер
zh_hans: 映射到服务器登录名
zh_hant: 對應至伺服器登入

# objectManagement.maxDegreeParallelismLabel
source: Max Degree Parallelism
de: Max. Grad-Parallelität
es: Paralelismo de grado máximo
fr: Parallélisme de degré max.
it: Massimo grado di parallelismo
ja: 最大限度の並列処理
ko: 최대 수준 병렬 처리
pt_br: Paralelismo de Grau Máximo
ru: Максимальная степень параллелизма
zh_hans: 最大并行度
zh_hant: 最大平行處理原則

# objectManagement.databaseProperties.maxPlansPerQueryText
source: Max Plans Per Query
de: Max. Pläne pro Abfrage
es: Número máximo de planes por consulta
fr: Nbre de plans max. par requête
it: Numero massimo di piani per query
ja: クエリあたりの最大プラン数
ko: 쿼리당 최대 계획
pt_br: Planos Máximos por Consulta
ru: Максимальное число планов на запрос
zh_hans: 每个查询的最大计划数
zh_hant: 每個查詢的方案上限

# objectManagement.maxSizeLabel
source: Max Size
de: Max. Größe
es: Tamaño máximo
fr: Taille maximum
it: Dimensioni massime
ja: 最大サイズ
ko: 최대 크기
pt_br: Tamanho Máximo
ru: Максимальный размер
zh_hans: 最大大小
zh_hant: 最大大小

# objectManagement.databaseProperties.maxSizeInMbText
source: Max Size (MB)
de: Max. Größe (MB)
es: Tamaño máximo (MB)
fr: Taille maximale (Mo)
it: Dimensioni massime (MB)
ja: 最大サイズ (MB)
ko: 최대 크기(MB)
pt_br: Tamanho Máximo (MB)
ru: Максимальный размер (МБ)
zh_hans: 最大大小(MB)
zh_hant: 大小上限 (MB)

# objectManagement.maxTextReplicationSizeLabel
source: Max Text Replication Size
de: Max. Textgröße für Replikation
es: Tamaño de replicación de texto máximo
fr: Taille de réplication de texte maximum
it: Dimensioni massime replica testo
ja: テキスト レプリケーションの最大サイズ
ko: 최대 텍스트 복제 크기
pt_br: Tamanho Máx. de Replicação de texto
ru: Максимальный размер реплицируемого текста
zh_hans: 最大文本复制大小
zh_hant: 文字複寫大小上限

# objectManagement.databaseProperties.maximumFileSizeText
source: Maximum File Size
de: Maximale Dateigröße
es: Tamaño de archivo máximo
fr: Taille maximale du fichier
it: Dimensioni massime file
ja: ファイルの最大サイズ
ko: 최대 파일 크기
pt_br: Tamanho Máximo do Arquivo
ru: Максимальный размер файла
zh_hans: 最大文件大小
zh_hant: 檔案大小上限

# objectManagement.maxServerMemoryText
source: Maximum Server Memory (MB)
de: Maximaler Serverarbeitsspeicher (MB)
es: Cantidad máxima de memoria del servidor (MB)
fr: Mémoire maximale du serveur (MO)
it: Memoria massima del server (MB)
ja: 最大サーバー メモリ (MB)
ko: 최대 서버 메모리(MB)
pt_br: Memória Máxima do Servidor (MB)
ru: Максимальный объем памяти сервера (МБ)
zh_hans: 最大服务器内存(MB)
zh_hant: 伺服器記憶體上限 (MB)

# objectManagement.databaseProperties.fileSizeLimitError
source: Maximum file size cannot be less than size
de: Die maximale Dateigröße darf nicht kleiner als die Größe sein.
es: El tamaño máximo de archivo no puede ser menor que el tamaño
fr: La taille maximale du fichier ne peut pas être inférieure à la taille
it: Le dimensioni massime del file non possono essere inferiori alle dimensioni
ja: 最大ファイル サイズをサイズより小さくすることはできません
ko: 최대 파일 크기는 크기보다 작을 수 없습니다.
pt_br: O tamanho máximo do arquivo não pode ser menor que o tamanho
ru: Максимальный размер файла не может быть меньше размера
zh_hans: 最大文件大小不能小于
zh_hant: 檔案大小上限不能低於

# objectManagement.serverMemoryMaxLowerThanMinInputError
source: Maximum server memory cannot be lower than minimum server memory
de: Die maximale Größe des Serverarbeitsspeichers darf nicht unter der minimalen Größe des Serverarbeitsspeichers liegen.
es: La memoria máxima del servidor no puede ser inferior a la memoria mínima del servidor
fr: La mémoire maximale du serveur ne peut pas être inférieure à la mémoire minimale du serveur
it: La memoria massima del server non può essere inferiore alla memoria minima del server
ja: 最大サーバー メモリを最小サーバー メモリより小さくすることはできません
ko: 최대 서버 메모리는 최소 서버 메모리보다 작을 수 없습니다.
pt_br: A memória máxima do servidor não pode ser inferior à memória mínima do servidor
ru: Максимальный объем памяти сервера не может быть меньше минимального объема памяти сервера
zh_hans: 最大服务器内存不能低于最小服务器内存
zh_hant: 伺服器記憶體最大值不能低於伺服器記憶體最小值

# objectManagement.membersLabel
source: Members
de: Mitglieder
es: Miembros
fr: Membres
it: Membri
ja: メンバー
ko: 구성원
pt_br: Membros
ru: Участники
zh_hans: 成员
zh_hant: 成員

# objectManagement.membershipLabel
source: Membership
de: Mitgliedschaft
es: Pertenencia
fr: Appartenance
it: Appartenenza
ja: メンバーシップ
ko: 멤버십
pt_br: Associação
ru: Участие
zh_hans: 成员身份
zh_hant: 成員資格

# objectManagement.memory
source: Memory
de: Arbeitsspeicher
es: Memoria
fr: Mémoire
it: Memoria
ja: メモリ
ko: 메모리
pt_br: Memória
ru: Память
zh_hans: 内存
zh_hant: 記憶體

# objectManagement.databaseProperties.memoryAllocated
source: Memory Allocated To Memory Optimized Objects
de: Für speicheroptimierte Objekte reservierter Arbeitsspeicher
es: Memoria asignada a objetos con optimización para memoria
fr: Mémoire allouée aux objets mémoire optimisés
it: Memoria allocata agli oggetti con ottimizzazione per la memoria
ja: メモリ最適化オブジェクトに割り当てられたメモリ
ko: 메모리 액세스에 최적화된 개체에 할당된 메모리
pt_br: Memória Alocada a Objetos com Otimização de Memória
ru: Память, выделенная для оптимизированных для обработки в памяти объектов
zh_hans: 分配给内存优化对象的内存
zh_hant: 配置給記憶體最佳化物件的記憶體

# objectManagement.databaseProperties.memoryOptimizedFileGroupsSectionText
source: Memory Optimized Data
de: Speicheroptimierte Daten
es: Datos optimizados para memoria
fr: Données optimisées en mémoire
it: Dati con ottimizzazione per la memoria
ja: メモリ最適化データ
ko: 메모리 액세스에 최적화된 데이터
pt_br: Dados com otimização de memória
ru: Данные, оптимизированные для операций в памяти
zh_hans: 内存优化数据
zh_hant: 記憶體最佳化資料

# objectManagement.databaseProperties.memoryUsed
source: Memory Used By Memory Optimized Objects
de: Von speicheroptimierten Objekten genutzter Arbeitsspeicher
es: Memoria usada por objetos con optimización para memoria
fr: Mémoire utilisée par les objets mémoire optimisés
it: Memoria usata dagli oggetti con ottimizzazione per la memoria
ja: メモリ最適化オブジェクトによって使用されるメモリ
ko: 메모리 액세스에 최적화된 개체에서 사용하는 메모리
pt_br: Memória Usada por Objetos com Otimização de Memória
ru: Память, используемая оптимизированными для обработки в памяти объектами
zh_hans: 内存优化对象使用的内存
zh_hant: 記憶體最佳化物件使用的記憶體

# objectManagement.login.aadAuthenticationType
source: Microsoft Entra ID Authentication
de: Microsoft Entra-ID-Authentifizierung
es: Autenticación de Microsoft Entra Id.
fr: Authentification Microsoft Entra ID
it: Autenticazione di Microsoft Entra ID
ja: Microsoft Entra ID 認証
ko: Microsoft Entra ID 인증
pt_br: Autenticação de ID Microsoft Entra
ru: Проверка подлинности Microsoft Entra ID
zh_hans: Microsoft Entra ID 身份验证
zh_hant: Microsoft Entra ID 驗證

# objectManagement.minServerMemoryText
source: Minimum Server Memory (MB)
de: Minimaler Serverarbeitsspeicher (MB)
es: Memoria mínima del servidor (MB)
fr: Mémoire minimale du serveur (Mo)
it: Memoria minima del server (MB)
ja: 最小サーバー メモリ (MB)
ko: 최소 서버 메모리(MB)
pt_br: Memória Mínima do Servidor (MB)
ru: Минимальный объем памяти сервера (МБ)
zh_hans: 最小服务器内存(MB)
zh_hant: 伺服器記憶體下限 (MB)

# objectManagement.databaseProperties.monitoringSectionText
source: Monitoring
de: Überwachung
es: Supervisión
fr: Supervision
it: Monitoraggio
ja: 監視
ko: 모니터링
pt_br: Monitoramento
ru: Мониторинг
zh_hans: 监视
zh_hant: 監視

# objectManagement.databaseProperties.notAvailableText
source: N/A
de: n. v
es: N/D
it: N/D
ja: 該当なし
ko: 해당 없음
pt_br: N/D
ru: Нет данных
zh_hans: 不适用

# objectManagement.databaseProperties.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# objectManagement.databaseFileName
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# objectManagement.nameLabel
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# objectManagement.nameCannotBeEmptyError
source: Name cannot be empty.
de: Das Namensfeld darf nicht leer bleiben.
es: El nombre no puede estar vacío.
fr: Le nom ne peut pas être vide.
it: Il nome non può essere vuoto.
ja: 名前を空にすることはできません。
ko: 이름은 비워둘 수 없습니다.
pt_br: O nome não pode ficar em branco.
ru: Необходимо ввести имя.
zh_hans: 名称不能为空。
zh_hant: 名稱不能空白。

# objectManagement.backupNewMediaDescription
source: New media set description
de: Beschreibung des neuen Mediensatzes
es: Nueva descripción del conjunto de medios
fr: Description du nouveau support de sauvegarde
it: Descrizione del nuovo set di supporti
ja: 新しいメディア セットの説明
ko: 새 미디어 세트 설명
pt_br: Nova descrição do conjunto de mídias
ru: Описание нового набора носителей
zh_hans: 新建媒体集说明
zh_hant: 新增媒體集描述

# objectManagement.backupNewMediaName
source: New media set name
de: Name des neuen Mediensatzes
es: Nuevo nombre de conjunto de medios
fr: Nom du nouveau support de sauvegarde
it: Nome del nuovo set di supporti
ja: 新しいメディア セット名
ko: 새 미디어 세트 이름
pt_br: Novo nome do conjunto de mídias
ru: Имя нового набора носителей
zh_hans: 新建媒体集名称
zh_hant: 新增媒體集名稱

# objectManagement.user.noLogin
source: No Login Access
de: Kein Anmeldezugriff
es: Sin acceso de inicio de sesión
fr: Aucun accès à la connexion
it: Nessun account di accesso
ja: ログイン アクセスなし
ko: 로그인 액세스 권한 없음
pt_br: Sem acesso de login
ru: Нет доступа для входа
zh_hans: 无登录访问权限
zh_hant: 無登入存取權

# objectManagement.noEncryptorWarning
source: No certificate or asymmetric key is available
de: Es ist kein Zertifikat oder asymmetrischer Schlüssel verfügbar.
es: No hay certificado o clave asimétrica disponible
fr: Aucun certificat ni clé asymétrique n'est disponible
it: Non sono disponibili certificati o chiavi asimmetriche
ja: 使用可能な証明書または非対称キーがありません
ko: 사용 가능한 인증서 또는 비대칭 키가 없습니다.
pt_br: Nenhum certificado ou chave assimétrica está disponível
ru: Нет доступных сертификатов или ассиметричных ключей.
zh_hans: 没有可用的证书或非对称密钥
zh_hant: 沒有憑證或非對稱金鑰可用

# objectManagement.doDatabaseFilesError
source: No database files were specified to attach to the server.
de: Es wurden keine Datenbankdateien angegeben, die an den Server angefügt werden sollen.
es: No se especificó ningún archivo de base de datos para adjuntar al servidor.
fr: Aucun fichier de base de données n’a été spécifié pour être attaché au serveur.
it: Non è stato specificato alcun file di database da collegare al server.
ja: サーバーにアタッチするデータベース ファイルが指定されていません。
ko: 서버에 연결할 데이터베이스 파일이 지정되지 않았습니다.
pt_br: Nenhum arquivo de banco de dados foi especificado para anexar ao servidor.
ru: Не указаны файлы базы данных для подключения к серверу.
zh_hans: 未指定要附加到服务器的数据库文件。
zh_hant: 未指定要附加至伺服器的資料庫檔案。

# objectManagement.noSecurableObjectsFoundInfoMessage
source: No securable objects could be found for the specified selection.
de: Für die angegebene Auswahl wurden keine sicherungsfähigen Objekte gefunden.
es: No se encontró ningún objeto protegible para la selección especificada.
fr: Aucun objet sécurisable n’a été trouvé pour la sélection spécifiée.
it: Impossibile trovare oggetti a protezione diretta per la selezione specificata.
ja: 指定した選択に対してセキュリティ保護可能なオブジェクトが見つかりませんでした。
ko: 지정한 선택 사항에 대한 보안 개체를 찾을 수 없습니다.
pt_br: Nenhum objeto protegível foi encontrado para a seleção especificada.
ru: Не удалось найти защищаемые объекты для указанного выбора.
zh_hans: 找不到指定选择的安全对象。
zh_hant: 找不到指定選取項目的安全性實體物件。

# objectManagement.databaseProperties.noneText
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
it: Nessuno
ja: なし
ko: 없음
pt_br: Nenhum
ru: Нет
zh_hans: 无
zh_hant: 無

# objectManagement.noLoginAuditingText
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
it: Nessuno
ja: なし
ko: 없음
pt_br: Nenhum
ru: Нет
zh_hans: 无
zh_hant: 無

# objectManagement.serverNumaNodeLabel
source: Numa Node {0}
de: NUMA-Knoten {0}
es: Nodo Numa {0}
fr: {0}de nœud Numa
it: Nodo NUMA {0}
ja: Numa ノード {0}
ko: Numa 노드 {0}
pt_br: Nó Numa {0}
ru: Узел NUMA {0}
zh_hans: Numa 节点 {0}
zh_hant: Numa 節點 {0}

# objectManagement.databaseProperties.numberOfUsers
source: Number of Users
de: Anzahl von Benutzern
es: Número de usuarios
fr: Nombre d’utilisateurs
it: Numero di utenti
ja: ユーザー数
ko: 사용자 수
pt_br: Número de Usuários
ru: Число пользователей
zh_hans: 用户数
zh_hant: 使用者數目

# objectManagement.objectTypeLabel
source: Object Type
de: Objekttyp
es: Tipo de objeto
fr: Type d’objet
it: Tipo di oggetto
ja: オブジェクトの種類
ko: 개체 유형
pt_br: Tipo de Objeto
ru: Тип объекта
zh_hans: 对象类型
zh_hant: 物件類型

# objectManagement.objectTypesLabel
source: Object Types
de: Objekttypen
es: Tipos de objeto
fr: Types d'objets
it: Tipi di oggetto
ja: オブジェクトの種類
ko: 개체 유형
pt_br: Tipos de Objeto
ru: Типы объектов
zh_hans: 对象类型
zh_hant: 物件類型

# objectManagement.objectsLabel
source: Objects
de: Objekte
es: Objetos
fr: Objets
it: Oggetti
ja: オブジェクト
ko: 개체
pt_br: Objetos
ru: Объекты
zh_hans: 对象
zh_hant: 物件

# objectManagement.login.oldPasswordLabel
source: Old password
de: Altes Kennwort
es: Contraseña anterior
fr: Ancien mot de passe
it: Vecchia password
ja: 古いパスワード
ko: 이전 암호
pt_br: Senha antiga
ru: Старый пароль
zh_hans: 旧密码
zh_hant: 舊密碼

# objectManagement.login.oldPasswordCannotBeEmptyError
source: Old password cannot be empty.
de: Das alte Kennwort darf nicht leer sein.
es: La contraseña anterior no puede estar vacía.
fr: L’ancien mot de passe ne peut pas être vide.
it: La vecchia password non può essere vuota.
ja: 古いパスワードを空にすることはできません。
ko: 이전 암호는 비워 둘 수 없습니다.
pt_br: A senha antiga não pode ficar vazia.
ru: Старый пароль не может быть пустым.
zh_hans: 旧密码不能为空。
zh_hant: 舊密碼不可為空白。

# objectManagement.operatingSystem
source: Operating System
de: Betriebssystem
es: Sistema operativo
fr: Système d’exploitation
it: Sistema operativo
ja: オペレーティング システム
ko: 운영 체제
pt_br: Sistema Operacional
ru: Операционная система
zh_hans: 操作系统
zh_hant: 作業系統

# objectManagement.databaseProperties.actualOperationModeText
source: Operation Mode (Actual)
de: Betriebsmodus (Tatsächlich)
es: Modo de operación (real)
fr: Mode d’opération (réel)
it: Modalità operativa (effettiva)
ja: 操作モード (実際)
ko: 작동 모드(실제)
pt_br: Modo de operação (real)
ru: Режим работы (фактический)
zh_hans: 操作模式(实际)
zh_hant: 作業模式 (實際)

# objectManagement.databaseProperties.requestedOperationModeText
source: Operation Mode (Requested)
de: Betriebsmodus (Angefordert)
es: Modo de operación (solicitado)
fr: Mode d’opération (demandé)
it: Modalità operativa (richiesta)
ja: 操作モード (要求)
ko: 작동 모드(요청)
pt_br: Modo de operação (solicitado)
ru: Режим работы (запрошенный)
zh_hans: 操作模式(要求)
zh_hant: 作業模式 (要求)

# objectManagement.optimizeAdHocWorkloadsLabel
source: Optimize Ad Hoc Workloads
de: Ad-hoc-Workloads optimieren
es: Optimizar cargas de trabajo ad hoc
fr: Optimiser les charges de travail ad hoc
it: Ottimizza carichi di lavoro ad hoc
ja: アドホック ワークロードの最適化
ko: 임시 워크로드 최적화
pt_br: Otimizar cargas de trabalho Ad Hoc
ru: Оптимизировать нерегламентированные рабочие нагрузки
zh_hans: 优化临时工作负载
zh_hant: 針對臨機工作負載進行最佳化

# objectManagement.restoreDatabase.restorePlan.originalFileNameText
source: Original File Name
de: Ursprünglicher Dateiname
es: Nombre de archivo original
fr: Nom de fichier d'origine
it: Nome file originale
ja: 元のファイル名
ko: 원래 파일 이름
pt_br: Nome do Arquivo Original
ru: Исходное имя файла
zh_hans: 原始文件名
zh_hant: 原始檔案名稱

# objectManagement.overwriteExistingBackups
source: Overwrite all existing backup sets
de: Alle vorhandenen Sicherungssätze überschreiben
es: Sobrescribir todos los conjuntos de copia de seguridad existentes
fr: Remplacer tous les jeux de sauvegarde existants
it: Sovrascrivi tutti i set di backup esistenti
ja: 既存のすべてのバックアップ セットを上書きする
ko: 모든 기존 백업 세트 덮어쓰기
pt_br: Substituir todos os conjuntos de backup existentes
ru: Перезаписать все существующие резервные наборы данных
zh_hans: 覆盖所有现有备份集
zh_hant: 覆寫所有現有的備份集

# objectManagement.backupOverwriteMedia
source: Overwrite media
de: Medium überschreiben
es: Sobrescribir medios
fr: Remplacez le support
it: Sovrascrivi supporti di memorizzazione
ja: メディアを上書きする
ko: 미디어 덮어쓰기
pt_br: Substituir mídia
ru: Перезапись носителя
zh_hans: 覆盖媒体
zh_hant: 覆寫媒體
