Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# objectManagement.databaseProperties.valueForPrimaryColumnHeader
source: Value for Primary
de: Wert für primär
es: Valor para principal
fr: Valeur pour le primaire
it: Valore per primario
ja: プライマリの値
ko: 기본 값
pt_br: Valor para a Chave Primária
ru: Значение для основного
zh_hans: 主要值
zh_hant: 主要值

# objectManagement.databaseProperties.valueForSecondaryColumnHeader
source: Value for Secondary
de: Wert für sekundäre
es: Valor para secundario
fr: Valeur pour Secondaire
it: Valore per il secondario
ja: セカンダリの値
ko: 보조용 값
pt_br: Valor para secundário
ru: Значение для получателя
zh_hans: 辅助数据库的值
zh_hant: 次要值

# objectManagement.locksValidation
source: Value should be greater than {0}. Choose 0 for default settings.
de: Der Wert muss größer als {0} sein. Wählen Sie 0 als Standardeinstellungen aus.
es: El valor debe ser superior a {0}. Elija 0 para la configuración por defecto.
fr: La valeur doit être supérieure à {0}. Choisissez 0 pour les paramètres par défaut.
it: Il valore deve essere maggiore di {0}. Scegliere 0 per le impostazioni predefinite.
ja: 値を {0} より大きくする必要があります。既定の設定では 0 を選択します。
ko: 값은 {0}보다 커야 합니다. 기본 설정에 대해 0을 선택합니다.
pt_br: O valor deve ser maior que {0}. Escolha 0 para as configurações padrão.
ru: Значение должно быть больше {0}. Выберите 0 для использования параметров по умолчанию.
zh_hans: 值应大于 {0}。为默认设置选择 0。
zh_hant: 值應該大於 {0}。選擇 0 作為預設設定。

# objectManagement.verifyBackupWhenFinished
source: Verify backup when finished
de: Sicherung nach Abschluss überprüfen
es: Comprobar copia de seguridad cuando haya terminado
fr: Vérifier la sauvegarde une fois terminée
it: Verifica il backup al termine
ja: 完了時にバックアップを検証する
ko: 완료되면 백업 확인
pt_br: Verificar backup quando terminar
ru: Проверить резервную копию после завершения
zh_hans: 完成后验证备份
zh_hant: 完成後驗證備份

# objectManagement.versionText
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本

# objectManagement.databaseProperties.waitStatisticsCaptureModeText
source: Wait Statistics Capture Mode
de: Wartestatistik-Erfassungsmodus
es: Modo de captura de estadísticas de espera
fr: Mode de capture des statistiques d'attente
it: Modalità di acquisizione delle statistiche di attesa
ja: 待機統計取り込みモード
ko: 대기 통계 캡처 모드
pt_br: Modo de Captura de Estatísticas de Espera
ru: Режим записи статистики ожидания
zh_hans: 等待统计信息捕获模式
zh_hant: 等候統計資料擷取模式

# objectManagement.login.windowsAuthenticationType
source: Windows Authentication
de: Windows-Authentifizierung
es: Autenticación de Windows
fr: Authentification Windows
it: Autenticazione di Windows
ja: Windows 認証
ko: Windows 인증
pt_br: Autenticação do Windows
ru: Проверка подлинности Windows.
zh_hans: Windows 身份验证
zh_hant: Windows 驗證

# objectManagement.onlyWindowsAuthModeText
source: Windows Authentication mode
de: Windows-Authentifizierungsmodus
es: Modo de Autenticación de Windows
fr: Mode d'authentification Windows
it: Modalità Autenticazione di Windows
ja: Windows 認証モード
ko: Windows 인증 모드
pt_br: Modo Autenticação do Windows
ru: Режим проверки подлинности Windows
zh_hans: Windows 身份验证模式
zh_hant: Windows 驗證模式

# objectManagement.withGrantColumnHeader
source: With Grant
de: Mit Zuweisung
es: Con concesión
fr: Avec autorisation
it: Con diritto di concessione
ja: 許可の有無
ko: 허용 권한 소유
pt_br: Com Concessão
ru: С предоставлением разрешения
zh_hans: 具有授予权限
zh_hant: 已具授與

# objectManagement.databaseProperties.yesText
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# objectManagement.ApplicationRoleTypeDisplayName
source: application role
de: Anwendungsrolle
es: rol de aplicación
fr: rôle d’application
it: ruolo applicazione
ja: アプリケーション ロール
ko: 애플리케이션 역할
pt_br: função de aplicativo
ru: роль приложения
zh_hans: 应用程序角色
zh_hant: 應用程式角色

# objectManagement.ColumnDisplayName
source: column
de: Spalte
es: columna
fr: colonne
it: colonna
ja: 列
ko: 열
pt_br: coluna
ru: столбец
zh_hans: 列
zh_hant: 資料行

# objectManagement.DatabaseDisplayName
source: database
de: Datenbank
es: base de datos
fr: base de données
ja: データベース
ko: 데이터 베이스
pt_br: banco de dados
ru: база данных
zh_hans: 数据库
zh_hant: 資料庫

# objectManagement.DatabaseRoleTypeDisplayName
source: database role
de: Datenbankrolle
es: rol de base de datos
fr: rôle de base de données
it: ruolo del database
ja: データベース ロール
ko: 데이터베이스 역할
pt_br: função de banco de dados
ru: роль базы данных
zh_hans: 数据库角色
zh_hant: 資料庫角色

# objectManagement.LoginTypeDisplayName
source: login
de: Anmeldename
es: inicio de sesión
fr: connexion
it: accesso
ja: ログイン
ko: 로그인
pt_br: logon
ru: имя для входа
zh_hans: 登录名
zh_hant: 登入

# objectManagement.ServerRoleTypeDisplayName
source: server role
de: Serverrolle
es: rol del servidor
fr: rôle serveur
it: ruolo del server
ja: サーバー の役割
ko: 서버 역할
pt_br: função de servidor
ru: роль сервера
zh_hans: 服务器角色
zh_hant: 伺服器角色

# objectManagement.TableDisplayName
source: table
de: Tabelle
es: tabla
it: tabella
ja: テーブル
ko: 테이블
pt_br: tabela
ru: таблица
zh_hans: 表
zh_hant: 資料表

# objectManagement.UserDisplayName
source: user
de: Benutzer
es: usuario
fr: utilisateur
it: utente
ja: ユーザー
ko: 사용자
pt_br: usuário
ru: пользователь
zh_hans: 用户
zh_hant: 使用者

# objectManagement.ViewDisplayName
source: view
de: Ansicht
es: Ver
fr: vue
it: visualizza
ja: ビュー
ko: 보기
pt_br: exibir
ru: представление
zh_hans: 视图
zh_hant: 檢視

# objectManagement.newObjectDialogTitle
source: {0} - New (Preview)
de: {0} – Neu (Vorschau)
es: {0} - Nuevo (Versión preliminar)
fr: {0} : nouveau (préversion)
it: {0} - Nuovo (anteprima)
ja: {0} - 新規 (プレビュー)
ko: {0} 신규(미리 보기)
pt_br: {0} – Novo (Versão prévia)
ru: {0} — предварительная версия
zh_hans: {0}–新建(预览)
zh_hant: {0} - 新增 (預覽)

# objectManagement.databaseProperties.mbUnitText
source: {0} MB
fr: {0} MO
ru: {0} МБ

# objectManagement.objectPropertiesDialogTitle
source: {0} Properties (Preview) - {1}
de: Eigenschaften von {0} (Vorschau) – {1}
es: {0}Propiedades (versión preliminar) - {1}
fr: Propriétés{0} (préversion) - {1}
it: {0} Proprietà (anteprima) - {1}
ja: {0} プロパティ (プレビュー) - {1}
ko: {0} 속성(미리 보기) - {1}
pt_br: {0} Propriedades (Versão Prévia) – {1}
ru: Свойства {0} (предварительная версия) — {1}
zh_hans: {0} 属性 (预览版) - {1}
zh_hant: {0} 屬性 (預覽) - {1}

# downloadingServiceSizeChannelMsg
source: ({0} KB)
fr: ({0} Ko)
ru: ({0} КБ)

# downloadServiceDoneChannelMsg
source: Downloaded {0}
de: {0} wurde heruntergeladen
es: {0} descargado
fr: Téléchargement {0}
it: Scaricato {0}
ja: ダウンロード済み {0}
ko: {0}을(를) 다운로드함
pt_br: Baixado {0}
ru: Скачано {0}
zh_hans: 已下载 {0}
zh_hant: 已下載 {0}

# downloadingServiceStatusMsg
source: Downloading {0}
de: {0} wird heruntergeladen
es: Descargando {0}
fr: Téléchargement de {0}
it: Download di {0}
ja: {0} をダウンロードしています
ko: {0} 다운로드 중
pt_br: Baixando {0}
ru: Скачивание службы {0}
zh_hans: 正在下载 {0}
zh_hant: 正在下載 {0}

# downloadingServiceChannelMsg
source: Downloading {0}
de: {0} wird heruntergeladen
es: Descargando {0}
fr: Téléchargement de {0}
it: Download di {0}
ja: {0} をダウンロードしています
ko: {0} 다운로드 중
pt_br: Baixando {0}
ru: Скачивание службы {0}
zh_hans: 正在下载 {0}
zh_hant: 正在下載 {0}

# entryExtractedChannelMsg
source: Extracted {0} ({1}/{2})
de: {0} extrahiert ({1}/{2})
es: Elementos extraídos {0} ({1} de {2})
fr: {0} extrait ({1}/{2})
it: Estratto {0} ({1}/{2})
ja: {0} ({1}/{2}) を抽出しました
ko: 추출된 {0}({1}/{2})
pt_br: Extraído {0} ({1}/{2})
ru: Извлечено {0} ({1}/{2})
zh_hans: 已提取 {0} ({1}/{2})
zh_hant: 已擷取 {0} ({1}/{2})

# failedToStartServiceErrorMsg
source: Failed to start {0}
de: Fehler beim Starten von "{0}".
es: No se ha podido iniciar {0}
fr: Échec du démarrage de {0}
it: Non è stato possibile avviare {0}
ja: {0} を開始できませんでした
ko: {0}을(를) 시작하지 못함
pt_br: Falha ao iniciar o {0}
ru: Не удалось запустить {0}
zh_hans: 未能启动 {0}
zh_hant: 無法啟動 {0}

# installedServiceChannelMsg
source: Installed {0}
de: {0} wurde installiert
es: {0} instalado
fr: {0} installé
it: {0} installato
ja: {0} がインストールされました
ko: {0} 설치됨
pt_br: Instalado {0}
ru: Установлено: {0}
zh_hans: 已安装{0}
zh_hant: 已安裝 {0}

# installingServiceStatusMsg
source: Installing {0}
de: {0} wird installiert
es: Instalando {0}
fr: Installation de {0}
it: Installazione di {0}
ja: {0} のインストール中
ko: {0} 설치 중
pt_br: Instalando {0}
ru: Установка {0}
zh_hans: 正在安装 {0}
zh_hant: 正在安裝 {0}

# installingServiceChannelMsg
source: Installing {0} to {1}
de: "{0}" wird in "{1}" installiert.
es: Instalando {0} en {1}
fr: Installation de {0} sur {1}
it: Installazione di {0} in {1}
ja: {0} を {1} にインストールしています
ko: {1}에 {0} 설치 중
pt_br: Instalando {0} para {1}
ru: Установка {0} в {1}
zh_hans: 正在将 {0} 安装到 {1}
zh_hant: 正在將 {0} 安裝到 {1}

# startingServiceStatusMsg
source: Starting {0}
de: {0} wird gestartet
es: Iniciando {0}
fr: Démarrage de {0}
it: Avvio di {0}
ja: {0} を開始しています
ko: {0}을(를) 시작하는 중
pt_br: Iniciando {0}
ru: Запуск службы {0}
zh_hans: 正在启动{0}
zh_hant: 正在啟動 {0}

# serviceStartedStatusMsg
source: {0} Started
de: {0} gestartet
es: {0} Iniciado
fr: {0} démarré
it: {0} avviato
ja: {0} が開始されました
ko: {0} 시작됨
pt_br: {0} Iniciado
ru: Служба {0} запущена
zh_hans: 已启动{0}
zh_hant: 已啟動 {0}

# tableDesigner.turnOnPreloadingMessage
source: Do you want to reduce the table designer load time by enabling the database model preloading? The database model will be preloaded when you expand the database node in object explorer.
de: Möchten Sie die Ladezeit des Tabellen-Designers reduzieren, indem Sie das Vorabladen des Datenbankmodells aktivieren? Das Datenbankmodell wird vorab geladen, wenn Sie den Datenbankknoten im Objekt-Explorer erweitern.
es: ¿Desea reducir el tiempo de carga del diseñador de tablas habilitando la carga previa del modelo de base de datos? El modelo de base de datos se cargará previamente al expandir el nodo de base de datos en el explorador de objetos.
fr: Voulez-vous réduire le temps de chargement du concepteur de tables en activant le préchargement du modèle de base de données ? Le modèle de base de données est préchargé lorsque vous développez le nœud de base de données dans l’Explorateur d’objets.
it: Ridurre il tempo di caricamento di Progettazione tabelle abilitando il precaricamento del modello di database? Il modello di database viene precaricato quando si espande il nodo del database in Esplora oggetti.
ja: データベース モデルの事前読み込みを有効にして、テーブル デザイナーの読み込み時間を短縮しますか? オブジェクト エクスプローラーでデータベース ノードを展開すると、データベース モデルが事前に読み込まれます。
ko: 데이터베이스 모델 사전 로드를 활성화하여 테이블 디자이너 로드 시간을 줄이시겠습니까? 개체 탐색기에서 데이터베이스 노드를 확장하면 데이터베이스 모델이 미리 로드됩니다.
pt_br: Deseja reduzir o tempo de carregamento do designer de tabela habilitando o pré-carregamento do modelo de banco de dados? O modelo de banco de dados será pré-carregado quando você expandir o nó de banco de dados no explorador de objetos.
ru: Хотите сократить время загрузки конструктора таблиц, включив предварительную загрузку модели базы данных? Модель базы данных будет предварительно загружена при развертывании узла базы данных в обозревателе объектов.
zh_hans: 是否要通过启用数据库模型预加载来减少表设计器加载时间? 在对象资源管理器中展开数据库节点时，将预加载数据库模型。
zh_hant: 是否要啟用資料庫模型預先載入來縮短資料表設計工具的載入時間? 當您在物件總管中展開資料庫節點時，將會預先載入資料庫模型。

# tableDesigner.FailedToGetConnectionStringError
source: Failed to get connection string for the table. Please reconnect to the server and try again.
de: Fehler beim Abrufen der Verbindungszeichenfolge für die Tabelle. Stellen Sie erneut eine Verbindung mit dem Server her, und versuchen Sie es noch mal.
es: No se ha podido obtener la cadena de conexión para la tabla. Vuelva a conectarse al servidor e inténtelo de nuevo.
fr: Échec de l’obtention de la chaîne de connexion pour la table. Veuillez vous reconnecter au serveur et réessayez.
it: Impossibile ottenere la stringa di connessione per la tabella. Riconnettersi al server e riprovare.
ja: テーブルの接続文字列を取得できませんでした。サーバーに再接続して、もう一度お試しください。
ko: 테이블에 대한 연결 문자열을 가져오지 못했습니다. 서버에 다시 연결하고 다시 시도하세요.
pt_br: Falha ao obter cadeia de conexão para a tabela. Reconecte-se ao servidor e tente novamente.
ru: Не удалось получить строку подключения для таблицы. Подключитесь к серверу повторно и повторите попытку.
zh_hans: 无法获取表的连接字符串。请重新连接到服务器，然后重试。
zh_hant: 無法取得資料表的連接字串。請重新連線到伺服器，然後再試一次。

# tableDesigner.NewTable
source: New Table
de: Neue Tabelle
es: Nueva tabla
fr: Nouvelle table
it: Nuova tabella
ja: 新しいテーブル
ko: 새 테이블
pt_br: Nova Tabela
ru: Создать таблицу
zh_hans: 新建表
zh_hant: 新增資料表

# tableDesigner.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# tableDesigner.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# viewKnownIssuesText
source: View Known Issues
de: Bekannte Probleme anzeigen
es: Ver problemas conocidos
fr: Voir les problèmes connus
it: Visualizza problemi noti
ja: 既知の問題の表示
ko: 알려진 문제 보기
pt_br: Exibir Problemas Conhecidos
ru: Просмотреть известные проблемы
zh_hans: 查看已知问题
zh_hant: 檢視已知問題

# serviceCrashMessage
source: {0} component exited unexpectedly. Please restart Azure Data Studio.
de: Die Komponente "{0}" wurde unerwartet beendet. Starten Sie Azure Data Studio neu.
es: El componente {0} se cerró de forma inesperada. Reinicie Azure Data Studio.
fr: Le composant {0} a quitté de manière inattendue. Redémarrez Azure Data Studio.
it: Il componente {0} è stato chiuso in modo imprevisto. Riavviare Azure Data Studio.
ja: {0} コンポーネントが予期せず終了しました。Azure Data Studio を再起動してください。
ko: {0} 구성 요소가 예기치 않게 종료되었습니다. Azure Data Studio를 다시 시작하세요.
pt_br: O componente {0} foi encerrado inesperadamente. Reinicie o Azure Data Studio.
ru: Компонент {0} неожиданно завершил работу. Перезапустите Azure Data Studio.
zh_hans: {0} 个组件意外退出。请重启 Azure Data Studio。
zh_hant: {0} 個元件意外結束。請重新啟動 Azure Data Studio。

# objectManagement.addText
source: Add…
de: Hinzufügen...
es: Agregar…
fr: Ajouter…
it: Aggiungi…
ja: 追加...
ko: 추가…
pt_br: Adicionar…
ru: Добавить...
zh_hans: 添加...
zh_hant: 新增...

# mssql.ui.scriptError
source: An error occurred while generating the script. {0}
de: Fehler beim Generieren des Skripts. {0}
es: Se ha producido un error al generar el script. {0}
fr: Une erreur s’est produite lors de la génération du script. {0}
it: Errore durante la generazione dello script. {0}
ja: スクリプトの生成中にエラーが発生しました。{0}
ko: 스크립트를 생성하는 동안 오류가 발생했습니다. {0}
pt_br: Ocorreu um erro ao gerar o script. {0}
ru: Произошла ошибка при создании сценария. {0}
zh_hans: 生成脚本时出错。{0}
zh_hant: 產生指令碼時發生錯誤。{0}

# objectManagement.editText
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
pt_br: Editar
ru: Изменить
zh_hans: 编辑
zh_hant: 編輯

# mssql.ui.generatingScript
source: Generating script...
de: Skript wird generiert...
es: Generando el script...
fr: Génération du script...
it: Generazione script...
ja: スクリプトを生成しています...
ko: 스크립트 생성 중...
pt_br: Gerando script...
ru: Создание сценария…
zh_hans: 正在生成脚本...
zh_hant: 正在產生指令碼...

# mssql.ui.helpText
source: Help
de: Hilfe
es: Ayuda
fr: Aide
it: Guida
ja: ヘルプ
ko: 도움말
pt_br: Ajuda
ru: Справка
zh_hans: 帮助
zh_hant: 說明

# mssql.ui.loadingDialog
source: Loading dialog completed
de: Dialogfeld wurde geladen
es: Se completó el cuadro de diálogo de carga
fr: Boîte de dialogue de chargement terminée
it: Caricamento della finestra di dialogo completato
ja: ダイアログの読み込みが完了しました
ko: 대화 상자 로드 완료
pt_br: Carregamento da caixa de diálogo concluído
ru: Загрузка диалогового окна завершена
zh_hans: 已完成加载对话框
zh_hant: 已完成載入對話方塊

# mssql.ui.OkText
source: OK
es: Aceptar
ko: 확인
ru: ОК
zh_hans: 确定
zh_hant: 確定

# objectManagement.removeText
source: Remove
de: Entfernen
es: Quitar
fr: Supprimer
it: Rimuovi
ja: 削除
ko: 제거
pt_br: Remover
ru: Удалить
zh_hans: 删除
zh_hant: 移除

# mssql.ui.scriptText
source: Script
de: Skript
ja: スクリプト
ko: 스크립트
ru: Сценарий
zh_hans: 脚本
zh_hant: 指令碼

# mssql.ui.generatingScriptCompleted
source: Script generated
de: Das Skript wurde generiert.
es: Script generado
fr: Script généré
it: Script generato
ja: スクリプトが生成されました
ko: 스크립트가 생성됨
pt_br: Script gerado
ru: Сценарий создан
zh_hans: 生成的脚本
zh_hant: 已產生指令碼

# mssql.ui.scriptGenerated
source: Script has been generated successfully. You can close the dialog to view it in the newly opened editor.
de: Das Skript wurde erfolgreich generiert. Sie können das Dialogfeld schließen, um es im neu geöffneten Editor anzuzeigen.
es: El script se ha generado correctamente. Puedes cerrar el cuadro de diálogo para verlo en el editor recién abierto.
fr: Le script a été généré avec succès. Vous pouvez fermer la boîte de dialogue pour l'afficher dans l'éditeur nouvellement ouvert.
it: Lo script è stato generato. È possibile chiudere la finestra di dialogo per visualizzarla nell'editor appena aperto.
ja: スクリプトが正常に生成されました。このダイアログを閉じると、エディターが新しく開いてスクリプトが表示されます。
ko: 스크립트가 생성되었습니다. 대화 상자를 닫아 새로 연 편집기에서 스크립트를 볼 수 있습니다.
pt_br: O script foi gerado com êxito. Você pode fechar a caixa de diálogo para exibi-la no editor recém-aberto.
ru: Сценарий успешно создан. Вы можете закрыть диалоговое окно, чтобы просмотреть его в открывшемся редакторе.
zh_hans: 已成功生成脚本。可以关闭对话框以在新打开的编辑器中查看。
zh_hant: 已成功產生指令碼。您可以關閉對話方塊，以在新開啟的編輯器中檢視它。

# objectManagement.selectLabel
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

# mssql.ui.noActionScriptedMessage
source: There is no action to be scripted.
de: Es ist keine Aktion für das Skript vorhanden.
es: No hay acción para incluir en el script.
fr: Aucune action ne requiert de script.
it: Nessuna azione per cui generare uno script.
ja: スクリプトを作成するアクションはありません。
ko: 스크립팅할 동작이 없습니다.
pt_br: Não há ação a ser incluída no script.
ru: Нет действий для включения в скрипт.
zh_hans: 没有要编写脚本的操作。
zh_hant: 沒有要編寫指令碼的動作。

# mssql.ui.yesText
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# json.schemas.url.desc
source: A URL to a schema or a relative path to a schema in the current directory
de: Eine URL zu einem Schema oder ein relativer Pfad zu einem Schema im aktuellen Verzeichnis
es: Una dirección URL a un esquema o una ruta de acceso relativa a un esquema en el directorio actual
fr: URL de schéma ou chemin relatif d'un schéma dans le répertoire actuel
it: URL di uno schema o percorso relativo di uno schema nella directory corrente
ja: スキーマへの URL または現在のディレクトリ内のスキーマへの相対パス
ko: 현재 디렉터리에 있는 스키마의 URL 또는 상대 경로
pt_br: Uma URL para um esquema ou um caminho relativo a um esquema no diretório atual
ru: URL-адрес схемы или относительный путь к ней в текущем каталоге
zh_hans: 架构的 URL 或当前目录中架构的相对路径
zh_hant: 目前目錄中的結構描述 URL 或結構描述相對路徑

# json.schemas.fileMatch.item.desc
source: A file pattern that can contain '*' to match against when resolving JSON files to schemas.
de: Ein Dateimuster, das "*" enthalten kann, zum Abgleich beim Auflösen von JSON-Dateien in Schemas
es: Un patrón de archivo que puede contener "*" con el cual coincidir cuando los archivos JSON se resuelvan en esquemas.
fr: Modèle de fichier pouvant contenir '*' à mapper durant la résolution de fichiers JSON en schémas.
it: Criteri dei file che possono contenere '*' da usare per la ricerca durante la risoluzione di file JSON in schemi.
ja: JSON ファイルをスキーマに解決するときに突き合わせる、'*' を含められるファイル パターンです。
ko: JSON 파일로 스키마를 확인할 때 일치할 '*'를 포함할 수 있는 파일 패턴입니다.
pt_br: Um padrão de arquivos que pode conter '*' para fazer a correspondência ao resolver arquivos JSON para esquemas.
ru: Шаблон файла, который может содержать "*" и с которым выполняется сравнение, при разрешении JSON-файлов в схемах.
zh_hans: 将 JSON 文件解析到架构时用于匹配的可以包含 "*" 的文件模式。
zh_hant: 可包含 '*' 的檔案模式，在將 JSON 檔案解析成結構描述時的比對對象。

# mssql.connectionOptions.groupName.advanced
source: Advanced
de: Erweitert
es: Opciones avanzadas
fr: Avancé
it: Avanzata
ja: 詳細設定
ko: 고급
pt_br: Avançado
ru: Дополнительно
zh_hans: 高级
zh_hant: 進階

# json.schemas.fileMatch.desc
source: An array of file patterns to match against when resolving JSON files to schemas.
de: Ein Array aus Dateimustern zum Abgleich beim Auflösen von JSON-Dateien in Schemas
es: Una matriz de patrones de archivo con los cuales coincidir cuando los archivos JSON se resuelvan en esquemas.
fr: Tableau de modèles de fichier à mapper durant la résolution de fichiers JSON en schémas.
it: Matrice di criteri dei file da usare per la ricerca durante la risoluzione di file JSON in schemi.
ja: JSON ファイルをスキーマに解決するときに突き合わせるファイル パターンの配列です。
ko: JSON 파일로 스키마를 확인할 때 일치할 파일 패턴의 배열입니다.
pt_br: Uma matriz de padrões de arquivos para fazer correspondência ao resolver arquivos JSON para esquemas.
ru: Массив шаблонов файлов, с которым выполняется сравнение, при разрешении JSON-файлов в схемах.
zh_hans: 将 JSON 文件解析到架构时用于匹配的一组文件模式。
zh_hant: 檔案模式陣列，在將 JSON 檔案解析成結構描述時的比對對象。

# mssql.query.executionTimeout
source: An execution time-out of 0 indicates an unlimited wait (no time-out)
de: Ein Timeoutwert von 0 für die Ausführung kennzeichnet einen unbegrenzten Wartevorgang (kein Timeout).
es: Un tiempo de espera de ejecución de 0 indica una espera ilimitada (sin tiempo de espera)
fr: Un délai d'expiration de 0 indique une attente illimitée (aucun délai d'expiration)
it: L'impostazione del valore 0 per il timeout di esecuzione indica un'attesa illimitata (nessun timeout)
ja: 実行タイムアウトが 0 の場合は、無制限の待機 (タイムアウトなし) を示します
ko: 실행 시간 제한이 0이면 무제한 대기(시간 제한 없음)를 나타냅니다.
pt_br: Um tempo limite de execução 0 indica uma espera ilimitada (sem tempo limite)
ru: Время ожидания выполнения, равное 0, указывает на неограниченное время ожидания
zh_hans: 如果执行超时为 0，则表示无限等待(不会超时)
zh_hant: 執行逾時為 0 表示無限等候 (不逾時)

# mssql.connectionOptions.applicationIntent.displayName
source: Application intent
de: Anwendungszweck
es: Intención de la aplicación
fr: Intention d'application
it: Finalità dell'applicazione
ja: アプリケーションの意図
ko: 애플리케이션 의도
pt_br: Intenção do aplicativo
ru: Намерение приложения
zh_hans: 应用意图
zh_hant: 應用程式的意圖

# mssql.connectionOptions.applicationName.displayName
source: Application name
de: Anwendungsname
es: Nombre de la aplicación
fr: Nom de l'application
it: Nome dell'applicazione
ja: アプリケーション名
ko: 애플리케이션 이름
pt_br: Nome da Aplicação
ru: Имя приложения
zh_hans: 应用程序名称
zh_hant: 應用程式名稱

# json.schemas.desc
source: Associate schemas to JSON files in the current project
de: Hiermit werden Schemas zu JSON-Dateien im aktuellen Projekt zugeordnet.
es: Asociar esquemas a archivos JSON en el proyecto actual
fr: Associer des schémas aux fichiers JSON dans le projet actuel
it: Associa schemi a file JSON nel progetto corrente
ja: スキーマを現在のプロジェクトの JSON ファイルに関連付けます
ko: 현재 프로젝트에서 스키마를 JSON 파일에 연결
pt_br: Esquemas associados a arquivos JSON no projeto atual
ru: Связь схем с JSON-файлами в текущем проекте
zh_hans: 将架构关联到当前项目中的 JSON 文件
zh_hant: 在結構描述與目前專案的 JSON 檔案之間建立關聯

# mssql.connectionOptions.attachDbFilename.displayName
source: Attach DB filename
de: Dateiname der anzufügenden Datenbank
es: Adjuntar nombre de archivo de base de datos
fr: Attacher le nom de fichier de base de données
it: Collega nome file del database
ja: 添付 DB ファイル名
ko: DB 파일 이름 연결
pt_br: Anexar o nome do arquivo de BD
ru: Имя вложенного файла базы данных
zh_hans: 附加 DB 文件名
zh_hant: 附加 DB 檔案名稱

# title.attachDatabase
source: Attach Database (Preview)
de: Datenbank anfügen (Vorschau)
es: Adjuntar base de datos (versión preliminar)
fr: Attacher la base de données (préversion)
it: Collega database (anteprima)
ja: データベースのアタッチ (プレビュー)
ko: 데이터베이스 첨부(미리 보기)
pt_br: Anexar banco de dados (versão prévia)
ru: Подключение базы данных (предварительная версия)
zh_hans: 附加数据库(预览版)
zh_hant: 附加資料庫 (預覽)

# mssql.connectionOptions.enclaveAttestationUrl.displayName
source: Attestation URL
de: Nachweis-URL
es: URL de atestación
fr: URL d’attestation
it: URL di attestazione
ja: 構成証明 URL
ko: 증명 URL
pt_br: URL do Atestado
ru: URL-адрес аттестации
zh_hans: 认证 URL
zh_hant: 證明 URL

# mssql.connectionOptions.enclaveAttestationProtocol.displayName
source: Attestation protocol
de: Nachweisprotokoll
es: Protocolo de atestación
fr: Protocole d'attestation
it: Protocollo di attestazione
ja: 構成証明プロトコル
ko: 증명 프로토콜
pt_br: Protocolo de atestado
ru: Протокол аттестации
zh_hans: 证明协议
zh_hant: 證明通訊協定
