Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.data-workspace.*.xlf
Languages: de, fr, it, ja, ko, zh_hans

source: All Project Types
de: Alle Projekttypen
fr: Tous les types de projets
it: Tutti tipi di progetto
ja: すべてのプロジェクトの種類
ko: 모든 프로젝트 형식
zh_hans: 所有项目类型

# dataworkspace.restartConfirmation
source: Azure Data Studio needs to be restarted for the project to be added to the workspace. Restart now?
de: Azure Data Studio muss neu gestartet werden, damit das Projekt in den Arbeitsbereich hinzugefügt wird. Jetzt neu starten?
fr: Azure Data Studio doit être redémarré pour que le projet soit ajouté à l'espace de travail. Redémarrer maintenant?
it: È necessario riavviare Azure Data Studio per aggiungere il progetto all'area di lavoro. Riavvia ora?
ja: プロジェクトをワークスペースに追加するには、Azure Data Studio を再起動する必要があります。今すぐ再起動しますか?
ko: 프로젝트를 작업 영역에 추가하려면 Azure Data Studio를 다시 시작해야 합니다. 지금 다시 시작하시겠습니까?
zh_hans: 需要重启 Azure Data Studio 才能将项目添加到工作区。立即重启?

# dataworkspace.browse
source: Browse
de: Durchsuchen
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
zh_hans: 浏览

# dataworkspace.browseEllipsis
source: Browse...
de: Durchsuchen...
fr: Parcourir...
it: Sfoglia...
ja: 参照...
ko: 찾아보기...
zh_hans: 浏览...

# dataworkspace.sdkLearnMorePlaceholder
source: Click "Learn More" button for more information about SDK-style projects
de: Klicken Sie auf die Schaltfläche „Weitere Informationen“, um weitere Informationen zu Projekten im SDK-Stil zu erhalten.
fr: Cliquez sur le bouton « En savoir plus » pour plus d’informations sur les projets de style SDK
it: Fare clic sul pulsante "Altre informazioni" per altre informazioni sui progetti in stile SDK
ja: SDK スタイルのプロジェクトの詳細については、[詳細情報] ボタンをクリックしてください
ko: SDK 스타일 프로젝트에 관한 자세한 내용을 보려면 "자세한 정보" 버튼을 클릭합니다.
zh_hans: 单击“了解详细信息”按钮了解有关 SDK 样式项目的详细信息

# LocalDevInfo
source: Click "Learn more" button for more information about local development experience to {0}
de: Klicken Sie auf die Schaltfläche „Weitere Informationen“, um weitere Informationen zur lokalen Entwicklungserfahrung bezüglich {0} zu erfahren
fr: Cliquez sur le bouton « En savoir plus » pour plus d’informations sur l’expérience de développement local pour {0}
it: Fare clic sul pulsante "Altre informazioni" per altre informazioni sull'esperienza di sviluppo locale per {0}
ja: {0}するローカル開発エクスペリエンスの詳細については、[詳細情報] ボタンをクリックしてください
ko: {0} 로컬 개발 환경에 대한 자세한 내용을 보려면 "자세한 정보" 단추를 클릭합니다.
zh_hans: 单击“了解详细信息”按钮，以详细了解 {0} 的本地开发体验

# gitCloneMessage
source: Cloning git repository '{0}'...
de: Das Git-Repository "{0}" wird geklont ...
fr: Clonage du dépôt Git '{0}'...
it: Clonazione del repository GIT '{0}'...
ja: Git リポジトリ '{0}' をクローンしています...
ko: Git 리포지토리 '{0}'을(를) 복제하는 중...
zh_hans: 正在克隆 Git 存储库“{0}”...

# dataworkspace.create
source: Create
de: Erstellen
fr: Créer
it: Crea
ja: 作成
ko: 만들기
zh_hans: 创建

# dataworkspace.NewProjectDialogTitle
source: Create new database project
de: Neues Datenbankprojekt erstellen
fr: Créer un projet de base de données
it: Creare un nuovo progetto di database
ja: 新しいデータベース プロジェクトの作成
ko: 새 데이터베이스 프로젝트 만들기
zh_hans: 创建新数据库项目

# dataworkspace.default
source: Default
de: Standard
fr: Par défaut
it: Predefinito
ja: 既定
ko: 기본값
zh_hans: 默认

# dataworkspace.projectDirectoryAlreadyExistErrorShort
source: Directory '{0}' already exists in the selected location, please choose another
de: Das Verzeichnis "{0}" ist bereits am ausgewählten Speicherort vorhanden, wählen Sie ein anderes aus
fr: Le répertoire « {0} » existe déjà à l’emplacement sélectionné, choisissez-en un autre
it: La directory '{0}' esiste già nel percorso selezionato, sceglierne un altro
ja: ディレクトリ '{0}' は選択された場所に既に存在します。別の場所を選択してください
ko: 디렉터리 '{0}'이(가) 선택한 위치에 이미 있습니다. 다른 디렉터리를 선택하세요.
zh_hans: 所选位置中已存在目录“{0}”，请选择其他项

# dataworkspace.enterProjectName
source: Enter Project Name
de: Geben Sie den Projektnamen ein
fr: Entrer le nom du projet
it: Immettere il nome del progetto
ja: プロジェクト名を入力してください
ko: 프로젝트 이름 입력
zh_hans: 输入项目名

# dataworkspace.projectNamePlaceholder
source: Enter project name
de: Geben Sie den Projektnamen ein
fr: Entrer le nom du projet
it: Immettere il nome del progetto
ja: プロジェクト名を入力してください
ko: 프로젝트 이름 입력
zh_hans: 输入项目名称

# dataworkspace.gitRepoUrlPlaceholder
source: Enter remote git repository URL
de: URL des Git-Remoterepositorys eingeben
fr: Entrer une URL de référentiel git distant
it: Immettere l'URL del repository GIT remoto
ja: リモート git リポジトリの URL を入力してください
ko: 원격 GIT 리포지토리 URL 입력
zh_hans: 输入远程 git 存储库 URL

# gitCloneError
source: Error during git clone. View git output for more details
de: Fehler beim Git-Klonen. Weitere Details finden Sie in der Git-Ausgabe
fr: Erreur lors du Git Clone. Afficher la sortie git pour plus de détails
it: Errore durante il comando git clone. Per altri dettagli, visualizzare l'output git
ja: git の複製中にエラーが発生しました。詳細について git 出力を表示します
ko: GIT 복제 중 오류가 발생했습니다. GIT 출력 보기로 자세한 내용 확인
zh_hans: Git 克隆期间出错。请查看 git 输出以了解更多详细信息

# activateExtensionFailed
source: Failed to load the project provider extension '{0}'. Error message: {1}
de: Fehler beim Laden der Projektanbietererweiterung "{0}". Fehlermeldung: {1}
fr: Échec du chargement de l’extension de fournisseur de projet « {0} ». Message d’erreur : {1}
it: Non è stato possibile caricare l'estensione del provider di progetti '{0}'. Messaggio di errore: {1}
ja: プロジェクト プロバイダー拡張機能 '{0}' を読み込むことができませんでした。エラー メッセージ: {1}
ko: 프로젝트 공급자 확장 '{0}'을(를) 로드하지 못했습니다. 오류 메시지: {1}
zh_hans: 未能加载项目提供程序扩展“{0}”。错误消息: {1}

# fileDoesNotExist
source: File '{0}' doesn't exist
de: Die Datei "{0}" ist nicht vorhanden
fr: Le fichier « {0} » n'existe pas
it: Il file '{0}' non esiste
ja: ファイル '{0}' は存在しません
ko: 파일 '{0}'이(가) 없습니다.
zh_hans: 文件“{0}”不存在

# tooLongFilenameErrorMessage
source: File name cannot be over 255 characters
de: Der Dateiname darf nicht mehr als 255 Zeichen umfassen
fr: Le nom de fichier ne peut pas dépasser 255 caractères
it: Il nome del file non può contenere più di 255 caratteri
ja: ファイル名は 255 文字を超えることはできません
ko: 파일 이름은 255자를 초과할 수 없습니다.
zh_hans: 文件名不能超过 255 个字符

# whitespaceFilenameErrorMessage
source: File name cannot be whitespace
de: Der Dateiname darf nicht aus Leerzeichen bestehen.
fr: Un nom de fichier ne peut pas être un espace blanc
it: Il nome file non può essere vuoto
ja: ファイル名を空白にすることはできません
ko: 파일 이름은 공백일 수 없습니다.
zh_hans: 文件名不能为空白

# filenameEndingInPeriodErrorMessage
source: File name cannot end with a period
de: Der Dateiname darf nicht mit einem Punkt enden.
fr: Le nom ne peut pas se terminer par un point
it: Il nome file non può terminare con un punto
ja: ファイル名の末尾をピリオドにすることはできません
ko: 파일 이름은 마침표(.)로 끝날 수 없습니다.
zh_hans: 文件名不能以句号结尾

# trailingWhitespaceErrorMessage
source: File name cannot start or end with whitespace
de: Der Dateiname darf nicht mit einem Leerzeichen beginnen oder enden
fr: Le nom de fichier ne peut pas commencer ou se terminer par un espace blanc
it: Il nome file può iniziare o terminare con uno spazio vuoto
ja: ファイル名の先頭または末尾に空白文字を使用することはできません
ko: 파일 이름은 공백으로 시작하거나 끝날 수 없습니다
zh_hans: 文件名不能以空格开头或结尾

# dataworkspace.gitRepoUrlTitle
source: Git repository URL
fr: URL du référentiel Git
it: URL del repository GIT
ja: Git リポジトリ URL
ko: GIT 리포지토리 URL
zh_hans: Git 存储库 URL

# invalidFileCharsErrorMessage
source: Invalid file characters
de: Ungültige Dateizeichen
fr: Caractères de fichier non valides
it: Caratteri di file non validi
ja: 無効なファイル文字
ko: 잘못된 파일 문자
zh_hans: 文件字符无效

# dataworkspace.learnMore
source: Learn More
de: Weitere Informationen
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
zh_hans: 了解详细信息

# openedProjectsUndefinedAfterRefresh
source: List of opened projects should not be undefined after refresh from disk.
de: Die Liste der geöffneten Projekte sollte nach der Aktualisierung vom Datenträger nicht undefiniert sein.
fr: La liste des projets ouverts ne doit pas être indéfinie après l’actualisation à partir du disque.
it: L'elenco dei progetti aperti non deve essere indefinito dopo l'aggiornamento dal disco.
ja: ディスクから更新した後に、開いているプロジェクトの一覧を未定義にすることはできません。
ko: 디스크에서 새로 고친 후에는 열린 프로젝트 목록을 정의하지 않아야 합니다.
zh_hans: 从磁盘刷新后，打开的项目列表应已被定义。

# dataworksapce.local
source: Local
de: Lokal
it: Locale
ja: ローカル
ko: 로컬
zh_hans: 本地

# dataworkspace.localClonePathTitle
source: Local clone path
de: Lokaler Klonpfad
fr: Chemin d'accès de clone local
it: Percorso clonazione locale
ja: ローカルの複製パス
ko: 로컬 복제 경로
zh_hans: 本地克隆路径

# dataworkspace.locationSelectorTitle
source: Location
de: Speicherort
fr: Emplacement
it: Percorso
ja: 場所
ko: 위치
zh_hans: 位置

# dataworkspace.projectLocationTitle
source: Location
de: Speicherort
fr: Emplacement
it: Posizione
ja: 場所
ko: 위치
zh_hans: 位置

# dataworkspace.projectNameTitle
source: Name
fr: Nom
it: Nome
ja: 名前
ko: 이름
zh_hans: 名称

# dataworkspace.nameCannotBeEmpty
source: Name cannot be empty
de: Name darf nicht leer sein
fr: Le nom ne peut pas être vide
it: Il nome non può essere vuoto.
ja: 名前を空にすることはできません。
ko: 이름은 비워 둘 수 없습니다.
zh_hans: 名称不能为空

# dataworkspace.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
zh_hans: 否

# noProjectProvidingExtensionsInstalled
source: No database project extensions are installed. Please install a database project extension to use this feature.
de: Es sind keine Datenbankprojekterweiterungen installiert. Installieren Sie eine Datenbankprojekterweiterung, um dieses Feature zu verwenden.
fr: Aucune extension de projet de base de données n’est installée. Installez une extension de projet de base de données pour utiliser cette fonctionnalité.
it: Non sono installate estensioni di progetto di database. Installare un'estensione di progetto di database per usare questa funzionalità.
ja: データベース プロジェクト拡張機能はインストールされていません。この機能を使用するには、データベース プロジェクト拡張機能をインストールしてください。
ko: 데이터베이스 프로젝트 확장이 설치되어 있지 않습니다. 이 기능을 사용하려면 데이터베이스 프로젝트 확장을 설치하세요.
zh_hans: 未安装数据库项目扩展。请安装数据库项目扩展以使用此功能。

# UnknownProjectTypeError
source: No provider was found for project type with id: '{0}'
de: Für den Projekttyp mit der ID "{0}" wurde kein Anbieter gefunden
fr: Aucun fournisseur n’a été trouvé pour le type de projet ayant l’ID : « {0} »
it: Non è stato trovato alcun provider per il tipo di progetto con ID: '{0}'
ja: ID: '{0}' のプロジェクトの種類のプロバイダーが見つかりませんでした
ko: ID가 '{0}'인 프로젝트 형식에 대한 공급자를 찾을 수 없습니다.
zh_hans: 找不到 id 为“{0}”的项目类型的提供程序

# UnknownProjectsError
source: No provider was found for the following projects: {0}
de: Für die folgenden Projekte wurde kein Anbieter gefunden: {0}
fr: Aucun fournisseur n’a été trouvé pour les projets suivants : {0}
it: Non è stato trovato alcun provider per i progetti seguenti: {0}
ja: 次のプロジェクトのプロバイダーが見つかりませんでした: {0}
ko: 다음 프로젝트에 대한 공급자를 찾을 수 없습니다. {0}
zh_hans: 找不到以下项目的提供程序: {0}

# dataworkspace.ok
source: OK
ko: 확인
zh_hans: 确定

# onlyMovingOneFileIsSupported
source: Only moving one file at a time is supported.
de: Es kann immer nur eine Datei auf einmal verschoben werden.
fr: Le déplacement d’un seul fichier à la fois est pris en charge.
it: È supportato solo lo spostamento di un file alla volta.
ja: 一度に 1 つのファイルのみを移動できます。
ko: 한 번에 하나의 파일만 이동할 수 있습니다.
zh_hans: 仅支持一次移动一个文件。

# dataworkspace.open
source: Open
de: Öffnen
fr: Ouvrir
it: Apri
ja: 開く
ko: 열기
zh_hans: 打开

# dataworkspace.openExistingDialogTitle
source: Open Existing Project
de: Vorhandenes Projekt öffnen
fr: Ouvrir un projet existant
it: Apri progetto esistente
ja: 既存のプロジェクトを開く
ko: 기존 프로젝트 열기
zh_hans: 打开现有项目

# noPreviousData
source: Prior {0} for the current project will appear here, please run to see the results.
de: Vorherige "{0}" für das aktuelle Projekt werden hier angezeigt. Führen Sie die Ausführung aus, um die Ergebnisse anzuzeigen.
fr: Les {0} antérieures pour le projet actif s’afficheront ici, exécutez pour voir les résultats.
it: {0} precedenti per il progetto corrente verranno visualizzati qui. Eseguire per visualizzare i risultati.
ja: 現在のプロジェクトの前の {0} がここに表示されます。結果を確認するには、実行してください。
ko: 현재 프로젝트에 대한 이전 {0}이(가) 여기에 표시됩니다. 실행하여 결과를 확인하세요.
zh_hans: 当前项目的前期 {0} 将在此处显示，请运行以查看结果。

# dataworkspace.project
source: Project
de: Projekt
it: Progetto
ja: プロジェクト
zh_hans: 项目

# projectFailedToLoad
source: Project '{0}' failed to load: {1} To view more details, [open the developer console](command:workbench.action.toggleDevTools).
de: Projekt '{0}' konnte nicht geladen werden: {1} Um weitere Details zu sehen, [öffnen Sie die Entwicklerkonsole](command:workbench.action.toggleDevTools).
fr: Échec du chargement du projet '{0}' : {1} pour afficher plus de détails, [ouvrez la console du développeur](commande : workbench.action.toggleDevTools).
it: Non è stato possibile caricare il progetto '{0}': {1} Per visualizzare altri dettagli, [open the developer console](command:workbench.action.toggleDevTools).
ja: プロジェクト '{0}' を読み込めませんでした: {1}。詳細を表示するには、[開発者コンソールを開いてください](command:workbench.action.toggleDevTools)。
ko: ‘{0}’ 프로젝트를 로드하지 못했습니다. {1}. 자세한 내용을 보려면 [개발자 콘솔을 여세요](command:workbench.action.toggleDevTools).
zh_hans: 无法加载项目 '{0}':{1} 要查看更多详细信息，请 [打开开发人员控制台](command:workbench.action.toggleDevTools)

# dataworkspace.projectAlreadyOpened
source: Project '{0}' is already opened.
de: Das Projekt "{0}" ist bereits geöffnet.
fr: Le projet « {0} » est déjà ouvert.
it: Il progetto '{0}' è già aperto.
ja: プロジェクト '{0}' は既に開かれています。
ko: 프로젝트 '{0}'이(가) 이미 열려 있습니다.
zh_hans: 已打开项目“{0}”。

# dataworkspace.projectFileTitle
source: Project file
de: Projektdatei
fr: Fichier projet
it: File di progetto
ja: プロジェクト ファイル
ko: 프로젝트 파일
zh_hans: 项目文件

# projectNameNull
source: Project name is null
de: Projektname ist Null
fr: Le nom de la feuille est Null
it: Il nome del progetto è Null
ja: プロジェクト名が NULL です
ko: 프로젝트 이름이 Null입니다.
zh_hans: 项目名为 null

# dataworksapce.refresh
source: Refresh
de: Aktualisieren
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
zh_hans: 刷新

# dataworkspace.remoteGitRepo
source: Remote git repository
de: Git-Remoterepository
fr: Référentiel Git distant
it: Repository GIT remoto
ja: リモート git リポジトリ
ko: 원격 GIT 리포지토리
zh_hans: 远程 Git 存储库

# reservedValueErrorMessage
source: Reserved file name. Choose another name and try again
de: Reservierter Dateiname. Wählen Sie einen anderen Namen aus, und versuchen Sie es noch mal.
fr: Nom de fichier réservé. Choisissez un autre nom et réessayez
it: Nome file riservato. Scegliere un altro nome e riprovare
ja: 予約済みのファイル名です。別の名前を選択して、もう一度お試しください
ko: 예약된 파일 이름입니다. 다른 이름을 선택하고 다시 시도하십시오.
zh_hans: 文件名已保留。请选择其他名称，然后重试

# dataworkspace.sdkStyleProject
source: SDK-style project (Preview)
de: Projekte im SDK-Stil (Vorschau)
fr: Projet de style SDK (préversion)
it: Progetto in stile SDK (Anteprima)
ja: SDK スタイルのプロジェクト (プレビュー)
ko: SDK 스타일 프로젝트(미리 보기)
zh_hans: SDK 样式项目(预览版)

# dataworkspace.select
source: Select
de: Auswählen
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
zh_hans: 选择

# ++CODE++60dc6b3745804caa2d48a35dbb7306bb3f4f05286e7f9de259423f6abe87ec8f
source: Select
de: Auswählen
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
zh_hans: 选择

# dataworkspace.selectProjectType
source: Select Database Project Type
de: Datenbankprojekttyp auswählen
fr: Sélectionner le type de projet de base de données
it: Selezionare il tipo di progetto di database
ja: データベース プロジェクトの種類の選択
ko: 데이터베이스 프로젝트 유형 선택
zh_hans: 选择数据库项目类型

# dataworkspace.selectProjectLocation
source: Select Project Location
de: Projektspeicherort auswählen
fr: Sélectionner l’emplacement du projet
it: Seleziona percorso del progetto
ja: プロジェクトの場所を選択
ko: 프로젝트 위치 선택
zh_hans: 选择项目位置

# dataworkspace.selectTargetPlatform
source: Select Target Platform
de: Zielplattform auswählen
fr: Sélectionner la plateforme cible
it: Selezione della piattaforma di destinazione
ja: ターゲット プラットフォームの選択
ko: 대상 플랫폼 선택
zh_hans: 选择目标平台

# dataworkspace.localClonePathPlaceholder
source: Select location to clone repository locally
de: Speicherort zum lokalen Klonen des Repositorys auswählen
fr: Sélectionner l’emplacement vers lequel cloner le référentiel localement
it: Selezionare il percorso per clonare il repository in locale
ja: リポジトリをローカルに複製する場所を選択してください
ko: 리포지토리를 로컬로 복제할 위치 선택
zh_hans: 选择本地克隆存储库的位置

# dataworkspace.projectLocationPlaceholder
source: Select location to create project
de: Speicherort zum Erstellen des Projekts auswählen
fr: Sélectionner l’emplacement de création du projet
it: Selezionare il percorso per creare il progetto
ja: プロジェクトを作成する場所の選択
ko: 프로젝트를 만들 위치 선택
zh_hans: 选择要创建项目的位置

# dataworkspace.projectFilePlaceholder
source: Select project file
de: Projektdatei auswählen
fr: Sélectionner un fichier de projet
it: Seleziona file di progetto
ja: プロジェクト ファイルを選択
ko: 프로젝트 파일 선택
zh_hans: 选择项目文件

# dataworkspace.workspacePlaceholder
source: Select workspace ({0}) file
de: Arbeitsbereichsdatei auswählen ({0})
fr: Sélectionner le fichier d’espace de travail ({0})
it: Selezionare un file dell'area di lavoro ({0})
ja: ワークスペース ({0}) ファイルの選択
ko: 작업 영역({0}) 파일 선택
zh_hans: 选择工作区({0})文件

# dataworkspace.targetPlatform
source: Target Platform
de: Zielplattform
fr: Plateforme cible
it: Piattaforma di destinazione
ja: ターゲット プラットフォーム
ko: 대상 플랫폼
zh_hans: 目标平台

# dataworkspace.cloneParentDirectoryNotExistError
source: The selected clone path '{0}' does not exist or is not a directory.
de: Der ausgewählte Klonpfad "{0}" ist nicht vorhanden oder kein Verzeichnis.
fr: Le chemin de clone sélectionné « {0} » n’existe pas ou n’est pas un répertoire.
it: Il percorso di clonazione selezionato '{0}' non esiste o non è una directory.
ja: 選択したパスのクローン '{0}' は存在しないか、ディレクトリではありません。
ko: 선택한 복제 경로 '{0}'이(가) 없거나 디렉터리가 아닙니다.
zh_hans: 所选克隆路径“{0}”不存在或不是目录。

# dataworkspace.projectParentDirectoryNotExistError
source: The selected project location '{0}' does not exist or is not a directory.
de: Der ausgewählte Projektspeicherort "{0}" ist nicht vorhanden oder kein Verzeichnis.
fr: L’emplacement de projet sélectionné « {0} » n’existe pas ou n’est pas un répertoire.
it: Il percorso del progetto selezionato '{0}' non esiste o non è una directory.
ja: 選択したプロジェクトの場所 '{0}' は存在しないか、ディレクトリではありません。
ko: 선택한 프로젝트 위치 '{0}'이(가) 없거나 디렉터리가 아닙니다.
zh_hans: 所选项目位置“{0}”不存在或不是目录。

# dataworkspace.fileNotExistError
source: The selected {0} file '{1}' does not exist or is not a file.
de: Die ausgewählte {0}-Datei "{1}" ist nicht vorhanden oder keine Datei.
fr: Le fichier {0} sélectionné « {1} » n’existe pas ou n’est pas un fichier.
it: Il file {0} selezionato '{1}' non esiste o non è un file.
ja: 選択した {0} ファイル '{1}' が存在しないか、ファイルではありません。
ko: 선택한 {0} 파일 '{1}'이(가) 없거나 파일이 아닙니다.
zh_hans: 所选 {0} 文件“{1}”不存在或者不是文件。

# dataworkspace.projectDirectoryAlreadyExistError
source: There is already a directory named '{0}' in the selected location: '{1}'.
de: Es ist bereits ein Verzeichnis mit dem Namen "{0}" am ausgewählten Speicherort vorhanden: "{1}".
fr: Il existe déjà un répertoire nommé « {0} » à l’emplacement sélectionné : « {1} ».
it: Esiste già una directory denominata '{0}' nel percorso selezionato: '{1}'.
ja: 選択した場所: '{1}' に、'{0}' という名前のディレクトリが既に存在します。
ko: 선택한 위치 '{1}'에 '{0}'(이)라는 디렉터리가 이미 있습니다.
zh_hans: 所选位置“{1}”中已存在名为“{0}”的目录。

# reservedWindowsFilenameErrorMessage
source: This file name is reserved for use by Windows. Choose another name and try again
de: Dieser Dateiname ist für Windows reserviert. Wählen Sie einen anderen Namen, und versuchen Sie es noch mal.
fr: Ce nom de fichier est réservé à l’utilisation par Windows. Choisissez un autre nom et essayez à nouveau
it: Questo nome file è riservato per l'uso da parte di Windows. Scegliere un altro nome e riprovare
ja: このファイル名は Windows による使用のために予約されています。別の名前を選んで再実行してください
ko: 이 파일 이름은 Windows에서 예약되어 있습니다. 다른 이름을 선택하고 다시 시도하세요.
zh_hans: 此文件名保留供 Windows 使用。请选择其他名称，然后重试

# dragAndDropNotSupported
source: This project type does not support drag and drop.
de: Dieser Projekttyp unterstützt Drag &amp; Drop nicht.
fr: Ce type de projet ne prend pas en charge l’opération de glisser-déplacer.
it: Questo tipo di progetto non supporta il trascinamento della selezione.
ja: このプロジェクトの種類では、ドラッグ アンド ドロップはサポートされていません。
ko: 이 프로젝트 형식은 끌어서 놓기 기능이 지원되지 않습니다.
zh_hans: 此项目类型不支持拖放。

# dataworkspace.Type
source: Type
de: Typ
it: Tipo
ja: 種類
ko: 형식
zh_hans: 类型

# undefinedFilenameErrorMessage
source: Undefined name
de: Nicht definierter Name
fr: Nom non défini
it: Nome non definito
ja: 未定義の名前
ko: 정의되지 않은 이름
zh_hans: 未定义名称

# dataworkspace.yesRecommended
source: Yes (Recommended)
de: Ja (empfohlen)
fr: Oui (recommandé)
it: Sì (Scelta consigliata)
ja: はい (推奨)
ko: 예(권장)
zh_hans: 是(推荐)

# projects.showNotAddedProjectsInWorkspacePrompt
source: Always show information message when the current workspace folders contain projects that have not been added to the workspace's projects.
de: Informationsmeldung immer anzeigen, wenn die aktuellen Arbeitsbereichsordner Projekte enthalten, die nicht zu den Projekten des Arbeitsbereichs hinzugefügt wurden.
fr: Toujours afficher un message d'information lorsque les dossiers de l'espace de travail actuel contiennent des projets qui n'ont pas été ajoutés aux projets de l'espace de travail.
it: Mostra sempre un messaggio informativo quando le cartelle dell'area di lavoro correnti contengono progetti che non sono stati aggiunti ai progetti dell'area di lavoro.
ja: ワークスペースのプロジェクトにまだ追加されていないプロジェクトが現在のワークスペースフォルダーに含まれている場合は、情報メッセージを常に表示します。
ko: 현재 작업 영역 폴더에 작업 영역의 프로젝트에 추가되지 않은 프로젝트가 포함된 경우 항상 정보 메시지를 표시합니다.
zh_hans: 在当前工作区文件夹包含尚未添加到工作区项目的项目时，始终显示信息消息。

# close-workspace-command
source: Close Workspace
de: Arbeitsbereich schließen
fr: Fermer l'espace de travail
it: Chiudi area di lavoro
ja: ワークスペースを閉じる
ko: 작업 영역 닫기
zh_hans: 关闭工作区

# projects-view-no-workspace-content
source: Create new or open existing to get started. [Create new](command:projects.new) [Open existing](command:projects.openExisting) To learn more about projects [read our docs](https://aka.ms/azuredatastudio-projects).
de: Erstellen Sie ein neues oder öffnen Sie ein bestehendes, um loszulegen. [Neues erstellen](command:projects.new) [Bestehendes öffnen](command:projects.openExisting) Weitere Informationen zu Projekten [unsere Dokumentation lesen](https://aka.ms/azuredatastudio-projects).
fr: Créez un nouveau projet ou ouvrez un projet existant pour commencer. [Créer](command:projects.new) [Ouvrir un existant](command:projects.openExisting) Pour en savoir plus sur les projets [lire nos documents](https://aka.ms/azuredatastudio-projects).
it: Per iniziare, creare un nuovo progetto o aprirne uno esistente. [Crea nuovo](comando: projects.new) [Apri esistente](comando: projects.openExisting) Per altre informazioni sui progetti [vedere la documentazione](https://aka.ms/azuredatastudio-projects).
ja: 新規作成するか、既存のものを開いて作業を開始します。 [新規作成](command:projects.new) [既存のものを開く](command:projects.openExisting) プロジェクトの詳細情報については、[ドキュメントを読む](https://aka.ms/azuredatastudio-projects) をご覧ください。
ko: 새 항목을 만들거나 기존 항목을 열어 시작합니다. [새로 만들기](command:projects.new) [기존 항목 열기](command:projects.openExisting) 프로젝트에 대해 자세히 알아보려면 [문서를 읽어보세요](https://aka.ms/azuredatastudio-projects).
zh_hans: 创建新的或打开现有的以开始使用。 [新建](command:projects.new) [打开现有](command:projects.openExisting) 要了解项目的详细信息，请 [阅读文档](https://aka.ms/azuredatastudio-projects)。

# main-view-name
source: Database Projects
de: Datenbankprojekte
fr: Projets de base de données
it: Progetti di database
ja: データベース プロジェクト
ko: 데이터베이스 프로젝트
zh_hans: 数据库项目

# data-workspace-view-container-name
source: Database Projects
de: Datenbankprojekte
fr: Projets de base de données
it: Progetti di database
ja: データベース プロジェクト
ko: 데이터베이스 프로젝트
zh_hans: 数据库项目

# projects.defaultProjectSaveLocation
source: Full path to folder where new projects are saved by default.
de: Vollständiger Pfad zu dem Ordner, in dem neue Projekte standardmäßig gespeichert werden.
fr: Chemin d’accès complet au dossier dans lequel les nouveaux projets sont enregistrés par défaut.
it: Percorso completo della cartella in cui vengono salvati i nuovi progetti per impostazione predefinita.
ja: 新しいプロジェクトがデフォルトで保存されるフォルダーへのフルパス。
ko: 새 프로젝트가 기본적으로 저장되는 폴더의 전체 경로입니다.
zh_hans: 文件夹的完整路径，其中已默认保存新项目。
