Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.datavirtualization.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# externalTable.databaseNameTitle
source: Database Name
de: Datenbankname
es: Nombre de la base de datos
fr: Nom de la base de données
it: Nome database
ja: データベース名
ko: 데이터베이스 이름
pt_br: Nome do Banco de Dados
ru: Имя базы данных
zh_hans: 数据库名称
zh_hant: 資料庫名稱

# externalTable.externalSchemaTitle
source: External Schema
de: Externes Schema
es: Esquema externo
fr: Schéma externe
it: Schema esterno
ja: 外部スキーマ
ko: 외부 스키마
pt_br: Esquema Externo
ru: Внешняя схема
zh_hans: 外部架构
zh_hant: 外部架構描述

# externalTable.externalTableTitle
source: External Table
de: Externe Tabelle
es: Tabla externa
fr: Table externe
it: Tabella esterna
ja: 外部テーブル
ko: 외부 테이블
pt_br: Tabela Externa
ru: Внешняя таблица
zh_hans: 外部表
zh_hant: 外部資料表

# externalTable.hostnameTitle
source: Hostname
es: Nombre de host
fr: Nom d’hôte
it: Nome host
ja: ホスト名
ko: 호스트 이름
pt_br: Nome do host
ru: Имя узла
zh_hans: 主机名
zh_hant: 主機名稱

# msgMissingNodeContext
source: Node Command called without any node passed
de: Es wurde ein Knotenbefehl aufgerufen, ohne dass ein Knoten übergeben wurde.
es: Se ha llamado al comando de nodo sin pasar ningún nodo
fr: Commande de nœud appelée sans aucun nœud
it: Il comando di Node è stato chiamato senza passare alcun nodo
ja: ノードが渡されずに呼び出されたノード コマンド
ko: 노드가 전달되지 않고 호출된 노드 명령
pt_br: Comando de nó chamado sem nenhum nó passado
ru: Команда Node вызвана без передачи какого-либо узла
zh_hans: 调用了节点命令但未传递任何节点
zh_hant: 已呼叫節點命令，但未傳遞任何節點

# externalTable.serverNameTitle
source: Server Name
es: Nombre del servidor
fr: Nom du serveur
it: Nome server
ja: サーバー名
ko: 서버 이름
pt_br: Nome do Servidor
ru: Имя сервера
zh_hans: 服务器名称
zh_hant: 伺服器名稱

# externalTable.serviceNameTitle
source: Service name / SID
de: Dienstname/SID
es: Nombre del servicio/SID
fr: Nom du service/SID
it: Nome servizio/SID
ja: サービス名/SID
ko: 서비스 이름 / SID
pt_br: Nome do Serviço/SID:
ru: Имя службы или ИД безопасности:
zh_hans: 服务名称/SID:
zh_hant: 服務名稱 / SID

# externalTable.sourceSchemaTitle
source: Source Schema
de: Quellschema
es: Esquema de origen
fr: Schéma source
it: Schema di origine
ja: ソース スキーマ
ko: 원본 스키마
pt_br: Esquema de Origem
ru: Исходная схема
zh_hans: 源架构
zh_hant: 來源結構描述

# externalTable.sourceTableTitle
source: Source Table
de: Quelltabelle
es: Tabla de origen
fr: Table source
it: Tabella di origine
ja: 基になるテーブル
ko: 원본 테이블
pt_br: Tabela de Origem
ru: Исходная таблица
zh_hans: 源表
zh_hant: 來源資料表

# downloadingServiceSize
source: ({0} KB)
fr: ({0} Ko)
ru: ({0} КБ)

# downloadingServiceComplete
source: Done downloading {0}
de: Download von {0} abgeschlossen
es: Descarga finalizada {0}
fr: Téléchargement de {0} terminé
it: Il download di {0} è stato completato
ja: {0} のダウンロードが完了しました
ko: {0} 다운로드 완료
pt_br: Download de {0} concluído
ru: Скачивание службы {0} завершено
zh_hans: {0}下载完毕
zh_hant: 已完成下載 {0}

# downloadingServiceStatus
source: Downloading {0}
de: {0} wird heruntergeladen
es: Descargando {0}
fr: Téléchargement de {0}
it: Download di {0}
ja: {0} をダウンロードしています
ko: {0} 다운로드 중
pt_br: Baixando {0}
ru: Скачивание службы {0}
zh_hans: 正在下载 {0}
zh_hant: 正在下載 {0}

# downloadingService
source: Downloading {0}
de: {0} wird heruntergeladen
es: Descargando {0}
fr: Téléchargement de {0}
it: Download di {0}
ja: {0} をダウンロードしています
ko: {0} 다운로드 중
pt_br: Baixando {0}
ru: Скачивание службы {0}
zh_hans: 正在下载 {0}
zh_hant: 正在下載 {0}

# serviceStartFailed
source: Failed to start {0}: {1}
de: Fehler beim Starten von {0}: {1}
es: No se pudo iniciar {0}: {1}
fr: Échec du démarrage de {0} : {1}
it: Non è stato possibile avviare {0}: {1}
ja: {0}を開始できませんでした: {1}
ko: {0}:{1}을(를) 시작하지 못함
pt_br: Falha ao iniciar {0}: {1}
ru: Не удалось запустить {0}: {1}
zh_hans: 未能启动 {0}: {1}
zh_hant: 無法啟動 {0}: {1}

# serviceInstalled
source: Installed {0}
de: {0} wurde installiert
es: Se instaló {0}
fr: {0} est installé
it: {0} installato
ja: {0} がインストールされました
ko: {0} 설치됨
pt_br: {0} instalado
ru: Установлено: {0}
zh_hans: 已安装{0}
zh_hant: 已安裝 {0}

# installingService
source: Installing {0}
de: {0} wird installiert
es: Instalando {0}
fr: Installation de {0}
it: Installazione di {0}
ja: {0} のインストール中
ko: {0} 설치 중
pt_br: Instalando {0}
ru: Установка {0}
zh_hans: 正在安装 {0}
zh_hant: 正在安裝 {0}

# installingServiceDetailed
source: Installing {0} to {1}
de: "{0}" wird in "{1}" installiert.
es: Instalando {0} en {1}
fr: Installation de {0} sur {1}
it: Installazione di {0} in {1}
ja: {0} を {1} にインストールしています
ko: {1}에 {0} 설치 중
pt_br: Instalando {0} para {1}
ru: Установка {0} в {1}
zh_hans: 正在将 {0} 安装到 {1}
zh_hant: 正在將 {0} 安裝到 {1}

# serviceStarting
source: Starting {0}...
de: {0} wird gestartet...
es: Iniciando {0}...
fr: Démarrage de {0}...
it: Avvio di {0}...
ja: {0} を開始しています...
ko: {0} 시작 중...
pt_br: Iniciando {0}...
ru: Запуск {0}...
zh_hans: 正在启动 {0}...
zh_hant: 正在啟動 {0}...

# serviceStarted
source: {0} started
de: {0} gestartet
es: Se inició {0}
fr: {0} démarré
it: Attività {0} avviata
ja: {0} 開始
ko: {0} 시작됨
pt_br: {0} iniciado
ru: Запущено: {0}
zh_hans: {0} 已启动
zh_hant: {0} 已開始

# serviceCrashButton
source: View Known Issues
de: Bekannte Probleme anzeigen
es: Ver problemas conocidos
fr: Afficher les problèmes connus
it: Visualizza problemi noti
ja: 既知の問題の表示
ko: 알려진 문제 보기
pt_br: Ver Problemas Conhecidos
ru: Просмотреть известные проблемы
zh_hans: 查看已知问题
zh_hant: 檢視已知問題

# serviceCrashMessage
source: service component could not start
de: Die Dienstkomponente konnte nicht gestartet werden.
es: el componente de servicio no se pudo iniciar
fr: le composant de service n'a pas pu démarrer
it: non è stato possibile avviare il componente del servizio
ja: サービス コンポーネントを開始できませんでした
ko: 서비스 구성 요소를 시작할 수 없습니다.
pt_br: componente de serviço não pôde ser iniciado
ru: Не удалось запустить компонент службы
zh_hans: 服务组件无法启动
zh_hant: 服務元件無法啟動

# executeCommandProcessExited
source: Process exited with code {0}
de: Der Prozess wurde mit Code {0} beendet.
es: Proceso cerrado con el código {0}
fr: Le processus s'est arrêté avec le code {0}
it: Processo terminato con codice {0}
ja: プロセスがコード {0} で終了しました
ko: 프로세스가 {0} 코드로 종료됨
pt_br: Processo encerrado com o código {0}
ru: Процесс завершил работу с кодом {0}
zh_hans: 已退出进程，代码为 {0}
zh_hant: 處理序已結束，代碼為 {0}

# tableFromFileImport.databaseDropdownTitle
source: Database the external table will be created in
de: Datenbank, in der die externe Tabelle erstellt wird
es: Base de datos en la que se creará la tabla externa
fr: Base de données dans laquelle la table externe sera créée
it: Database in cui verrà creata la tabella esterna
ja: 外部テーブルが作成されるデータベース
ko: 외부 테이블이 생성될 데이터베이스
pt_br: Banco de dados no qual a tabela externa será criada
ru: База данных, в которой будет создана внешняя таблица
zh_hans: 将在其中创建外部表的数据库
zh_hant: 外部資料表的資料庫將建立於

# tableFromFileImport.destConnTitle
source: Destination Server
de: Zielserver
es: Servidor de destino
fr: Serveur de destination
it: Server di destinazione
ja: 同期先サーバー
ko: 대상 서버
pt_br: Servidor de Destino
ru: Целевой сервер
zh_hans: 目标服务器
zh_hant: 目的地伺服器

# tableFromFileImport.dataSourceDropdown
source: External data source for new external table
de: Externe Datenquelle für neue externe Tabelle
es: Origen de datos externo para la nueva tabla externa
fr: Source de données externe pour la nouvelle table externe
it: Origine dati esterna per la nuova tabella esterna
ja: 新しい外部テーブル用外部データ ソース
ko: 새 외부 테이블의 외부 데이터 원본
pt_br: Fonte de dados externa para uma nova tabela externa
ru: Внешний источник данных для новой внешней таблицы
zh_hans: 新外部表的外部数据源
zh_hant: 新外部資料表的外部資料來源

# tableFromFileImport.tableTextboxTitle
source: Name for new external table
de: Name für neue externe Tabelle
es: Nombre de la nueva tabla externa
fr: Nom de la nouvelle table externe
it: Nome per la nuova tabella esterna
ja: 新しい外部テーブルの名前
ko: 새 외부 테이블의 이름
pt_br: Nome da nova tabela externa
ru: Имя новой внешней таблицы
zh_hans: 新外部表的名称
zh_hant: 新外部資料表的名稱

# tableFromFileImport.fileFormatTextboxTitle
source: Name for new table's external file format
de: Name für das externe Dateiformat der neuen Tabelle
es: Nombre del formato de archivo externo de la nueva tabla
fr: Nom du format de fichier externe de la nouvelle table
it: Nome per il formato di file esterno della nuova tabella
ja: 新しいテーブルの外部ファイル形式の名前
ko: 새 테이블의 외부 파일 형식 이름
pt_br: Nome do formato de arquivo externo para a nova tabela
ru: Имя формата внешнего файла новой таблицы
zh_hans: 新表的外部文件格式的名称
zh_hant: 新資料表的外部檔案格式名稱

# tableFromFileImport.noSchemas
source: No user schemas were found in the specified database.
de: In der angegebenen Datenbank wurden keine Schemas gefunden.
es: No se encontraron esquemas de usuario en la base de datos especificada.
fr: Aucun schéma utilisateur n’a été trouvé dans la base de données spécifiée.
it: Nessuno schema utente nel database specificato.
ja: 指定したデータベースにはユーザー スキーマがありません。
ko: 지정한 데이터베이스에 테이블이 없습니다.
pt_br: Nenhum esquema de usuário foi encontrado no banco de dados especificado.
ru: В указанной базе данных схемы пользователей не найдены.
zh_hans: 在指定的数据库中找不到用户架构。
zh_hant: 在指定的資料庫中找不到使用者結構描述。

# tableFromFileImport.noDataSources
source: No valid external data sources were found in the specified database.
de: In der angegebenen Datenbank wurden keine gültigen externen Datenquellen gefunden.
es: No se encontraron orígenes de datos externos válidos en la base de datos especificada.
fr: Aucune source de données externe valide n’a été trouvée dans la base de données spécifiée.
it: Non sono state trovate origini dati esterne valide nel database specificato.
ja: 指定されたデータベースに有効な外部データ ソースが見つかりませんでした。
ko: 지정한 데이터베이스에서 유효한 외부 데이터 원본을 찾을 수 없습니다.
pt_br: Nenhuma fonte de dados externa válida foi encontrada no banco de dados especificado.
ru: В указанной базе данных не найдены допустимые внешние источники данных.
zh_hans: 在指定的数据库中找不到有效的外部数据源。
zh_hant: 在指定的資料庫中找不到有效的外部資料來源。

# tableFromFileImport.refreshButtonTitle
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# tableFromFileImport.schemaTextboxTitle
source: Schema for new external table
de: Schema für neue externe Tabelle
es: Esquema para nueva tabla externa
fr: Schéma de la nouvelle table externe
it: Schema per la nuova tabella esterna
ja: 新しい外部テーブルのスキーマ
ko: 새 외부 테이블의 스키마
pt_br: Esquema para uma nova tabela externa
ru: Схема новой внешней таблицы
zh_hans: 新外部表的名称
zh_hant: 新外部資料表的結構描述

# tableFromFileImport.fileTextboxTitle
source: Source File
de: Quelldatei
es: Archivo de origen
fr: Fichier source
it: File di origine
ja: ソース ファイル
ko: 원본 파일
pt_br: Arquivo de Origem
ru: Исходный файл
zh_hans: 源文件
zh_hant: 原始程式檔

# tableFromFileImport.folderTextboxTitle
source: Source Folder
de: Quellordner
es: Carpeta de origen
fr: Dossier source
it: Cartella di origine
ja: 転送元フォルダー
ko: 원본 폴더
pt_br: Pasta de Origem
ru: Исходная папка
zh_hans: 源文件夹
zh_hant: 來源資料夾

# tableFromFileImport.fileFormatExists
source: The specified external file format name already exists.
de: Der angegebene Name für das externe Dateiformat ist bereits vorhanden.
es: El nombre de formato de archivo externo especificado ya existe.
fr: Le nom de format de fichier externe spécifié existe déjà.
it: Il nome del formato di file esterno specificato esiste già.
ja: 指定された外部ファイル形式名は既に存在します。
ko: 지정된 외부 파일 형식 이름이 이미 있습니다.
pt_br: O nome do formato de arquivo externo especificado já existe.
ru: Указанное имя формата внешнего файла уже существует.
zh_hans: 指定的外部文件格式名称已存在。
zh_hant: 指定的外部檔案格式名稱已存在。

# tableFromFileImport.tableExists
source: The specified table name already exists under the specified schema.
de: Der angegebene Tabellenname ist bereits im angegebenen Schema vorhanden.
es: El nombre de tabla especificado ya existe en el esquema especificado.
fr: Le nom de table spécifié existe déjà sous le schéma spécifié.
it: Il nome di tabella specificato esiste già nello schema specificato.
ja: 指定されたテーブル名は、指定されたスキーマに既に存在します。
ko: 지정한 테이블 이름이 이미 지정한 스키마 아래에 있습니다.
pt_br: O nome da tabela especificado já existe no esquema especificado.
ru: Указанное имя таблицы уже существует в указанной схеме.
zh_hans: 指定的表名在指定的架构下已存在。
zh_hant: 指定的資料表名稱已存在於指定的結構描述下。

# tableFromFileImport.allowNulls
source: Allow Nulls
de: NULL-Werte zulassen
es: Permitir NULL
fr: Autoriser les valeurs Null
it: Consenti valori Null
ja: Null を許容
ko: Null 허용
pt_br: Permitir Valores Nulos
ru: Разрешить значения NULL
zh_hans: 允许 Null
zh_hant: 允許 Null 值

# tableFromFileImport.columnName
source: Column Name
de: Spaltenname
es: Nombre de columna
fr: Nom de la colonne
it: Nome colonna
ja: 列名
ko: 열 이름
pt_br: Nome da Coluna
ru: Имя столбца
zh_hans: 列名
zh_hant: 資料行名稱

# tableFromFileImport.dataType
source: Data Type
de: Datentyp
es: Tipo de datos
it: Tipo di dati
ja: データ型
ko: 데이터 형식
pt_br: Tipo de Dados
ru: Тип данных
zh_hans: 数据类型
zh_hant: 資料類型

# tableFromFileImport.noProseInfo
source: Failed to generate column information for the specified file.
de: Fehler beim Generieren von Spalteninformationen für die angegebene Datei.
es: No se pudo generar la información de columna para el archivo especificado.
fr: Échec de la génération des informations de colonne pour le fichier spécifié.
it: Impossibile generare le informazioni sulla colonna per il file specificato.
ja: 指定されたファイルの列情報を生成できませんでした。
ko: 지정된 파일에 대한 열 정보를 생성하지 못했습니다.
pt_br: Falha ao gerar informações de coluna para o arquivo especificado.
ru: Не удалось создать сведения о столбце для указанного файла.
zh_hans: 无法为指定的文件生成列信息。
zh_hant: 無法為指定的檔案產生資料行資訊。

# tableFromFileImport.noPreviewData
source: Failed to retrieve any data from the specified file.
de: Fehler beim Abrufen von Daten aus der angegebenen Datei.
es: No se pudieron recuperar los datos del archivo especificado.
fr: Échec de la récupération des données du fichier spécifié.
it: Impossibile recuperare dati dal file specificato.
ja: 指定されたファイルからデータを取得できませんでした。
ko: 지정한 파일에서 데이터를 검색하지 못했습니다.
pt_br: Falha ao recuperar dados do arquivo especificado.
ru: Не удалось получить данные из указанного файла.
zh_hans: 无法从指定的文件中检索任何数据。
zh_hant: 無法從指定的檔案擷取任何資料。

# tableFromFileImport.prosePreviewMessage
source: This operation analyzed the input file structure to generate the preview below for up to the first 50 rows.
de: Mit diesem Vorgang wurde die Struktur der Eingabedatei analysiert, um die nachstehende Vorschau für die ersten 50 Zeilen zu generieren.
es: Esta operación analizó la estructura del archivo de entrada para generar la vista previa siguiente para las primeras 50 filas.
fr: Cette opération a analysé la structure du fichier d'entrée pour générer l'aperçu ci-dessous des 50 premières lignes.
it: Questa operazione ha analizzato la struttura del file di input per generare l'anteprima seguente per le prime 50 righe.
ja: この操作によって、最初の 50 行までのプレビューを下に生成するために入力ファイル構造が分析されました。
ko: 이 작업은 입력 파일 구조를 분석하여 처음 50개 행의 미리 보기를 아래에 생성했습니다.
pt_br: Esta operação analisou a estrutura do arquivo de entrada para gerar a visualização abaixo para as primeiras 50 linhas.
ru: Эта операция проанализировала структуру первых 50 строк входного файла для отображения предварительного просмотра ниже.
zh_hans: 此操作分析了输入文件的结构并生成了下方的前 50 行预览。
zh_hant: 這項作業分析了輸出檔案結構，並產生了以下最多包含前 50 列的預覽。

# tableFromFileImport.importInformation
source: Data Virtualization information
de: Informationen zur Datenvirtualisierung
es: Información de virtualización de datos
fr: Informations sur la virtualisation des données
it: Informazioni sulla virtualizzazione dei dati
ja: データ仮想化情報
ko: 데이터 가상화 정보
pt_br: Informações de Virtualização de Dados
ru: Сведения о виртуализации данных
zh_hans: 数据虚拟化信息
zh_hant: 資料虛擬化資訊

# tableFromFileImport.databaseName
source: Database name
de: Datenbankname
es: Nombre de la base de datos
fr: Nom de la base de données
it: Nome del database
ja: データベース名
ko: 데이터베이스 이름
pt_br: Nome do banco de dados
ru: Имя базы данных
zh_hans: 数据库名
zh_hant: 資料庫名稱

# tableFromFileImport.fileFormat
source: File format name
de: Dateiformatname
es: Nombre del formato de archivo
fr: Nom du format de fichier
it: Nome formato di file
ja: ファイル形式名
ko: 파일 형식 이름
pt_br: Nome do formato de arquivo
ru: Имя формата файла
zh_hans: 文件格式名称
zh_hant: 檔案格式名稱

# tableFromFileImport.next
source: Next
de: Weiter
es: Siguiente
fr: Suivant
it: Avanti
ja: 次へ
ko: 다음
pt_br: Próximo
ru: Далее
zh_hans: 下一页
zh_hant: 下一步

# tableFromFileImport.serverName
source: Server name
es: Nombre del servidor
fr: Nom du serveur
it: Nome del server
ja: サーバー名
ko: 서버 이름
pt_br: Nome do servidor
ru: Имя сервера
zh_hans: 服务器名称
zh_hant: 伺服器名稱

# tableFromFileImport.summaryFileName
source: Source File
de: Quelldatei
es: Archivo de origen
fr: Fichier source
it: File di origine
ja: ソース ファイル
ko: 원본 파일
pt_br: Arquivo de Origem
ru: Исходный файл
zh_hans: 源文件
zh_hant: 原始程式檔

# tableFromFileImport.summaryFolderName
source: Source Folder
de: Quellordner
es: Carpeta de origen
fr: Dossier source
it: Cartella di origine
ja: 転送元フォルダー
ko: 원본 폴더
pt_br: Pasta de Origem
ru: Исходная папка
zh_hans: 源文件夹
zh_hant: 來源資料夾

# tableFromFileImport.tableName
source: Table name
de: Tabellenname
es: Nombre de la tabla
fr: Nom de la table
it: Nome della tabella
ja: テーブル名
ko: 테이블 이름
pt_br: Nome da tabela
ru: Имя таблицы
zh_hans: 表名
zh_hant: 資料表名稱

# tableFromFileImport.tableSchema
source: Table schema
de: Tabellenschema
es: Esquema de tabla
fr: Schéma de tableau
it: Schema della tabella
ja: テーブル スキーマ
ko: 테이블 스키마
pt_br: Esquema da tabela
ru: Схема таблицы
zh_hans: 表架构
zh_hant: 資料表結構描述

# tableFromFileImport.importData
source: Virtualize Data
de: Daten virtualisieren
es: Virtualizar datos
fr: Virtualiser les données
it: Virtualizza dati
ja: データの仮想化
ko: 데이터 가상화
pt_br: Virtualizar Dados
ru: Виртуализация данных
zh_hans: 虚拟化数据
zh_hant: 虛擬化資料

# tableFromFileImport.onlyCsvSupported
source: Currently only csv files are supported for this wizard.
de: Derzeit werden für diesen Assistenten nur CSV-Dateien unterstützt.
es: Actualmente solo se admiten archivos CSV para este asistente.
fr: Actuellement, seuls les fichiers CSV sont pris en charge pour cet Assistant.
it: Per questa procedura guidata sono attualmente supportati solo i file CSV.
ja: 現在、このウィザードでは CSV ファイルのみがサポートされています。
ko: 현재 이 마법사에서는 CSV 파일만 지원됩니다.
pt_br: Atualmente, somente arquivos csv têm suporte para este assistente.
ru: Сейчас для этого мастера поддерживаются только CSV-файлы.
zh_hans: 此向导当前仅支持 csv 文件。
zh_hant: 此精靈目前只支援 CSV 檔案。

# tableFromFileImport.page2Name
source: Modify Columns
de: Spalten ändern
es: Modificar columnas
fr: Modifier les colonnes
it: Modifica colonne
ja: 列の変更
ko: 열 수정
pt_br: Modificar Colunas
ru: Изменить столбцы
zh_hans: 修改列
zh_hant: 修改資料行

# tableFromFileImport.noCsvFileFound
source: No csv files were found in the specified folder.
de: Im angegebenen Ordner wurden keine CSV-Dateien gefunden.
es: No se encontraron archivos CSV en la carpeta especificada.
fr: Aucun fichier CSV n'a été trouvé dans le dossier spécifié.
it: Non sono stati trovati file CSV nella cartella specificata.
ja: 指定されたフォルダーに CSV ファイルが見つかりませんでした。
ko: 지정된 폴더에서 csv 파일을 찾을 수 없습니다.
pt_br: Nenhum arquivo csv foi encontrado na pasta especificada.
ru: CSV-файлы не найдены в указанной папке.
zh_hans: 在指定的文件夹中找不到 csv 文件。
zh_hant: 在指定的資料夾中找不到 csv 檔案。

# import.needFile
source: Please select a source file or folder before using this wizard.
de: Wählen Sie eine Quelldatei oder einen Quellordner aus, bevor Sie diesen Assistenten verwenden.
es: Seleccione un archivo o carpeta de origen antes de usar este asistente.
fr: Veuillez sélectionner un fichier ou un dossier source avant d'utiliser cet assistant.
it: Seleziona un file o una cartella di origine prima di utilizzare questa procedura guidata.
ja: このウィザードを使用する前に、ソース ファイルまたはフォルダーを選択してください。
ko: 이 마법사를 사용하기 전에 원본 파일 또는 폴더를 선택하세요.
pt_br: Selecione um arquivo ou pasta de origem antes de usar esse assistente.
ru: Перед использованием этого мастера выберите исходный файл или папку.
zh_hans: 请在使用此向导之前选择源文件或文件夹。
zh_hant: 使用此精靈前，請先選取來源檔案或資料夾。

# tableFromFileImport.page1Name
source: Preview Data
de: Datenvorschau
es: Vista previa de datos
fr: Aperçu des données
it: Anteprima dati
ja: データのプレビュー
ko: 데이터 미리 보기
pt_br: Visualizar Dados
ru: Предварительный просмотр данных
zh_hans: 预览数据
zh_hant: 預覽資料

# tableFromFileImport.page0Name
source: Select the destination database for your external table
de: Wählen Sie die Zieldatenbank für Ihre externe Tabelle aus.
es: Selección de la base de datos de destino para la tabla externa
fr: Sélectionner la base de données de destination pour votre table externe
it: Selezionare il database di destinazione per la tabella esterna
ja: 外部テーブルの宛先データベースを選択する
ko: 외부 테이블의 대상 데이터베이스를 선택하세요.
pt_br: Selecione o banco de dados de destino para sua tabela externa
ru: Выберите конечную базу данных для внешней таблицы
zh_hans: 选择外部表的目标数据库
zh_hant: 選取外部資料表的目的地資料庫

# tableFromFileImport.page3Name
source: Summary
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
it: Riepilogo
ja: 概要
ko: 요약
pt_br: Resumo
ru: Сводка
zh_hans: 摘要
zh_hant: 摘要

# tableFromFileImport.openScriptMsg
source: The script has opened in a document window. You can view it once the wizard is closed.
de: Das Skript wurde in einem Dokumentfenster geöffnet. Sie können es anzeigen, sobald der Assistent geschlossen wurde.
es: El script se ha abierto en una ventana de documento. Puede verlo una vez cerrado el asistente.
fr: Le script s'est ouvert dans une fenêtre de document. Vous pouvez le visualiser une fois l'assistant fermé.
it: Lo script è stato aperto in una finestra del documento. È possibile visualizzarla dopo la chiusura della procedura guidata.
ja: スクリプトがドキュメント ウィンドウで開きました。ウィザードが閉じられると表示できます。
ko: 문서 창에서 스크립트가 열렸습니다. 마법사가 닫히면 볼 수 있습니다.
pt_br: O script foi aberto em uma janela do documento. Você poderá vê-lo assim que o assistente for fechado.
ru: Сценарий открыт в окне документа. Вы можете просмотреть его после закрытия мастера.
zh_hans: 脚本已在文档窗口中打开。关闭向导后即可查看它。
zh_hant: 指令碼已在文件視窗中開啟。一旦精靈關閉，您就可以檢視它。

# tableFromFile.taskLabel
source: Virtualize Data
de: Daten virtualisieren
es: Virtualizar datos
fr: Virtualiser les données
it: Virtualizza dati
ja: データの仮想化
ko: 데이터 가상화
pt_br: Virtualizar Dados
ru: Виртуализация данных
zh_hans: 虚拟化数据
zh_hant: 虛擬化資料

# tableFromFileImport.wizardName
source: Virtualize Data From CSV
de: Daten aus CSV-Datei virtualisieren
es: Virtualización de datos desde CSV
fr: Virtualiser les données à partir d’un fichier CSV
it: Virtualizza dati da CSV
ja: CSV からデータを仮想化する
ko: CSV에서 데이터 가상화
pt_br: Virtualizar dados do CSV
ru: Виртуализация данных из CSV-файла
zh_hans: 从 CSV 虚拟化数据
zh_hant: 從 CSV 將資料虛擬化

# newCredOption
source: -- Create New Credential --
de: -- Neue Anmeldeinformationen erstellen --
es: -- Crear nueva credencial --
fr: -- Créer un nouvel identifiant --
it: -- Crea nuove credenziali --
ja: -- 新しい資格情報の作成 --
ko: -- 새 자격 증명 만들기 --
pt_br: — Criar Nova Credencial —
ru: -- Создать учетные данные --
zh_hans: --新建凭据--
zh_hant: -- 建立新認證 --

# credentialNameDropdown
source: Choose Credential
de: Anmeldeinformationen auswählen
es: Elegir credencial
fr: Choisir les informations d’identification
it: Scegli credenziali
ja: 資格情報の選択
ko: 자격 증명 선택
pt_br: Escolher Credencial
ru: Выбор учетных данных
zh_hans: 选择凭据
zh_hant: 選擇認證

# credentialFields
source: Configure Credential
de: Anmeldeinformationen konfigurieren
es: Configurar credenciales
fr: Configurer les informations d'identification
it: Configura credenziali
ja: 資格情報の構成
ko: 자격 증명 구성
pt_br: Configurar Credencial
ru: Настройка учетных данных
zh_hans: 配置凭据
zh_hant: 設定認證

# connectionDetailsTitle
source: Create a connection to your Data Source
de: Verbindung mit Ihrer Datenquelle herstellen
es: Crear una conexión al origen de datos
fr: Créez une connexion à votre source de données
it: Crea una connessione all'origine dati
ja: データ ソースへの接続を作成する
ko: 데이터 원본에 대한 연결 만들기
pt_br: Criar uma conexão com sua Fonte de Dados
ru: Создание подключения к источнику данных
zh_hans: 无法与数据源建立连接
zh_hant: 與您的資料來源建立連接
