Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.all.backups.restored
source: All backups restored
de: Alle Sicherungen wiederhergestellt
es: Todas las copias de seguridad restauradas
fr: Toutes les sauvegardes ont été restaurées.
ja: すべてのバックアップが復元されました
ko: 모든 백업이 복원됨
pt_br: Todos os backups restaurados
ru: Все резервные копии восстановлены
zh_hans: 已还原的所有备份
zh_hant: 已還原所有備份

# sql.migration.view.all
source: All database migrations
de: Alle Datenbankmigrationen
es: Todas las migraciones de bases de datos
fr: Toutes les migrations de base de données
ja: すべてのデータベース移行
ko: 모든 데이터베이스 마이그레이션
pt_br: Todas as migrações de banco de dados
ru: Все миграции баз данных
zh_hans: 所有数据库迁移
zh_hant: 所有資料庫移轉

# sql.migration.all.fields.required
source: All fields are required.
de: Alle Felder müssen ausgefüllt werden.
es: Todos los campos son obligatorios.
fr: Tous les champs sont requis.
ja: すべてのフィールドに入力してください。
ko: 모든 필드가 필수 항목입니다.
pt_br: Todos os campos são obrigatórios.
ru: Нужно заполнить все поля.
zh_hans: 所有字段均为必填。
zh_hant: 所有欄位都是必要欄位。

# sql.ir.version.mismatch
source: All nodes should be on the same version to be configured
zh_hans: 所有节点都应在同一版本上进行配置

# sql.migration.all.source.tables.empty
source: All of source tables are empty. No table is available to select for data migration. But they are available for schema migration if they do not exist on target.
de: Alle Quelltabellen sind leer. Für die Datenmigration ist keine Tabelle zur Auswahl verfügbar. Sie sind jedoch für die Schemamigration verfügbar, wenn sie nicht auf dem Ziel vorhanden sind.
es: Todas las tablas de origen están vacías. No hay ninguna tabla disponible para seleccionar para la migración de datos. Pero están disponibles para la migración de esquemas si no existen en el destino.
fr: Toutes les tables sources sont vides. Aucune table n’est disponible pour la migration des données. Mais ils sont disponibles pour la migration de schéma s’ils n’existent pas sur la cible.
ja: すべてのソース テーブルが空です。データ移行用に選択できるテーブルはありません。ただし、ターゲットに存在しない場合は、スキーマの移行に使用できます。
ko: 원본 테이블이 모두 비어 있습니다. 데이터 마이그레이션을 위해 선택할 수 있는 테이블이 없습니다. 그러나 대상에 테이블이 없는 경우 스키마 마이그레이션을 사용할 수 있습니다.
pt_br: Todas as tabelas de destino estão vazias. Nenhuma tabela está disponível para seleção para migração de dados. Mas eles estão disponíveis para migração de esquema se não existirem no destino.
ru: Все исходные таблицы пусты. Нет доступных таблиц для выбора с целью переноса данных. Но они доступны для миграции схемы, если они не существуют в целевом объекте.
zh_hans: 所有源表均为空。没有表可供选择以用于数据迁移。但是，如果它们在目标上不存在，则可用于架构迁移。
zh_hant: 所有來源資料表都是空白。沒有資料表可供選取以進行資料移轉。但若它們不存在於目標上，則它們可供結構描述移轉使用。

# sql.migration.unavailable.source.tables.heading
source: All of tables below are empty. No table is available to select for data migration. But if they do not exist on target, schema migration is available.
de: Alle unten aufgeführten Tabellen sind leer. Für die Datenmigration ist keine Tabelle zur Auswahl verfügbar. Wenn sie jedoch auf dem Ziel nicht vorhanden sind, ist die Schemamigration verfügbar.
es: Todas las tablas siguientes están vacías. No hay ninguna tabla disponible para seleccionar para la migración de datos. Pero si no existen en el destino, la migración del esquema está disponible.
fr: Toutes les tables ci-dessous sont vides. Aucune table n’est disponible pour la migration des données. Mais s’ils n’existent pas sur la cible, la migration de schéma est disponible.
ja: 以下のテーブルはすべて空です。データ移行用に選択できるテーブルはありません。ただし、ターゲットに存在しない場合は、スキーマの移行を使用できます。
ko: 아래 테이블이 모두 비어 있습니다. 데이터 마이그레이션을 위해 선택할 수 있는 테이블이 없습니다. 그러나 대상에 테이블이 없는 경우 스키마 마이그레이션을 사용할 수 있습니다.
pt_br: Todas as tabelas abaixo estão vazias. Nenhuma tabela está disponível para seleção para migração de dados. Mas se eles não existirem no destino, a migração de esquema estará disponível.
ru: Все таблицы ниже пусты. Нет доступных таблиц для выбора с целью переноса данных. Но если они не существуют в целевом объекте, миграция схемы доступна.
zh_hans: 下面的所有表均为空。没有表可供选择以用于数据迁移。但如果目标上不存在它们，则可以使用架构迁移。
zh_hant: 下列所有資料表都是空白。沒有資料表可供選取以進行資料移轉。但如果它們不存在於目標上，則結構描述移轉可供使用。

# sql.migration.missing.tables.heading
source: All of tables below are missing on target. To migrate the data in these tables, select the migrate schema option above.
de: Alle unten aufgeführten Tabellen fehlen auf dem Ziel. Um die Daten in diesen Tabellen zu migrieren, wählen Sie oben die Option "Schema migrieren" aus.
es: Faltan todas las tablas siguientes en el destino. Para migrar los datos de estas tablas, seleccione la opción migrar esquema anterior.
fr: Toutes les tables ci-dessous sont manquantes dans la cible. Pour migrer les données de ces tables, sélectionnez l’option Migrer le schéma ci-dessus.
ja: 以下のすべてのテーブルがターゲットに存在しません。これらのテーブルのデータを移行するには、上記の [スキーマの移行] オプションを選択します。
ko: 아래 테이블이 모두 대상에 없습니다. 이러한 테이블의 데이터를 마이그레이션하려면 위의 스키마 마이그레이션 옵션을 선택하세요.
pt_br: Todas as tabelas abaixo estão ausentes no destino. Para migrar os dados nessas tabelas, selecione a opção de migração de esquema acima.
ru: Все указанные ниже таблицы отсутствуют в целевом объекте. Чтобы перенести данные в эти таблицы, выберите вариант схемы миграции выше.
zh_hans: 目标上缺少以下所有表。若要迁移这些表中的数据，请选择上面的迁移架构选项。
zh_hant: 目標上遺漏下列所有資料表。若要移轉這些資料表中的資料，請選取上方的 [移轉結構描述] 選項。

# sql.migration.multi.step.all.steps.completed.errors
source: All steps completed with the following error(s):{0}{1}
de: Alle Schritte wurden mit den folgenden Fehlern abgeschlossen:{0}{1}
es: Todos los pasos se completaron con los siguientes errores:{0}{1}
fr: Toutes les étapes sont terminées avec la ou les erreurs suivantes :{0}{1}
ja: 全てのステップは次のエラーで完了しました: {0}{1}
ko: 다음 오류와 함께 모든 단계가 완료되었습니다.{0}{1}
pt_br: Todas as etapas foram concluídas com o(s) seguinte(s) erros:{0}{1}
ru: Все шаги завершены со следующими ошибками:{0}{1}
zh_hans: 已完成所有步骤，但出现以下错误: {0}{1}
zh_hant: 所有步驟都已完成，但發生以下錯誤:{0}{1}

# sql.migration.multi.step.all.steps.succeeded
source: All steps succeeded.
de: Alle Schritte wurden erfolgreich ausgeführt.
es: Todos los pasos se realizaron correctamente.
fr: Toutes les étapes ont réussi.
ja: すべてのステップが成功しました。
ko: 모든 단계가 완료되었습니다.
pt_br: Todas as etapas foram bem-sucedidas.
ru: Все шаги выполнены успешно.
zh_hans: 所有步骤已成功。
zh_hant: 所有步驟都已成功。

# sql.migration.pre.req.3
source: An Azure SQL Managed Instance, SQL Server on Azure Virtual Machine, or Azure SQL Database to migrate your database(s) to.
de: Eine Azure SQL Managed Instance, einen SQL Server auf einer Azure-VM oder eine Azure SQL-Datenbank, zu dem Ihre Datenbank(en) migriert werden sollen.
es: Una Azure SQL Managed Instance, SQL Server en Azure Virtual Machine o Azure SQL Database para migrar su(s) base(s) de datos.
fr: Un Azure SQL Managed Instance, un SQL Server sur une machine virtuelle Azure ou un Azure SQL Database vers lequel migrer vos bases de données.
ja: データベースの移行先となる Azure SQL Managed Instance、Azure Virtual Machine 上のSQL Server、または Azure SQL Database。
ko: Azure SQL Managed Instance, Azure Virtual Machine의 SQL Server 또는 데이터베이스를 마이그레이션할 Azure SQL Database.
pt_br: Uma Instância Gerenciada de SQL do Azure, SQL Server na Máquina Virtual do Azure ou Banco de Dados SQL do Azure para migrar seus bancos de dados.
ru: Управляемый экземпляр SQL Azure, SQL Server на виртуальной машине Azure или база данных SQL Azure для переноса баз данных.
zh_hans: 要将你的数据库迁移到的 Azure SQL 托管实例、Azure 虚拟机上的 SQL Server 或 Azure SQL 数据库。
zh_hant: 要移轉資料庫的目標 Azure SQL 受控執行個體、Azure 虛擬機器上的 SQL Server 或 Azure SQL 資料庫。

# sql.migration.pre.req.1
source: An Azure account (not required for assessment or SKU recommendation functionality)
de: Ein Azure-Konto (nicht erforderlich für Bewertungs- oder SKU-Empfehlungsfunktionen)
es: Una cuenta de Azure (no es necesaria para la función de evaluación o recomendación de SKU)
fr: Un compte Azure (non requis pour la fonctionnalité d’évaluation ou de recommandation de référence SKU)
ja: Azure アカウント (評価または SKU のレコメンデーション 機能には必要ありません)
ko: Azure 계정(평가 또는 SKU 권장 기능에는 필요하지 않음)
pt_br: Uma conta do Azure (não é necessária para a funcionalidade de avaliação ou recomendação de SKU)
ru: Учетная запись Azure (не требуется для оценки или рекомендаций по SKU)
zh_hans: Azure 帐户(非评估或 SKU 建议功能所需)
zh_hant: Azure 帳戶 (評定或 SKU 建議功能不需要)

# sql.migration.refresh.migrations.error.title
source: An error has occured while refreshing the migrations list.
de: Fehler beim Aktualisieren der Migrationsliste.
es: Error al actualizar la lista de migraciones.
fr: Une erreur s’est produite lors de l’actualisation de la liste des migrations.
ja: 移行リストの更新中にエラーが発生しました。
ko: 마이그레이션 목록을 새로 고치는 동안 오류가 발생했습니다.
pt_br: Erro ao atualizar a lista de migrações.
ru: Произошла ошибка при обновление списка миграций.
zh_hans: 刷新迁移列表时出错。
zh_hant: 重新整理移轉清單時發生錯誤。

# sql.migration.database.backup.load.error
source: An error occurred while accessing database details.
de: Fehler beim Zugriff auf Datenbankdetails.
es: Error al obtener acceso a los detalles de la base de datos.
fr: Une erreur s’est produite lors de l’accès aux détails de la base de données.
ja: データベースの詳細へのアクセス中にエラーが発生しました。
ko: 데이터베이스 세부 정보에 액세스하는 동안 오류가 발생했습니다.
pt_br: Erro ao acessar detalhes do banco de dados.
ru: Произошла ошибка при доступе к сведениям базы данных.
zh_hans: 访问数据库详细信息时出错。
zh_hant: 存取資料庫詳細資料時發生錯誤。

# sql.migration.wizard.sku.assessment.error
source: An error occurred while assessing the server '{0}'.
de: Fehler beim Bewerten des Servers "{0}".
es: Error al evaluar el servidor '{0}'.
fr: Une erreur s'est produite lors de l’évaluation du serveur.
ja: サーバー '{0}' の評価中にエラーが発生しました。
ko: '{0}' 서버를 평가하는 동안 오류가 발생했습니다.
pt_br: Erro ao avaliar o servidor '{0}'.
ru: При доступе к серверу "{0}" произошла ошибка.
zh_hans: 评估服务器“{0}”时出错。
zh_hant: 評定伺服器 '{0}' 時發生錯誤。

# sql.migration.cancel.error
source: An error occurred while canceling the migration.
de: Es ist ein Fehler beim Abbrechen der Migration aufgetreten.
es: Se ha producido un error al cancelar la migración.
fr: Une erreur est survenue lors de l’annulation de la migration.
ja: 移行のキャンセル中にエラーが発生しました。
ko: 마이그레이션을 취소하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao cancelar a migração.
ru: Произошла ошибка при отмене миграции
zh_hans: 取消迁移时出现错误。
zh_hant: 取消移轉時發生錯誤。

# sql.migration.database.connection.error
source: An error occurred while connecting to target migration database.
de: Fehler beim Herstellen einer Verbindung mit der Zielmigrationsdatenbank.
es: Error al conectarse a la base de datos de migración de destino.
fr: Une erreur s'est produite lors de la connexion à la base de données de migration cible.
ja: ターゲット移行データベースへの接続中にエラーが発生しました。
ko: 대상 마이그레이션 데이터베이스에 연결하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao conectar ao banco de dados para a migração de destino.
ru: Ошибка при подключении к целевой базе данных миграции.
zh_hans: 连接到目标迁移数据库时出错。
zh_hant: 連接到目標移轉資料庫時發生錯誤。

# sql.migration.wizard.connection.error.title
source: An error occurred while connecting to the target server.
de: Beim Herstellen einer Verbindung mit dem Zielserver ist ein Fehler aufgetreten.
es: Se produjo un error al conectar con el servidor de destino.
fr: Une erreur s'est produite lors de la connexion au serveur cible.
ja: ターゲット サーバーへの接続中にエラーが発生しました。
ko: 대상 서버에 연결하는 동안 오류가 발생했습니다.
pt_br: Erro ao se conectar ao servidor de destino.
ru: Ошибка при подключении к целевому серверу.
zh_hans: 连接到目标服务器时出错。
zh_hant: 連線到目標伺服器時發生錯誤。

# sql.migration.delete.error
source: An error occurred while deleting the migration.
de: Fehler beim Löschen der Migration.
es: Error al eliminar la migración.
fr: Une erreur s’est produite pendant la suppression de la migration.
ja: 移行の削除中にエラーが発生しました。
ko: 마이그레이션을 삭제하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao excluir a migração.
ru: Ошибка при удалении миграции.
zh_hans: 删除迁移时出错。
zh_hant: 刪除移轉時發生錯誤。

# sql.migration.wizard.sku.error
source: An error occurred while generating SKU recommendations for the server '{0}'.
de: Fehler beim Generieren von SKU-Empfehlungen für den Server '{0}'.
es: Error al generar recomendaciones de SKU para el servidor \"{0}\".
fr: Une erreur s’est produite lors de la génération des recommandations SKU pour le serveur '{0}'.
ja: サーバー `{0}` の SKU レコメンデーションの生成中にエラーが発生しました。
ko: '{0}' 서버의 SKU 권장 사항을 생성하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao gerar recomendações de SKU para o servidor '{0}'.
ru: Произошла ошибка при создании рекомендаций по SKU для сервера \"{0}\".
zh_hans: 为服务器“{0}”生成 SKU 建议时出错。
zh_hant: 產生伺服器 '{0}' 的 SKU 建議時發生錯誤。

# sql.migration.cutover.error
source: An error occurred while initiating cutover.
de: Fehler beim Initiieren des Cutovers.
es: Se produjo un error al iniciar la transición.
fr: Une erreur s’est produite lors du lancement du basculement.
ja: 一括移行開始中にエラーが発生しました。
ko: 컷오버를 시작하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao iniciar a substituição.
ru: При запуске прямой миграции произошла ошибка.
zh_hans: 启动直接转换时出错。
zh_hant: 起始完全移轉時發生錯誤。

# sql.migration.select.service.select.subscription.error
source: An error occurred while loading account subscriptions. Please check your Azure connection and try again.
de: Beim Laden der Kontoabonnements ist ein Fehler aufgetreten. Bitte überprüfen Sie Ihre Azure-Verbindung und versuchen Sie es erneut.
es: Error al cargar las suscripciones de cuenta. Compruebe la conexión de Azure e inténtelo de nuevo.
fr: Une erreur s’est produite lors du chargement des abonnements de compte. Vérifiez votre connexion Azure et réessayez.
ja: アカウント サブスクリプションの読み込み中にエラーが発生しました。Azure 接続を確認して、もう一度お試しください。
ko: 계정 구독을 로드하는 동안 오류가 발생했습니다. Azure 연결을 확인하고 다시 시도하세요.
pt_br: Ocorreu um erro ao carregar as assinaturas da conta. Verifique sua conexão do Azure e tente novamente.
ru: Произошла ошибка при загрузке подписок учетных записей. Проверьте подключение к Azure и повторите попытку.
zh_hans: 加载帐户订阅时出错。请检查 Azure 连接，然后重试。
zh_hant: 載入帳戶訂閱時發生錯誤。請檢查您的 Azure 連線，然後再試一次。

# sql.migration.select.service.select.tenant.error
source: An error occurred while loading available Azure account tenants.
de: Beim Laden des verfügbaren Azure-Kontomandanten ist ein Fehler aufgetreten.
es: Error al cargar los inquilinos de las cuentas de Azure disponibles.
fr: Une erreur s’est produite lors du chargement des locataires de compte Azure disponibles.
ja: 使用可能な Azure アカウント テナントの読み込み中にエラーが発生しました。
ko: 사용 가능한 Azure 계정 테넌트를 로드하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao carregar os locatários da conta do Azure disponíveis.
ru: При загрузке доступных клиентов учетных записей Azure произошла ошибка.
zh_hans: 加载可用的 Azure 帐户租户时出错。
zh_hant: 載入可用的 Azure 帳戶租用戶時發生錯誤。

# sql.migration.select.service.select.account.error
source: An error occurred while loading available Azure accounts.
de: Fehler beim Laden von Azure-Ressourcen.
es: Error al cargar las cuentas de Azure disponibles.
fr: Une erreur s’est produite lors du chargement des comptes Azure disponibles.
ja: 使用可能な Azure アカウントの読み込み中にエラーが発生しました。
ko: 사용 가능한 Azure 계정을 로드하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao carregar as contas do Azure disponíveis.
ru: При загрузке доступных учетных записей Azure произошла ошибка.
zh_hans: 加载可用的 Azure 帐户时出错。
zh_hant: 載入可用的 Azure 帳戶時發生錯誤。

# sql.migration.select.service.select.service.error
source: An error occurred while loading available database migration services. Please check your Azure connection and try again.
de: Fehler beim Laden der verfügbaren Datenbankmigrationsdienste. Überprüfen Sie Ihre Azure-Verbindung, und versuchen Sie es noch mal.
es: Error al cargar los servicios de migración de bases de datos disponibles. Compruebe la conexión de Azure e inténtelo de nuevo.
fr: Une erreur s’est produite lors du chargement des services de migration de base de données disponibles. Vérifiez votre connexion Azure et réessayez.
ja: 使用可能なデータベースの移行サービスの読み込み中にエラーが発生しました。Azure 接続を確認して、もう一度お試しください。
ko: 사용 가능한 데이터베이스 마이그레이션 서비스를 로드하는 동안 오류가 발생했습니다. Azure 연결을 확인하고 다시 시도하세요.
pt_br: Ocorreu um erro ao carregar os serviços de migração de banco de dados disponíveis. Verifique sua conexão do Azure e tente novamente.
ru: Произошла ошибка при загрузке доступных служб миграции баз данных. Проверьте подключение к Azure и повторите попытку.
zh_hans: 加载可用的数据库迁移服务时出错。请检查 Azure 连接，然后重试。
zh_hant: 載入可用的資料庫移轉服務時發生錯誤。請檢查您的 Azure 連線，然後再試一次。

# sql.migration.select.service.select.resource.group.error
source: An error occurred while loading available resource groups. Please check your Azure connection and try again.
de: Beim Laden verfügbarer Ressourcengruppen ist ein Fehler aufgetreten. Bitte überprüfen Sie Ihre Azure-Verbindung und versuchen Sie es erneut.
es: Error al cargar los grupos de recursos disponibles. Compruebe la conexión de Azure y vuelva a intentarlo.
fr: Une erreur s’est produite lors du chargement des groupes de ressources disponibles. Vérifiez votre connexion Azure et réessayez.
ja: 使用可能なリソース グループの読み込み中にエラーが発生しました。Azure 接続を確認して、もう一度お試しください。
ko: 사용 가능한 리소스 그룹을 로드하는 동안 오류가 발생했습니다. Azure 연결을 확인하고 다시 시도하세요.
pt_br: Ocorreu um erro ao carregar os grupos de recursos disponíveis. Verifique sua conexão do Azure e tente novamente.
ru: Произошла ошибка при загрузке доступных групп ресурсов. Проверьте подключение к Azure и повторите попытку.
zh_hans: 加载可用的资源组时出错。请检查 Azure 连接，然后重试。
zh_hant: 載入可用的資源群組時發生錯誤。請檢查您的 Azure 連線，然後再試一次。

# sql.migration.select.service.select.location.error
source: An error occurred while loading locations. Please check your Azure connection and try again.
de: Fehler beim Laden von Speicherorten. Überprüfen Sie Ihre Azure-Verbindung, und versuchen Sie es noch mal.
es: Error al cargar ubicaciones. Compruebe la conexión de Azure e inténtelo de nuevo.
fr: Une erreur s’est produite lors du chargement des emplacements. Vérifiez votre connexion Azure et réessayez.
ja: 場所の読み込み中にエラーが発生しました。Azure 接続を確認して、もう一度お試しください。
ko: 위치를 로드하는 동안 오류가 발생했습니다. Azure 연결을 확인하고 다시 시도하세요.
pt_br: Ocorreu um erro ao carregar os locais. Verifique sua conexão do Azure e tente novamente.
ru: Произошла ошибка при загрузке расположений. Проверьте подключение к Azure и повторите попытку.
zh_hans: 加载位置时出错。请检查 Azure 连接，然后重试。
zh_hant: 載入位置時發生錯誤。請檢查您的 Azure 連線，然後再試一次。

# sql.migration.service.status.refresh.error
source: An error occurred while refreshing the migration service creation status.
de: Es ist ein Fehler beim Aktualisieren des Migrationsdienst-Erstellungsstatus aufgetreten.
es: Se ha producido un error al actualizar el estado de creación del servicio de migración.
fr: Une erreur s’est produite lors de l’actualisation de l’état de création du service de migration.
ja: Migration Service の作成ステータスを更新中にエラーが発生しました。
ko: 마이그레이션 서비스 만들기 상태를 새로 고치는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao atualizar o status de criação do serviço de migração.
ru: Произошла ошибка при обновлении статуса создания службы миграции.
zh_hans: 刷新迁移服务创建状态时出错。
zh_hant: 重新整理移轉服務建立狀態時發生錯誤。

# sql.migration.cutover.status.refresh.error
source: An error occurred while refreshing the migration status.
de: Es ist ein Fehler beim Aktualisieren des Migrationsstatus aufgetreten.
es: Se ha producido un error al actualizar el estado de la migración.
fr: Une erreur s’est produite lors de l’actualisation de l’état de la migration.
ja: 移行ステータスの更新中にエラーが発生しました。
ko: 마이그레이션 상태를 새로 고치는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao atualizar o status da migração.
ru: Произошла ошибка при обновлении статуса миграции.
zh_hans: 刷新迁移状态时出错。
zh_hant: 重新整理移轉狀態時發生錯誤。

# sql.migration.refresh.migrations.error.label
source: An error occurred while refreshing the migrations list. Please check your linked Azure connection and click refresh to try again.
de: Fehler beim Aktualisieren der Migrationsliste. Überprüfen Sie Ihre verknüpfte Azure-Verbindung, und klicken Sie auf "Aktualisieren", um es noch mal zu versuchen.
es: Error al actualizar la lista de migraciones. Compruebe la conexión de Azure vinculada y haga clic en Actualizar para volver a intentarlo.
fr: Une erreur s’est produite lors de l’actualisation de la liste des migrations. Vérifiez votre connexion Azure liée, puis cliquez sur Actualiser pour réessayer.
ja: 移行リストの更新中にエラーが発生しました。リンクされた Azure 接続を確認し、[更新] をクリックしてもう一度お試しください。
ko: 마이그레이션 목록을 새로 고치는 동안 오류가 발생했습니다. 연결된 Azure 연결을 확인하고 새로 고침을 클릭하여 다시 시도하세요.
pt_br: Ocorreu um erro ao atualizar a lista de migrações. Verifique sua conexão do Azure vinculada e clique em atualizar para tentar novamente.
ru: Произошла ошибка при обновлении списка миграций. Проверьте связанное подключение к Azure и нажмите "Обновить", чтобы повторить попытку.
zh_hans: 刷新迁移列表时出错。请检查关联的 Azure 连接，然后单击“刷新”重试。
zh_hant: 重新整理移轉清單時發生錯誤'。 請檢查您的連結 Azure 連線，然後按一下 [重新整理] 再試一次。

# sql.migration.retry.migration.error
source: An error occurred while restarting the migration.
de: Fehler beim erneuten Starten der Migration.
es: Error al reiniciar la migración.
fr: Une erreur s'est produite lors du démarrage de la migration.
ja: 移行の再開中にエラーが発生しました。
ko: 마이그레이션을 다시 시작하는 동안 오류가 발생했습니다.
pt_br: Erro ao reiniciar a migração.
ru: Произошла ошибка при перезапуске миграции.
zh_hans: 开始迁移时出现错误。
zh_hant: 重新啟動移轉時發生錯誤。

# sql.migration.wizard.login.error.title
source: An error occurred while trying to get {0} login information.
de: Beim Versuch, {0} Anmeldeinformationen abzurufen, ist ein Fehler aufgetreten.
es: Error al intentar obtener {0} información de inicio de sesión.
fr: Une erreur s’est produite lors de la tentative d’obtention des informations de connexion {0}.
ja: {0} ログイン情報の取得中にエラーが発生しました。
ko: {0} 로그인 정보를 가져오는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao tentar obter {0} informações de logon.
ru: Произошла ошибка при попытке получения сведений об учетных данных {0}.
zh_hans: 尝试获取 {0} 登录信息时出错。
zh_hant: 嘗試取得 {0} 登入資訊時發生錯誤。

# sql.migration.wizard.sku.assessment.unexpected.error
source: An unexpected error occurred while assessing the server '{0}'.{3}Message: {1}{3}stack: {2}
de: Beim Bewerten des Servers „{0}“ ist ein unerwarteter Fehler aufgetreten.{3}Nachricht: {1}{3}Stack: {2}
es: Error inesperado al evaluar el servidor '{0}'.{3} Mensaje: {1}{3}pila: {2}
fr: Une erreur inattendue s’est produite lors de l’évaluation du serveur « {0} ».{3}Message:pile {1}{3}: {2}
ja: サーバー '{0}' の評価中に予期しないエラーが発生しました。{3}メッセージ: {1}{3}スタック {2}
ko: '{0}' 서버를 평가하는 동안 예기치 않은 오류가 발생했습니다. {3}메시지: {1}{3}스택: {2}
pt_br: Ocorreu um erro inesperado ao avaliar o servidor '{0}'.{3}Mensagem: {1}{3}pilha: {2}
ru: Произошла непредвиденная ошибка при оценке сервера "{0}".{3}Сообщение: {1}{3}стопка: {2}
zh_hans: 评估服务器“{0}”时发生意外错误。{3}消息: {1}{3}堆栈: {2}
zh_hant: 評定伺服器 '{0}' 時發生意外的錯誤。{3}訊息: {1}{3}堆疊: {2}

# sql.migration.database.migration.mode.online.description
source: Application downtime is limited to cutover at the end of migration.
de: Die Ausfallzeit der Anwendung ist auf den Cutover am Ende der Migration beschränkt.
es: El tiempo de inactividad de la aplicación está limitado a la transición hacia el final de la migración.
fr: Le temps d’arrêt de l’application est limité au basculement à la fin de la migration.
ja: アプリケーションのダウンタイムは、移行終了時の一括移行に限定されます。
ko: 애플리케이션 다운타임은 마이그레이션 종료 시 컷오버로 제한됩니다.
pt_br: O tempo de inatividade do aplicativo é limitado para ser substituído no final da migração.
ru: Простой приложения ограничен прямой миграцией в конце миграционного процесса.
zh_hans: 应用程序停机时间限制为在迁移结束时直接转换。
zh_hant: 應用程式停機的情況只會發生於移轉結束時的完全移轉期間。

# sql.migration.database.migration.mode.offline.description
source: Application downtime will start when the migration starts.
de: Die Downtime der Anwendung beginnt, wenn die Migration gestartet wird.
es: El tiempo de inactividad de la aplicación se iniciará cuando se inicie la migración.
fr: Le temps d’arrêt de l’application va démarrer lorsque la migration démarre.
ja: アプリケーションのダウンタイムは、移行開始時に開始します。
ko: 마이그레이션이 시작되면 애플리케이션 가동 중지 시간이 시작됩니다.
pt_br: O tempo de inatividade do aplicativo será iniciado quando a migração for iniciada.
ru: Время простоя приложения начнется при запуске миграции.
zh_hans: 应用程序停机时间将在迁移启动时开始。
zh_hant: 當移轉開始時，應用程式的停機時間就會開始。

# sql.migration.select.service.apply.label
source: Apply
de: Anwenden
es: Aplicar
fr: Appliquer
ja: 適用
ko: 적용
pt_br: Aplicar
ru: Применить
zh_hans: 应用
zh_hant: 套用
