Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.login.migration.refresh.login.data.successful
source: Refreshing login list was successful. Source logins found {0}, Target logins found {1}
de: Die Anmeldeliste wurde erfolgreich aktualisiert. Gefundene Quellanmeldungen {0}, gefundene Zielanmeldungen {1}
es: La actualización de la lista de inicio de sesión se realizó correctamente. Se encontraron inicios de sesión de origen {0}, inicios de sesión de destino encontrados {1}
fr: L’actualisation de la liste de connexions a réussi. Connexions sources trouvées {0}, connexions cibles trouvées {1}
ja: ログイン リストの更新に成功しました。ソース ログインが {0} 件、ターゲット ログインが {1} 件見つかりました。
ko: 로그인 목록을 새로 고침 했습니다. 원본 로그인이 {0}을(를) 찾았습니다. 대상 로그인이 {1}을(를) 찾았습니다.
pt_br: A atualização da lista de logons foi bem-sucedida. {0} Logons de origem encontrados, {1} Logons de destino encontrados
ru: Список учетных данных обновлен. Найдены исходные учетные данные: {0}, найдены целевые учетные данные: {1}
zh_hans: 已成功刷新登录列表。找到的源登录 {0}，找到的目标登录 {1}
zh_hant: 重新整理登入清單成功。發現來源登入 {0}，找到目標登入 {1}

# sql.migration.resourceGroups
source: Resource group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# sql.migration.storage.account.resource.group.label
source: Resource group
zh_hans: 资源组

# sql.migration.rg.created
source: Resource group created
de: Ressourcengruppe erstellt
es: Grupo de recursos creado
fr: Groupe de ressources créé
ja: リソース グループが作成されました
ko: 리소스 그룹을 만들었습니다.
pt_br: Grupo de recursos criado
ru: Создана группа ресурсов
zh_hans: 已创建资源组
zh_hant: 已建立資源群組

# sql.migration.services.resource.group
source: Resource group for your Azure Database Migration Service.
de: Ressourcengruppe für Ihren Azure Database Migration Service.
es: Grupo de recursos para su Azure Database Migration Service.
fr: Groupe de ressources pour votre Azure Database Migration Service.
ja: Azure Database Migration Service のリソース グループ。
ko: Azure Database Migration Service의 리소스 그룹입니다.
pt_br: Grupo de recursos para o seu Serviço de Migração de Banco de Dados do Azure.
ru: Группа ресурсов для Azure Database Migration Service.
zh_hans: Azure 数据库迁移服务的资源组。
zh_hant: Azure 資料庫移轉服務的資源群組。

# sql.migration.dms.resource_group
source: Resource group for your Azure SQL target. Only resource groups that contain a service will be shown.
de: Ressourcengruppe für Ihr Azure SQL-Ziel. Es werden nur Ressourcengruppen angezeigt, die einen Dienst enthalten.
es: Grupo de recursos para el destino de Azure SQL. Solo se mostrarán los grupos de recursos que contienen un servicio.
fr: Groupe de ressources pour votre cible Azure SQL. Seuls les groupes de ressources qui contiennent un service sont affichés.
ja: Azure SQL ターゲット用途のリソース グループ。サービスを含むリソース グループのみが表示されます。
ko: Azure SQL 대상의 리소스 그룹입니다. 서비스를 포함하는 리소스 그룹만 표시합니다.
pt_br: Grupo de recursos para seu destino SQL do Azure. somente grupos de recursos que contêm um serviço serão mostrados.
ru: Группа ресурсов для целевого Azure SQL. Будут показаны только группы ресурсов, содержащие службу.
zh_hans: Azure SQL 目标的资源组。将仅显示包含服务的资源组。
zh_hant: 您的 Azure SQL 目標的資源群組。只會顯示包含服務的資源群組。

# sql.migration.sku.resource_group
source: Resource group for your Azure SQL target. Only resource groups that contain a target eligible for migration will be shown.
de: Ressourcengruppe für Ihr Azure SQL-Ziel. Es werden nur Ressourcengruppen angezeigt, die ein für die Migration geeignetes Ziel enthalten.
es: Grupo de recursos para el destino de Azure SQL. Solo se mostrarán los grupos de recursos que contengan un destino apto para la migración.
fr: Groupe de ressources pour votre cible Azure SQL. Seuls les groupes de ressources qui contiennent une cible éligible pour la migration sont affichés.
ja: Azure SQL ターゲット用途のリソース グループ。移行先として適したターゲットを含むリソース グループのみが表示されます。
ko: Azure SQL 대상의 리소스 그룹입니다. 마이그레이션에 적합한 대상을 포함하는 리소스 그룹만 표시합니다.
pt_br: Grupo de recursos para seu destino SQL do Azure. Somente grupos de recursos que contêm um destino qualificado para migração serão mostradas.
ru: Группа ресурсов для целевого Azure SQL. Будут показаны только те группы ресурсов, которые содержат цель, подходящую для миграции.
zh_hans: Azure SQL 目标的资源组。将仅显示包含符合迁移条件的目标的资源组。
zh_hant: 您的 Azure SQL 目標的資源群組。只會顯示包含符合移轉目標的資源群組。

# sql.migration.sku.restart.performance.collection
source: Restart data collection
de: Datensammlung neu starten
es: Reiniciar la recopilación de datos
fr: Redémarrer la collecte de données
ja: データ収集を再開する
ko: 데이터 수집 다시 시작
pt_br: Reiniciar a coleta de dados
ru: Перезапустить сбор данных
zh_hans: 重启数据收集
zh_hant: 重新啟動資料收集

# sql.migration.restart.migration.wizard
source: Restart migration wizard
de: Migrations-Assistent neu starten
es: Asistente para reiniciar la migración
fr: Redémarrer l'assistant de migration
ja: 移行ウィザードの再起動
ko: 마이그레이션 마법사 다시 시작
pt_br: Reiniciar o assistente de migração
ru: Перезапустить мастер миграции
zh_hans: 重新启动迁移向导
zh_hant: 重新啟動移轉精靈

# sql.migration.restore.status.restore.completed
source: Restore completed
de: Wiederherstellung abgeschlossen
es: Restauración completada
fr: Restauration terminée
ja: 復元が完了しました
ko: 복원이 완료됨
pt_br: Restauração concluída
ru: Восстановление завершено
zh_hans: 还原已完成
zh_hant: 已完成還原

# sql.migration.backup.file.restore.finish.date
source: Restore finish date
de: Enddatum der Wiederherstellung
es: Fecha de finalización de la restauración
fr: Date de fin de la restauration
ja: 復元の終了日
ko: 복원 완료 날짜
pt_br: Restaurar data de término
ru: Дата окончания восстановления
zh_hans: 还原完成日期
zh_hant: 還原完成日期

# sql.migration.restore.status.restore.paused
source: Restore paused
de: Wiederherstellung angehalten
es: Restauración en pausa
fr: Restauration suspendue
ja: 復元が一時停止されました
ko: 복원이 일시 중지됨
pt_br: Restauração pausada
ru: Восстановление приостановлено
zh_hans: 还原已暂停
zh_hant: 還原已暫停

# sql.migration.field.label.restore.percent.completed
source: Restore percent completed
de: Wiederherstellungsabschluss in Prozent
es: Porcentaje de restauración completado
fr: Pourcentage de restauration effectué
ja: 復元の完了率
ko: 복원 완료율
pt_br: Porcentagem de restauração concluída
ru: Процент выполнения восстановления
zh_hans: 已完成还原百分比
zh_hant: 還原完成百分比

# sql.migration.field.label.restore.plan.size
source: Restore plan size (MB)
de: Größe des Wiederherstellungsplans (MB)
es: Tamaño del plan de restauración (MB)
fr: Taille du plan de restauration (Mo)
ja: 復元プランのサイズ (MB)
ko: 복원 계획 크기(MB)
pt_br: Restaurar tamanho do plano (MB)
ru: Размер плана восстановления (МБ)
zh_hans: 还原计划大小(MB)
zh_hant: 還原計劃大小 (MB)

# sql.migration.backup.file.restore.start.date
source: Restore start date
de: Startdatum der Wiederherstellung
es: Fecha de inicio de la restauración
fr: Date de début de la restauration
ja: 復元の開始日
ko: 복원 시작 날짜
pt_br: Restaurar data de início
ru: Дата начала восстановления
zh_hans: 还原开始日期
zh_hant: 還原開始日期

# sql.migration.backup.file.restore.status
source: Restore status
de: Wiederherstellungsstatus
es: Estado de restauración
fr: État de restauration
ja: 復元の状態
ko: 복원 상태
pt_br: Restaurar status
ru: Состояние восстановления
zh_hans: 还原状态
zh_hant: 還原狀態

# sql.migration.restore.backupset.status.restored
source: Restored
de: Wiederhergestellt
es: Restaurado
fr: Restauré
ja: 復元済み
ko: 복원됨
pt_br: Restaurado
ru: Восстановлено
zh_hans: 已还原
zh_hant: 已還原

# sql.migration.field.label.restored.files
source: Restored files
de: Wiederhergestellte Dateien
es: Archivos restaurados
fr: Fichiers restaurés
ja: 復元されたファイル
ko: 복원된 파일
pt_br: Arquivos restaurados
ru: Восстановленные файлы
zh_hans: 已还原的文件
zh_hant: 已還原的檔案

# sql.migration.field.label.restored.size
source: Restored size (MB)
de: Wiederhergestellte Größe (MB)
es: Tamaño restaurado (MB)
fr: Taille restaurée (Mo)
ja: 復元されたサイズ (MB)
ko: 복원된 크기(MB)
pt_br: Tamanho restaurado (MB)
ru: Размер восстановленных файлов (МБ)
zh_hans: 已还原大小(MB)
zh_hant: 已還原的大小 (MB)

# sql.migration.restore.status.Restoring
source: Restoring
de: Wird wiederhergestellt
es: Restaurando
fr: Restauration
ja: 復元しています
ko: 복원 중
pt_br: Restaurando
ru: Восстановление
zh_hans: 正在还原
zh_hant: 正在還原

# sql.migration.restore.backupset.status.restoring
source: Restoring
de: Wird wiederhergestellt
es: Restaurando
fr: Restauration
ja: 復元しています
ko: 복원
pt_br: Restaurando
ru: Восстановление
zh_hans: 正在还原
zh_hant: 正在還原

# sql.migration.status.restoring
source: Restoring
de: Wird wiederhergestellt
es: Restaurando
fr: Restauration
ja: 復元しています
ko: 복원 중
pt_br: Restaurando
ru: Восстановление
zh_hans: 正在还原
zh_hant: 正在還原

# sql.migration.field.label.restoring.files
source: Restoring files
de: Dateien werden wiederhergestellt
es: Restaurando archivos
fr: Restauration des fichiers
ja: ファイルを復元しています
ko: 파일 복원 중
pt_br: Restaurando arquivos
ru: Восстановление файлов
zh_hans: 正在还原文件
zh_hant: 正在還原檔案

# sql.migration.resume.session
source: Resume previously saved session
de: Vorherige gespeicherte Sitzung fortsetzen
es: Reanudar la sesión guardada anteriormente
fr: Reprendre la session précédemment enregistrée
ja: 以前に保存したセッションを再開する
ko: 이전에 저장된 세션 다시 시작
pt_br: Retomar a sessão salva previamente
ru: Возобновить ранее сохраненный сеанс
zh_hans: 恢复以前保存的会话
zh_hant: 繼續之前儲存的工作階段

# sql.migration.status.retriable
source: Retriable
de: Wiederholbar
es: Posibilidad de volver a intentarlo
fr: Réessayer
ja: 取得可能
ko: 다시 시도 가능
pt_br: Recuperável
ru: Повторное
zh_hans: 可重试
zh_hant: 可重试

# sql.migration.tde.migrate.start.validation
source: Retry migration
de: Migration wiederholen
es: Reintentar migración
fr: Réessayer la migration
ja: 移行の再試行
ko: 마이그레이션 다시 시도
pt_br: Repetir a migração
ru: Повтор миграции
zh_hans: 重试迁移
zh_hant: 重試移轉

# sql.migration.retry.migration
source: Retry migration
de: Migration wiederholen
es: Reintentar migración
fr: Réessayer la migration
ja: 移行の再試行
ko: 마이그레이션 다시 시도
pt_br: Repetir a migração
ru: Повтор миграции
zh_hans: 重试迁移
zh_hant: 重試移轉

# sql.migration.validate.ir.unsuccessful.revalidation
source: Revalidate unsuccessful steps
de: Nicht erfolgreiche Schritte erneut überprüfen
es: Volver a validar los pasos que no se han realizado correctamente
fr: Revalider les étapes non réussies
ja: 失敗した手順を再検証する
ko: 실패한 단계 유효성 재검사
pt_br: Revalidar etapas malsucedidas
ru: Повторно проверить невыполненные шаги
zh_hans: 重新验证不成功的步骤
zh_hant: 重新驗證失敗的步驟

# sql.migration.sqldb.column.rowscopied
source: Rows copied
de: Kopierte Zeilen
es: Filas copiadas
fr: Lignes copiées
ja: コピーされた行
ko: 행 복사됨
pt_br: Linhas copiadas
ru: Строки скопированы
zh_hans: 已复制行
zh_hant: 已複製的資料列

# sql.migration.sqldb.column.rowsread
source: Rows read
de: Gelesene Zeilen
es: Filas leídas
fr: Lignes lues
ja: 読み取られた行
ko: 읽은 행
pt_br: Linhas lidas
ru: Прочитанные строки
zh_hans: 已读取行
zh_hant: 已讀取的資料列

# sql.migration.resume.title
source: Run migration workflow again
de: Migrationsworkflow erneut ausführen
es: Volver a ejecutar el flujo de trabajo de migración
fr: Réexécuter le flux de travail de migration
ja: 移行ワークフローを再度実行する
ko: 마이그레이션 워크플로 다시 실행
pt_br: Executar o fluxo de trabalho de migração novamente
ru: Снова запустить рабочий процесс миграции
zh_hans: 再次运行迁移工作流
zh_hant: 再次執行移轉工作流程

# sql.migration.tde.validation.run.validation
source: Run validation
de: Validierung ausführen
es: Ejecutar validación
fr: Exécuter la validation
ja: 検証の実行
ko: 유효성 검사 실행
pt_br: Executar validação
ru: Запустить проверку
zh_hans: 运行验证
zh_hant: 執行驗證

# sql.migration.run.validation
source: Run validation
de: Validierung ausführen
es: Ejecutar validación
fr: Exécuter la validation
ja: 検証の実行
ko: 유효성 검사 실행
pt_br: Executar validação
ru: Запустить проверку
zh_hans: 运行验证
zh_hant: 執行驗證

# sql.migration.state.running
source: Running
de: Wird ausgeführt
es: En ejecución
fr: En cours d'exécution
ja: 実行中
ko: 실행하는 중
pt_br: Executando
ru: Выполняется
zh_hans: 正在运行
zh_hant: 正在執行

# sql.migration.tde.validation.running
source: Running
de: Wird ausgeführt
es: En ejecución
fr: En cours d'exécution
ja: 実行中
ko: 실행 중
pt_br: Em execução
ru: Выполняется
zh_hans: 正在运行
zh_hant: 正在執行

# sql.migration.validation.state.running
source: Running
de: Wird ausgeführt
es: En ejecución
fr: En cours d’exécution
ja: 実行中
ko: 실행하는 중
pt_br: Executando
ru: Выполняется
zh_hans: 正在运行
zh_hant: 正在執行

# sql.migration.sku.azureRecommendation.tooltip.inProgress
source: Running the performance collection for a longer period of time helps ensure a more accurate recommendation.
de: Durch ausführen der Leistungserfassung für einen längeren Zeitraum wird eine genauere Empfehlung sichergestellt.
es: Ejecutar la recopilación de rendimiento durante un período de tiempo más largo ayuda a garantizar una recomendación más precisa.
fr: L’exécution de la collecte des performances pendant une période plus longue permet de garantir une recommandation plus précise.
ja: パフォーマンス コレクションをより長い期間実行すると、より正確なレコメンデーションが得られます。
ko: 오래 성능 수집을 실행할수록 더욱 정확한 권장 사항이 제공됩니다.
pt_br: A execução da coleta de desempenho por um período mais longo ajuda a garantir uma recomendação mais precisa.
ru: Выполнение сбора данных о производительности в течение более длительного времени помогает получить более точную рекомендацию.
zh_hans: 长时间运行性能集合有助于确保更准确的建议。
zh_hant: 長時間執行效能集合有助於確保更精確的建議。

# sql.migration.sql.database
source: SQL Database
de: SQL-Datenbank
es: Base de datos SQL
fr: Base de données SQL
ja: SQL データベース
pt_br: Banco de Dados SQL
ru: База данных SQL
zh_hans: SQL 数据库

# sql.migration.database.schema.migration.project
source: SQL Database Projects extension
de: SQL-Datenbank-Projekterweiterung
es: Extensión SQL Database Projects
fr: Extension Projets de base de données SQL
ja: SQL データベース プロジェクト拡張機能
ko: SQL 데이터베이스 프로젝트 확장
pt_br: Extensão de projetos de Banco de Dados SQL
ru: Расширение проектов базы данных SQL
zh_hans: SQL 数据库项目扩展
zh_hant: SQL Database 專案延伸模組

# sql.migration.sql.managed.instance
source: SQL Managed Instance
de: Verwaltete SQL-Instanz
pt_br: Instância Gerenciada por SQL
ru: Управляемый экземпляр SQL
zh_hans: SQL 托管实例
zh_hant: SQL 受控執行個體

# sql.migration.database.schema.migration.dacpac
source: SQL Server dacpac extension
de: SQL Server-DACPAC-Erweiterung
es: SQL Server extensión dacpac
fr: Extension dacpac SQL Server
ja: SQL Server dacpac 拡張機能
ko: SQL Server DACPAC 확장
pt_br: Extensão dacpac do SQL Server
ru: Расширение DACPAC SQL Server
zh_hans: SQL Server dacpac 扩展
zh_hant: SQL Server dacpac 延伸模組

# sql.migration.sql.server.instance
source: SQL Server instance
de: SQL Server-Instanz
es: Instancia de SQL Server
fr: Instance SQL Server
ja: SQL Server インスタンス
ko: SQL Server 인스턴스
pt_br: Instância do SQL Server
ru: Экземпляр сервера SQL Server
zh_hans: SQL Server 实例
zh_hant: SQL Server 執行個體

# sql.migration.azure.sql.database.virtual.machine.short
source: SQL Server on Azure VM
de: SQL Server auf einem virtuellen Azure-Computer
es: SQL Server en la VM de Azure
fr: SQL Server sur machine virtuelle Azure
ja: Azure VM での SQL Server
pt_br: SQL Server na VM do Azure
ru: SQL Server на виртуальной машине Azure
zh_hans: Azure VM 上的 SQL Server
zh_hant: Azure VM 上的 SQL Server

# sql.migration.summary.vm.type
source: SQL Server on Azure Virtual Machine
de: SQL Server auf Azure-VM
es: SQL Server en una máquina virtual de Azure
fr: SQL Server dans une machine virtuelle Azure
ja: Azure Virtual Machine 上の SQL Server
ko: Azure 가상 머신의 SQL Server
pt_br: SQL Server na Máquina Virtual do Azure
ru: SQL Server на виртуальной машине Azure
zh_hans: Azure 虚拟机上的 SQL Server
zh_hant: Azure 虛擬機器上的 SQL Server

# sql.login.migration.vm.title
source: SQL Server on Azure Virtual Machine
de: SQL Server auf Azure-VM
es: SQL Server en una máquina virtual de Azure
fr: SQL Server dans une machine virtuelle Azure
ja: Azure Virtual Machine 上の SQL Server
ko: Azure 가상 머신의 SQL Server
pt_br: SQL Server na Máquina Virtual do Azure
ru: SQL Server на виртуальной машине Azure
zh_hans: Azure 虚拟机上的 SQL Server
zh_hant: Azure 虛擬機器上的 SQL Server

# sql.migration.sku.vm.target.title
source: SQL Server on Azure Virtual Machine
de: SQL Server auf Azure-VM
es: SQL Server en una máquina virtual de Azure
fr: SQL Server dans une machine virtuelle Azure
ja: Azure Virtual Machine 上の SQL Server
ko: Azure 가상 머신의 SQL Server
pt_br: SQL Server na Máquina Virtual do Azure
ru: SQL Server на виртуальной машине Azure
zh_hans: Azure 虚拟机上的 SQL Server
zh_hant: Azure 虛擬機器上的 SQL Server

# sql.migration.sku.vm.card.title
source: SQL Server on Azure Virtual Machine (IaaS)
de: SQL Server auf Azure-VM (IaaS)
es: SQL Server en una máquina virtual de Azure (IaaS)
fr: SQL Server dans une machine virtuelle Azure (laaS)
ja: Azure Virtual Machine 上の SQL Server (IaaS)
ko: Azure 가상 머신의 SQL Server(IaaS)
pt_br: SQL Server na Máquina Virtual do Azure (IaaS)
ru: SQL Server на виртуальной машине Azure (IaaS)
zh_hans: Azure 虚拟机上的 SQL Server (laaS)
zh_hant: Azure 虛擬機器上的 SQL Server (IaaS)

# sql.migration.azure.sql.database.virtual.machine
source: SQL Server on Azure Virtual Machines
de: SQL Server auf Azure-VMs
es: SQL Server en Azure Virtual Machines
fr: SQL Server sur des machines virtuelles Azure
ja: Azure Virtual Machines 上の SQL Server
ko: Azure 가상 컴퓨터의 SQL Server
pt_br: SQL Server em Máquinas Virtuais do Azure
ru: SQL Server на виртуальных машинах Azure
zh_hans: Azure 虚拟机上的 SQL Server
zh_hant: Azure 虛擬機器上的 SQL Server

# sql.migration.sql.virtual.machine
source: SQL Virtual Machine
de: Virtueller SQL-Computer
es: Máquina virtual de SQL
fr: Machine virtuelle SQL
ja: SQL 仮想マシン
ko: SQL 가상 머신
pt_br: Máquina Virtual SQL
ru: Виртуальная машина SQL
zh_hans: SQL 虚拟机
zh_hant: SQL 虛擬機器

# sql.migration.sku.sql.dataDisk
source: SQL data files
de: SQL-Datendateien
es: Archivos de datos de SQL
fr: Fichiers de données DQS
ja: SQL データ ファイル
ko: SQL 데이터 파일
pt_br: Arquivos de dados do SQL
ru: Файлы данных SQL
zh_hans: SQL 数据文件
zh_hant: SQL 資料檔案

# sql.migration.sku.sql.logDisk
source: SQL log files
de: SQL-Protokolldateien
es: Archivos de registro de SQL
fr: Fichiers journaux SQL
ja: SQL ログ ファイル
ko: SQL 로그 파일
pt_br: Arquivos de log do SQL
ru: Файлы журналов SQL
zh_hans: SQL 日志文件
zh_hant: SQL 記錄檔案

# sql.migration.sql.assessment.notebook.title
source: SQL migration assessment
de: SQL-Migrationsbewertung
es: Evaluación de la migración de SQL
fr: Évaluation de la migration SQL
ja: SQL 移行評価
ko: SQL 마이그레이션 평가
pt_br: Avaliação de migração de SQL
ru: Оценка миграции SQL
zh_hans: SQL 迁移评估
zh_hant: SQL 移轉評定

# sql.migration.target.provisioning.save
source: Save
zh_hans: 保存

# sql.migration.target.provisioning.title
source: Save Template
zh_hans: 保存模板

# sql.migration.save.close
source: Save and close
de: Speichern und schließen
es: Guardar y cerrar
fr: Enregistrer et fermer
ja: 保存して閉じる
ko: 저장하고 닫기
pt_br: Salvar e fechar
ru: Сохранить и закрыть
zh_hans: 保存并关闭
zh_hant: 儲存後關閉

# sql.migration.save.assessment.report
source: Save assessment report
de: Bewertungsbericht speichern
es: Guardar informe de la valoración
fr: Enregistrer le rapport d'évaluation
ja: 評価レポートを保存する
ko: 평가 보고서 저장
pt_br: Salvar relatório de avaliação
ru: Сохранить отчет об оценке
zh_hans: 保存评估报告
zh_hant: 儲存評定報表

# sql.migration.save.recommendation.report
source: Save recommendation report
de: Empfehlungsbericht speichern
es: Guardar informe de recomendaciones
fr: Enregistrer le rapport de recommandation
ja: 推奨事項レポートを保存する
ko: 권장 사항 보고서 저장
pt_br: Salvar relatório de recomendação
ru: Сохранить отчет о рекомендациях
zh_hans: 保存建议报告
zh_hant: 儲存建議報告

# sql.ir.save.script
source: Save script
zh_hans: 保存脚本

# sql.migration.target.upload.to.azure
source: Save to Azure blob container
zh_hans: 保存到 Azure Blob 容器

# sql.migration.saved.assessment.result
source: Saved session
de: Gespeicherte Sitzung
es: Sesión guardada
fr: Session enregistrée
ja: 保存されたセッション
ko: 저장된 세션
pt_br: Sessão salva
ru: Сохраненный сеанс
zh_hans: 已保存的会话
zh_hant: 已儲存的工作階段

# sql.migration.sku.parameters.scale.factor
source: Scale factor
de: Skalierungsfaktor
es: Factor de escala:
fr: Facteur d'échelle
ja: 倍率:
ko: 배율
pt_br: Fator de escala:
ru: Коэффициент масштаба
zh_hans: 比例因子
zh_hant: 比例因素

# sql.migration.schema.data
source: Schema and data
de: Schema und Daten
es: Esquema y datos
fr: Schéma et données
ja: スキーマとデータ
ko: 스키마 및 데이터
pt_br: Esquema e dados
ru: Схема и данные
zh_hans: 架构和数据
zh_hant: 結構描述和資料

# sql.migration.schema.migration.column.label
source: Schema migration
es: Migración de esquema
fr: Migration de schéma
ja: スキーマの移行
ko: 스키마 마이그레이션
pt_br: Migração de esquema
ru: Миграция схемы
zh_hans: 架构迁移
zh_hant: 結構描述移轉

# sql.migration.schema.migration.header
source: Schema migration
es: Migración de esquema
fr: Migration de schéma
ja: スキーマの移行
ko: 스키마 마이그레이션
pt_br: Migração de esquema
ru: Миграция схемы
zh_hans: 架构迁移
zh_hant: 結構描述移轉

# sql.schema.migration.information
source: Schema migration is in {0} in Step 6. It requires an Integration Runtime version of [{1}] or higher. Schema deployment will make a best effort to deploy database objects. Schema deployment errors will not prevent data migration.
de: Die Schemamigration befindet sich in Schritt 6 in {0}. Sie erfordert eine Integration Runtime-Version von [{1}] oder höher. Bei der Schemabereitstellung wird versucht, die Datenbankobjekte bestmöglich bereitzustellen. Schemabereitstellungsfehler verhindern die Datenmigration nicht.
es: La migración de esquemas se encuentra en {0} en el paso 6. Requiere una versión de Integration Runtime de [{1}] o superior. La implementación del esquema hará el mejor esfuerzo para implementar objetos de base de datos. Los errores de implementación de esquema no impedirán la migración de datos.
fr: La migration de schéma est en {0} à l’étape 6. Elle nécessite une version Integration Runtime de [{1}] ou ultérieure. Le déploiement de schéma permet de déployer des objets de base de données. Les erreurs de déploiement de schéma n’empêchent pas la migration des données.
ja: スキーマの移行は手順 6 の{0} で行います。Integration Runtime バージョン [{1}] 以降が必要です。スキーマのデプロイでは、データベース オブジェクトのデプロイに最善を尽くします。スキーマ デプロイ エラーが発生しても、データの移行が妨げられることはありません。
ko: 스키마 마이그레이션의 {0}/6단계를 진행 중입니다. [{1}] 이상의 Integration Runtime 버전이 필요합니다. 스키마 배포는 데이터베이스 개체를 배포하기 위해 최선을 다합니다. 스키마 배포 오류로 인해 데이터 마이그레이션이 방해되지는 않습니다.
pt_br: A migração do esquema está em {0} na Etapa 6. Ela requer uma versão do Integration Runtime [{1}] ou superior. A implantação do esquema fará o melhor esforço para implantar objetos de banco de dados. Erros de implantação de esquema não impedirão a migração de dados.
ru: Миграция схемы находится в {0} на шаге 6. Для этого требуется версия Microsoft Integration Runtime [{1}] или выше. При развертывании схемы будет сделано все возможное для развертывания объектов базы данных. Ошибки развертывания схемы не препятствуют переносу данных.
zh_hans: 架构迁移位于步骤 6 的 {0} 中。它需要 [{1}] 或更高版本的 Integration Runtime。架构部署将尽力部署数据库对象。架构部署错误不会阻止数据迁移。
zh_hant: 結構描述移轉在步驟 6 的 {0} 中。其需要 Integration Runtime 版本的 [{1}] 或更新版本。結構描述部署將盡力部署資料庫物件。結構描述部署錯誤將不會防止資料移轉。
