Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.status.error.count.single
source: ({0} error)
de: ({0} Fehler)
fr: ({0} erreur)
ja: ({0} エラー)
ko: ({0}개의 오류)
pt_br: ({0} erro)
ru: ({0} ошибка)
zh_hans: ({0} 错误)
zh_hant: ({0} 個錯誤)

# sql.migration.status.error.count.multiple
source: ({0} errors)
de: ({0} Fehler)
es: ({0} errores)
fr: ({0} erreurs)
ja: ({0} エラー)
ko: ({0}개의 오류)
pt_br: ({0} erros)
ru: (Ошибок: {0})
zh_hans: ({0} 个错误)
zh_hant: ({0} 個錯誤)

# sql.migration.status.warning.count.single
source: ({0} warning)
de: ({0} Warnung)
es: ({0} advertencia)
fr: ({0} avertissement)
ja: ({0} 警告)
ko: ({0}개의 경고)
pt_br: ({0} aviso)
ru: ({0} предупреждение)
zh_hans: ({0} 个警告)
zh_hant: ({0} 個警告)

# sql.migration.status.warning.count.multiple
source: ({0} warnings)
de: ({0} Warnungen)
es: ({0} advertencias)
fr: ({0} avertissements)
ja: ({0} 警告)
ko: ({0}개의 경고)
pt_br: ({0} avisos)
ru: (Предупреждений: {0})
zh_hans: ({0} 个警告)
zh_hant: ({0} 個警告)

# sql.migration.unavailable.target
source: (Unavailable) {0}
de: (Nicht verfügbar) {0}
es: (No disponible) {0}
fr: (Indisponible) {0}
ja: (使用不可) {0}
ko: (사용할 수 없음) {0}
pt_br: (Indisponível) {0}
ru: (Недоступно) {0}
zh_hans: (不可用) {0}
zh_hant: (無法使用) {0}

# sql.migration.assessed.databases
source: (for {0} assessed databases)
de: (für {0} bewertete Datenbanken)
es: (para {0} bases de datos evaluadas)
fr: (pour {0} bases de données évaluées)
ja: (評価済みデータベース {0} 件の場合)
ko: ({0} 평가된 데이터베이스의 경우)
pt_br: (para {0} bancos de dados avaliados)
ru: (для {0} оцененных баз данных)
zh_hans: (适用于 {0} 个已评估的数据库)
zh_hant: (針對 {0} 個已評定的資料庫)

# sql.migration.new.resource.group
source: (new) {0}
de: (neu) {0}
es: (nuevo) {0}
fr: (nouveau) {0}
ja: (新規) {0}
ko: (신규) {0}
pt_br: (novo) {0}
ru: (новое) {0}
zh_hans: (新) {0}
zh_hant: (新) {0}

# sql.migration.service.details.status.unavailable
source: -- unavailable --
de: -- nicht verfügbar --
es: -- no disponible --
fr: -- non disponible --
ja: -- 使用不可 --
ko: -- 사용할 수 없음 --
pt_br: - indisponível -
ru: -- недоступно --
zh_hans: -- 不可用 --
zh_hant: -- 無法使用 --

# sql.migration.database.missing.tables
source: 0 tables on source database found on target database. To migrate the data in the tables select the migrate schema option above.
de: In der Zieldatenbank wurden 0 Tabellen in der Quelldatenbank gefunden. Um die Daten in den Tabellen zu migrieren, wählen Sie oben die Option "Schema migrieren" aus.
es: Se encontraron 0 tablas en la base de datos de origen en la base de datos de destino. Para migrar los datos de las tablas, seleccione la opción migrar esquema anterior.
fr: 0 table sur la base de données source trouvée sur la base de données cible. Pour migrer les données des tables, sélectionnez l’option migrer le schéma ci-dessus.
ja: ターゲット データベースでソース データベースに 0 個のテーブルが見つかりました。テーブル内のデータを移行するには、上記の [スキーマの移行] オプションを選択します。
ko: 원본 데이터베이스에 테이블 0개가 대상 데이터베이스에 있습니다. 테이블에서 데이터를 마이그레이션하려면 위의 스키마 마이그레이션 옵션을 선택합니다.
pt_br: 0 tabelas no banco de dados de origem encontradas no banco de dados de destino. Para migrar os dados nas tabelas, selecione a opção de migração de esquema acima.
ru: 0 таблиц базы данных-источника найдено в целевой базе данных. Чтобы перенести данные в таблицах, выберите параметр миграции схемы выше.
zh_hans: 在目标数据库上找到源数据库上的 0 个表。若要迁移表中的数据，请选择上面的迁移架构选项。
zh_hant: 在目標資料庫上找到來源資料庫上的 0 個資料表。若要移轉資料表中的資料，請選取上方的移轉結構描述選項。

# sql.migration.cutover.step.1
source: 1. Stop all incoming transactions to the source database.
de: 1. Beenden Sie alle eingehenden Transaktionen in der Quelldatenbank.
es: 1. Detenga todas las transacciones entrantes en la base de datos de origen.
fr: 1. Arrêtez toutes les transactions entrantes à destination de la base de données source.
ja: 1. ソース データベースに送信されるすべてのトランザクションを停止します。
ko: 1. 원본 데이터베이스로 들어오는 모든 트랜잭션을 중지합니다.
pt_br: 1. Interromper todas as transações de entrada para o banco de dados de origem.
ru: 1. Остановите все входящие транзакции в базе данных-источнике.
zh_hans: 1. 停止到源数据库的所有传入事务。
zh_hant: 1. 停止所有導向來源資料庫的傳入交易。

# sql.migration.cutover.step.2.network.share
source: 2. Create a final transaction log backup and store it on the network share.
de: 2. Erstellen Sie eine abschließende Transaktionsprotokollsicherung, und speichern Sie sie auf der Netzwerkfreigabe.
es: 2. Cree una copia de seguridad final del registro de transacciones y almacénela en el recurso compartido de red.
fr: 2. Créez une sauvegarde finale du journal des transactions et stockez-la sur le partage réseau.
ja: 2. トランザクション ログの最終的なバックアップを取り、それをネットワーク共有に格納します。
ko: 2. 최종 트랜잭션 로그 백업을 만들어 네트워크 공유에 저장합니다.
pt_br: 2. Crie um backup de log final e armazene-o no compartilhamento de rede.
ru: 2. Сделайте окончательную резервную копию журналов транзакций и разместите ее в сетевой папке.
zh_hans: 2. 创建最终事务日志备份并将其存储在网络共享上。
zh_hant: 2. 建立最終交易記錄備份，並儲存在網路共用上。

# sql.migration.cutover.step.2.blob
source: 2. Create a final transaction log differential or backup and store it in the Azure Storage Blob Container.
de: 2. Erstellen Sie eine abschließende differenzielle Transaktionsprotokollsicherung, und speichern Sie sie im Azure Storage Blob Container.
es: 2. Cree una copia de seguridad o diferencial del registro de transacciones final y almacénela en el contenedor de Azure Storage Blob.
fr: 2. Créez un journal des transactions différentielle ou une sauvegarde finale et stockez-le dans le conteneur Azure Storage Blob.
ja: 2. 最終の差分またはトランザクション ログのバックアップを作成し、Azure Storage Blob コンテナーに格納します。
ko: 2. 최종 트랜잭션 로그 차등 또는 백업을 만들어 Azure Storage Blob 컨테이너에 저장합니다.
pt_br: 2. Faça o backup do log diferencial final ou faça o backup e armazene-o no Contêiner do Azure Storage Blob.
ru: 2. Создайте окончательную разностную копию журнала транзакций или резервную копию и сохраните ее в контейнере Azure Storage Blob.
zh_hans: 2. 创建最终事务日志的差异或备份，并将其存储在 Azure 存储 Blob 容器中。
zh_hant: 2. 建立最終交易記錄差異比較或備份，並將它儲存在在 Azure 儲存體 Blob 容器。

# sql.migration.cutover.step.3.blob
source: 3. Verify that all backups have been restored on the target database. The "Log backups pending restore" value should be zero.
de: 3. Stellen Sie sicher, dass alle Sicherungen in der Zieldatenbank wiederhergestellt wurden. Der Wert für "Ausstehende Wiederherstellung von Protokollsicherungen" sollte 0 (null) sein.
es: 3. Compruebe que todas las copias de seguridad se hayan restaurado en la base de datos de destino. El valor de "Copias de seguridad del registro de transacciones" debe ser cero.
fr: 3. Vérifiez que toutes les sauvegardes ont été restaurées sur la base de données cible. La valeur « Sauvegardes du journal en attente de restauration » doit être égale à zéro.
ja: 3. ターゲット データベースですべてのバックアップが復元されていることを確認します。"復元保留中のログ バックアップ" 値は、0 にする必要があります。
ko: 3. 모든 백업이 대상 데이터베이스에서 복원되었는지 확인합니다. "복원 보류 중인 로그 백업" 값은 0이어야 합니다.
pt_br: 3. Verifique se todos os backups foram restaurados no banco de dados de destino. O valor de “Backups de log com restauração pendente” deve ser zero.
ru: 3. Убедитесь в том, что все резервные копии восстановлены в целевой базе данных. Значение параметра "Резервные копии журналов, ожидающие восстановления" должно быть нулевым.
zh_hans: 3. 验证是否已在目标数据库上还原所有备份。“等待还原的日志备份”值应为零。
zh_hant: 3. 確認所有備份已還原到目標資料庫上。[待還原的記錄備份] 值應為零。

# sql.migration.cutover.step.3.network.share
source: 3. Verify that all log backups have been restored on the target database. The "Log backups pending restore" value should be zero.
de: 3. Stellen Sie sicher, dass alle Protokollsicherungen in der Zieldatenbank wiederhergestellt wurden. Der Wert für "Ausstehende Wiederherstellung von Protokollsicherungen" sollte 0 (null) sein.
es: 3. Compruebe que todas las copias de seguridad de registros se hayan restaurado en la base de datos de destino. El valor de "Copias de seguridad del registro de transacciones" debe ser cero.
fr: 3. Vérifiez que vos sauvegardes ont été restaurées sur la base de données cible. La valeur « sauvegarde du journal en attente de restauration » doit être égale à zéro.
ja: 3. ターゲット データベースですべてのログ バックアップが復元されていることを確認します。"復元保留中のログ バックアップ" 値は、0 にする必要があります。
ko: 3. 모든 로그 백업이 대상 데이터베이스에서 복원되었는지 확인합니다. "복원 보류 중인 로그 백업" 값은 0이어야 합니다.
pt_br: 3. Verifique se todos os backups de log foram restaurados no banco de dados de destino. O valor de “Backups de log com restauração pendente” deve ser zero.
ru: 3. Убедитесь в том, что все резервные копии журналов восстановлены в целевой базе данных. Значение параметра "Резервные копии журналов, ожидающие восстановления" должно быть нулевым.
zh_hans: 3. 验证是否已在目标数据库上还原所有日志备份。“等待还原的日志备份”值应为零。
zh_hant: 3. 確認所有記錄備份已還原到目標資料庫上。[待還原的記錄備份] 值應為零。

# sql.migration.bc.info
source: A SQL Managed Instance migration cutover to the Business Critical service tier can take significantly longer than General Purpose because three secondary replicas have to be seeded for Always On High Availability group. The duration of the operation depends on the size of the data. Seeding speed in 90% of cases is 220 GB/hour or higher.
de: Ein Cutover der Migration einer verwalteten SQL-Instanz kann auf der Dienstebene "Unternehmenskritisch" erheblich länger dauern als auf "Universell", da für drei sekundäre Replikate eine Always On-Hochverfügbarkeitsgruppe angelegt werden muss. Die Dauer des Vorgangs hängt von der Größe der Daten ab. Die Seedinggeschwindigkeit ist in 90 % der Fälle 220 GB/Stunde oder höher.
es: La transición de SQL Managed Instance para el nivel de servicio crítico para la empresa puede tardar mucho más que De uso general, ya que deben inicializarse tres réplicas secundarias para el grupo de alta disponibilidad Always On. La duración de la operación depende del tamaño de los datos. La velocidad de inicio en el 90% de los casos es de 220 GB/hora o superior.
fr: Un basculement de la migration des SQL Managed Instances pour le niveau de service critique pour l'entreprise peut prendre beaucoup plus de temps que pour le niveau de service général, car trois répliques secondaires doivent être alimentées pour le groupe de haute disponibilité Always On. La durée de cette opération dépend de la taille des données. Dans 90 % des cas, la vitesse d'alimentation est de 220 Go/heure ou plus.
ja: ビジネス クリティカル サービス層の SQL Managed Instance の一括移行では、Always On 高可用性グループに 3 つのセカンダリ レプリカをシードする必要があるため、通常の目的よりも大幅に時間がかかります。このオペレーションの期間は、データのサイズに依存します。シードの速度は、90% のケースで220GB/時以上となっています。
ko: 중요 업무용 서비스 계층으로의 SQL Managed Instance 마이그레이션 컷오버는 Always On 고가용성 그룹에 대해 3개의 보조 복제본을 시드해야 하기 때문에 범용보다 훨씬 오래 걸릴 수 있습니다. 작업 기간은 데이터 크기에 따라 다릅니다. 90%의 경우 시딩 속도는 220GB/시간 이상입니다.
pt_br: Uma substituição de migração de Instância Gerenciada de SQL para a camada de serviço Comercialmente Crítico pode levar muito mais tempo do que a de Uso Geral, pois três réplicas secundárias devem ser propagadas para o grupo de Alta Disponibilidade Always On. A duração da operação depende do tamanho dos dados. A velocidade de propagação em 90% dos casos é de 220 GB/hora ou superior.
ru: Прямая миграция управляемого экземпляра SQL на критически важный для бизнеса уровень может занять значительно больше времени, чем для уровня общего назначения, поскольку для группы высокого уровня доступности Always On необходимо присвоить начальное значение трем вторичным репликам. Продолжительность этой операции зависит от объема данных. В 90% случаев скорость присвоения начального значения составляет 220 ГБ в час или выше.
zh_hans: SQL 托管实例迁移直接转换到业务关键服务层需要的时间可能远多于常规用途，因为必须为始终打开高可用性组设置三个次要副本的种子。该操作持续时间取决于数据的大小。在 90% 的情况下，设置种子的速度为 220 GB/小时或更高。
zh_hant: 因為必須將三個次要複本設為 Always On 高可用性群組，所以企業關鍵服務層的 SQL 受控執行個體完全移轉所花費的時間會明顯超出一般用途。作業的持續時間取決於資料的大小。90% 案例的植入速度為 220 GB/小時或更高。

# sql.migration.dashboard.help.description.dmsGuide
source: A hub of migration articles that provides step-by-step guidance for migrating and modernizing your data assets in Azure.
de: Ein Hub mit Artikeln zur Migration, die Schritt-für-Schritt-Anleitungen für die Migration und Modernisierung Ihrer Datenressourcen in Azure bereitstellen.
es: Sitio central de artículos de migración que proporciona instrucciones paso a paso para migrar y modernizar sus recursos de datos en Azure.
fr: Hub d’articles de migration qui fournit des conseils détaillés sur la migration et la modernisation de vos ressources de données dans Azure.
ja: Azure のデータ資産の移行と最新化に関して、手順を追ったガイダンスを提供する移行記事のハブ。
ko: Azure에서 데이터 자산을 마이그레이션하고 최신화하기 위한 단계별 지침을 제공하는 마이그레이션 문서의 허브입니다.
pt_br: Um hub de artigos de migração que fornece orientações passo a passo para migrar e modernizar seus ativos de dados no Azure.
ru: Центр статей по миграции, предоставляющий пошаговое руководство по миграции и модернизации ресурсов данных в Azure.
zh_hans: 提供有关在 Azure 中迁移和现代化数据资产分步指南的迁移文章中心。
zh_hant: 移轉文章的中樞，提供在 Azure 中移轉和讓資料資產現代化的逐步指引。

# sql.migration.resource.group.description
source: A resource group is a container that holds related resources for an Azure solution.
de: Eine Ressourcengruppe ist ein Container, der zugehörige Ressourcen für eine Azure-Lösung enthält.
es: Un grupo de recursos es un contenedor que tiene los recursos relacionados de una solución de Azure.
fr: Un groupe de ressources est un conteneur qui inclut les ressources associées à une solution Azure.
ja: リソース グループは、Azure のソリューションに関連するリソースを保持するコンテナーです。
ko: 리소스 그룹은 Azure 솔루션에 대한 관련 리소스를 보유하는 컨테이너입니다.
pt_br: Um grupo de recursos é um contêiner que armazena recursos relacionados para uma solução do Azure.
ru: Группа ресурсов — это контейнер, содержащий связанные ресурсы для решения Azure.
zh_hans: 资源组是保管 Azure 解决方案的相关资源的容器。
zh_hant: 資源群組是能夠存放 Azure 解決方案相關資源的容器。

# sql.migration.target.provisioning.template.display.limit
source: A single ARM template has a deployment limitation of a maximum 50 Azure SQL Databases. The template for the first 50 databases is displayed below. To view all templates, save the template JSON file in a local storage or Azure Blob storage.
zh_hans: 单个 ARM 模板的部署限制为最多 50 个 Azure SQL 数据库。前 50 个数据库的模板如下所示。要查看所有模板，请将模板 JSON 文件保存在本地存储或 Azure Blob 存储中。

# sql.migration.pre.req.2
source: A source SQL Server database(s) running on on-premises, or on SQL Server on Azure Virtual Machine or any virtual machine running in the cloud (private, public).
de: Eine oder mehrere SQL Server-Quelldatenbanken, die lokal oder auf SQL Server auf einer Azure-VM oder einem beliebigen virtuellen Computer in der Cloud (privat, öffentlich) ausgeführt werden.
es: Una(s) base(s) de datos SQL Server de origen que se ejecuta(n) localmente, o en SQL Server en Azure Virtual Machine o en cualquier máquina virtual que se ejecute en la nube (privada, pública).
fr: Une ou plusieurs bases de données SQL Server sources s’exécutant localement ou sur SQL Server sur une machine virtuelle Azure ou une machine virtuelle exécutée dans le cloud (privé, public).
ja: オンプレミス、Azure 仮想マシン上のSQL Server、またはクラウドで実行されている任意の仮想マシン (プライベート、パブリック) で実行されているソース SQL Server データベース。
ko: 온-프레미스 또는 Azure Virtual Machine의 SQL Server 또는 클라우드(프라이빗, 퍼블릭)에서 실행되는 모든 가상 머신에서 실행되는 원본 SQL Server 데이터베이스입니다.
pt_br: Uma fonte de bancos de dados SQL Server em execução no local ou no SQL Server na Máquina Virtual do Azure ou em qualquer máquina virtual em execução na nuvem (privada, pública).
ru: Исходные базы данных SQL Server, работающие в локальной среде, на SQL Server в виртуальной машине Azure или в любой виртуальной машине, работающей в облаке (частном, общедоступном).
zh_hans: 在本地或 Azure 虚拟机中的 SQL Server 或云(私有、公共)中运行的任何虚拟机上的源 SQL Server 数据库。
zh_hant: 在內部部署或 Azure 虛擬機器上的 SQL Server 上執行的來源 SQL Server 資料庫，或雲端中執行的任何虛擬機器 (私人、公用)。

# sql.migration.dashboard.help.description.sqldb
source: A step-by-step tutorial to migrate databases from a SQL Server instance (on-premises or Azure Virtual Machines) to Azure SQL Database.
de: Ein Tutorial, das Schritt für Schritt erklärt, wie Sie Datenbanken von einer SQL Server-Instanz (vor Ort oder Azure Virtual Machines) zu Azure SQL Database migrieren.
es: Tutorial paso a paso para migrar bases de datos de una instancia de SQL Server (local o de Azure Virtual Machines) a Azure SQL Database.
fr: Un didacticiel pas à pas pour migrer des bases de données d'une instance SQL Server (sur site ou Azure Virtual Machines) vers Azure SQL Database.
ja: SQL Server インスタンス (オンプレミスまたは Azure Virtual Machines) から Azure SQL Database にデータベースを移行するためのステップ バイ ステップ チュートリアルです。
ko: SQL Server 인스턴스(온-프레미스 또는 Azure Virtual Machines)에서 Azure SQL Database로 데이터베이스를 마이그레이션하는 단계별 자습서입니다.
pt_br: Um tutorial passo a passo para migrar bancos de dados de uma instância do SQL Server (no local ou Máquinas Virtuais do Microsoft Azure) para o Banco de Dados SQL do Azure.
ru: Пошаговый учебник по миграции баз данных с экземпляра SQL Server (локальная среда или Виртуальные машины Azure) в Базу данных SQL Azure.
zh_hans: 将数据库从 SQL Server 实例(本地或 Azure 虚拟机中)迁移到 Azure SQL 数据库的分步教程。
zh_hant: 將資料庫從 SQL Server 執行個體 (內部部署或 Azure 虛擬機器) 移轉至 Azure SQL 資料庫的逐步教學課程。

# sql.migration.dashboard.help.description.mi
source: A step-by-step tutorial to migrate databases from a SQL Server instance (on-premises or Azure Virtual Machines) to Azure SQL Managed Instance with minimal downtime.
de: Ein Tutorial, das Sie mit einer Schritt-für-Schritt-Anleitung dabei unterstützt, Datenbanken aus einer SQL Server-Instanz (lokal oder Azure Virtual Machines) mit minimaler Downtime zu Azure SQL Managed Instance zu migrieren.
es: Tutorial paso a paso para migrar bases de datos de una instancia de SQL Server (local o de Azure Virtual Machines) a Azure SQL Managed Instance con un tiempo de inactividad mínimo.
fr: Didacticiel pas à pas permettant de migrer des bases de données d’une instance de SQL Server (machines virtuelles locales ou Azure) vers Azure SQL Managed Instance avec un temps d’arrêt minimal.
ja: SQL Server インスタンス (オンプレミスまたは Azure Virtual Machines) から Azure SQL Managed Instance に最小のダウンタイムでデータベースを移行するための手順を追ったチュートリアルです。
ko: 가동 중지 시간을 최소화하면서 SQL Server 인스턴스(온-프레미스 또는 Azure Virtual Machines)에서 Azure SQL Managed Instance로 데이터베이스를 마이그레이션하는 단계별 자습서입니다.
pt_br: Um tutorial passo a passo para migrar bancos de dados de uma instância do SQL Server (local ou Máquinas Virtuais do Azure) para a Instância Gerenciada de SQL do Azure com tempo de inatividade mínimo.
ru: Пошаговый учебник по миграции баз данных с экземпляра SQL Server (локальный или Виртуальные машины Microsoft Azure) в Управляемый экземпляр SQL Azure с минимальным простоем.
zh_hans: 以最短故障时间将数据库从 SQL Server 实例(本地或 Azure 虚拟机)迁移到 Azure SQL 托管实例的分步教程。
zh_hant: 將資料庫從 SQL Server 執行個體 (內部部署或 Azure 虛擬機器) 移轉到 Azure SQL 受控執行個體的逐步教學課程，停機時間最短。

# sql.migration.dashboard.help.description.vm
source: A step-by-step tutorial to migrate databases from a SQL Server instance (on-premises) to SQL Server on Azure Virtual Machines with minimal downtime.
de: Ein Tutorial, das Sie mit einer Schritt-für-Schritt-Anleitung dabei unterstützt, Datenbanken aus einer (lokalen) SQL Server-Instanz mit minimaler Downtime zu SQL Server auf Azure Virtual Machines zu migrieren.
es: Tutorial paso a paso para migrar bases de datos de una instancia de SQL Server (local) a SQL Server en Azure Virtual Machines con un tiempo de inactividad mínimo.
fr: Un tutoriel étape par étape pour migrer les bases de données d'une instance de SQL Server (sur site) vers SQL Server on Azure Virtual Machines avec un minimum de temps d'arrêt.
ja: SQL Server インスタンス (オンプレミス) から Azure Virtual Machines 上の SQL Server に最小のダウンタイムでデータベースを移行するための手順を追ったチュートリアルです。
ko: 가동 중지 시간을 최소화하면서 SQL Server 인스턴스(온-프레미스)에서 Azure Virtual Machines의 SQL Server로 데이터베이스를 마이그레이션하는 단계별 자습서입니다.
pt_br: Um tutorial passo a passo para migrar bancos de dados de uma instância do SQL Server (local) para o SQL Server em Máquinas Virtuais do Azure com tempo de inatividade mínimo.
ru: Пошаговый учебник по миграции баз данных с экземпляра SQL Server (локальный) в SQL Server на виртуальных машинах Microsoft Azure с минимальным простоем.
zh_hans: 以最短故障时间将数据库从 SQL Server 实例(本地)迁移到 Azure 虚拟机上的 SQL Server 的分步教程。
zh_hant: 將資料庫從 SQL Server 執行個體 (內部部署) 移轉到 Azure 虛擬機器上 SQL Server 的逐步教學課程，停機時間最短。

# sql.migration.validate.error.gatewaytimeout
source: A time-out was encountered while validating a resource connection. Learn more: https://aka.ms/dms-migrations-troubleshooting.
de: Bei der Validierung einer Ressourcenverbindung ist eine Zeitüberschreitung aufgetreten. Weitere Informationen finden Sie unter: https://aka.ms/dms-migrations-troubleshooting.
es: Se agotó el tiempo de espera al validar una conexión de recursos. Más información: https://aka.ms/dms-migrations-troubleshooting.
fr: Un délai d'attente a été rencontré lors de la validation d'une connexion de ressource. En savoir plus : https://aka.ms/dms-migrations-troubleshooting.
ja: リソース接続の検証中にタイムアウトが発生しました。詳細情報: https://aka.ms/dms-migrations-troubleshooting。
ko: 리소스 연결을 확인하는 동안 시간 초과가 발생했습니다. 자세히 알아보기: https://aka.ms/dms-migrations-troubleshooting.
pt_br: Foi encontrado um tempo limite ao validar uma conexão de recurso. Saiba mais: https://aka.ms/dms-migrations-troubleshooting.
ru: Превышено время ожидания при проверке подключения к ресурсу. Подробнее: https://aka.ms/dms-migrations-troubleshooting.
zh_hans: 验证资源连接时遇到超时。了解详细信息: https://aka.ms/dms-migrations-troubleshooting。
zh_hant: 驗證資源連線時發生逾時。深入了解: https://aka.ms/dms-migrations-troubleshooting.

# sql.migration.assessment.results.summary.label.caps
source: ASSESSMENT RESULTS
de: BEWERTUNGSERGEBNISSE
es: RESULTADOS DE LA EVALUACIÓN
fr: RÉSULTATS DE L'ÉVALUATION
ja: 評価結果
ko: 평가 결과
pt_br: RESULTADOS DA AVALIAÇÃO
ru: РЕЗУЛЬТАТЫ ОЦЕНКИ
zh_hans: 评估结果
zh_hant: 評定結果

# sql.migration.active.backup.files
source: Active backup files
de: Aktive Sicherungsdateien
es: Archivos de copia de seguridad activos
fr: Fichiers de sauvegarde actifs
ja: アクティブなバックアップ ファイル
ko: 활성 백업 파일
pt_br: Arquivos de backup ativos
ru: Активные файлы резервных копий
zh_hans: 活动备份文件
zh_hant: 使用中的備份檔案

# sql.migration.active.backup.files.items
source: Active backup files (1 item)
de: Aktive Sicherungsdateien (1 Element)
es: Archivos de copia de seguridad activos (1 elemento)
fr: Fichiers de sauvegarde actifs (1 élément)
ja: アクティブなバックアップ ファイル (1 項目)
ko: 활성 백업 파일(1개 항목)
pt_br: Arquivos de backup ativos (1 item)
ru: Активные файлы резервного копирования (1 элемент)
zh_hans: 活动备份文件(1 项)
zh_hant: 使用中的備份檔案 (1 個項目)

# sql.migration.active.backup.files.multiple.items
source: Active backup files ({0} items)
de: Aktive Sicherungsdateien ({0} Elemente)
es: Archivos de copia de seguridad activa ({0} elementos)
fr: Fichiers de sauvegarde actifs (éléments{0} )
ja: アクティブなバックアップ ファイル ({0} 項目)
ko: 활성 백업 파일({0}개 항목)
pt_br: Arquivos de backup ativos ({0} items)
ru: Активные файлы резервных копий ({0} элементов)
zh_hans: 活动备份文件({0} 项)
zh_hant: 使用中的備份檔案 ({0} 個項目)

# sql.migration.wizard.account.noAccount.error
source: Add a linked account and then try again.
de: Fügen Sie ein verknüpftes Konto hinzu, und versuchen Sie es dann erneut.
es: Agregue una cuenta vinculada e inténtelo de nuevo.
fr: Ajoutez un compte lié, puis réessayez.
ja: リンクされたアカウントを追加して、もう一度お試しください。
ko: 연결된 계정을 추가한 후 다시 시도하세요.
pt_br: Adicione uma conta vinculada e tente novamente.
ru: Добавьте связанную учетную запись и повторите попытку.
zh_hans: 请添加链接帐户，然后重试。
zh_hant: 新增連結的帳戶，然後再試一次。

# sql.migration.status.add.account
source: Add account
de: Konto hinzufügen
es: Agregar cuenta
fr: Ajouter un compte
ja: アカウントを追加
ko: 계정 추가
pt_br: Adicionar conta
ru: Добавить учетную запись
zh_hans: 添加帐户
zh_hant: 新增帳戶

# sql.migration.status.add.account.MESSAGE
source: Add your Azure account to view existing migrations and their status.
de: Fügen Sie Ihr Azure-Konto hinzu, um vorhandene Migrationen und deren Status anzuzeigen.
es: Agregue su cuenta de Azure para ver las migraciones existentes y su estado.
fr: Ajoutez votre compte Azure pour afficher les migrations existantes et leur état.
ja: Azure アカウントを追加して、既存の移行とその状態を表示します。
ko: Azure 계정을 추가하여 기존 마이그레이션 및 해당 상태를 확인합니다.
pt_br: Adicione sua conta do Azure para exibir as migrações existentes e seu status.
ru: Добавьте вашу учетную запись Azure, чтобы увидеть существующие миграции и их состояние.
zh_hans: 添加 Azure 帐户以查看现有迁移及其状态。
zh_hant: 新增您的 Azure 帳戶以檢視現有的移轉及其狀態。
