Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.invalid.user.account
source: Invalid user account format. Example: {0}
de: Ungültiges Benutzerkontoformat. Beispiel: {0}
es: Formato de cuenta de usuario no válido. Ejemplo: {0}
fr: Format de compte d’utilisateur non valide. Exemple : {0}
ja: 無効なユーザー アカウントの形式です。例: {0}
ko: 사용자 계정 형식이 잘못되었습니다. 예: {0}
pt_br: O formato da conta de usuário é inválido. Exemplo: {0}
ru: Недопустимый формат учетной записи пользователя. Пример: {0}
zh_hans: 用户帐户格式无效。示例: {0}
zh_hant: 使用者帳戶格式無效。範例: {0}

# sql.migration.issues.details
source: Issue details
de: Problemdetails
es: Detalles del problema
fr: Détails du problème
ja: 問題の詳細
ko: 문제 세부 정보
pt_br: Detalhes do problema
ru: Подробные сведения о проблеме
zh_hans: 问题详情
zh_hant: 問題詳細資料

# sql.migration.issues
source: Issues
de: Probleme
es: Problemas
fr: Problèmes
ja: 問題
ko: 문제
pt_br: Problemas
ru: Проблемы
zh_hans: 问题
zh_hant: 問題

# sql.migration.issues.count
source: Issues ({0})
de: Probleme ({0})
es: Problemas ({0})
fr: Problèmes ({0})
ja: 問題 ({0} 件)
ko: 문제({0}개)
pt_br: Problemas ({0})
ru: Проблемы ({0})
zh_hans: 问题({0})
zh_hant: 問題 ({0})

# sql.migration.severity.issues.label
source: Issues by severity
de: Probleme nach Schweregrad
es: Problemas por gravedad
fr: Problèmes par gravité
ja: 重大度別の問題
ko: 심각도별 문제
pt_br: Problemas por gravidade
ru: Проблемы по степени серьезности
zh_hans: 按严重性划分的问题
zh_hant: 依嚴重性的問題

# sql.migration.key1.label
source: Key 1
de: Schlüssel 1
es: Clave 1
fr: Clé 1
ja: キー 1
ko: 키 1
pt_br: Chave 1
ru: Ключ 1
zh_hans: 密钥 1
zh_hant: 金鑰 1

# sql.migration.key1.copied
source: Key 1 copied
de: Schlüssel 1 kopiert
es: Clave 1 copiada
fr: Clé 1 copiée
ja: キー 1 がコピーされました
ko: 키 1 복사됨
pt_br: Chave 1 copiada
ru: Ключ 1 скопирован
zh_hans: 已复制密钥 1
zh_hant: 已複製金鑰 1

# sql.migration.key2.label
source: Key 2
de: Schlüssel 2
es: Clave 2
fr: Clé 2
ja: キー 2
ko: 키 2
pt_br: Chave 2
ru: Ключ 2
zh_hans: 密钥 2
zh_hant: 金鑰 2

# sql.migration.key2.copied
source: Key 2 copied
de: Schlüssel 2 kopiert
es: Clave 2 copiada
fr: Clé 2 copiée
ja: キー 2 がコピーされました
ko: 키 2 복사됨
pt_br: Chave 2 copiada
ru: Ключ 2 скопирован
zh_hans: 已复制密钥 2
zh_hant: 已複製金鑰 2

# sql.migration.sql.vm.page.blob.url.label
source: Known issues, limitations, and troubleshooting
de: Bekannte Probleme, Einschränkungen und Problembehandlung
es: Problemas conocidos, limitaciones y solución de problemas
fr: Problèmes connus, limitations et résolution des problèmes
ja: 既知の問題、制限事項、トラブルシューティング
ko: 알려진 문제, 제한 사항 및 문제 해결
pt_br: Problemas conhecidos, limitações e solução de problemas
ru: Известные проблемы, ограничения и устранение неполадок
zh_hans: 已知问题、限制和故障排除
zh_hant: 已知問題、限制和疑難排解

# sql.migration.last.LSN
source: Last LSN
de: Letzte LSN
es: Último LSN
fr: Dernier NSE
ja: 最後の LSN
ko: 마지막 LSN
pt_br: Último LSN
ru: Последний номер LSN
zh_hans: 最后一个 LSN
zh_hant: 最後一個 LSN

# sql.migration.last.applied.lsn
source: Last applied LSN
de: Zuletzt angewendete LSN
es: LSN aplicado por última vez
fr: Dernier LSN appliqué
ja: 最後に適用された LSN
ko: 마지막으로 적용된 LSN
pt_br: Último LSN aplicado
ru: Последний примененный номер LSN
zh_hans: 上次应用的 LSN
zh_hant: 上次套用的 LSN

# sql.migration.last.applied.backup.files
source: Last applied backup file(s)
de: Zuletzt angewendete Sicherungsdateien
es: Archivos de copia de seguridad aplicados por última vez
fr: Derniers fichier(s) de sauvegarde appliqués
ja: 最後に適用されたバックアップ ファイル
ko: 마지막으로 적용된 백업 파일
pt_br: Últimos arquivos de backup aplicados
ru: Последние примененные файлы резервной копии
zh_hans: 上次应用的一个或多个备份文件
zh_hant: 上次套用的備份檔案

# sql.migration.last.applied.files.taken.on
source: Last applied backup taken on
de: Zuletzt angewendete Sicherung erstellt am
es: Hora de la última copia de seguridad aplicada:
fr: Dernière sauvegarde appliquée effectuée le
ja: 以下で作成された、最後に適用されたバックアップ
ko: 백업을 마지막으로 적용한 날짜
pt_br: Último backup aplicado realizado em
ru: Последняя примененная резервная копия от
zh_hans: 上次应用备份文件的时间
zh_hant: 上次套用的備份建立於

# sql.migration.blob.container.last.backup.file.label
source: Last backup file
de: Letzte Sicherungsdatei
es: Último archivo de copia de seguridad
fr: Dernier fichier de sauvegarde
ja: 最終バックアップ ファイル
ko: 마지막 백업 파일
pt_br: Último arquivo de backup
ru: Последний файл резервной копии
zh_hans: 上一个备份文件
zh_hant: 最後備份的檔案

# sql.migration.cutover.last.file.restored
source: Last file restored: {0}
de: Letzte wiederhergestellte Datei: {0}
es: Último archivo restaurado: {0}
fr: Dernier fichier restauré : {0}
ja: 復元された最後のファイル: {0}
ko: 마지막으로 복원된 파일: {0}
pt_br: Último arquivo restaurado: {0}
ru: Последний восстановленный файл: {0}
zh_hans: 最近还原的文件: {0}
zh_hant: 上次還原的檔案: {0}

# sql.migration.sku.recommendations.lastRefreshed
source: Last refreshed: {0}
de: Letzte Aktualisierung: {0}
es: Última actualización: {0}
fr: Dernière actualisation : {0}
ja: 最終更新: {0}
ko: 마지막 새로 고침: {0}
pt_br: Última atualização: {0}
ru: Последнее обновление: {0}
zh_hans: 上次刷新时间: {0}
zh_hant: 上次重新整理時間: {0}

# sql.migration.field.label.last.restored.file.time
source: Last restored file time
de: Zeitpunkt der letzten Wiederherstellung der Datei
es: Hora de la última restauración del archivo
fr: Heure du dernier fichier restauré
ja: 最後に復元されたファイル時間
ko: 마지막으로 복원된 파일 시간
pt_br: Hora do último arquivo restaurado
ru: Время последнего восстановления файла
zh_hans: 上次还原的文件时间
zh_hant: 上次還原的檔案時間

# sql.migration.last.scan.completed
source: Last scan completed: {0}
de: Letzte abgeschlossene Überprüfung: {0}
es: Último examen completado: {0}
fr: Dernière analyse terminée : {0}
ja: 完了した最後のスキャン: {0}
ko: 마지막 검사 완료: {0}
pt_br: Última verificação concluída: {0}
ru: Последнее сканирование: {0}
zh_hans: 最近完成的扫描: {0}
zh_hant: 上次完成的掃描: {0}

# sql.migration.field.label.last.uploaded.file
source: Last uploaded file
de: Zuletzt hochgeladene Datei
es: Último archivo cargado
fr: Dernier fichier chargé
ja: 最後にアップロードしたファイル
ko: 마지막으로 업로드한 파일
pt_br: Último arquivo enviado
ru: Последний отправленный файл
zh_hans: 上次上传的文件
zh_hant: 上次上傳的檔案

# sql.migration.field.label.last.uloaded.file.time
source: Last uploaded file time
de: Zeitpunkt des letzten Dateiuploads
es: Hora de la última carga del archivo
fr: Heure du dernier chargement du fichier
ja: 最後にアップロードしたファイル時間
ko: 마지막으로 업로드한 파일 시간
pt_br: Hora do último arquivo carregado
ru: Время последней отправки файла
zh_hans: 上次上传的文件时间
zh_hant: 上次上傳檔案時間

# sql.migration.learn.more
source: Learn more
de: Weitere Informationen
es: Más información
fr: En savoir plus
ja: 詳細情報
ko: 자세히 알아보기
pt_br: Saiba mais
ru: Подробнее
zh_hans: 了解详细信息
zh_hant: 深入了解

# sql.migration.database.assessment.xevents.link
source: Learn more
de: Weitere Informationen
es: Más información
fr: En savoir plus
ja: 詳細情報
ko: 자세히 알아보기
pt_br: Saiba mais
ru: Дополнительные сведения
zh_hans: 了解详细信息
zh_hant: 深入了解

# sql.migration.learn.more.prerequisites
source: Learn more about things you need before starting a migration.
de: Erfahren Sie mehr über die erforderlichen Schritte, bevor Sie eine Migration starten.
es: Obtenga más información acerca de las cosas que necesita antes de iniciar una migración.
fr: En savoir plus sur les éléments dont vous avez besoin avant de commencer une migration.
ja: 移行を開始する前に、必要な事項の詳細を説明します。
ko: 마이그레이션을 시작하기 전에 필요한 사항에 대해 자세히 알아보세요.
pt_br: Saiba mais sobre o que você precisa antes de iniciar uma migração.
ru: Дополнительные сведения о необходимых вещах перед началом миграции.
zh_hans: 在开始迁移之前，请了解有关所需内容的详细信息。
zh_hant: 在開始移轉之前，深入了解您需要的事項。

# sql.migration.wizard.account.add.button.label
source: Link account
de: Konto verknüpfen
es: Vincular cuenta
fr: Lier un compte
ja: アカウントのリンク
ko: 계정 연결
pt_br: Vincular conta
ru: Свяжите учетную запись
zh_hans: 链接帐户
zh_hant: 連結帳戶

# sql.migration.load.assessment.report
source: Load assessment report
de: Bewertungsbericht laden
es: Informe de evaluación de carga
fr: Charger le rapport d’évaluation
ja: 評価レポートを読み込む
ko: 평가 보고서 로드
pt_br: Relatório de avaliação de carga
ru: Загрузить отчет об оценке
zh_hans: 加载评估报告
zh_hant: 載入評定報表

# sql.migration.service.container.loading.help
source: Loading Migration Services
de: Migrationsdienste werden geladen
es: Cargando servicios de migración
fr: Chargement des services de migration
ja: 移行サービスの読み込み中
ko: 마이그레이션 서비스 로드 중
pt_br: Carregando Serviços de Migração
ru: Загрузка служб миграции
zh_hans: 正在加载迁移服务
zh_hant: 正在載入移轉服務

# sql.migration.database.loading
source: Loading database table list..
de: Datenbanktabellenliste wird geladen...
es: Cargando la lista de tablas de base de datos...
fr: Chargement de la liste des tables de la base de données..
ja: データベース テーブルの一覧を読み込んでいます...
ko: 데이터베이스 테이블 목록을 로드하는 중입니다.
pt_br: Carregando lista de tabelas do banco de dados
ru: Загрузка списка таблиц базы данных...
zh_hans: 正在加载数据库表列表。.
zh_hant: 正在載入資料庫資料表清單..

# sql.migration.database.loading.tables
source: Loading tables list...
de: Tabellenliste wird geladen...
es: Cargando lista de tablas...
fr: Chargement de la liste des tableaux...
ja: テーブルの一覧を読み込んでいます...
ko: 테이블 목록을 로드하는 중...
pt_br: Carregando a lista de tabelas...
ru: Загрузка списка таблиц…
zh_hans: 正在加载表列表...
zh_hant: 正在載入資料表清單...

# sql.migration.sku.recommendations.loading
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
ja: 読み込んでいます...
ko: 로드 중...
pt_br: Carregando...
ru: Загрузка…
zh_hans: 正在加载...
zh_hant: 正在載入...

# sql.migration.sku.targetStorageConfiguration.local.SSD
source: Local SSD
de: Lokales SSD
es: SSD local
fr: SSD local
ja: ローカル SSD
ko: 로컬 SSD
pt_br: SSD local
ru: Локальная память SSD
zh_hans: 本地 SSD
zh_hant: 本機 SSD

# sql.migration.location
source: Location
de: Speicherort
es: Ubicación
fr: Emplacement
ja: 場所
ko: 위치
pt_br: Localização
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# sql.migration.cutover.pending.backup
source: Log backups pending restore: {0}
de: Sicherungen mit ausstehender Wiederherstellung protokollieren: {0}
es: Copias de seguridad de registros pendientes de restauración: {0}
fr: Sauvegardes du journal en attente de restauration : {0}
ja: 復元保留中のログ バックアップ: {0}
ko: 복원 보류 중인 로그 백업: {0}
pt_br: Backups de log com restauração pendente: {0}
ru: Резервные копии журналов, ожидающие восстановления: {0}
zh_hans: 日志备份挂起还原: {0}
zh_hant: 記錄備份擱置還原: {0}

# sql.migration.sku.log.storage.requirement
source: Log storage requirement
de: Protokollspeicheranforderung
es: Requisito de almacenamiento de registros
fr: Exigence de stockage des journaux
ja: ログ ストレージの要件
ko: 로그 스토리지 요구 사항
pt_br: Requisitos de armazenamento de log
ru: Требование к хранилищу журналов
zh_hans: 日志存储要求
zh_hant: 記錄儲存體需求

# sql.login.migration.logins.found
source: Login found
de: Anmeldung gefunden
es: Inicio de sesión encontrado
fr: Connexion trouvée
ja: ログインが見つかりました
ko: 로그인 찾음
pt_br: Logon encontrado
ru: Учетные данные найдены
zh_hans: 找到了登录
zh_hant: 找到登入

# sql.login.migration.steps.migrate.logins
source: Login migration completed
de: Benutzernamenmigration abgeschlossen
es: Migración de inicio de sesión completada
fr: Migration de connexion effectuée
ja: ログインの移行が完了しました
ko: 로그인 마이그레이션 완료
pt_br: Migração de login concluída
ru: Перенос имен для входа завершен
zh_hans: 登录名迁移已完成
zh_hant: 登入移轉完成

# sql.login.migration.error
source: Login migration error: {0}
de: Anmeldemigrationsfehler: {0}
es: Error de migración de inicio de sesión: {0}
fr: Erreur de migration de connexion : {0}
ja: ログイン移行エラー: {0}
ko: 로그인 마이그레이션 오류: {0}
pt_br: Ocorreu um erro de migração de logon: {0}
ru: Ошибка миграции учетных данных: {0}
zh_hans: 登录迁移错误: {0}
zh_hant: 登入移轉錯誤: {0}

# sql.login.migration.status.page.previous.button.error
source: Login migration has already been initiated and going back to prior page is disabled.
de: Die Anmeldemigration wurde bereits initiiert, und das Zurückkehren zur vorherigen Seite ist deaktiviert.
es: La migración de inicio de sesión ya se ha iniciado y la opción de volver a la página anterior está deshabilitada.
fr: La migration de connexion a déjà été initiée et le retour à la page précédente est désactivé.
ja: ログイン移行は既に開始されており、前のページに戻る操作は無効になっています。
ko: 로그인 마이그레이션이 이미 시작되었으며 이전 페이지로 돌아갈 수 없습니다.
pt_br: A migração de logon já foi iniciada e voltar à página anterior está desabilitada.
ru: Миграция учетных данных уже запущена, а возврат к предыдущей странице отключен.
zh_hans: 登录迁移已启动，已禁用返回到前一页。
zh_hant: 登入移轉已起始，且已停用回到先前頁面的功能。

# sql.login.migration.in.progress
source: Login migration in progress
de: Die Migration von Anmeldungen ist in Bearbeitung
es: Migración de inicio de sesión en curso
fr: Migration de connexions en cours
ja: テスト移行が進行中
ko: 로그인 마이그레이션 진행 중
pt_br: A migração de logon está em andamento
ru: Выполняется миграция учетных данных
zh_hans: 登录迁移正在进行中
zh_hant: 正在進行登入移轉

# sql.migration.database.migration.status.label
source: Login migration status: {0}
de: Status der Benutzernamenmigration: {0}
es: Estado de migración de inicio de sesión: {0}
fr: État de la migration de connexion : {0}
ja: ログイン移行の状態: {0}
ko: 로그인 마이그레이션 상태: {0}
pt_br: Status da migração do login: {0}
ru: Состояние миграции имен для входа: {0}
zh_hans: 登录迁移状态: {0}
zh_hant: 登入移轉狀態: {0}

# sql.login.migration.logins.not.found
source: Login not found
de: Anmeldung nicht gefunden
es: Inicio de sesión no encontrado
fr: Connexion introuvable
ja: ログインが見つかりません
ko: 로그인을 찾을 수 없음
pt_br: Logon não encontrado
ru: Учетные данные не найдены
zh_hans: 找不到登录
zh_hant: 找不到登入

# sql.login.migration.type
source: Login type
de: Anmeldetyp
es: Tipo de inicio de sesión
fr: Type de connexion
ja: ログインの種類
ko: 로그인 유형
pt_br: Tipo de logon
ru: Тип учетных данных
zh_hans: 登录类型
zh_hant: 登入類型

# sql.migration.sku.logs.iops.requirement
source: Logs IOPS requirement
de: IOPS-Anforderung für Protokolle
es: Requisito de IOPS de registros
fr: Exigence IOPS des journaux
ja: ログ IOPS 要件
ko: 로그 IOPS 요구 사항
pt_br: Requisito de IOPS de registros
ru: Требуемое количество операций ввода-вывода в секунду для журналов
zh_hans: 日志 IOPS 要求
zh_hant: 記錄 IOPS 需求

# sql.migration.field.label.mi.restore.state
source: Managed instance restore state
de: Wiederherstellungsstatus der verwalteten Instanz
es: Estado de restauración de la instancia administrada
fr: État de restauration de Managed Instance
ja: マネージド インスタンスの復元状態
ko: 관리되는 인스턴스 복원 상태
pt_br: Estado de restauração da instância gerenciada
ru: Состояние восстановления управляемого экземпляра
zh_hans: 托管实例还原状态
zh_hant: 受控執行個體還原狀態

# sql.ir.manual.ir.collapsed
source: Manual IR configuration collapsed
zh_hans: 手动 IR 配置已折叠

# sql.ir.manual.ir.expanded
source: Manual IR configuration expanded
zh_hans: 手动 IR 配置已展开

# sql.migration.map.target.heading
source: Map selected source databases to target databases for migration
de: Zuordnen ausgewählter Quelldatenbanken zu Zieldatenbanken für die Migration
es: Asigne las bases de datos de origen seleccionadas a las bases de datos de destino para la migración
fr: Mapper les bases de données source sélectionnées aux bases de données cible pour la migration
ja: 選択したソース データベースを移行先データベースにマップする
ko: 선택한 원본 데이터베이스를 마이그레이션할 대상 데이터베이스에 매핑
pt_br: Mapeie os bancos de dados de origem selecionados para os bancos de dados de destino
ru: Сопоставление выбранных баз данных-источников с целевыми базами данных для миграции
zh_hans: 将所选源数据库映射到目标数据库以进行迁移
zh_hant: 將選取的來源資料庫對應到目標資料庫以進行移轉

# sql.migration.sku.azureConfiguration.premiumSeriesMemoryOptimized
source: Memory optimized premium-series
de: Speicheroptimierte Premium-Serie
es: Serie premium optimizada para memoria
fr: Série premium à mémoire optimisée
ja: メモリ最適化 Premium シリーズ
ko: 메모리 최적화 프리미엄-데이터 계열
pt_br: Série premium otimizada para memória
ru: Серия Premium, оптимизированная для операций в памяти
zh_hans: 内存优化高级系列
zh_hant: 記憶體最佳化進階系列

# sql.migration.sku.memory.requirement
source: Memory requirement
de: Arbeitsspeicheranforderungen
es: Requisito de memoria
fr: Mémoire requise
ja: メモリ要件
ko: 메모리 요구 사항
pt_br: Requisito de Memória
ru: Требования к памяти
zh_hans: 内存要求
zh_hant: 記憶體需求

# sql.login.migration.aad.domain.name.input.box.label
source: Microsoft Entra ID Domain Name (only required to migrate Windows Authenication Logins)
de: Microsoft Entra ID-Domänennamen (nur zum Migrieren von Windows-Authentifizierungsanmeldungen erforderlich)
es: Nombre de dominio Microsoft Entra ID (solo necesario para migrar los inicios de sesión de autenticación de Windows)
fr: Nom de domaine Microsoft Entra ID (requis uniquement pour migrer les connexions d'authentification Windows)
ja: Microsoft Entra ID ドメイン名 (Windows 認証ログインを移行する場合にのみ必要)
ko: Microsoft Entra ID 도메인 이름(Windows 인증 로그인을 마이그레이션하는 데만 필요)
pt_br: Nome de Domínio do Microsoft Entra ID (necessário apenas para migrar logons de autenticação do Windows)
ru: Доменное имя Microsoft Entra ID (требуется только для того, чтобы перенести имена входа для проверки подлинности Windows)
zh_hans: Microsoft Entra ID 域名(仅需要迁移 Windows 身份验证登录名)
zh_hant: Microsoft Entra ID 網域名稱 (只需要移轉 Windows Authenication 登入)

# sql.login.migration.enter.AAD.domain.name.to.continue
source: Microsoft Entra ID Domain name is required to migrate Windows login. Please enter an AAD Domain Name or deselect windows login(s).
de: Microsoft Entra ID-Domänenname ist erforderlich, um die Windows-Anmeldung zu migrieren. Geben Sie einen AAD-Domänennamen ein, oder heben Sie die Auswahl von Windows-Anmeldungen auf.
es: El nombre del dominio de Microsoft Entra ID es necesario para migrar el inicio de sesión de Windows. Escriba un nombre de dominio de AAD o anule la selección de los inicios de sesión de Windows.
fr: Le nom de domaine Microsoft Entra ID est requis pour migrer la connexion Windows. Veuillez saisir un nom de domaine AAD ou désélectionner les connexions Windows.
ja: Windows ログインを移行するには、Microsoft Entra ID ドメイン名が必要です。AAD ドメイン名を入力するか、Windows ログインの選択を解除してください。
ko: Windows 로그인을 마이그레이션하려면 Microsoft Entra ID 도메인 이름이 필요합니다. AAD 도메인 이름을 입력하거나 Windows 로그인 선택을 취소하세요.
pt_br: O nome de domínio do Microsoft Entra ID é necessário para migrar o logon do Windows. Insira um Nome de Domínio do AAD ou anule a seleção dos logons do Windows.
ru: Для переноса имени входа Windows требуется доменное имя Microsoft Entra ID. Введите доменное имя AAD или отмените выбор имен входа Windows.
zh_hans: Microsoft Entra ID 域名是迁移 Windows 登录名所必需的。请输入 AAD 域名或取消选择 windows 登录名。
zh_hant: 需要 Microsoft Entra ID 網域名稱才能移轉 Windows 登入。請輸入 AAD 網域名稱或取消選取 Windows 登入。

# sql.migration.azure.tenant
source: Microsoft Entra tenant
de: Microsoft Entra-Mandant
es: Inquilino de Microsoft Entra
fr: Locataire Microsoft Entra
ja: Microsoft Entra テナント
ko: Microsoft Entra 테넌트
pt_br: Locatário do Microsoft Entra
ru: Клиент Microsoft Entra
zh_hans: Microsoft Entra 租户
zh_hant: Microsoft Entra 租用戶

# sql.migration.start.login.migration.button
source: Migrate
de: Migrieren
es: Migrar
fr: Migrer
ja: 移行
ko: 마이그레이션
pt_br: Migrar
ru: Мигрировать
zh_hans: 迁移
zh_hant: 移轉

# sql-migration.wizard.title
source: Migrate '{0}' to Azure SQL
de: "{0}" zu Azure SQL migrieren
es: Migrar "{0}" a Azure SQL
fr: Migrer « {0} » vers Azure SQL
ja: '{0}' を Azure SQL に移行する
ko: Azure SQL로 '{0}' 마이그레이션
pt_br: Migrar '{0}' para SQL do Azure
ru: Миграция "{0}" в Azure SQL
zh_hans: 将“{0}”迁移到 Azure SQL
zh_hant: 將 '{0}' 移轉到 Azure SQL

# sql.migration.dashboard.login.migrate.task.button.description
source: Migrate SQL Server logins to Azure SQL.
de: Migrieren von SQL Server-Anmeldungen zu Azure SQL.
es: Migre los inicios de sesión de SQL Server a Azure SQL.
fr: Migrez des comptes de connexions SQL Server vers Azure SQL.
ja: SQL Server ログインを Azure SQL に移行します。
ko: SQL Server 로그인을 Azure SQL로 마이그레이션합니다.
pt_br: Migrar os logons do SQL Server para o SQL do Azure.
ru: Миграция учетных данных SQL Server в Azure SQL.
zh_hans: 将 SQL Server 登录迁移到 Azure SQL。
zh_hant: 將 SQL Server 登入移轉至 Azure SQL。

# sql.migration.dashboard.migrate.task.button.description
source: Migrate a SQL Server instance to Azure SQL.
de: Migrieren Sie eine SQL Server-Instanz zu Azure SQL.
es: Migre una instancia de SQL Server a Azure SQL.
fr: Migrez une instance de SQL Server vers Azure SQL.
ja: SQL Server インスタンスを Azure SQL に移行します。
ko: SQL Server 인스턴스를 Azure SQL로 마이그레이션합니다.
pt_br: Migrar a Instância do SQL Server para o SQL do Azure.
ru: Перенос экземпляра SQL Server в Azure SQL.
zh_hans: 将 SQL Server 实例迁移到 Azure SQL。
zh_hant: 將 SQL Server 執行個體移轉到 Azure SQL。

# sql.migration.tde.button.migrate
source: Migrate certificates
de: Zertifikate migrieren
es: Migrar certificados
fr: Migrer des certificats
ja: 証明書を移行する
ko: 인증서 마이그레이션
pt_br: Migrar certificados
ru: Перенести сертификаты
zh_hans: 迁移证书
zh_hant: 移轉憑證

# sql.migration.dashboard.help.link.migrateUsingADS
source: Migrate databases using Azure Data Studio
de: Datenbanken mithilfe von Azure Data Studio migrieren
es: Migrar bases de datos con Azure Data Studio
fr: Migrer les bases de données à l’aide de Azure Data Studio
ja: Azure Data Studio を使用してデータベースを移行する
ko: Azure Data Studio를 사용하여 데이터베이스 마이그레이션
pt_br: Migrar bancos de dados usando Azure Data Studio
ru: Миграция баз данных с помощью Azure Data Studio
zh_hans: 使用 Azure Data Studio 迁移数据库
zh_hant: 使用 Azure Data Studio 來移轉資料庫

# sql-migration.login.wizard.title
source: Migrate logins from '{0}' to Azure SQL
de: Migrieren von Anmeldungen von „{0}“ zu Azure SQL
es: Migrar inicios de sesión de "{0}" a Azure SQL
fr: Migrer les connexions de « {0} » vers Azure SQL
ja: '{0}' から Azure SQL にログインを移行する
ko: 로그인을 '{0}'에서 Azure SQL로 마이그레이션
pt_br: Migrar os logons de '{0}' para SQL do Azure
ru: Миграция учетных данных из "{0}" в Azure SQL
zh_hans: 将登录从 "{0}" 迁移到 Azure SQL
zh_hant: 將登入從 '{0}' 移轉至 Azure SQL

# sql.migration.tab.button.login.migration.description
source: Migrate logins to Azure SQL
de: Migrieren von Anmeldungen zu Azure SQL
es: Migrar inicios de sesión a Azure SQL
fr: Migrer les connexions vers Azure SQL
ja: Azure SQL にログインを移行する
ko: 로그인을 Azure SQL로 마이그레이션
pt_br: Migrar os logons para o SQL do Azure
ru: Миграция учетных данных в Azure SQL
zh_hans: 将登录迁移到 Azure SQL
zh_hant: 將登入移轉至 Azure SQL

# sql.migration.dashboard.login.migrate.task.button
source: Migrate logins to Azure SQL
de: Migrieren von Anmeldungen zu Azure SQL
es: Migrar inicios de sesión a Azure SQL
fr: Migrer les connexions vers Azure SQL
ja: Azure SQL にログインを移行する
ko: 로그인을 Azure SQL로 마이그레이션
pt_br: Migrar os logons para o SQL do Azure
ru: Миграция учетных данных в Azure SQL
zh_hans: 将登录迁移到 Azure SQL
zh_hant: 將登入移轉至 Azure SQL

# sql.migration.schema.migration.checkbox.info
source: Migrate schema to target
de: Schema zum Ziel migrieren
es: Migrar esquema a destino
fr: Migrer le schéma vers la cible
ja: スキーマをターゲットに移行する
ko: 대상으로 스키마 마이그레이션
pt_br: Migrar esquema para destino
ru: Перенести схему в целевой объект
zh_hans: 将架构迁移到目标
zh_hant: 移轉結構描述至目標

# sql.migration.tab.button.migration.description
source: Migrate to Azure SQL
de: Zu Azure SQL migrieren
es: Migrar a Azure SQL
fr: Migrer vers Azure SQL
ja: Azure SQLへの移行
ko: Azure SQL로 마이그레이션
pt_br: Migrar para SQL do Azure
ru: Миграция в Azure SQL
zh_hans: 迁移到 Azure SQL
zh_hant: 移轉到 Azure SQL

# sql.migration.dashboard.migrate.task.button
source: Migrate to Azure SQL
de: Zu Azure SQL migrieren
es: Migrar a Azure SQL
fr: Migrer vers Azure SQL
ja: Azure SQLへの移行
ko: Azure SQL로 마이그레이션
pt_br: Migrar para SQL do Azure
ru: Миграция в Azure SQL
zh_hans: 迁移到 Azure SQL
zh_hant: 移轉到 Azure SQL

# sql.login.migration.failed
source: Migrating logins failed
de: Fehler beim Migrieren von Anmeldungen
es: Error al migrar los inicios de sesión
fr: Échec de la migration des connexions
ja: ログインの移行に失敗しました
ko: 로그인 마이그레이션 실패
pt_br: Ocorreu um erro ao migrar os logons
ru: Не удалось перенести учетные данные
zh_hans: 迁移登录失败
zh_hant: 移轉登入失敗
