Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.login.migration.migrate.server.roles.and.set.permissions.failed
source: Migrating server roles, establishing server mappings and setting permissions failed.
de: Das Migrieren von Serverrollen, das Einrichten von Serverzuordnungen und das Festlegen von Berechtigungen ist fehlgeschlagen..
es: Error al migrar los roles de servidor, el establecimiento de asignaciones de servidor y el establecimiento de permisos.
fr: Échec de la migration des rôles serveur, de l’établissement des mappages de serveurs et de la définition des autorisations.
ja: サーバーの役割の移行、サーバー マッピングの確立、アクセス許可の設定に失敗しました。
ko: 서버 역할 마이그레이션, 서버 매핑 설정 및 권한 설정을 하지 못했습니다.
pt_br: Ocorreu um erro ao migrar as funções de servidor, estabelecer os mapeamentos de servidores e definir permissões.
ru: Не удалось перенести роли сервера, установить сопоставления серверов и настроить разрешения.
zh_hans: 迁移服务器角色、建立服务器映射和设置权限失败。
zh_hant: 移轉伺服器角色、建立伺服器對應及設定權限失敗。

# sql.migration.tde.migrate.heading
source: Migrating the certificates from the following databases:
de: Migrieren der Zertifikate aus den folgenden Datenbanken:
es: Migrando los certificados de las siguientes bases de datos:
fr: Migration des certificats à partir des bases de données suivantes :
ja: 次のデータベースから証明書を移行しています:
ko: 다음 데이터베이스에서 인증서를 마이그레이션하는 중:
pt_br: Migrando os certificados dos seguintes bancos de dados:
ru: Выполняется миграция сертификатов из следующих баз данных:
zh_hans: 从以下数据库迁移证书:
zh_hant: 正在從下列資料庫移轉憑證:

# sql.login.migration.status.page.description
source: Migrating {0} logins to target {1} '{2}'
de: {0} Anmeldungen werden zum Ziel {1} „{2}“ migriert
es: Migrar inicios de sesión de {0} al destino {1} "{2}"
fr: Migration des connexions {0} vers la cible {1} « {2} »
ja: {0} 件のログインをターゲット {1} '{2}' に移行しています
ko: {0} 로그인을 대상 {1} '{2}'(으)로 마이그레이션하는 중
pt_br: Migrando {0} logons para o destino {1} '{2}'
ru: Миграция учетных данных ({0}) в целевой объект {1} "{2}"
zh_hans: 正在将 {0} 个登录迁移到目标 {1} "{2}"
zh_hant: 正在將 {0} 登入移轉至目標 {1} '{2}'

# sql.login.migration.migration.status.column
source: Migration Status
de: Migrationsstatus
es: Estado de migración
fr: État de la migration
ja: 移行の状態
ko: 마이그레이션 상태
pt_br: Status de Migração
ru: Состояние миграции
zh_hans: 迁移状态
zh_hant: 移轉狀態

# sql.login.migration.status.page.title
source: Migration Status
de: Migrationsstatus
es: Estado de migración
fr: État de la migration
ja: 移行の状態
ko: 마이그레이션 상태
pt_br: Status de Migração
ru: Состояние миграции
zh_hans: 迁移状态
zh_hant: 移轉狀態

# sql.migration.tde.migrate.validation.camceled
source: Migration canceled
de: Migration abgebrochen
es: Migración cancelada
fr: Migration annulée
ja: 移行が取り消されました
ko: 마이그레이션을 취소했습니다.
pt_br: Migração cancelada
ru: Миграция отменена.
zh_hans: 迁移已取消
zh_hant: 移轉已取消。

# sql.migration.cannot.retry
source: Migration cannot be restarted.
de: Die Migration kann nicht erneut gestartet werden.
es: No se puede reiniciar la migración.
fr: Impossible de redémarrer la migration.
ja: 移行を再開できません。
ko: 마이그레이션을 다시 시작하지 못했습니다.
pt_br: A migração não pôde ser reiniciada.
ru: Невозможно перезапустить миграцию.
zh_hans: 无法启动迁移。
zh_hant: 無法重新開啟移轉。

# sql.migration.tde.migrate.validation.completed
source: Migration completed successfully.
de: Die Migration wurde erfolgreich abgeschlossen.
es: Migración completada correctamente
fr: Migration effectuée correctement
ja: 移行が正常に完了しました。
ko: 마이그레이션을 완료했습니다.
pt_br: Migração concluída com êxito.
ru: Миграция выполнена.
zh_hans: 已成功完成迁移。
zh_hant: 已成功完成移轉。

# sql.migration.tde.migrate.completed.errors
source: Migration completed with the following error(s):{0}{1}
de: Die Migration wurde mit den folgenden Fehlern abgeschlossen:{0}{1}
es: La migración se completó con los siguientes errores:{0}{1}
fr: La migration s’est achevée avec la ou les erreurs suivantes : {0}{1}
ja: 移行は完了しましたが、次のエラーが発生しました:{0}{1}
ko: 다음 오류와 함께 마이그레이션이 완료됨:{0}{1}
pt_br: Migração concluída com os seguintes erros:{0}{1}
ru: Миграция завершена со следующими ошибками:{0}{1}
zh_hans: 迁移已完成，出现以下错误:{0}{1}
zh_hant: 移轉完成，發生以下錯誤:{0}{1}

# sql.migration.cutover
source: Migration cutover
de: Cutover der Migration
es: Transición de migración
fr: Basculement de la migration
ja: 一括移行
ko: 마이그레이션 컷오버
pt_br: Substituição de migração
ru: Прямая миграция
zh_hans: 迁移直接转换
zh_hant: 完全移轉

# sql.migration.error.details.title
source: Migration error details
de: Migrationsfehler-Details
es: Detalles del error de migración
fr: Détails de l'erreur de migration
ja: 移行エラーの詳細
ko: 마이그레이션 오류 세부 정보
pt_br: Detalhes do erro de migração
ru: Сведения об ошибке миграции
zh_hans: 迁移错误详细信息
zh_hant: 移轉錯誤詳細資料

# sql.migration.error.details.label
source: Migration error(s))
de: Migrationsfehler
es: Errores de migración
fr: Erreur(s) de migration
ja: 移行エラー
ko: 마이그레이션 오류
pt_br: Erros de migração
ru: Ошибки миграции
zh_hans: 迁移错误
zh_hant: 移轉錯誤

# sql.migration.cannot.delete
source: Migration is currently in progress and cannot be deleted.
de: Die Migration wird derzeit ausgeführt und kann nicht gelöscht werden.
es: La migración se encuentra en curso y no puede eliminarse.
fr: La migration est actuellement en cours et ne peut pas être supprimée.
ja: 移行は現在進行中です。削除できません。
ko: 마이그레이션이 현재 진행 중이므로 삭제할 수 없습니다.
pt_br: A migração está em andamento e não pode ser excluída.
ru: В настоящее время выполняется миграция, ее невозможно удалить.
zh_hans: 迁移当前正在进行，无法删除。
zh_hant: 移轉目前正在進行中，無法刪除。

# sql.migration.cannot.cancel
source: Migration is not in progress and cannot be canceled.
de: Die Migration ist nicht in Bearbeitung und kann nicht abgebrochen werden.
es: La migración no está en curso y no se puede cancelar.
fr: La migration n’est pas en cours et ne peut pas être annulée.
ja: 移行は進行中ではないため、取り消すことができません。
ko: 마이그레이션이 진행 중이 아니므로 취소할 수 없습니다.
pt_br: A migração não está em andamento não pode ser cancelada.
ru: Миграция не выполняется и не может быть отменена.
zh_hans: 迁移未进行，并且无法取消。
zh_hant: 移轉不在進行中，因此無法取消。

# sql.migration.cannot.cutover
source: Migration is not in progress and cannot be cutover.
de: Die Migration ist nicht in Bearbeitung, Cutover nicht möglich.
es: La migración no está en curso y no se puede realizar la transición.
fr: La migration n’est pas en cours et ne peut pas être à basculement.
ja: 移行は進行中ではないため、一括移行にすることができません。
ko: 마이그레이션이 진행 중이 아니므로 컷오버할 수 없습니다.
pt_br: A migração não está em andamento e não pode ser substituída.
ru: Миграция не выполняется и не может быть отменена.
zh_hans: 迁移未进行，无法直接转换。
zh_hant: 移轉不在進行中，且無法完全移轉。

# sql.migration.cutover.type
source: Migration mode
de: Migrationsmodus
es: Modo de migración
fr: Mode de migration
ja: 移行モード
ko: 마이그레이션 모드
pt_br: Modo de migração
ru: Режим миграции
zh_hans: 迁移模式
zh_hant: 移轉模式

# sql.migration.database.migration.mode.label
source: Migration mode
de: Migrationsmodus
es: Modo de migración
fr: Mode de migration
ja: 移行モード
ko: 마이그레이션 모드
pt_br: Modo de migração
ru: Режим миграции
zh_hans: 迁移模式
zh_hant: 移轉模式

# sql.migration.migration.readiness.label
source: Migration readiness
de: Migrationsbereitschaft
es: Preparación de la migración
fr: Préparation à la migration
ja: 移行の準備
ko: 마이그레이션 준비 상태
pt_br: Preparação para migração
ru: Готовность к миграции
zh_hans: 迁移准备情况
zh_hant: 移轉整備程度

# sql.migration.readiness.section.title
source: Migration readiness of assessed databases in the server instance
de: Migrationsbereitschaft bewerteter Datenbanken in der Serverinstanz
es: Preparación de la migración de las bases de datos evaluadas en la instancia del servidor
fr: Préparation à la migration des bases de données évaluées dans l'instance de serveur
ja: サーバー インスタンスで評価されたデータベースの移行準備
ko: 서버 인스턴스에서 평가된 데이터베이스의 마이그레이션 준비
pt_br: Preparação para migração de bancos de dados avaliados na instância do servidor
ru: Готовность оцененных баз данных к миграции в экземпляре сервера
zh_hans: 服务器实例中已评估数据库的迁移就绪情况
zh_hant: 伺服器執行個體中已評定資料庫的移轉整備程度

# serviceCrashMessage
source: Migration service component could not start. {0}
de: Die Migrationsdienstkomponente konnte nicht gestartet werden. {0}
es: No se pudo iniciar el componente del servicio de migración. {0}
fr: Le composant du service de migration n’a pas pu démarrer. {0}
ja: 移行サービス コンポーネントを開始できませんでした。{0}
ko: 마이그레이션 서비스 구성 요소를 시작할 수 없습니다. {0}
pt_br: O componente do serviço de migração não pôde ser iniciado. {0}
ru: Не удалось запустить компонент службы миграции. {0}
zh_hans: 迁移服务组件无法启动。{0}
zh_hant: 移轉服務元件無法啟動。{0}

# sql.migration.database.status.column
source: Migration status
de: Migrationsstatus
es: Estado de migración
fr: État de la migration
ja: 移行の状態
ko: 마이그레이션 상태
pt_br: Status de migração
ru: Состояние миграции
zh_hans: 迁移状态
zh_hant: 移轉狀態

# sql.migration.migration.status
source: Migration status
de: Migrationsstatus
es: Estado de migración
fr: État de la migration
ja: 移行の状態
ko: 마이그레이션 상태
pt_br: Status de migração
ru: Состояние миграции
zh_hans: 迁移状态
zh_hant: 移轉狀態

# sql.migration.error.title
source: Migration status details
de: Details zum Migrationsstatus
es: Detalles del estado de la migración
fr: Détails de l’état de la migration
ja: 移行状態の詳細
ko: 마이그레이션 상태 세부 정보
pt_br: Detalhes do status da migração
ru: Сведения о состоянии миграции
zh_hans: 迁移状态详细信息
zh_hant: 移轉狀態詳細資料

# sql.login.migration.login.status.details.title
source: Migration status details for {0}
de: Migrationsstatusdetails für {0}
es: Detalles del estado de migración para {0}
fr: Détails de l’état de la migration pour {0}
ja: {0} の移行状態の詳細
ko: {0}에 대한 마이그레이션 상태 세부 정보
pt_br: Detalhes do status da migração para {0}
ru: Сведения о состоянии миграции для {0}
zh_hans: {0} 的迁移状态详细信息
zh_hant: {0} 的移轉狀態詳細資料

# sql.migration.migration.status.filter
source: Migration status filter
de: Migrationsstatus-Filter
es: Filtro de estado de migración
fr: Filtre d’état de la migration
ja: 移行状態フィルター
ko: 마이그레이션 상태 필터
pt_br: Filtro de status de migração
ru: Фильтр состояния миграции
zh_hans: 迁移状态筛选器
zh_hant: 移轉狀態篩選

# sql.migration.tde.migrate.status.details
source: Migration status: {0}{1}{2}
de: Migrationsstatus: {0}{1}{2}
es: Estado de migración: {0}{1}{2}
fr: État de la migration : {0}{1}{2}
ja: 移行の状態: {0}{1}{2}
ko: 마이그레이션 상태: {0}{1}{2}
pt_br: Status da migração: {0}{1}{2}
ru: Состояние миграции: {0}{1}{2}
zh_hans: 迁移状态: {0}{1}{2}
zh_hant: 移轉狀態: {0}{1}{2}

# sql.migration.wizard.cancel.reason.migration.taking.longer
source: Migration taking longer or having issues
de: Migration dauert länger oder hat Probleme
es: La migración está tardando más tiempo o tiene problemas
fr: La migration prend plus de temps ou rencontre des problèmes
ko: 마이그레이션 시간이 오래 걸리거나 문제가 있음
ru: Миграция занимает длительное время, или возникли проблемы
zh_hans: 迁移需要更长时间或出现问题
zh_hant: 移轉需要較長的時間或發生問題

# sql.migration.schema.type
source: Migration type
de: Migrationstyp
es: Tipo de migración
fr: Type de migration
ja: 移行の種類
ko: 마이그레이션 유형
pt_br: Tipo de migração
ru: Тип миграции
zh_hans: 迁移类型
zh_hant: 移轉類型

# sql.migration.database.migration.migration.type.tool.tip
source: Migration type includes: Schema only migration, Data only migration, Schema and data migration.
de: Der Migrationstyp umfasst: Nur Schemamigration, Nur Datenmigration, Schema- und Datenmigration.
es: El tipo de migración incluye: migración solo de esquema, migración solo de datos, migración de esquema y datos.
fr: Le type de migration inclut : migration de schéma uniquement, migration de données uniquement, schéma et migration de données.
ja: 移行の種類には、スキーマのみの移行、データのみの移行、スキーマとデータの移行が含まれます。
ko: 마이그레이션 유형에는 스키마만 마이그레이션, 데이터만 마이그레이션, 스키마 및 데이터 마이그레이션이 있습니다.
pt_br: O tipo de migração inclui: migração somente de esquema, migração somente de dados, migração de esquema e dados.
ru: Тип миграции включает: только миграцию схемы, только перенос данных, миграцию схемы и данных.
zh_hans: 迁移类型包括: 仅限架构迁移、仅数据迁移、架构和数据迁移。
zh_hant: 移轉類型包括: 僅結構描述移轉、僅資料移轉、結構描述和資料移轉。

# sql.migration.tab.migrations.title
source: Migrations
de: Migrationen
es: Migraciones
ja: 移行
ko: 마이그레이션
pt_br: Migrações
ru: Миграции
zh_hans: 迁移
zh_hant: 移轉

# sql.migration.details.breadcrumb.migrations
source: Migrations
de: Migrationen
es: Migraciones
ja: 移行
ko: 마이그레이션
pt_br: Migrações
ru: Миграции
zh_hans: 迁移
zh_hant: 移轉

# sql.migration.table.missing.count
source: Missing on target ({0})
de: Fehlt in Ziel ({0})
es: Falta en el destino ({0})
fr: Manquant sur la cible ({0})
ja: ターゲットに見つかりません ({0})
ko: 대상에 없음({0})
pt_br: Faltando no destino ({0})
ru: Отсутствует в целевом объекте ({0})
zh_hans: 在目标上缺少({0})
zh_hant: 目標上遺漏 ({0})

# sql.migration.schema.partial.missing
source: Missing schemas on the target. Some tables are disabled and cannot be migrated unless this option is selected. No tables selected will migrate missing schema only.
de: Fehlende Schemas am Ziel. Einige Tabellen sind deaktiviert und können nur migriert werden, wenn diese Option ausgewählt ist. Wenn Sie keine Tabellen auswählen, wird nur das fehlende Schema migriert.
es: Faltan esquemas en el destino. Algunas tablas están deshabilitadas y no se pueden migrar a menos que se seleccione esta opción. Ninguna de las tablas seleccionadas migrará solo el esquema que falta.
fr: Schémas manquants dans la cible. Certaines tables sont désactivées et ne peuvent pas être migrées, sauf si cette option est sélectionnée. Désolé, aucune table sélectionnée ne migre le schéma manquant uniquement.
ja: ターゲットにスキーマがありません。一部のテーブルは無効になっており、このオプションを選択しない限り移行できません。テーブルが選択されていないと、不足しているスキーマのみが移行されます。
ko: 대상에 스키마가 없습니다. 일부 테이블이 사용하지 않도록 설정되어 있으며 이 옵션을 선택하지 않으면 마이그레이션할 수 없습니다. 선택한 테이블이 없으면 누락된 스키마만 마이그레이션됩니다.
pt_br: Esquemas ausentes no destino. Algumas tabelas estão desabilitadas e não podem ser migradas a menos que essa opção seja selecionada. Nenhuma tabela selecionada migrará apenas o esquema ausente.
ru: Отсутствуют схемы в целевом объекте. Некоторые таблицы отключены, и их нельзя перенести, если не выбран этот параметр. Ни одна из выбранных таблиц не перенесет только отсутствующую схему.
zh_hans: 目标上缺少架构。除非选择此选项，否则会禁用某些表且无法迁移。不选择任何表将仅迁移缺少的架构。
zh_hant: 目標上遺漏結構描述。某些資料表已停用，除非選取此選項，否則無法移轉。未選取資料表將只會移轉遺失的結構描述。

# sql.migration.mode
source: Mode
de: Modus
es: Modo
ja: モード
ko: 모드
pt_br: Modo
ru: Режим
zh_hans: 模式
zh_hant: 模式

# sql.migration.more.info
source: More info
de: Weitere Informationen
es: Más información
fr: Informations supplémentaires
ja: 詳細情報
ko: 추가 정보
pt_br: Mais informações
ru: Дополнительные сведения
zh_hans: 详细信息
zh_hant: 其他資訊

# sql.migration.nc.blob.storage.radio.label
source: My database backups are in an Azure Storage Blob Container
de: Meine Datenbanksicherungen befinden sich in einem Azure Storage Blob-Container
es: Mis copias de seguridad de base de datos están en un contenedor de Azure Storage Blob
fr: Mes sauvegardes de base de données se trouvent dans un conteneur Azure Storage Blob
ja: データベースのバックアップは、Azure Storage Blob コンテナーにあります。
ko: 내 데이터베이스 백업은 Azure Storage Blob 컨테이너에 있습니다.
pt_br: Meus backups do banco de dados se encontram em um contêiner do Azure Storage Blob
ru: Мои резервные копии базы данных находятся в контейнере Azure Storage Blob
zh_hans: 我的数据库备份位于 Azure 存储 Blob 容器中
zh_hant: 我的資料庫備份位於 Azure 儲存體 Blob 容器中

# sql.migration.nc.network.share.radio.label
source: My database backups are on a network share
de: Meine Datenbanksicherungen befinden sich in einer Netzwerkfreigabe
es: Mis copias de seguridad de base de datos están en un recurso compartido de red
fr: Les sauvegardes de ma base de données sont sur un partage réseau
ja: データベースのバックアップは、ネットワーク共有にあります
ko: 내 데이터베이스 백업은 네트워크 공유에 있습니다.
pt_br: Meus backups do banco de dados se encontram em um compartilhamento de rede
ru: Мои резервные копии базы данных находятся в сетевой папке
zh_hans: 我的数据库备份位于网络共享上
zh_hant: 我的資料庫備份位於網路共用

# sql.migration.na
source: N/A
de: N/V
es: N/D
ja: 該当なし
ko: 해당 없음
pt_br: N/D
ru: Н/Д
zh_hans: 不适用

# sql.migration.name
source: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# sql.migration.name.of.new.rg
source: Name of new resource group
de: Name der neuen Ressourcengruppe
es: Nombre del nuevo grupo de recursos
fr: Nom du nouveau groupe de ressources
ja: 新しいリソース グループの名前
ko: 새 리소스 그룹의 이름
pt_br: Nome do novo grupo de recursos
ru: Имя новой группы ресурсов
zh_hans: 新资源组名称
zh_hant: 新資源群組的名稱

# sql.migration.src.database.tool.tip
source: Name of the source database
de: Name der Quelldatenbank
es: Nombre de la base de datos de origen
fr: Nom de la base de données source
ja: ソース データベースの名前
ko: 원본 데이터베이스의 이름
pt_br: Nome do banco de dados de origem
ru: Имя базы данных-источника
zh_hans: 源数据库名称
zh_hant: 來源資料庫的名稱

# sql.migration.src.server.tool.tip
source: Name of the source server
de: Name des Quellservers
es: Nombre del servidor de origen
fr: Nom du serveur source
ja: ソース サーバーの名前
ko: 원본 서버의 이름
pt_br: Nome do servidor de origem
ru: Имя исходного сервера
zh_hans: 源服务器名称
zh_hant: 來源伺服器的名稱

# sql.migration.impact.object.name
source: Name: {0}
es: Nombre: {0}
fr: Nom : {0}
ja: 名前: {0}
ko: 이름: {0}
pt_br: Nome: {0}
ru: Имя: {0}
zh_hans: 名称: {0}
zh_hant: 名稱: {0}

# sql.migration.name.label
source: Names:
de: Namen:
es: Nombres:
fr: Noms :
ja: 名前:
ko: 이름:
pt_br: Nomes:
ru: Имена:
zh_hans: 名称:
zh_hant: 名稱:

# sql.migration.wizard.cancel.reason.need.to.analyse.findings
source: Need to analyse/fix the findings
de: Analyse/Korrektur der Ergebnisse erforderlich
es: Necesidad de analizar o corregir los resultados
fr: Nécessité d'analyser/corriger les résultats
ko: 결과를 분석/수정해야 함
ru: Необходимо проанализировать/исправить найденные результаты
zh_hans: 需要分析/修复结果
zh_hant: 需要分析/修正結果

# sql.migration.wizard.cancel.reason.change.source.sql.server
source: Need to change source SQL Server
de: Der Quell-SQL Server muss geändert werden.
es: Es necesario cambiar el SQL Server de origen
fr: Besoin de changer la source SQL Server
ko: 원본 SQL Server를 변경해야 함
ru: Необходимо изменить исходный SQL Server
zh_hans: 需要更改源 SQL Server
zh_hant: 需要變更來源 SQL Server

# sql.migration.wizard.cancel.reason.need.to.evaluate.recommended.sku
source: Need to evaluate the recommended SKU
de: Die empfohlene SKU muss ausgewertet werden.
es: Es necesario evaluar el SKU recomendado.
fr: Besoin d'évaluer le SKU recommandé
ko: 권장 SKU를 평가해야 합니다.
ru: Необходимо оценить рекомендуемый SKU
zh_hans: 需要评估推荐的 SKU
zh_hant: 需要評估建議的 SKU

# sql.migration.wizard.cancel.reason.need.to.review.login.selection
source: Need to review login selection
de: Die Anmeldeauswahl muss überprüft werden.
es: Es necesario revisar la selección de inicio de sesión
fr: Besoin de revoir la sélection de connexion
ko: 로그인 선택을 검토해야 함
ru: Необходимо проверить выбор имени для входа
zh_hans: 需要查看登录选择
zh_hant: 需要檢閱登入選取

# sql.migration.wizard.cancel.reason.need.to.review.table.selection
source: Need to review table selection
de: Tabellenauswahl muss überprüft werden
es: Es necesario revisar la selección de la tabla
fr: Besoin de revoir la sélection des tables
ko: 테이블 선택을 검토해야 함
ru: Необходимо проверить выбор таблицы
zh_hans: 需要查看表选择
zh_hant: 需要檢閱資料表選取

# sql.migration.needs.review
source: Needs review
de: Prüfung erforderlich
es: Necesita revisión
fr: Besoin d'un examen
ja: レビューが必要
ko: 검토 필요
pt_br: Precisa de revisão
ru: Требуется проверка
zh_hans: 需要审核
zh_hant: 需要檢閱

# sql.migration.tde.wizard.network.share.label
source: Network path for certificate
de: Netzwerkpfad für Zertifikat
es: Ruta de acceso de red para el certificado
fr: Chemin d’accès réseau pour le certificat
ja: 証明書のネットワーク パス
ko: 인증서의 네트워크 경로
pt_br: Caminho de rede para o certificado
ru: Сетевой путь для сертификата
zh_hans: 证书的网络路径
zh_hant: 憑證的網路路徑

# sql.migration.tde.wizard.network.share.info
source: Network path where certificate will be placed.
de: Netzwerkpfad, in dem das Zertifikat platziert wird.
es: Ruta de acceso de red donde se colocará el certificado.
fr: Chemin d’accès réseau où le certificat sera placé.
ja: 証明書の配置先とするネットワーク パス。
ko: 인증서를 배치할 네트워크 경로입니다.
pt_br: Caminho de rede em que o certificado será colocado.
ru: Сетевой путь для размещения сертификата.
zh_hans: 将放置证书的网络路径。
zh_hant: 放置憑證的網路路徑位置。

# sql.migration.network.share
source: Network share
de: Netzwerkfreigabe
es: Recurso compartido de red
fr: Partage réseau
ja: ネットワーク共有
ko: 네트워크 공유
pt_br: Compartilhamento de rede
ru: Сетевая папка
zh_hans: 网络共享
zh_hant: 網路共用

# sql.migration.validate.ir.validation.result.label.networkshare
source: Network share connectivity: '{0}'
de: Netzwerkfreigabekonnektivität: „{0}“
es: Conectividad del recurso compartido de red: "{0}"
fr: Connectivité du partage réseau : '{0}'
ja: ネットワーク共有の接続性: '{0}'
ko: 네트워크 공유 연결: '{0}'
pt_br: Conectividade de compartilhamento de rede: '{0}'
ru: Подключение к сетевой папке: "{0}"
zh_hans: 网络共享连接:“{0}”
zh_hant: 網路共用連線能力: '{0}'

# sql.migration.network.share.header.text
source: Network share details
de: Details zur Netzwerkfreigabe
es: Detalles del recurso compartido de red
fr: Détails du partage réseau
ja: ネットワーク共有の詳細
ko: 네트워크 공유 세부 정보
pt_br: Detalhes do compartilhamento de rede
ru: Сведения о сетевой папке
zh_hans: 网络共享详细信息
zh_hant: 網路共用詳細資料

# sql.migration.network.share.location.label
source: Network share location where the backups are stored
de: Speicherort der Netzwerkfreigabe, an dem die Sicherungen gespeichert werden
es: Ubicación del recurso compartido de red donde se almacenan las copias de seguridad
fr: Emplacement du partage réseau où les sauvegardes sont stockées
ja: バックアップが保存されているネットワーク共有の場所
ko: 백업이 저장되는 네트워크 공유 위치
pt_br: Local de compartilhamento de rede onde os backups estão armazenados
ru: Расположение общей сетевой папки, в которой хранятся архивные копии
zh_hans: 存储备份的网络共享位置
zh_hant: 儲存備份的網路共用位置

# sql.migration.network.share.path
source: Network share path
de: Pfad der Netzwerkfreigabe
es: Ruta de acceso del recurso compartido de red
fr: Chemin d’accès au partage réseau
ja: ネットワーク共有パス
ko: 네트워크 공유 경로
pt_br: Caminho de compartilhamento de rede
ru: Путь к общей папке
zh_hans: 网络共享路径
zh_hant: 網路共用路徑

# sql.migration.network.share.location.info
source: Network share path for your database backups. The migration process will automatically retrieve valid backup files from this network share.
de: Netzwerkfreigabepfad für Ihre Datenbanksicherungen. Der Migrationsprozess ruft automatisch gültige Sicherungsdateien von dieser Netzwerkfreigabe ab.
es: Ruta de acceso del recurso compartido de red para las copias de seguridad de base de datos. El proceso de migración recuperará automáticamente archivos de copia de seguridad válidos de este recurso compartido de red.
fr: Chemin d’accès au partage réseau pour vos sauvegardes de base de données. Le processus de migration récupère automatiquement les fichiers de sauvegarde valides de ce partage réseau.
ja: データベース バックアップのネットワーク共有パス。移行プロセスでは、このネットワーク共有から有効なバックアップ ファイルを自動的に取得します。
ko: 데이터베이스 백업에 대한 네트워크 공유 경로입니다. 마이그레이션 프로세스는 이 네트워크 공유에서 유효한 백업 파일을 자동으로 검색합니다.
pt_br: Caminho de compartilhamento de rede para seu backups de banco de dados. O processo de migração recuperará automaticamente arquivos de backup válidos desse compartilhamento de rede.
ru: Путь к сетевой папке для резервных копий базы данных. В процессе миграции будут автоматически извлечены допустимые файлы резервной копии из этой сетевой папки.
zh_hans: 数据库备份的网络共享路径。迁移过程将自动从此网络共享检索有效的备份文件。
zh_hant: 資料庫備份的網路共用路徑。移轉程式會自動從此網路共用中擷取有效的備份檔案。

# sql.migration.tab.button.login.migration.label
source: New login migration (PREVIEW)
de: Migration neuer Anmeldungen (VORSCHAU)
es: Nueva migración de inicio de sesión (VERSIÓN PRELIMINAR)
fr: Nouvelle migration de connexion (PRÉVERSION)
ja: 新しいログイン移行 (プレビュー)
ko: 새 로그인 마이그레이션(미리 보기)
pt_br: Nova migração de logons (VISUALIZAÇÃO)
ru: Новая миграция учетных данных (предварительная версия)
zh_hans: 新登录迁移(预览版)
zh_hant: 新的登入移轉 (預覽)

# sql.migration.tab.button.migration.label
source: New migration
de: Neue Migration
es: Nueva migración
fr: Nouvelle migration
ja: 新規の移行
ko: 새 마이그레이션
pt_br: Nova migração
ru: Новая миграция
zh_hans: 新建迁移
zh_hant: 新增移轉
