Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.community.support.description
source: Connect with Microsoft Community
de: Verbindung mit der Microsoft-Community herstellen
es: Conectar con Microsoft Community
fr: Se connecter à la communauté Microsoft
ja: Microsoft コミュニティとつながる
ko: Microsoft 커뮤니티와 연결
pt_br: Conecte-se com a Microsoft Community
ru: Обратитесь к сообществу Microsoft
zh_hans: 与 Microsoft Community 联系
zh_hant: 連結 Microsoft 社群

# sql.migration.wizard.target.connection.error
source: Connection error: {0}
de: Verbindungsfehler: {0}
es: Error de conexión: {0}
fr: Erreur de connexion : {0}
ja: 接続エラー: {0}
ko: 연결 오류: {0}
pt_br: Erro de conexão: {0}
ru: Ошибка подключения: {0}
zh_hans: 连接错误: {0}
zh_hant: 連線錯誤: {0}

# sql.migration.database.connection.error.message
source: Connection error:{0} {1}
de: Verbindungsfehler:{0} {1}
es: Error de conexión:{0} {1}
fr: Erreur de connexion : {0} {1}
ja: 接続エラー:{0} {1}
ko: 연결 오류: {0} {1}
pt_br: Erro de conexão: {0} {1}
ru: Ошибка подключения:{0} {1}
zh_hans: 连接错误: {0} {1}
zh_hant: 連線錯誤:{0} {1}

# sql.migration.connection.status
source: Connection status
de: Verbindungsstatus
es: Estado de la conexión
fr: État de la connexion
ja: 接続の状態
ko: 연결 상태
pt_br: Status da conexão
ru: Состояние подключения
zh_hans: 连接状态
zh_hant: 連線狀態

# sql.migration.wizard.source.missing
source: Connection was successful but did not find any target databases.
de: Die Verbindung war erfolgreich, aber es wurden keine Zieldatenbanken gefunden.
es: La conexión se realizó correctamente, pero no se encontró ninguna base de datos de destino.
fr: La connexion a réussi mais n'a trouvé aucune base de données cible.
ja: 接続は成功しましたが、ターゲット データベースが見つかりませんでした。
ko: 연결에 성공했지만 대상 데이터베이스를 찾지 못했습니다.
pt_br: A conexão foi bem-sucedida, mas não encontrou nenhum banco de dados de destino.
ru: Подключение успешно установлено, но не найдены целевые базы данных.
zh_hans: 连接成功，但未找到任何目标数据库。
zh_hant: 連線成功，但找不到任何目標資料庫。

# sql.login.migration.wizard.target.connection.success
source: Connection was successful.
de: Die Verbindung war erfolgreich.
es: La conexión se realizó correctamente.
fr: La connexion a réussi.
ja: 接続が正常に完了しました。
ko: 연결되었습니다.
pt_br: A conexão foi bem-sucedida.
ru: Подключение выполнено.
zh_hans: 连接成功。
zh_hant: 連線成功。

# sql.migration.wizard.target.connection.success
source: Connection was successful. Target databases found: {0}
de: Die Verbindung war erfolgreich. Gefundene Zieldatenbanken: {0}
es: La conexión se realizó correctamente. Bases de datos de destino encontradas: {0}
fr: La connexion a réussi. Bases de données cibles trouvées : {0}
ja: 接続に成功しました。ターゲット データベースが見つかりました: {0}
ko: 연결에 성공했습니다. 검색된 대상 데이터베이스: {0}
pt_br: A conexão foi bem-sucedida. Os bancos de dados de destino encontrados: {0}
ru: Подключение успешно установлено. Найдены целевые базы данных: {0}
zh_hans: 连接成功。已找到目标数据库: {0}
zh_hant: 連線成功。找到目標資料庫: {0}

# sql.migration.wizard.cancel.reason.continue.with.migration.later
source: Continue with migration later
de: Migration später fortsetzen
es: Continuar con la migración más tarde
fr: Poursuivre la migration plus tard
ko: 마이그레이션 나중에 계속
ru: Продолжить миграцию позже
zh_hans: 稍后继续迁移
zh_hant: 稍後繼續移轉

# sql.migration.sqldb.column.copyduration
source: Copy duration
de: Kopierdauer
es: Duración de la copia
fr: Durée de copie
ja: コピー期間
ko: 복사 기간
pt_br: Duração da cópia
ru: Продолжительность копирования
zh_hans: 复制持续时间
zh_hant: 複製期間

# sql.migration.copy.status.copyfinished
source: Copy finished
de: Kopiervorgang abgeschlossen
es: Copia finalizada
fr: Copie terminée
ja: コピーの完了
ko: 복사 완료
pt_br: Cópia concluída
ru: Копирование завершено
zh_hans: 复制已完成
zh_hant: 複製已完成

# sql.migration.copy.key1
source: Copy key 1
de: Schlüssel 1 kopieren
es: Copiar clave 1
fr: Copier la clé 1
ja: キー 1 のコピー
ko: 키 1 복사
pt_br: Copiar chave 1
ru: Копировать ключ 1
zh_hans: 复制密钥 1
zh_hant: 複製金鑰 1

# sql.migration.copy.key2
source: Copy key 2
de: Schlüssel 2 kopieren
es: Copiar clave 2
fr: Copier la clé 2
ja: キー 2 のコピー
ko: 키 2 복사
pt_br: Copiar chave 2
ru: Копировать ключ 2
zh_hans: 复制密钥 2
zh_hant: 複製金鑰 2

# sql.migration.copy.migration.details
source: Copy migration details
de: Migrationsdetails kopieren
es: Copiar detalles de la migración
fr: Copier les détails de la migration
ja: 移行の詳細をコピー
ko: 마이그레이션 세부 정보 복사
pt_br: Copiar detalhes da migração
ru: Копировать сведения о миграции
zh_hans: 复制迁移详细信息
zh_hant: 複製移轉詳細資料

# sql.migration.tde.migrate.copy.results
source: Copy migration results
de: Migrationsergebnisse kopieren
es: Copiar los resultados de la migración
fr: Copier les résultats de la migration
ja: 移行結果をコピーする
ko: 마이그레이션 결과 복사
pt_br: Copiar resultados da migração
ru: Копировать результаты миграции
zh_hans: 复制迁移结果
zh_hant: 複製移轉結果

# sql.migration.multi.step.status.dialog.copy.results
source: Copy results
de: Ergebnisse kopieren
es: Copiar resultados
fr: Copier des résultats
ja: 結果のコピー
ko: 결과 복사
pt_br: Copiar os resultados
ru: Копировать результаты
zh_hans: 复制结果
zh_hant: 複製結果

# sql.migration.sqldb.column.copystart
source: Copy start
de: Kopierstart
es: Inicio de copia
fr: Début de la copie
ja: コピーの開始
ko: 복사 시작
pt_br: Início da cópia
ru: Запуск копирования
zh_hans: 复制开始
zh_hant: 複製開始

# sql.migration.sqldb.column.copythroughput
source: Copy throughput
de: Kopierdurchsatz
es: Copiar rendimiento
fr: Copier le débit
ja: コピーのスループット
ko: 복사 처리량
pt_br: Copiar taxa de transferência
ru: Пропускная способность копирования
zh_hans: 复制吞吐量
zh_hant: 複製輸送量

# sql.migration.copy.throughput
source: Copy throughput (MBPS)
de: Kopierdurchsatz (MBit/s)
es: Copiar rendimiento (MBPS)
fr: Débit de copie (Mbits/s)
ja: コピー スループット (Mbps)
ko: 복사 처리량(MBPS)
pt_br: Taxa de Transferência de Cópia (MBPS)
ru: Пропускная способность копирования (Мбит/с)
zh_hans: 复制吞吐量(MBPS)
zh_hant: 複製輸送量 (MBPS)

# sql.migration.validate.ir.copy.results
source: Copy validation results
de: Validierungsergebnisse kopieren
es: Copiar los resultados de la validación
fr: Copie des résultats de la validation
ja: 検証結果をコピー
ko: 유효성 검사 결과 복사
pt_br: Copiar resultados de validação
ru: Копировать результаты проверки
zh_hans: 复制验证结果
zh_hant: 複製驗證結果

# sql.migration.copy.status.copying
source: Copying
de: Kopiervorgang
es: Copiando
fr: Copie
ja: コピー中
ko: 복사 중
pt_br: Copiando
ru: Копирование
zh_hans: 正在复制
zh_hant: 正在複製

# sql.migration.create
source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
ko: 만들기
pt_br: Criar
ru: Создать
zh_hans: 创建
zh_hant: 建立

# sql.migration.services.dialog.title
source: Create Azure Database Migration Service
de: Einen Azure Database Migration Service erstellen
es: Crear Azure Database Migration Service
fr: Créer Azure Database Migration Service
ja: Azure Database Migration Service の作成
ko: Azure Database Migration Service 만들기
pt_br: Criar Serviço de Migração de Banco de Dados do Azure
ru: Создать Azure Database Migration Service
zh_hans: 创建 Azure 数据库迁移服务
zh_hant: 建立 Azure 資料庫移轉服務

# sql.migration.support.request.descrption
source: Create a support request
de: Supportanfrage erstellen
es: Crear una solicitud de soporte técnico
fr: Créer une demande de support
ja: サポート リクエストを作成する
ko: 지원 요청 만들기
pt_br: Criar uma solicitação de suporte
ru: Создать запрос на поддержку
zh_hans: 创建支持请求
zh_hant: 建立支援要求

# sql.migration.create.new
source: Create new
de: Neu erstellen
es: Crear nuevo
fr: Créer
ja: 新規作成
ko: 새로 만들기
pt_br: Criar novo
ru: Создать
zh_hans: 新建
zh_hant: 新建

# sql.migration.create.new.migration.service
source: Create new migration service
de: Neuen Migrationsdienst erstellen
es: Crear un nuevo servicio de migración
fr: Créer un nouveau service de migration
ja: 新しい移行サービスの作成
ko: 새 마이그레이션 서비스 만들기
pt_br: Criar novo serviço de migração
ru: Создать новую службу миграции
zh_hans: 创建新的迁移服务
zh_hant: 建立新的移轉服務

# sql.migration.create.new.resource.group
source: Create new resource group
de: Neue Ressourcengruppe erstellen
es: Crear nuevo grupo de recursos
fr: Créer un groupe de ressources
ja: 新しいリソース グループの作成
ko: 새 리소스 그룹 만들기
pt_br: Criar um novo grupo de recursos
ru: Создать новую группу ресурсов
zh_hans: 创建新资源组
zh_hant: 建立新的資源群組

# sql.migration.status.creating
source: Creating
de: Wird erstellt
es: Creando
fr: Création
ja: 作成中
ko: 만드는 중
pt_br: Criando
ru: Создание
zh_hans: 正在创建
zh_hant: 正在建立

# sql.migration.creating.rg.loading
source: Creating resource group
de: Ressourcengruppe wird erstellt
es: Crear grupo de recursos
fr: Création d'un groupe de ressources
ja: リソース グループを作成しています
ko: 리소스 그룹을 만드는 중
pt_br: Criando grupo de recursos
ru: Создание группы ресурсов
zh_hans: 正在创建资源组
zh_hant: 正在建立資源群組

# sql.migration.currently.restoring.file
source: Currently restoring file
de: Datei wird derzeit wiederhergestellt
es: Restaurando archivo actualmente
fr: Restauration du fichier en cours
ja: 現在ファイルを復元しています
ko: 현재 파일을 복원하는 중
pt_br: Atualmente restaurando arquivo
ru: Выполняется восстановление файла
zh_hans: 当前正在还原文件
zh_hant: 目前正在還原檔案

# sql.migration.cutover.in.progress
source: Cutover in progress for database '{0}'
de: Cutover für Datenbank '{0}' in Bearbeitung
es: Transición en curso para la base de datos “{0}”
fr: Basculement en cours pour la base de données « {0} »
ja: データベース '{0}' の一括移行が進行中です
ko: '{0}' 데이터베이스에 대한 컷오버 진행 중
pt_br: Substituição em andamento para o banco de dados '{0}'
ru: Выполняется прямая миграция для базы данных "{0}"
zh_hans: 正在对数据库“{0}”进行直接转换
zh_hant: 資料庫 '{0}' 的完全移轉進行中

# sql.migration.tab.dashboard.title
source: Dashboard
es: Panel
fr: Tableau de bord
ja: ダッシュボード
ko: 대시보드
pt_br: Painel
ru: Панель мониторинга
zh_hans: 仪表板
zh_hant: 儀表板

# sql.migration.sku.data.iops.requirement
source: Data IOPS requirement
de: Daten-IOPS-Anforderung
es: Requisito de IOPS de datos
fr: Exigence d'IOPS de données
ja: データ IOPS 要件
ko: 데이터 IOPS 요구 사항
pt_br: Requisito de IOPS de dados
ru: Требуемое количество операций ввода-вывода в секунду для данных
zh_hans: 数据 IOPS 要求
zh_hant: 資料 IOPS 需求

# sql.migration.wizard.cancel.reason.dms.service.or.ir.not.ready
source: Data Migration Service / IR node not ready
de: Data Migration Service/IR-Knoten nicht bereit
es: El nodo de Servicio de migración de datos/IR no está listo
fr: Service de migration de données / nœud IR non prêt
ko: 데이터 마이그레이션 서비스/IR 노드가 준비되지 않음
ru: Не готова служба переноса данных или узел IR
zh_hans: 数据迁移服务/IR 节点未就绪
zh_hant: 資料移轉服務 / IR 節點未就緒

# sql.migration.sku.azureRecommendation.status.stopped
source: Data collection for Azure recommendations has been stopped.
de: Die Datensammlung für Azure-Empfehlungen wurde beendet.
es: Se ha detenido la recopilación de datos para las recomendaciones de Azure.
fr: La collecte de données pour les recommandations Azure a été arrêtée.
ja: Azure のレコメンデーションのデータ収集が停止されました。
ko: Azure 권장 사항용 데이터 수집을 중지했습니다.
pt_br: A coleta de dados para recomendações do Azure foi interrompida.
ru: Сбор данных для рекомендаций Azure остановлен.
zh_hans: 已停止 Azure 建议的数据收集。
zh_hant: Azure 建議的資料集合已停止。

# sql.migration.sku.azureRecommendation.status.inProgress
source: Data collection is in progress.
de: Datensammlung wird durchgeführt.
es: La recopilación de datos está en curso.
fr: La collecte des données est en cours.
ja: データ収集が進行中です。
ko: 데이터 수집이 진행 중입니다.
pt_br: A coleta de dados está em andamento.
ru: Выполняется сбор данных.
zh_hans: 正在进行数据收集。
zh_hant: 資料收集進行中。

# sql.migration.sku.azureRecommendation.status.refining
source: Data collection still in progress.
de: Die Datensammlung wird noch ausgeführt.
es: La recopilación de datos aún está en curso.
fr: La collecte des données est toujours en cours.
ja: データ収集はまだ進行中です。
ko: 데이터 수집이 아직 진행 중입니다.
pt_br: Coleta de dados ainda em andamento.
ru: Сбор данных все еще выполняется.
zh_hans: 数据收集仍在进行。
zh_hant: 資料收集仍在進行中。

# sql.migration.data.migration.header
source: Data migration
de: Datenmigration
es: Migración de datos
fr: Migration des données
ja: データ移行
ko: 데이터 마이그레이션
pt_br: Migração de dados
ru: Перенос данных
zh_hans: 数据迁移
zh_hant: 資料移轉

# sql.migration.copy.throughput.info
source: Data movement throughput achieved during the migration of your database backups to Azure. This is the rate of data transfer, calculated by data read divided by duration of backups migration to Azure.
de: Datenverschiebungsdurchsatz, der während der Migration Ihrer Datenbanksicherungen zu Azure erreicht wurde. Dies ist die Rate der Datenübertragung, die durch gelesene Daten dividiert durch die Dauer der Migration von Sicherungen zu Azure berechnet wird.
es: El rendimiento del movimiento de datos se obtiene durante la migración de las copias de seguridad de la base de datos a Azure. Esta es la velocidad de transferencia de datos, que se calcula dividiendo la lectura de datos entre la duración de la migración de copias de seguridad a Azure.
fr: Débit de déplacement des données obtenu lors de la migration de vos sauvegardes de base de données vers Azure. Il s’agit du taux de transfert de données, calculé par les données lues divisées par la durée de la migration des sauvegardes vers Azure.
ja: データベース バックアップを Azure に移行する場合に達成したデータ移動のスループット。これは、データ読み込み量を Azure へのバックアップ移行期間で割ったデータ転送の比率です。
ko: 데이터베이스 백업을 Azure로 마이그레이션하는 동안 달성된 데이터 이동 처리량입니다. 데이터 읽기를 Azure로의 백업 마이그레이션 기간으로 나눠 계산된 데이터 전송 속도입니다.
pt_br: Taxa de transferência de movimentação de dados obtida durante a migração do seus backups de banco de dados para o Azure. Essa é a taxa de transferência de dados, calculada por dados lidos divididos pela duração da migração de backups para o Azure.
ru: Пропускная способность перемещения данных, достигнутая при переносе резервных копий базы данных в Azure. Это скорость передачи данных, вычисляемая путем деления прочитанных данных на длительность переноса резервных копий в Azure.
zh_hans: 将数据库备份迁移到 Azure 期间实现的数据移动吞吐量。这是数据传输速率，计算方式为读取的数据除以备份迁移到 Azure 的持续时间。
zh_hant: 將資料庫備份移轉至 Azure 期間達成的資料移動輸送量。這是資料傳輸速率，由資料讀取除以備份移轉至 Azure 的持續時間計算。

# sql.migration.data.only
source: Data only
de: Nur Daten
es: Solo datos
fr: Données seulement
ja: データのみ
ko: 데이터만
pt_br: Somente dados
ru: Только данные
zh_hans: 仅限数据
zh_hant: 僅限資料

# sql.migration.sqldb.column.dataread
source: Data read
de: Gelesene Daten
es: Datos leídos
fr: Lecture de données
ja: データの読み取り
ko: 읽은 데이터
pt_br: Leitura de dados
ru: Данных прочитано
zh_hans: 已读取数据
zh_hant: 讀取的資料

# sql.migration.data.source.configuration.page.title
source: Data source configuration
de: Datenquellenkonfiguration
es: Configuración del origen de datos
fr: Configuration de la source de données
ja: データ ソースの構成
ko: 데이터 원본 구성
pt_br: Configuração da fonte de dados
ru: Конфигурация источника данных
zh_hans: 数据源配置
zh_hant: 資料來源設定

# sql.migration.sku.data.storage.requirement
source: Data storage requirement
de: Datenspeicheranforderung
es: Requisito de almacenamiento de datos
fr: Exigence de stockage de données
ja: データ ストレージの要件
ko: 데이터 스토리지 요구 사항
pt_br: Requisitos de armazenamento de dados
ru: Требование к хранилищу данных
zh_hans: 数据存储要求
zh_hant: 資料儲存需求

# sql.migration.data.uploaded.size
source: Data uploaded / size
de: Hochgeladene Daten/Größe
es: Datos cargados / tamaño
fr: Données chargées/taille
ja: アップロードされたデータ/サイズ
ko: 업로드된 데이터/크기
pt_br: Dados carregados/tamanho
ru: Отправленные данные или размер
zh_hans: 已上传数据/大小
zh_hant: 已上傳的資料/大小

# sql.migration.sqldb.column.datawritten
source: Data written
de: Geschriebene Daten
es: Datos escritos
fr: Données écrites
ja: 書き込み済みデータ
ko: 쓴 데이터
pt_br: Dados gravados
ru: Данных записано
zh_hans: 已写入数据
zh_hant: 寫入的資料

# sql.migration.sku.azureConfiguration.vmPreview
source: Data: {0}, Log: {1}, tempdb: {2}
de: Daten: {0}, Protokoll: {1}, tempdb: {2}
es: Datos: {0}, Registro: {1}, tempdb: {2}
fr: Données : {0}, journal : {1}, tempdb : {2}
ja: データ: {0}、ログ: {1}、tempdb: {2}
ko: 데이터: {0}, 로그: {1}, tempdb: {2}
ru: Данные: {0}, журнал: {1}, tempdb: {2}
zh_hans: 数据: {0}，日志: {1}，tempdb: {2}
zh_hant: 資料: {0}，記錄: {1}，tempdb: {2}

# sql.migration.restore.backuptype.database
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Base de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# sql.migration.database
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Base de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# sql.migration.database.already.exists
source: Database '{0}' already exists on the target managed instance '{1}'.
de: Die Datenbank "{0}" ist bereits auf der verwalteten Zielinstanz "{1}" vorhanden.
es: La base de datos "{0}" ya existe en la instancia administrada de destino "{1}".
fr: La base de données « {0} » existe déjà sur le Managed Instance cible « {1} ».
ja: データベース '{0}' は、ターゲット マネージド インスタンス '{1}' に既に存在します。
ko: 데이터베이스 '{0}'이(가) 대상 관리되는 인스턴스 '{1}'에 이미 있습니다.
pt_br: O banco de dados '{0}' já existe na instância gerenciada de destino '{1}'.
ru: База данных "{0}" уже существует в целевом управляемом экземпляре "{1}".
zh_hans: 目标托管实例“{1}”上已存在数据库“{0}”。
zh_hant: 目標受控執行個體 '{1}'上已經有資料庫 '{0}'。

# sql.migration.database.migration.service
source: Database Migration Service
pt_br: Serviço de Migração de Banco de Dados
zh_hans: 数据库迁移服务
zh_hant: 資料庫移轉服務

# sql.migration.database.migration.service.authentication.keys
source: Database Migration Service authentication keys
de: Authentifizierungsschlüssel für Database Migration Service
es: Claves de autenticación de Database Migration Service
fr: Clés d’authentification du service de migration de base de données
ja: データベース移行サービスの認証キー
ko: 데이터베이스 마이그레이션 서비스 인증 키
pt_br: Chaves de autenticação do Serviço de Migração de Banco de Dados
ru: Ключи проверки подлинности Database Migration Service
zh_hans: 数据库迁移服务身份验证密钥
zh_hant: 資料庫移轉服務驗證金鑰

# sql.migration.database.issues.summary
source: Database assessment issues summary
de: Zusammenfassung der Datenbankbewertungsprobleme
es: Resumen de problemas de evaluación de base de datos
fr: Résumé des problèmes d’évaluation de base de données
ja: データベース評価の問題の概要
ko: 데이터베이스 평가 문제 요약
pt_br: Resumo dos problemas de avaliação do banco de dados
ru: Сводка по проблемам с оценкой баз данных
zh_hans: 数据库评估问题摘要
zh_hant: 資料庫評定問題摘要

# sql.migration.wizard.target.source.collation.error
source: Database mapping error (Error code: {0}) was found between '{1}' and '{2}' databases. The source database collation '{3}' does not match the target database collation '{4}'. Please select or re-create a target database with the same collation as the source database.
de: Datenbankzuordnungsfehler (Fehlercode: {0}) wurde zwischen den Datenbanken „{1}“ und „{2}“ gefunden. Die Quelldatenbanksortierung „{3}“ stimmt nicht mit der Zieldatenbanksortierung „{4}“ überein. Bitte wählen Sie eine Zieldatenbank mit derselben Sortierung wie die Quelldatenbank aus, oder erstellen Sie diese neu.
es: Se encontró un error de asignación (código de error: {0}) entre las bases de datos "{1}" y "{2}". La intercalación de la base de datos de origen "{3}" no coincide con la intercalación de la base de datos de destino "{4}". Seleccione o vuelva a crear una base de datos de destino con la misma intercalación que la base de datos de origen.
fr: Une erreur de mappage de base de données (code d’erreur : {0}) a été trouvée entre les bases de données '{1}' et '{2}'. Le classement de base de données source '{3}' ne correspond pas au classement de base de données cible '{4}'. Sélectionnez ou recréez une base de données cible avec le même classement que la base de données source.
ja: ' {1}' と '{2}' データベースの間で、データベース マッピング エラー (エラー コード:{0}) が見つかりました。ソース データベースの照合順序 '{3}' がターゲット データベースの照合順序 '{4}' と一致しません。ソース データベースと同じ照合順序のターゲット データベースを選択するか再作成してください。
ko: 데이터베이스 매핑 오류(오류 코드: {0})가 '{1}' 및 '{2}' 데이터베이스 사이에서 발견되었습니다. 원본 데이터베이스 데이터 정렬 '{3}'이(가) 대상 데이터베이스 데이터 정렬 '{4}'과(와) 일치하지 않습니다. 원본 데이터베이스와 동일한 데이터 정렬을 사용하여 대상 데이터베이스를 선택하거나 다시 생성하세요.
pt_br: Erro de mapeamento (código de erro: {0}) encontrado entre os bancos de dados '{1}' e '{2}'. A ordenação do banco de dados de origem '{3}' não corresponde à ordenação do banco de dados '{4}'. Selecione ou crie novamente um banco de dados de destino com a mesma ordenação que o banco de dados de origem.
ru: Обнаружена ошибка сопоставления между базами данных "{1}" и "{2}" (код ошибки: {0}). Параметры сортировки базы данных-источника "{3}" не совпадают с параметрами сортировки целевой базы "{4}". Выберите или повторно создайте целевую базу данных с такими же параметрами сортировки, как у источника.
zh_hans: 在“{1}”和“{2}”数据库之间发现映射错误(错误代码: {0})。源数据库排序规则“{3}”与目标数据库排序规则“{4}”不匹配。请选择或重新创建与源数据库具有相同排序规则的目标数据库。
zh_hant: 在 '{1}' 與 '{2}' 資料庫之間發現資料庫對應錯誤 (錯誤碼: {0})。來源資料庫定序 '{3}' 不符合目標資料庫定序 '{4}'。請選取或重新建立具有與來源資料庫相同定序的目標資料庫。

# sql.migration.wizard.target.missing
source: Database mapping error. Missing target databases to migrate. Please configure the target server connection and click connect to collect the list of available database migration targets.
de: Datenbankzuordnungsfehler. Zieldatenbanken für die Migration fehlen. Bitte konfigurieren Sie die Zielserververbindung, und klicken Sie auf „Verbinden“, um die Liste der verfügbaren Datenbankmigrationsziele zu sammeln.
es: Error de asignación de base de datos. Faltan bases de datos de destino para migrar. Configure la conexión del servidor de destino y haga clic en conectar para recopilar la lista de destinos de migración de base de datos disponibles.
fr: Erreur de mappage de base de données. Bases de données cibles manquantes à migrer. Veuillez configurer la connexion au serveur cible et cliquez sur se connecter pour collecter la liste des cibles de migration de base de données disponibles.
ja: データベース マッピング エラーです。移行するターゲット データベースがありません。 ターゲット サーバー接続を構成し、[接続] をクリックして、使用可能なデータベース移行ターゲットの一覧を収集してください。
ko: 데이터베이스 매핑 오류입니다. 마이그레이션할 대상 데이터베이스가 없습니다. 대상 서버 연결을 구성하고 연결을 클릭하여 사용 가능한 데이터베이스 마이그레이션 대상 목록을 수집하세요.
pt_br: Erro de mapeamento de banco de dados. Os bancos de dados de destino estão ausentes para migração. Configure a conexão do servidor de destino e clique em conectar para coletar a lista de destinos de migração de banco de dados disponíveis.
ru: Ошибка сопоставления баз данных. Нет целевых баз данных для миграции. Настройте подключение к целевому серверу и щелкните "Подключить", чтобы получить список доступных целевых объектов для миграции баз данных.
zh_hans: 数据库映射错误。缺少要迁移的目标数据库。请配置目标服务器连接，然后单击“连接”以收集可用数据库迁移目标的列表。
zh_hant: 資料庫對應錯誤。缺少要移轉的目標資料庫。 請設定目標伺服器連線，然後按一下 [連線] 以收集可用的資料庫移轉目標清單。

# sql.migration.wizard.target.source.mapping.error
source: Database mapping error. Source database '{0}' is not mapped to a target database. Please select a target database to migrate to.
de: Datenbankzuordnungsfehler. Die Quelldatenbank „{0}“ ist keiner Zieldatenbank zugeordnet. Bitte wählen Sie eine Zieldatenbank für die Migration aus.
es: Error de asignación de base de datos. La base de datos de origen "{0}" no está asignada a una base de datos de destino. Seleccione una base de datos de destino a la que migrar.
fr: Erreur de mappage de base de données. La base de données source '{0}' n'est pas mappée à une base de données cible. Veuillez sélectionner une base de données cible vers laquelle migrer.
ja: データベース マッピング エラーです。ソース データベース '{0}' はターゲット データベースにマップされていません。 移行先のターゲット データベースを選択してください。
ko: 데이터베이스 매핑 오류입니다. 원본 데이터베이스 '{0}'이(가) 대상 데이터베이스에 매핑되지 않았습니다. 마이그레이션할 대상 데이터베이스를 선택하세요.
pt_br: Erro de mapeamento de banco de dados. O banco de dados de origem '{0}' não está mapeado para um banco de dados de destino. Selecione um banco de dados de destino para a migração.
ru: Ошибка сопоставления баз данных. База данных-источник "{0}" не сопоставлена с целевой базой. Выберите целевую базу данных для миграции.
zh_hans: 数据库映射错误。未将源数据库“{0}”映射到目标数据库。请选择要迁移到的目标数据库。
zh_hant: 資料庫對應錯誤。來源資料庫 '{0}' 未對應到目標資料庫。請選取要移轉至的目標資料庫。
