Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.datavirtualization.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# title.datavirtualization
source: Data Virtualization
de: Datenvirtualisierung
es: Virtualización de datos
fr: Virtualisation des données
it: Virtualizzazione dei dati
ja: データ仮想化
ko: 데이터 가상화
pt_br: Virtualização de Dados
ru: Виртуализация данных
zh_hans: 数据虚拟化
zh_hant: 資料虛擬化

# config.logDebugInfo
source: Enable/disable logging debug information to the developer console.
de: Aktivieren/Deaktivieren der Protokollierung von Debuginformationen in der Entwicklerkonsole.
es: Habilitar o deshabilitar el registro de información de depuración en la consola del desarrollador.
fr: Activer/désactiver la journalisation des informations de débogage sur la console du développeur.
it: Abilita/disabilita la registrazione delle informazioni di debug nella console per sviluppatori.
ja: 開発者コンソールへのデバッグ情報のログ記録を有効または無効にします。
ko: 개발자 콘솔에 대한 디버그 정보 로깅을 활성화/비활성화합니다.
pt_br: Habilitar/desabilitar o registro em log das informações de depuração no console do desenvolvedor.
ru: Включить или отключить регистрацию сведений отладки на консоли разработчика.
zh_hans: 启用/禁用将调试信息记录到开发人员控制台。
zh_hant: 啟用/停用將偵錯資訊記錄到開發人員主控台。

# config.proseParsingMaxLines
source: Number of lines to read from a file to run PROSE parsing on.
de: Anzahl der Zeilen, die zum Ausführen der PROSE-Analyse aus einer Datei gelesen werden sollen.
es: Número de líneas para leer de un archivo en el que se va a ejecutar el análisis de PROSE.
fr: Nombre de lignes à lire à partir d'un fichier pour exécuter l'analyse PROSE.
it: Numero di righe da leggere da un file su cui eseguire l'analisi PROSE.
ja: PROSE 解析を実行するファイルから読み取る行数。
ko: PROSE 구문 분석을 실행하기 위해 파일에서 읽을 라인 수.
pt_br: Número de linhas a serem lidas de um arquivo no qual executar a análise PROSE.
ru: Количество строк, которые нужно прочитать из файла для запуска синтаксического анализа PROSE.
zh_hans: 要从文件中读取以运行 PROSE 分析的行数。
zh_hant: 要從檔案讀取以執行 PROSE 剖析的行數。

# description.datavirtualization
source: Support for Data Virtualization features in SQL Server
de: Unterstützung für Datenvirtualisierungsfeatures in SQL Server
es: Compatibilidad con las características de virtualización de datos en SQL Server
fr: Prise en charge des fonctionnalités de virtualisation des données dans SQL Server
it: Supporto per le funzionalità di virtualizzazione dei dati in SQL Server
ja: SQL Server でのデータ仮想化機能のサポート
ko: SQL Server의 데이터 가상화 기능 지원
pt_br: Suporte aos recursos de Virtualização de Dados no SQL Server
ru: Поддержка функций виртуализации данных в SQL Server
zh_hans: 支持 SQL Server 中的数据虚拟化功能
zh_hant: SQL Server 中的資料虛擬化功能支援

# config.extensionDescription
source: Support for Data Virtualization in SQL Server, including wizards for creating an External Table from an External Data Source or CSV files.
de: Unterstützung für die Datenvirtualisierung in SQL Server, einschließlich von Assistenten zum Erstellen einer externen Tabelle aus einer externen Datenquelle oder anhand von CSV-Dateien.
es: Compatibilidad con la virtualización de datos en SQL Server, incluidos los asistentes para crear una tabla externa a partir de una fuente de datos externa o archivos CSV.
fr: Prise en charge de la virtualisation des données dans SQL Server, y compris des assistants pour la création d'une table externe à partir d'une source de données externe ou de fichiers CSV.
it: Supporto per la virtualizzazione dei dati in SQL Server, incluse le procedure guidate per la creazione di una tabella esterna da un'origine dati esterna o da file CSV.
ja: 外部データ ソースまたは CSV ファイルから外部テーブルを作成するためのウィザードを含む、SQL Server でのデータ仮想化のサポート。
ko: 외부 데이터 원본 또는 CSV 파일에서 외부 테이블을 만드는 마법사를 포함하여 SQL Server의 데이터 가상화 지원.
pt_br: Suporte para Virtualização de Dados do SQL Server, incluindo assistentes para a criação de uma Tabela Externa a partir de uma Fonte de Dados Externa ou de arquivos CSV.
ru: Поддержка виртуализации данных в SQL Server, включая мастера создания внешней таблицы из внешнего источника данных или CSV-файлов.
zh_hans: 支持 SQL Server 中的数据虚拟化，包括从外部数据源或 CSV 文件创建外部表的向导。
zh_hant: SQL Server 中的資料虛擬化支援，包括從外部資料來源或 CSV 檔案建立外部資料表的精靈。

# title.tasks
source: Tasks
de: Aufgaben
es: Tareas
fr: Tâches
it: Attività
ja: タスク
ko: 작업
pt_br: Tarefas
ru: Задачи
zh_hans: 任务
zh_hant: 工作

# title.openVirtualizeDataWizard
source: Virtualize Data
de: Daten virtualisieren
es: Virtualizar datos
fr: Virtualiser les données
it: Virtualizza dati
ja: データの仮想化
ko: 데이터 가상화
pt_br: Virtualizar Dados
ru: Виртуализация данных
zh_hans: 虚拟化数据
zh_hant: 虛擬化資料

# title.openMssqlHdfsTableWizard
source: Virtualize Data From CSV Files
de: Daten aus CSV-Dateien virtualisieren
es: Virtualizar datos de archivos CSV
fr: Virtualiser les données à partir de fichiers CSV
it: Virtualizzare i dati da file CSV
ja: CSV ファイルからデータを仮想化する
ko: CSV 파일에서 데이터 가상화
pt_br: Virtualizar Dados a Partir de Arquivos CSV
ru: Виртуализация данных из CSV-файлов
zh_hans: 从 CSV 文件虚拟化数据
zh_hant: 從 CSV 將資料虛擬化
