Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.login.migration.wizard.target.permission.warning
source: Please ensure that the current user ({0}) has sysadmin permissions to get all login information for the current instance ({1}).
de: Stellen Sie sicher, dass der*die aktuelle Benutzer*in ({0}) über Berechtigungen als Systemadministrator*in verfügt, um alle Anmeldeinformationen für die aktuelle Instanz ({1}) abzurufen.
es: Asegúrese de que el usuario actual ({0}) tenga permisos de administrador del sistema para obtener toda la información de inicio de sesión para la instancia actual ({1}).
fr: Vérifiez que l’utilisateur actuel ({0}) dispose des autorisations sysadmin pour obtenir toutes les informations de connexion pour l’instance actuelle ({1}).
ja: 現在のユーザー ({0}) に、現在のインスタンス ({1}) のすべてのログイン情報を取得するための sysadmin アクセス許可があることを確認してください。
ko: 현재 사용자({0})에게 현재 인스턴스({1})에 대한 모든 로그인 정보를 가져올 수 있는 sysadmin 권한이 있는지 확인하세요.
pt_br: Certifique-se de que o usuário atual ({0}) tenha permissões de administrador de sistema para obter todas as informações de login da instância atual ({1}).
ru: Убедитесь, что у текущего пользователя ({0}) есть разрешения системного администратора для получения всех сведений об именах для входа в текущем экземпляре ({1}).
zh_hans: 请确保当前用户 ({0}) 具有获取当前实例 ({1}) 的所有登录信息的系统管理员权限。
zh_hant: 請確定目前的使用者 ({0}) 具有系統管理員權限，可取得目前執行個體 ({1}) 的所有登入資訊。

# sql.migration.tde.cert.network.info
source: Please enter a network path where SQL Server will export the certificates. Also verify that SQL Server service has write access to this path and the current user should have administrator privileges on the computer where this network path is.
de: Geben Sie einen Netzwerkpfad ein, in den SQL Server die Zertifikate exportieren. Stellen Sie außerdem sicher, dass SQL Server Dienst Schreibzugriff auf diesen Pfad hat und der aktuelle Benutzer über Administratorrechte auf dem Computer verfügen sollte, auf dem sich dieser Netzwerkpfad befindet.
es: Escriba una ruta de acceso de red donde SQL Server exportará los certificados. Compruebe también que SQL Server servicio tiene acceso de escritura a esta ruta de acceso y que el usuario actual debe tener privilegios de administrador en el equipo donde se encuentra esta ruta de acceso de red.
fr: Entrez un chemin d’accès réseau dans lequel SQL Server exportera les certificats. Vérifiez également que SQL Server service dispose d’un accès en écriture à ce chemin d’accès et que l’utilisateur actuel doit disposer de privilèges d’administrateur sur l’ordinateur sur lequel se trouve ce chemin d’accès réseau.
ja: SQL Server で証明書をエクスポートするネットワーク パスを入力してください。また、SQL Server サービスにこのパスに対する書き込みアクセス権があること、および現在のユーザーはこのネットワーク パスがあるコンピューターの管理者特権が必要であることを確認してください。
ko: SQL Server 인증서를 내보낼 네트워크 경로를 입력하세요. SQL Server 서비스가 이 경로에 대한 쓰기 권한을 가지고 있으며 현재 사용자에게 이 네트워크 경로가 있는 컴퓨터에 대한 관리자 권한이 있어야 하는지도 확인하세요.
pt_br: Insira um caminho de rede para onde o SQL Server exportará os certificados. Verifique também se o serviço do SQL Server tem acesso de gravação a esse caminho e se o usuário atual deve ter privilégios de administrador no computador onde está esse caminho de rede.
ru: Введите сетевой путь, по которому SQL Server будет экспортировать сертификаты. Также убедитесь, что у службы SQL Server есть доступ на запись по этому пути. У текущего пользователя должны быть права администратора на компьютере, где находится этот сетевой путь.
zh_hans: 请输入 SQL Server 将导出证书的网络路径。还要验证 SQL Server 服务是否具有对此路径的写入访问权限，并且当前用户应具有此网络路径所在的计算机的管理员权限。
zh_hant: 請輸入 SQL Server 將匯出憑證的網路路徑。另請確認 SQL Server 服務具有此路徑的寫入權限，而且目前的使用者應擁有此網路路徑所在的電腦的系統管理員權限。

# sql.login.migration.select.logins.windows.auth.warning
source: Please note that this wizard does not display windows authentication login types because migrating that type is currently not supported. Capability for migrating windows authentication logins is coming soon.
de: Bitte beachten Sie, dass dieser Assistent keine Anmeldetypen für die Windows-Authentifizierung anzeigt, da die Migration dieses Typs derzeit nicht unterstützt wird. Die Funktion zum Migrieren von Windows-Authentifizierungsanmeldungen ist in Kürze verfügbar.
es: Tenga en cuenta que este asistente no muestra los tipos de inicio de sesión de autenticación de Windows porque actualmente no se admite la migración de ese tipo. La funcionalidad para migrar los inicios de sesión de autenticación de Windows estará disponible próximamente.
fr: Veuillez noter que cet Assistant n’affiche pas les types de connexion d’authentification Windows, car la migration de ce type n’est actuellement pas prise en charge. La fonctionnalité de migration des connexions d’authentification Windows sera bientôt disponible.
ja: このウィザードでは、Windows 認証ログインの種類は表示されません。この種類の移行は現在サポートされていません。Windows 認証ログインの移行機能は近日公開予定です。
ko: 해당 유형의 마이그레이션은 현재 지원하지 않으므로 이 마법사는 Windows 인증 로그인 유형을 표시하지 않습니다. Windows 인증 로그인 마이그레이션 기능은 곧 제공될 예정입니다.
pt_br: Observe que esse assistente não exibe os tipos de logon de autenticação do Windows porque a migração desse tipo não é suportada no momento. A capacidade de migrar logons de autenticação do Windows estará disponível em breve.
ru: Обратите внимание, что этот мастер не отображает типы учетных данных проверки подлинности Windows, так как миграция этого типа сейчас не поддерживается. Возможность миграции учетных данных проверки подлинности Windows ожидается в ближайшее время.
zh_hans: 请注意，此向导不显示 Windows 身份验证登录类型，因为当前不支持迁移该类型。即将推出用于迁移 Windows 身份验证登录的功能。
zh_hant: 請注意，此精靈不會顯示 Windows 驗證登入類型，因為目前不支援移轉該類型。即將推出移轉 Windows 驗證登入的功能。

# sql.retry.migration.summary
source: Please resolve any errors before retrying the migration.
de: Beheben Sie alle Fehler, bevor Sie die Migration wiederholen.
es: Resuelva los errores antes de reintentar la migración.
fr: Corrigez les erreurs avant de réessayer la migration.
ja: 移行を再試行する前に、エラーを解決してください。
ko: 마이그레이션을 다시 시도하기 전에 오류를 해결하세요.
pt_br: Resolva quaisquer erros antes de tentar novamente a migração.
ru: Перед повторной миграцией необходимо устранить все ошибки.
zh_hans: 请在重试迁移之前解决任何错误。
zh_hant: 請先解決所有錯誤，再重試移轉。

# sql.migration.select.database.to.continue
source: Please select 1 or more databases to assess for migration
de: Wählen Sie mindestens eine Datenbank aus, auf die für die Migration zugegriffen werden soll
es: Seleccione 1 o más bases de datos para evaluar la migración
fr: Sélectionnez au moins une base de données à évaluer pour la migration
ja: 移行を評価するために 1 つ以上のデータベースを選択してください
ko: 마이그레이션을 평가할 데이터베이스를 1개 이상 선택하세요.
pt_br: Selecione um ou mais bancos de dados para avaliar a migração
ru: Выберите одну или несколько баз данных, чтобы выполнить оценку миграции
zh_hans: 请选择 1 个或多个要评估迁移的数据库
zh_hant: 請選取 1 或多個資料庫進行移轉評估

# sql.migration.database.validate.selection
source: Please select target database tables to migrate to. At least one database with one table is required.
de: Bitte wählen Sie die Zieldatenbanktabellen aus, zu denen migriert werden soll. Mindestens eine Datenbank mit einer Tabelle ist erforderlich.
es: Seleccione las tablas de base de datos de destino a las que migrar. Se requiere al menos una base de datos con una tabla.
fr: Veuillez sélectionner les tables de base de données cibles vers lesquelles migrer. Au moins une base de données avec une table est requise.
ja: 移行先のターゲット データベース テーブルを選択してください。 1 つのテーブルを持つ少なくとも 1 つのデータベースが必要です。
ko: 마이그레이션할 대상 데이터베이스 테이블을 선택하세요. 테이블이 하나 이상 있는 데이터베이스가 하나 이상 필요합니다.
pt_br: Selecione as tabelas de banco de dados de destino para a migração. É necessário pelo menos um banco de dados com uma tabela.
ru: Выберите таблицы целевых баз данных для миграции. Требуется хотя бы одна база данных с одной таблицей.
zh_hans: 请选择要迁移到的目标数据库表。至少需要一个包含一个表的数据库。
zh_hant: 請選取要移轉至的目標資料庫資料表。至少需要一個具有一個資料表的資料庫。

# sql.migration.service.selection.location.msg
source: Please select the location of your database backup files before continuing.
de: Bitte wählen Sie den Speicherort Ihrer Datenbanksicherungsdateien aus, bevor Sie fortfahren.
es: Seleccione la ubicación de los archivos de copia de seguridad de la base de datos antes de continuar.
fr: Veuillez sélectionner l’emplacement de vos fichiers de sauvegarde de base de données avant de continuer.
ja: 続行する前に、データベース バックアップ ファイルの場所を選択してください。
ko: 계속하기 전에 데이터베이스 백업 파일의 위치를 선택하세요.
pt_br: Selecione o local dos arquivos de backup do banco de dados antes de continuar.
ru: Прежде чем продолжить, выберите расположение файлов резервной копии базы данных.
zh_hans: 请先选择数据库备份文件的位置，然后再继续。
zh_hant: 請選取資料庫備份檔案的位置，再繼續。

# sql.migration.cancel.feedback.reason.container.description
source: Please take a moment to tell us the reason for canceling the migration. This will help us improve the experience.
de: Bitte nehmen Sie sich einen Moment Zeit, um uns den Grund für den Abbruch der Migration mitzuteilen. Dies hilft uns, die Erfahrung zu verbessern.
es: Dedique un momento a indicarnos el motivo de la cancelación de la migración. Esto nos ayudará a mejorar la experiencia.
fr: Veuillez prendre un moment pour nous indiquer la raison de l'annulation de la migration. Cela nous aidera à améliorer l’expérience.
ko: 잠시 시간을 내어 마이그레이션을 취소하는 이유를 알려주세요. 이는 환경을 개선하는 데 도움이 됩니다.
ru: Укажите причину отмены миграции. Это поможет нам улучшить взаимодействие.
zh_hans: 请花点时间告诉我们取消迁移的原因。这将有助于我们改进体验。
zh_hant: 請花一點時間告訴我們取消移轉的原因。這將協助我們改進體驗。

# sql.migration.port.label
source: Port
es: Puerto
ja: ポート
ko: 포트
pt_br: Porta
ru: Порт
zh_hans: 端口
zh_hant: 連接埠

# sql.ir.powershell.script.saved
source: PowerShell script saved
zh_hans: PowerShell 脚本已保存

# sql.ir.ps.script.collapsed
source: Powershell script collapsed
zh_hans: PowerShell 脚本已折叠

# sql.ir.ps.script.expanded
source: Powershell script expanded
zh_hans: PowerShell 脚本已展开

# sql.migration.status.prefetchobjects
source: Prefetch objects
de: Objekte vorab abrufen
es: Captura previa de objetos
fr: Pré-récupérer des objets
ja: プリフェッチ オブジェクト
ko: 개체 프리페치
pt_br: Pré-buscar objetos
ru: Упреждающая выборка объектов
zh_hans: 预提取对象
zh_hant: 預先擷取物件

# sql.migration.sku.targetStorageConfiguration.disktype.PremiumSsd
source: Premium SSD
de: SSD Premium
es: SSD prémium
fr: SSD Premium
ko: 프리미엄 SSD
pt_br: SSD Premium
ru: SSD (цен. категория "Премиум")
zh_hans: 高级 SSD
zh_hant: 進階 SSD

# sql.migration.sku.targetStorageConfiguration.disktype.PremiumSsdV2
source: Premium SSD v2
de: SSD Premium v2
es: SSD prémium v2
fr: SSD Premium v2
ko: 프리미엄 SSD v2
pt_br: SSD Premium v2
ru: SSD (цен. категория "Премиум") версии 2
zh_hans: 高级 SSD v2
zh_hant: 進階 SSD v2

# sql.migration.sku.azureConfiguration.premiumSeries
source: Premium-series
de: Premium-Serie
es: Serie Prémium
fr: Série Premium
ja: Premium シリーズ
ko: 프리미엄-데이터 계열
pt_br: Série Premium
ru: Серия Premium
zh_hans: 高级系列
zh_hant: 進階系列

# sql.migration.copy.status.preparingforcopy
source: Preparing
de: Wird vorbereitet
es: Preparando
fr: Préparation
ja: 準備中
ko: 준비 중
pt_br: Preparando
ru: Подготовка
zh_hans: 正在准备
zh_hant: 正在準備

# sql.ir.powershell.prereq
source: Prerequisite: Need PowerShell with execute as admin privileges.
zh_hans: 先决条件: 需要 PowerShell 具有以管理员身份执行的权限。

# sql.login.migration.status.page.previous.button.title
source: Previous (Disabled)
de: Zurück (deaktiviert)
es: Anterior (deshabilitado)
fr: Précédent (désactivé)
ja: 前 (無効)
ko: 이전(사용 안 함)
pt_br: Anterior (Desabilitado)
ru: Назад (отключено)
zh_hans: 上一个(已禁用)
zh_hant: 上一個 (已停用)

# sql.migration.tde.migrate.results.heading.previous
source: Previous certificates migration results:
de: Vorherige Zertifikatmigrationsergebnisse:
es: Resultados anteriores de la migración de certificados:
fr: Résultats de la migration des certificats précédents :
ja: 以前の証明書移行の結果:
ko: 이전 인증서 마이그레이션 결과:
pt_br: Resultados anteriores da migração de certificados:
ru: Предыдущие результаты миграции сертификатов:
zh_hans: 以前的证书迁移结果:
zh_hant: 之前的憑證移轉結果:

# sql.migration.provide.unique.containers
source: Provide a unique container for each target database. Databases affected:
de: Geben Sie einen eindeutigen Container für jede Zieldatenbank an. Betroffene Datenbanken:
es: Proporcione un contenedor único para cada base de datos de destino. Bases de datos afectadas:
fr: Spécifiez un conteneur unique pour chaque base de données cible. Bases de données affectées :
ja: ターゲット データベースごとに一意のコンテナーを指定してください。影響を受けるデータベースは以下のとおりです。
ko: 각 대상 데이터베이스에 대해 고유한 컨테이너를 제공하세요. 영향을 받는 데이터베이스:
pt_br: Forneça um contêiner exclusivo para cada banco de dados de destino. Banco de dados afetados:
ru: Укажите уникальный контейнер для каждой целевой базы данных. Затронутые базы данных:
zh_hans: 为每个目标数据库提供唯一的容器。受影响的数据库有:
zh_hant: 為每個目標資料庫提供唯一的容器。受影響的資料庫:

# sql.migration.blob.storage.help.text
source: Provide the Azure Storage Blob Container that contains the backups.
de: Geben Sie den Azure Storage Blob Container an, der die Sicherungen enthält.
es: Proporcione el contenedor de Azure Storage Blob que incluya las copias de seguridad.
fr: Fournissez le conteneur Azure Storage Blob qui contient les sauvegardes.
ja: バックアップを含む Azure Storage Blob コンテナーを指定します。
ko: 백업이 포함된 Azure Storage Blob 컨테이너를 제공합니다.
pt_br: Fornecer o Contêiner do Azure Storage Blob que contém os backups.
ru: Укажите контейнер Azure Storage Blob, содержащий резервные копии.
zh_hans: 提供包含备份的 Azure 存储 Blob 容器。
zh_hant: 提供包含備份的 Azure 儲存體 Blob 容器。

# sql.migration.network.share.azure.help
source: Provide the Azure Storage account where the backups will be uploaded to.
de: Geben Sie das Azure Storage-Konto an, in das die Sicherungen hochgeladen werden.
es: Proporcione la cuenta de Azure Storage en la que se cargarán las copias de seguridad.
fr: Indiquez le compte de stockage Azure dans lequel les sauvegardes seront chargées.
ja: バックアップのアップロード先の Azure Storage アカウントを指定します。
ko: 백업이 업로드될 Azure Storage 계정을 제공합니다.
pt_br: Forneça a conta do Armazenamento do Microsoft Azure em que os backups serão carregados.
ru: Укажите учетную запись хранения Azure, куда будут отправляться архивные копии.
zh_hans: 提供备份将上传到其中的 Azure 存储帐户。
zh_hant: 請提供要將備份上傳到的目標 Azure 儲存體帳戶。

# sql.migration.network.share.help.text
source: Provide the network share location where the backups are stored, and the user credentials used to access the share.
de: Geben Sie den Speicherort der Netzwerkfreigabe an, an dem die Sicherungen gespeichert sind, und die Benutzeranmeldeinformationen, die für den Zugriff auf die Freigabe verwendet werden.
es: Proporcione la ubicación del recurso compartido de red (donde se almacenan las copias de seguridad) y las credenciales de usuario con las que se accedió al recurso compartido.
fr: Indiquez l’emplacement du partage réseau où sont stockées les sauvegardes et les informations d’identification de l’utilisateur utilisées pour accéder au partage.
ja: バックアップが格納されているネットワーク共有の場所、および共有へのアクセスに使用するユーザーの資格情報を指定します。
ko: 백업이 저장되는 네트워크 공유 위치와 공유에 액세스하는 데 사용되는 사용자 자격 증명을 제공합니다.
pt_br: Forneça o local de compartilhamento de rede onde os backups estão armazenados e as credenciais de usuário usadas para acessar o compartilhamento.
ru: Укажите расположение общей сетевой папки, в которой хранятся резервные копии и учетные данные пользователя, используемые для доступа к общему ресурсу.
zh_hans: 提供存储备份的网络共享位置，以及用于访问共享的用户凭据。
zh_hant: 提供儲存備份的網路共用位置，以及用來存取共用的使用者認證。

# sql.migration.database.schema.migration.public.preview
source: Public Preview
de: Öffentliche Vorschau
es: Versión preliminar pública
fr: Préversion publique
ja: パブリック プレビュー
ko: 공개 미리 보기
pt_br: Versão Prévia Pública
ru: Общедоступная предварительная версия
zh_hans: 公共预览版
zh_hant: 公開預覽版

# sql.migration.restore.backupset.status.queued
source: Queued
de: In Warteschlange gestellt
es: En cola
fr: En attente
ja: キューに登録済み
ko: 큐에 대기됨
pt_br: Enfileirado
ru: В очереди
zh_hans: 已排队
zh_hant: 已佇列

# sql.migration.copy.status.queued
source: Queued
de: In Warteschlange gestellt
es: En cola
fr: En attente
ja: キューに投入済み
ko: 큐에 추가됨
pt_br: Na fila
ru: В очереди
zh_hans: 已排队
zh_hant: 已佇列

# sql.migration.field.label.queued.files
source: Queued files
de: Dateien in der Warteschlange
es: Archivos en cola
fr: Fichiers en file d’attente
ja: キューに登録済みのファイル
ko: 큐에 대기된 파일
pt_br: Arquivos em fila
ru: Файлы в очереди
zh_hans: 排队的文件
zh_hant: 已加入佇列的檔案

# sql.migration.sku.recommended.configuration.summary.label.caps
source: RECOMMENDED CONFIGURATION
de: EMPFOHLENE KONFIGURATION
es: CONFIGURACIÓN RECOMENDADA
fr: CONFIGURATION RECOMMANDÉE
ja: 推奨される構成
ko: 맞춤 구성
pt_br: CONFIGURAÇÃO RECOMENDADA
ru: РЕКОМЕНДУЕМАЯ КОНФИГУРАЦИЯ
zh_hans: 建议的配置
zh_hant: 建議設定

# sql.migration.sku.targetStorageConfiguration.caching.readOnly
source: Read-only
de: Schreibgeschützt
es: Solo lectura
fr: Lecture seule
ja: 読み取り専用
ko: 읽기 전용
pt_br: Somente leitura
ru: Только для чтения
zh_hans: 只读
zh_hant: 唯讀

# sql.migration.sku.targetStorageConfiguration.caching.readWrite
source: Read/write
de: Lesen/schreiben
es: Lectura/escritura
fr: Lecture/écriture
ja: 読み取り/書き込み
ko: 읽기/쓰기
pt_br: Leitura/gravação
ru: Для чтения и записи
zh_hans: 读/写
zh_hant: 讀取/寫入

# sql.migration.status.readyforcutover
source: Ready for cutover
de: Bereit für Cutover
es: Listo para la transición
fr: Prêt pour le basculement
ja: 一括移行の準備完了
ko: 전환 준비
pt_br: Pronto para substituição
ru: Готово к прямой миграции
zh_hans: 已准备好进行直接转换
zh_hant: 移轉已就緒

# sql.migration.migration.time.label
source: Ready for migration
de: Bereit für Migration
es: Listo para la migración
fr: Prêt pour la migration
ja: 移行の準備完了
ko: 마이그레이션 준비 완료
pt_br: Pronto para migração
ru: Готово к миграции
zh_hans: 迁移准备就绪
zh_hant: 已準備好進行移轉

# sql.migration.ready.warn
source: Ready with warnings
de: Bereit mit Warnungen
es: Listo con advertencias
fr: Enregistrer avec des avertissements
ja: 警告付きで準備完了
ko: 경고가 있는 준비 완료
pt_br: Pronto com avisos
ru: Готово с предупреждениями
zh_hans: 已准备好，出现警告
zh_hant: 已就緒但有警告

# sql.migration.cancel.feedback.reason.container.title
source: Reason for canceling migration
de: Grund für den Abbruch der Migration
es: Motivo para cancelar la migración
fr: Raison de l'annulation de la migration
ko: 마이그레이션을 취소하는 이유
ru: Причина отмены миграции
zh_hans: 取消迁移的原因
zh_hant: 取消移轉的原因

# sql.migration.copy.status.rebuildingindexes
source: Rebuilding indexes
de: Indizes werden neu erstellt
es: Recompilación de índices
fr: Reconstruction des index
ja: インデックスの再構築
ko: 인덱스를 다시 빌드하는 중
pt_br: Recompilando índices
ru: Перестроение индексов
zh_hans: 重新生成索引
zh_hant: 正在重建索引

# sql.migration.recommendation
source: Recommendation
de: Empfehlung
es: Recomendación
fr: Recommandation
ja: 推奨事項
ko: 권장 사항
pt_br: Recomendação
ru: Рекомендация
zh_hans: 建议
zh_hant: 建議

# sql.migration.sku.parameters
source: Recommendation parameters
de: Empfehlungsparameter
es: Parámetros de recomendación
fr: Paramètres de recommandation
ja: レコメンデーション パラメーター
ko: 권장 사항 매개 변수
pt_br: Parâmetros de recomendação
ru: Параметры рекомендаций
zh_hans: 建议参数
zh_hant: 建議參數

# sql.migration.sku.recommendationReason
source: Recommendation reason
de: Empfehlungsgrund
es: Motivo de la recomendación
fr: Raison de la recommandation
ja: レコメンデーションの理由
ko: 권장 이유
pt_br: Motivo da recomendação
ru: Причина рекомендации
zh_hans: 建议原因
zh_hant: 建議原因

# sql.migration.sku.targetStorageConfiguration
source: Recommendation target storage configuration
de: Konfiguration des Empfehlungszielspeichers
es: Configuración de almacenamiento de destino de la recomendación
fr: Configuration de stockage cible recommandée
ja: レコメンデーション ターゲット ストレージの構成
ko: 권장 대상 스토리지 구성
pt_br: Configuração do armazenamento de destino da recomendação
ru: Конфигурация целевого хранилища рекомендаций
zh_hans: 建议目标存储配置
zh_hant: 建議目標儲存體設定

# sql.migration.sku.recommendations
source: Recommendations
de: Empfehlungen
es: Recomendaciones
fr: Recommandations
ja: レコメンデーション
ko: 권장 사항
pt_br: Recomendações
ru: Рекомендации
zh_hans: 建议
zh_hant: 建議

# sql.migration.sku.recommendedConfiguration
source: Recommended configuration
de: Empfohlene Konfiguration
es: Configuración recomendada
fr: Configuration recommandée
ja: 推奨される構成
ko: 맞춤 구성
pt_br: Configuração recomendada
ru: Рекомендуемая конфигурация
zh_hans: 建议的配置
zh_hant: 建議設定

# sql.migration.sku.targetStorageConfiguration.recommendedStorageConfiguration
source: Recommended storage configuration
de: Empfohlene Speicherkonfiguration
es: Configuración de almacenamiento recomendada
fr: Configuration de stockage recommandée
ja: 推奨されるストレージ構成
ko: 맞춤 스토리지 구성
pt_br: Configuração do armazenamento recomendada
ru: Рекомендуемая конфигурация хранилища
zh_hans: 建议的存储配置
zh_hant: 建議的存放裝置設定

# sql.migration.status.refresh.label
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# sql.migration.details.refresh
source: Refresh
de: Aktualisieren
es: Actualización
fr: Actualiser
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновление
zh_hans: 刷新
zh_hant: 重新整理

# sql.migration.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# sql.migration.database.table.refresh.label
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# sql.migration.refresh.assessment.label
source: Refresh Assessment
de: Bewertung aktualisieren
es: Actualizar evaluación
fr: Actualiser l’évaluation
ja: 評価の更新
ko: 평가 새로 고침
pt_br: Atualizar Avaliação
ru: Обновить оценку
zh_hans: 刷新评估
zh_hant: 重新整理評定

# sql.migration.refresh.sku.label
source: Refresh SKU
de: SKU aktualisieren
es: Actualizar SKU
fr: Actualiser la référence SKU
ja: SKU の更新
ko: SKU 새로 고침
pt_br: Atualizar SKU
ru: Обновить SKU
zh_hans: 刷新 SKU
zh_hant: 重新整理 SKU

# sql.migration.refresh.key1
source: Refresh key 1
de: Schlüssel 1 aktualisieren
es: Actualizar clave 1
fr: Actualiser la clé 1
ja: キー 1 を最新の情報に更新する
ko: 키 1 새로 고침
pt_br: Atualizar chave 1
ru: Обновить ключ 1
zh_hans: 刷新密钥 1
zh_hant: 重新整理金鑰 1

# sql.migration.refresh.key2
source: Refresh key 2
de: Schlüssel 2 aktualisieren
es: Actualizar clave 2
fr: Actualiser la clé 2
ja: キー 2 を最新の情報に更新する
ko: 키 2 새로 고침
pt_br: Atualizar chaves 2
ru: Обновить ключ 2
zh_hans: 刷新密钥 2
zh_hant: 重新整理金鑰 2

# sql.login.migration.select.in.progress
source: Refreshing login list from source and target
de: Anmeldeliste aus Quelle und Ziel wird aktualisiert
es: Actualizando la lista de inicios de sesión desde el origen y el destino
fr: Actualisation de la liste de connexions à partir de la source et de la cible
ja: ソースとターゲットからログイン リストを更新しています
ko: 원본 및 대상에서 로그인 목록을 새로 고침 하는 중
pt_br: Atualizando a lista de logons de origem e de destino
ru: Обновление списка учетных данных из источника и целевого объекта
zh_hans: 正在从源和目标刷新登录列表
zh_hant: 正在從來源和目標重新整理登入清單

# sql.login.migration.refresh.source.login.data.failed
source: Refreshing login list from source failed
de: Fehler beim Aktualisieren der Anmeldeliste aus der Quelle.
es: Error al actualizar la lista de inicio de sesión desde el origen
fr: Échec de l’actualisation de la liste de connexions à partir de la source
ja: ソースからのログイン リストの更新に失敗しました
ko: 원본의 로그인 목록을 새로 고침 하지 못 함
pt_br: Falha ao atualizar a lista de logons de origem
ru: Не удалось обновить список учетных данных из источника
zh_hans: 从源刷新登录列表失败
zh_hant: 從來源重新整理登入清單失敗

# sql.login.migration.refresh.target.login.data.failed
source: Refreshing login list from target failed
de: Fehler beim Aktualisieren der Anmeldeliste vom Ziel.
es: Error al actualizar la lista de inicio de sesión desde el destino
fr: Échec de l’actualisation de la liste de connexions à partir de la cible
ja: ターゲットのログイン リストの更新に失敗しました
ko: 대상에서 로그인 목록을 새로 고침 하지 못 함
pt_br: Ocorreu um erro ao atualizar a lista de logons de destino
ru: Не удалось обновить список учетных данных из целевого объекта
zh_hans: 从目标刷新登录列表失败
zh_hant: 從目標重新整理登入清單失敗
