Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.target.table.missing
source: Target table does not exist
de: Die Zieltabelle ist nicht vorhanden.
es: La tabla de destino no existe.
fr: La table cible n'existe pas
ja: ターゲット テーブルが存在しません
ko: 대상 테이블이 없음
pt_br: A tabela de destino não existe
ru: Целевая таблица не существует
zh_hans: 目标表不存在
zh_hant: 目標資料表不存在

# sql.migration.target.table.not.empty
source: Target table is not empty.
de: Die Zieltabelle ist nicht leer.
es: La tabla de destino no está vacía.
fr: La table cible n'est pas vide.
ja: ターゲット テーブルが空ではありません。
ko: 대상 테이블이 비어 있지 않습니다.
pt_br: A tabela de destino não está vazia.
ru: Целевая таблица не пустая.
zh_hans: 目标表不为空。
zh_hant: 目標資料表不是空的。

# sql.migration.azure.sql.target
source: Target type
de: Zieltyp
es: Tipo de destino
fr: Type de cible
ja: ターゲットの種類
ko: 대상 유형
pt_br: Tipo de destino
ru: Тип объекта
zh_hans: 目标类型
zh_hant: 目標類型

# sql.migration.username.label
source: Target user name
de: Zielbenutzername
es: Nombre de usuario de destino
fr: Nom de l'utilisateur cible
ja: ターゲット ユーザー名
ko: 대상 사용자 이름
pt_br: Nome do usuário de destino
ru: Имя целевого пользователя
zh_hans: 目标用户名
zh_hant: 目標使用者名稱

# sql.migration.target.version
source: Target version
de: Zielversion
es: Versión de destino
fr: Version cible
ja: ターゲット バージョン
ko: 대상 버전
pt_br: Versão alvo
ru: Целевая версия
zh_hans: 目标版本
zh_hant: 目標版本

# sql.migration.target.provisioning.save.template.success
source: Template saved successfully
zh_hans: 已成功保存模板

# sql.migration.target.provisioning.upload.template.success
source: Template uploaded successfully
zh_hans: 已成功上传模板

# sql.migration.test.connection
source: Test connection
de: Verbindung testen
es: Conexión de prueba
fr: Tester la connexion
ja: 接続のテスト
ko: 연결 테스트
pt_br: Testar conexão
ru: Проверить подключение
zh_hans: 测试连接
zh_hant: 測試連接

# sql.migration.dashboard.help.description.migrateUsingADS
source: The Azure SQL Migration extension for Azure Data Studio provides capabilities to assess, get right-sized Azure recommendations and migrate SQL Server databases to Azure.
de: Die Azure SQL Migrationserweiterung für Azure Data Studio bietet Funktionen zum Bewerten, Abrufen der passenden Azure-Empfehlungen und migrieren von SQL Server-Datenbanken zu Azure.
es: La extensión de migración de Azure SQL para Azure Data Studio proporciona funcionalidades para evaluar, obtener recomendaciones de Azure del tamaño adecuado y migrar bases de datos de SQL Server a Azure.
fr: L’extension de migration Azure SQL pour Azure Data Studio fournit des fonctionnalités pour évaluer, obtenir des recommandations Azure adaptées et migrer SQL Server bases de données vers Azure.
ja: Azure Data Studio の Azure SQL 移行拡張機能では、アセスメントを実行し、適切なサイズの Azure 推奨事項を取得し、SQL Server データベースを Azure に移行する機能が提供されます。
ko: Azure Data Studio용 Azure SQL 마이그레이션 확장은 Azure 권장 사항을 평가하고, 적합한 크기를 구하며, SQL Server 데이터베이스를 Azure로 마이그레이션하는 기능을 제공합니다.
pt_br: A extensão SQL do Azure Migration para Azure Data Studio fornece recursos para avaliar, obter recomendações do Azure do tamanho certo e migrar bancos de dados do SQL Server para o Azure.
ru: Расширение миграции Azure SQL для Azure Data Studio предоставляет возможности для оценки, получения правильных рекомендаций Azure и миграции баз данных SQL Server в Azure.
zh_hans: Azure Data Studio 的 Azure SQL 迁移扩展提供评估、获取适当大小的 Azure 建议以及将 SQL Server 数据库迁移到 Azure 的功能。
zh_hant: Azure Data Studio 的 Azure SQL 移轉擴充功能提供評估、取得正確大小的 Azure 建議，以及將 SQL Server 資料庫移轉至 Azure 的功能。

# sql.migration.sqldb.not.ready
source: The SQL database server '{0}' is unavailable for migration because it is currently in the '{1}' state. To continue, select an available SQL database server.
de: Der SQL-Datenbank-Server „{0}“ ist für die Migration nicht verfügbar, da er sich derzeit im Zustand „{1}“ befindet. Wählen Sie einen verfügbaren SQL-Datenbank-Server aus, um fortzufahren.
es: El servidor de SQL Database "{0}" no está disponible para la migración porque actualmente se encuentra en el estado "{1}". Para continuar, seleccione un servidor de base de datos SQL disponible.
fr: Le serveur de base de données langage SQL '{0}' n'est pas disponible pour la migration car il est actuellement à l'état '{1}'. Pour continuer, sélectionnez un serveur de base de données langage SQL disponible.
ja: SQL データベース サーバー '{0}' は現在 '{1}' 状態であるため、移行できません。続行するには、使用可能な SQL データベース サーバーを選択します。
ko: SQL 데이터베이스 서버 '{0}'은(는) 현재 '{1}' 상태이므로 마이그레이션에 사용할 수 없습니다. 계속하려면 사용 가능한 SQL 데이터베이스 서버를 선택합니다.
pt_br: O servidor de banco de dados SQL '{0}' não está disponível para migração porque atualmente está no estado '{1}'. Para continuar, selecione um servidor de banco de dados SQL disponível.
ru: Сервер базы данных SQL "{0}" недоступен для миграции, поскольку сейчас он находится в состоянии "{1}". Чтобы продолжить, выберите доступный сервер базы данных SQL.
zh_hans: SQL 数据库服务器“{0}”不可用于迁移，因为它当前处于“{1}”状态。如果要继续，请选择可用的 SQL 数据库服务器。
zh_hant: SQL Database 伺服器 '{0}' 無法用於移轉，因為它目前處於'{1}'狀態。若要繼續，請選取可用的 SQL Database 伺服器。

# sql.migration.assessment.failed
source: The assessment of your SQL Server instance '{0}' failed.
de: Bei der Bewertung Ihrer SQL Server-Instanz „{0}“ ist ein Fehler aufgetreten.
es: Error en la evaluación de la instancia de SQL Server '{0}.
fr: L’évaluation de votre instance de SQL Server « {0} » a échoué.
ja: SQL Server インスタンス '{0}' を評価できませんでした。
ko: SQL Server 인스턴스 '{0}'을(를) 평가하지 못했습니다.
pt_br: Falha na avaliação da sua instância do SQL Server '{0}'.
ru: Сбой оценки экземпляра SQL Server \"{0}\".
zh_hans: SQL Server 实例“{0}”的评估失败。
zh_hant: 評定您的 SQL Server 執行個體 '{0}' 失敗。

# sql.migration.database.migration.target.type.tool.tip
source: The azure resource target type [SQL Managed Instance, SQL Virtual Machine, SQL Database]
de: Der Azure-Ressourcenzieltyp [SQL Managed Instance, SQL-VM, SQL-Datenbank].
es: El tipo de destino del recurso de Azure [SQL Managed Instance, máquina virtual de SQL, SQL Database]
fr: Le type de cible de ressource Azure [SQL Managed Instance, SQL Virtual Machine, SQL Database]
ja: Azure リソース ターゲットの種類 [SQL Managed Instance、SQL 仮想マシン、SQL データベース]
ko: Azure 리소스 대상 유형 [SQL Managed Instance, SQL 가상 머신, SQL Database]
pt_br: O tipo de destino do recurso azure [SQL Managed Instance, SQL Virtual Machine, SQL Database]
ru: Целевой тип ресурса Azure [Управляемый экземпляр SQL, виртуальная машина SQL, База данных SQL]
zh_hans: Azure 资源目标类型 [SQL 托管实例、SQL 虚拟机、SQL 数据库]
zh_hant: Azure 資源目標型別 [SQL 受控執行個體，SQL 虛擬機器，SQL Database]

# sql.migration.database.status.tool.tip
source: The current status of the migration
de: Der aktuelle Status der Migration
es: Estado actual de la migración
fr: L'état actuel de la migration
ja: 移行の現在の状態
ko: 마이그레이션의 현재 상태
pt_br: O status atual da migração
ru: Текущее состояние миграции
zh_hans: 迁移的当前状态
zh_hant: 移轉目前的狀態

# sql.migration.cannot.start.cutover.error
source: The cutover process cannot start until all the migrations are done. To return the latest file status, refresh your browser window.
de: Der Cutover kann erst gestartet werden, wenn alle Migrationen abgeschlossen sind. Aktualisieren Sie das Browserfenster, um den aktuellen Dateistatus anzuzeigen.
es: El proceso de transición no se puede iniciar hasta que se realicen todas las migraciones. Para devolver el estado de archivo más reciente, actualice la ventana del explorador.
fr: Le processus de basculement ne peut pas démarrer tant que toutes les migrations n’ont pas été effectuées. Pour retourner le dernier état du fichier, actualisez la fenêtre de votre navigateur.
ja: すべての移行が完了するまで一括移行処理を開始できません。最新のファイル状態に戻るには、ブラウザー ウィンドウを更新します。
ko: 모든 마이그레이션이 완료될 때까지 컷오버 프로세스를 시작할 수 없습니다. 최신 파일 상태를 반환하려면 브라우저 창을 새로 고칩니다.
pt_br: O processo de substituição não pode ser iniciado até que todas as migrações sejam concluídos. Para retornar o último status do arquivo, atualize a janela do navegador.
ru: Процесс прямой миграции не может быть запущен, пока не будут завершены все процессы миграции. Чтобы узнать о последнем состоянии файла, обновите окно браузера.
zh_hans: 在完成所有迁移之前，无法启动直接转换进程。要返回最新文件状态，请刷新浏览器窗口。
zh_hant: 在所有移轉完成前，完全移轉程序無法啟動。若要傳回最新的檔案狀態，請重新整理瀏覽器視窗。

# sql.migration.non.readiness.description
source: The database is ready to migrate with {0} warnings.
de: Die Datenbank ist bereit für die Migration mit {0} Warnungen.
es: La base de datos está lista para migrarse con {0} advertencias.
fr: La base de données est prête à migrer avec {0} avertissements.
ja: データベースを移行する準備ができましたが、{0} 警告が表示されます。
ko: 데이터베이스가 {0}개 경고와 함께 마이그레이션할 준비가 되었습니다.
pt_br: O banco de dados está pronto para migrar com {0} avisos.
ru: База данных готова к миграции с {0} предупреждениями.
zh_hans: 数据库已准备好迁移，出现 {0} 警告。
zh_hant: 資料庫已準備好進行移轉，但出現 {0} 個警告。

# sql.migration.readiness.description
source: The database is ready to migrate.
de: Die Datenbank ist bereit für die Migration.
es: La base de datos está lista para migrarse.
fr: La base de données est prête à migrer.
ja: データベースを移行する準備ができました。
ko: 데이터베이스를 마이그레이션할 준비가 완료되었습니다.
pt_br: O banco de dados está pronto para migrar.
ru: База данных готова к миграции.
zh_hans: 数据库已准备好迁移。
zh_hant: 資料庫已準備好進行移轉。

# sql.migration.schema.assessment.warning.message
source: The detected issues shown below might fail the schema migration. Some of them might be entirely unsupported and the others might be partially supported in Azure SQL Database. Therefore, please review the assessment results and make sure all of the issues will not fail the schema migration. However, it is allowed to proceed the schema migration and Azure Database Migration Service will migrate the objects as possible as it can.
de: Die unten gezeigten erkannten Probleme können bei der Schemamigration fehlschlagen. Einige davon werden möglicherweise vollständig nicht unterstützt, während die anderen teilweise in Azure SQL-Datenbank unterstützt werden. Überprüfen Sie daher die Bewertungsergebnisse, und stellen Sie sicher, dass bei der Schemamigration keine Fehler auftreten. Es ist jedoch zulässig, die Schemamigration fortzusetzen, und Azure Database Migration Service die Objekte nach Möglichkeit migrieren.
es: Los problemas detectados que se muestran a continuación podrían producir un error en la migración del esquema. Es posible que algunas de ellas no sean totalmente compatibles y que las demás se admitan parcialmente en Azure SQL Database. Por lo tanto, revise los resultados de la evaluación y asegúrese de que todos los problemas no impedirán la migración del esquema. Sin embargo, se permite continuar con la migración del esquema y Azure Database Migration Service migrará los objetos lo más posible.
fr: Les problèmes détectés ci-dessous risquent d’entraîner l’échec de la migration du schéma. Certains d’entre eux ne sont peut-être pas entièrement pris en charge et les autres peuvent être partiellement pris en charge dans base de données Azure SQL. Par conséquent, passez en revue les résultats de l’évaluation et assurez-vous que tous les problèmes n’entraînent pas l’échec de la migration du schéma. Toutefois, il est autorisé à poursuivre la migration du schéma et Azure Database Migration Service migrera les objets aussi possible que possible.
ja: 次に示す検出された問題は、スキーマの移行に失敗する可能性があります。完全にサポートされていないものもあれば、Azure SQL Database で部分的にサポートされているものもあります。 そのため、評価結果を確認し、すべての問題がスキーマの移行に失敗しないことを確認してください。 ただし、スキーマの移行を続行することは許可されており、Azure Database Migration Service は可能な限りオブジェクトを移行します。
ko: 아래 표시된 감지된 문제로 인해 스키마 마이그레이션에 실패할 수 있습니다. Azure SQL Database에서 일부 항목은 완전히 지원되지 않을 수 있으며 일부는 부분적으로 지원될 수 있습니다. 따라서 평가 결과를 검토하고 모든 문제가 스키마 마이그레이션의 실패를 초래하지 않도록 확인하세요. 그러나 스키마 마이그레이션을 계속할 수는 있으며 Azure Database Migration Service는 개체를 가능한 한 최대로 마이그레이션합니다.
pt_br: Os problemas detectados mostrados abaixo podem falhar na migração do esquema. Alguns deles podem não ter suporte total e outros podem ter suporte parcial no Banco de Dados SQL do Azure. Portanto, examine os resultados da avaliação e certifique-se de que todos os problemas não falharão na migração do esquema. No entanto, é permitido prosseguir a migração do esquema e o Serviço de Migração de Banco de Dados do Azure irá migrar os objetos tanto quanto possível.
ru: Обнаруженные проблемы, указанные ниже, могут привести к сбою миграции схемы. Некоторые из них могут быть полностью неподдерживаемыми, а другие могут частично поддерживаться в Базе данных SQL Azure. Поэтому проверьте результаты оценки и убедитесь, что никакие проблемы не вызовут сбой миграции схемы. Однако можно продолжить миграцию схемы, и Azure Database Migration Service перенесет объекты так, как это возможно.
zh_hans: 下面显示的检测到的问题可能会导致架构迁移失败。其中一些可能完全不受支持，而其他的可能在 Azure SQL 数据库中部分受支持。 因此，请查看评估结果，并确保所有问题都不会导致架构迁移失败。 但是，它可以继续进行架构迁移，Azure 数据库迁移服务将尽可能地迁移对象。
zh_hant: 下列顯示所偵測到的問題可能無法進行結構描述移轉。在 Azure SQL Database 中，其中某些可能完全不支援，而其他則可能部分支援。 因此，請檢查評定結果，並確定所有問題都不會讓結構描述移轉失敗。 但會允許結構描述移轉繼續進行，而 Azure 資料庫移轉服務將盡可能移轉物件。

# sql.migration.database.migration.duration.tool.tip
source: The duration of the migration
de: Die Dauer der Migration
es: Duración de la migración
fr: Durée de la migration
ja: 移行の期間
ko: 마이그레이션 기간
pt_br: A duração da migração
ru: Длительность миграции
zh_hans: 迁移的持续时间
zh_hant: 移轉的持續時間

# sql.migration.database.migration.finish.time.tool.tip
source: The fininish time for the migration
de: Die Endzeit für die Migration
es: La hora de finalización de la migración
fr: L'heure de fin de la migration
ja: 移行の完了時刻
ko: 마이그레이션 종료 시간
pt_br: O tempo de término para a migração
ru: Время окончания миграции
zh_hans: 迁移的完成时间
zh_hant: 移轉的結束時間

# sql.migration.starting.migration.error
source: The following error has occurred while starting the certificate migration: '{0}'
de: Fehler beim Starten der Zertifikatmigration: "{0}"
es: Se ha producido el siguiente error al iniciar la migración del certificado: "{0}"
fr: L'erreur suivante s'est produite lors du démarrage de la migration du certificat : '{0}'
ja: 証明書の移行の開始中にエラーが発生しました: '{0}'
ko: 인증서 마이그레이션을 시작하는 동안 '{0}' 오류가 발생했습니다.
pt_br: Ocorreu o seguinte erro ao iniciar a migração de certificado: "{0}"
ru: Произошла следующая ошибка при запуске миграции сертификатов: "{0}"
zh_hans: 启动证书迁移时出现以下错误:“{0}”
zh_hant: 啟動憑證移轉時發生下列錯誤: '{0}'

# sql.migration.service.error.not.ready
source: The following error occurred while retrieving registration information for Azure Database Migration Service '{0}'. Please click refresh and try again. Error: '{1}'.
de: Fehler beim Abrufen der Registrierungsinformationen für Azure Database Migration Service '{0}'. Klicken Sie auf "Aktualisieren" und versuchen Sie es noch mal. Fehler: '{1}'.
es: Error al recuperar la información de registro de Azure Database Migration Service '{0}'. Haga clic en Actualizar e inténtelo de nuevo. Error: '{1}'.
fr: L’erreur suivante s’est produite lors de la récupération des informations d’inscription pour Azure Database Migration Service « {0} ». Cliquez sur Actualiser et réessayez. Erreur : « {1} ».
ja: Azure Database Migration Service '{0}' の登録情報の取得中に次のエラーが発生しました。[更新] をクリックして、もう一度お試しください。エラー: '{1}'。
ko: Azure Database Migration Service '{0}'에 대한 등록 정보를 검색하는 동안 다음 오류가 발생했습니다. 새로 고침을 클릭하고 다시 시도하세요. 오류: '{1}'.
pt_br: Ocorreu o seguinte erro ao recuperar informações de registro para o Serviço de Migração de Banco de Dados do Azure '{0}'. Clique em atualizar e tente novamente. Erro: '{1}'.
ru: При получении сведений о регистрации для Azure Database Migration Service "{0}" произошла следующая ошибка. Нажмите "Обновить" и повторите попытку. Ошибка: "{1}".
zh_hans: 检索 Azure 数据库迁移服务 "{0}" 的注册信息时出现以下错误。请单击“刷新”，然后重试。错误: "{1}"。
zh_hant: 擷取 Azure 資料移轉服務 '{0}' 的註冊資訊時發生下列錯誤。請按一下 [重新整理]，然後再試一次。錯誤: '{1}'。

# sql.migration.mi.not.ready
source: The managed instance '{0}' is unavailable for migration because it is currently in the '{1}' state. To continue, select an available managed instance.
de: Die verwaltete Instanz \"{0}\" ist für die Migration nicht verfügbar, weil sie sich derzeit im Zustand \"{1}\" befindet. Wählen Sie eine verfügbare verwaltete Instanz aus, um fortzufahren.
es: La instancia administrada \"{0}\" no está disponible para la migración porque actualmente se encuentra en el estado \"{1}\". Para continuar, seleccione una instancia administrada disponible.
fr: L’instance managée «{0}» n’est pas disponible pour la migration, car elle est actuellement dans l’état «{1}». Pour continuer, sélectionnez une instance managée disponible.
ja: マネージド インスタンス '{0}' は、現在 '{1}' 状態であるため、移行のために使用できません。続行するには、使用可能なマネージド インスタンスを選択してください。
ko: 관리되는 인스턴스 '{0}'은(는) 현재 '{1}' 상태이므로 마이그레이션에 사용할 수 없습니다. 계속하려면 사용 가능한 관리형 인스턴스를 선택합니다.
pt_br: A instância gerenciada '{0}' não está disponível para migração porque está atualmente no estado '{1}'. Para continuar, selecione uma instância gerenciada disponível.
ru: Управляемый экземпляр \"{0}\" недоступен для миграции, так как сейчас он находится в состоянии \"{1}\". Чтобы продолжить, выберите доступный управляемый экземпляр.
zh_hans: 托管实例 “{0}” 不可用于迁移，因为它当前处于 “{1}” 状态。若要继续，请选择可用的托管实例。
zh_hant: 受控執行個體 '{0}' 無法用於移轉，因為它目前處於 '{1}' 狀態。若要繼續，請選取可用的受控執行個體。

# sql.retry.migration.title
source: The migration failed with the following errors:
de: Die Migration ist mit folgendem Fehler fehlgeschlagen:
es: Error en la migración con los siguientes errores:
fr: La migration a échoué avec les erreurs suivantes :
ja: 次のエラーで移行に失敗しました。
ko: 다음 오류로 인해 마이그레이션하지 못했습니다.
pt_br: A migração falhou com os seguintes erros:
ru: Миграция завершилась сбоем со следующими ошибками:
zh_hans: 迁移失败，出现以下错误:
zh_hant: 移轉失敗，發生下列錯誤:

# sql.migration.database.migration.start.time.tool.tip
source: The start time for the migration
de: Die Startzeit für die Migration
es: La hora de inicio de la migración
fr: L'heure de début de la migration
ja: 移行の開始時刻
ko: 마이그레이션 시작 시간
pt_br: A hora de início da migração
ru: Время начала миграции
zh_hans: 迁移开始时间
zh_hant: 移轉的開始時間

# sql.migration.database.migration.target.instance.database.name.tool.tip
source: The target database name
de: Der Name der Zieldatenbank
es: El nombre de la base de datos de destino
fr: Le nom de la base de données cible
ja: ターゲット データベース名
ko: 대상 데이터베이스 이름
pt_br: O nome do banco de dados de destino
ru: Имя целевой базы данных
zh_hans: 目标数据库名称
zh_hant: 目標資料庫名稱

# sql.migration.database.migration.target.instance.server.name.tool.tip
source: The target server name
de: Der Zielservername
es: El nombre del servidor de destino
fr: Le nom du serveur cible
ja: ターゲット サーバー名
ko: 대상 서버 이름
pt_br: O nome do servidor de destino
ru: Имя целевого сервера
zh_hans: 目标服务器名称
zh_hant: 目標伺服器名稱

# sql.migration.vm.not.ready.iaas.extension
source: The virtual machine '{0}' is unavailable for migration because the SQL Server IaaS Agent extension is currently in '{1}' mode instead of Full mode. Learn more: https://aka.ms/sql-iaas-extension
de: Der virtuelle Computer "{0}" ist für die Migration nicht verfügbar, da sich die SQL Server-IaaS-Agent-Erweiterung zurzeit im Modus "{1}" statt im Modus "Vollständig" befindet. Weitere Informationen: https://aka.ms/sql-iaas-extension
es: La máquina virtual '{0}' no está disponible para la migración porque la extensión del agente de IaaS de SQL Server está actualmente en modo '{1}' en lugar de en modo completo. Más información: https://aka.ms/sql-iaas-extension
fr: La machine virtuelle « {0} » n’est pas disponible pour la migration, car l’extension Agent IaaS SQL Server est actuellement en mode « {1} » au lieu du Mode complet. En savoir plus : https://aka.ms/sql-iaas-extension
ja: SQL Server IaaS エージェント拡張機能が現在フル モードではなく '{1}' モードであるため、仮想マシン '{0}' を移行できません。詳細情報: https://aka.ms/sql-iaas-extension
ko: SQL Server IaaS 에이전트 확장이 현재 전체 모드가 아닌 '{1}' 모드에 있으므로 가상 머신 ‘{0}’ 마이그레이션에 사용할 수 없습니다. 자세한 정보: https://aka.ms/sql-iaas-extension
pt_br: A máquina virtual “{0}” está indisponível para migração porque a extensão do Agente IaaS do SQL Server está atualmente no modo “{1}” em vez do modo Completo. Saiba mais: https://aka.ms/sql-iaas-extension
ru: Виртуальная машина "{0}" недоступна для миграции, так как расширение агента IaaS SQL Server сейчас находится в режиме "{1}", а не в полном режиме. Подробнее: https://aka.ms/sql-iaas-extension
zh_hans: 虚拟机“{0}”不可用于迁移，因为 SQL Server IaaS 代理扩展当前处于“{1}”模式，而不是“完整”模式。了解详细信息: https://aka.ms/sql-iaas-extension
zh_hant: 虛擬機器 '{0}' 無法移轉，因為 SQL Server IaaS 代理程式延伸項目目前處於 '{1}' 模式，而不是完整模式。深入了解: https://aka.ms/sql-iaas-extension

# sql.migration.vm.not.ready.power.state
source: The virtual machine '{0}' is unavailable for migration because the underlying virtual machine is not running. Please make sure it is powered on before retrying.
de: Der virtuelle Computer "{0}" ist für die Migration nicht verfügbar, da der zugrunde liegende virtuelle Computer nicht ausgeführt wird. Stellen Sie sicher, dass er eingeschaltet ist, bevor Sie es noch mal versuchen.
es: La máquina virtual '{0}' no está disponible para la migración porque la máquina virtual subyacente no se está ejecutando. Asegúrese de que esté encendida antes de volver a intentarlo.
fr: L’ordinateur virtuel « {0} » n’est pas disponible pour la migration, car l’ordinateur virtuel sous-jacent n’est pas en cours d’exécution. Vérifiez qu’il est sous tension avant de réessayer.
ja: 仮想マシン '{0}' は、基になる仮想マシンが実行されていないため、移行に使用できません。再試行する前に、電源がオンになっていることを確認してください。
ko: 기본 가상 머신이 실행되고 있지 않으므로 가상 머신 '{0}'을 마이그레이션에 사용할 수 없습니다. 다시 시도하기 전에 전원이 켜져 있는지 확인하세요.
pt_br: A máquina virtual “{0}” está indisponível para migração porque a máquina virtual subjacente não está em execução. Verifique se ele está ligado antes de tentar novamente.
ru: Виртуальная машина "{0}" недоступна для миграции, так как базовая виртуальная машина не запущена. Перед повторной попыткой убедитесь, что она включена.
zh_hans: 虚拟机“{0}”不可用于迁移，因为基础虚拟机未运行。请确保它已开机，然后重试。
zh_hant: 虛擬機器 '{0}' 無法用於移轉，因為基礎虛擬機器未執行。請確定電源已開啟，然後再試一次。

# sql.migration.blob.storage.folder.warning
source: There are multiple databases with the same backup location selected. Ensure that backup files from different databases are stored in separate folders.
de: Es sind mehrere Datenbanken mit demselben Sicherungsort ausgewählt. Stellen Sie sicher, dass Sicherungsdateien aus verschiedenen Datenbanken in separaten Ordnern gespeichert sind.
es: Hay varias bases de datos con la misma ubicación de copia de seguridad seleccionada. Asegúrese de que los archivos de copia de seguridad de diferentes bases de datos se almacenan en carpetas independientes.
fr: Il existe plusieurs bases de données avec le même emplacement de sauvegarde sélectionné. Assurez-vous que les fichiers de sauvegarde de différentes bases de données sont stockés dans des dossiers séparés.
ja: 複数のデータベースについて同じバックアップの場所が選択されています。異なるデータベースのバックアップ ファイルは必ず異なるフォルダーに保存してください。
ko: 동일한 백업 위치를 선택한 데이터베이스가 여러 개 있습니다. 서로 다른 데이터베이스의 백업 파일이 별도의 폴더에 저장되어 있는지 확인하세요.
pt_br: Existem vários bancos de dados com o mesmo local de backup selecionado. Certifique-se de que os arquivos de backup de diferentes bancos de dados sejam armazenados em pastas separadas.
ru: Выбрано несколько баз данных с одинаковым расположением резервной копии. Убедитесь, что файлы резервных копий из разных баз данных хранятся в отдельных папках.
zh_hans: 选择了多个具有相同备份位置的数据库。请确保不同数据库中的备份文件存储在单独的文件夹中。
zh_hant: 已選取多個具有相同備份位置的資料庫。請確認來自不同資料庫的備份檔案儲存在不同的資料夾中。

# sql.migration.pre.req.title
source: Things you need before starting your Azure SQL migration:
de: Dinge, die Sie benötigen, bevor Sie ihre Azure SQL-Migration starten:
es: Cosas que necesita antes de iniciar la migración de Azure SQL:
fr: Éléments dont vous avez besoin avant de commencer votre migration Azure SQL :
ja: Azure SQL 移行を開始する前に必要なもの:
ko: Azure SQL 마이그레이션을 시작하기 전에 필요한 사항:
pt_br: Coisas de que você precisa antes de iniciar a migração do SQL do Azure:
ru: Что необходимо перед началом миграции Azure SQL:
zh_hans: 开始 Azure SQL 迁移之前的必需项:
zh_hant: 開始 Azure SQL 移轉之前所需的項目:
