Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.query-history.*.xlf
Languages: de, es, it, ja, ko, ru, zh_hans, zh_hant

# errorLoading
source: Error loading saved query history items. {0}
de: Fehler beim Laden gespeicherter Abfrageverlaufselemente. {0}
es: Error al cargar los elementos del historial de consultas guardadas. {0}
it: Errore durante il caricamento degli elementi della cronologia delle query salvate. {0}
ja: 保存されたクエリ履歴項目の読み込み中にエラーが発生しました。{0}
ko: 저장된 쿼리 기록 항목을 로드하는 동안 오류가 발생했습니다. {0}
ru: Ошибка при загрузке сохраненных элементов журнала запросов. {0}
zh_hans: 加载保存的查询历史记录项时出错。{0}
zh_hant: 載入儲存的查詢歷程記錄項目時發生錯誤。{0}

source: Failed
de: Fehlerhaft
es: Error
it: Non riuscita
ja: 失敗
ko: 실패
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

source: Succeeded
de: Erfolgreich
es: Correcto
it: Operazione riuscita
ja: 成功
ko: 성공
ru: Выполнено
zh_hans: 成功
zh_hant: 已成功

# queryHistory.clear
source: Clear All History
de: Gesamten Verlauf löschen
es: Borrar todo el historial
it: Cancella tutta la cronologia
ja: すべての履歴をクリア
ko: 모든 기록 지우기
ru: Очистить весь журнал
zh_hans: 清除所有历史记录
zh_hant: 清除所有歷史記錄

# queryHistory.delete
source: Delete
de: Löschen
es: Eliminar
it: Elimina
ja: 削除
ko: 삭제
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# queryHistory.loading
source: Loading saved entries...
de: Gespeicherte Einträge werden geladen...
es: Cargando entradas guardadas...
it: Caricamento delle voci salvate...
ja: 保存されたエントリを読み込んでいます...
ko: 저장된 항목을 로드하는 중...
ru: Загрузка сохраненных записей...
zh_hans: 正在加载已保存的条目...
zh_hant: 正在載入已儲存的項目...

# queryHistory.maxEntries
source: Maximum number of entries to store. 0 means unlimited entries are stored. Increasing this limit may impact performance, especially if persistence is enabled.
de: Maximale Anzahl der zu speichernden Einträge. 0 (Null) bedeutet, dass unbegrenzte Einträge gespeichert werden. Das Erhöhen dieses Grenzwerts kann sich auf die Leistung auswirken, insbesondere dann, wenn Persistenz aktiviert ist.
es: Número máximo de entradas que se van a almacenar. 0 significa que se almacenan entradas ilimitadas. Aumentar este límite puede afectar al rendimiento, especialmente si la persistencia está habilitada.
it: Numero massimo di voci da memorizzare. 0 significa che le voci vengono memorizzate illimitatamente. L'aumento del limite può influire sulle prestazioni, soprattutto se la persistenza è abilitata.
ja: 格納するエントリの最大数。0 は、無制限のエントリが格納されていることを意味します。この制限を大きくすると、特に永続化が有効になっている場合、パフォーマンスに影響を与える可能性があります。
ko: 저장할 최대 항목 수입니다. 0은 무제한 항목이 저장됨을 의미합니다. 이 제한을 늘리면 성능에 영향을 미칠 수 있습니다. 특히 지속성을 사용하는 경우 그렇습니다.
ru: Максимальное число записей для хранения. 0 означает, что хранится неограниченное число записей. Увеличение этого ограничения может повлиять на производительность, особенно если включена сохраняемость.
zh_hans: 要存储的最大条目数。0 表示存储无限条目。增加此上限可能会影响性能，尤其是在启用持久性的情况下。
zh_hant: 要儲存的項目數上限。0 表示儲存無限制的項目。提高此限制可能會影響效能，特別是啟用持續性時。

# queryHistory.noEntries
source: No queries to display
de: Keine anzuzeigenden Abfragen vorhanden
es: No hay consultas que mostrar
it: Nessuna query da visualizzare
ja: 表示するクエリはありません
ko: 표시할 쿼리 없음
ru: Нет запросов для отображения
zh_hans: 没有要显示的查询
zh_hant: 沒有可顯示的查詢

# queryHistory.open
source: Open Query
de: Abfrage öffnen
es: Abrir consulta
it: Apri query
ja: クエリを開く
ko: 쿼리 열기
ru: Открыть запрос
zh_hans: 打开查询
zh_hant: 開啟查詢

# queryHistory.doubleClickAction.run
source: Open a new connected editor with the query and connection from the selected history item and automatically run the query
de: Öffnen eines neuen verbundenen Editors mit der Abfrage und der Verbindung aus dem ausgewählten Verlaufselement, und automatisches Ausführen der Abfrage
es: Abrir un nuevo editor conectado con la consulta y la conexión desde el elemento de historial seleccionado y ejecute automáticamente la consulta.
it: Aprire un nuovo editor connesso con la query e la connessione dall'elemento della cronologia selezionato ed eseguire automaticamente la query
ja: クエリーと選択した履歴項目からの接続を使用して新しい接続されたエディターを開き、クエリを自動的に実行します
ko: 선택한 기록 항목에서 쿼리 및 연결을 사용하여 연결된 새 편집기를 열고 쿼리를 자동으로 실행
ru: Открыть новый подключенный редактор с запросом и подключением из выбранного элемента журнала, автоматически выполнить запрос
zh_hans: 使用所选历史记录项中的查询和连接打开新的连接编辑器，并自动运行查询
zh_hant: 從選取的歷程記錄項目開啟具有查詢和連線的新連接編輯器，並自動執行查詢

# queryHistory.doubleClickAction.open
source: Open a new disconnected editor with the query from the selected history item
de: Öffnen eines neuen getrennten Editors mit der Abfrage aus dem ausgewählten Verlaufselement
es: Abrir un nuevo editor desconectado con la consulta del elemento de historial seleccionado
it: Aprire un nuovo editor disconnesso con la query dall'elemento della cronologia selezionato
ja: 選択した履歴項目のクエリを使用して、切断された新しいエディターを開きます
ko: 선택한 기록 항목의 쿼리로 연결이 끊긴 새 편집기 열기
ru: Открыть новый отключенный редактор с запросом из выбранного элемента журнала
zh_hans: 使用所选历史记录项中的查询打开新的断开连接的编辑器
zh_hant: 使用來自所選歷程記錄項目的查詢，開啟新的已中斷連線的編輯器

# queryHistory.openStorageFolder
source: Open storage folder
de: Speicherordner öffnen
es: Abrir carpeta de almacenamiento
it: Apri cartella di archiviazione
ja: ストレージ フォルダーを開く
ko: 저장소 폴더 열기
ru: Открыть папку хранилища
zh_hans: 打开存储文件夹
zh_hant: 開啟儲存資料夾

# queryHistory.disableCapture
source: Pause Query History Capture
de: Erfassung des Abfrageverlaufs anhalten
es: Pausar la captura del historial de consultas
it: Sospendi acquisizione della cronologia delle query
ja: Query History キャプチャの一時停止
ko: 쿼리 기록 캡처 일시 중지
ru: Приостановить ведение Журнала запросов
zh_hans: 暂停查询历史记录捕获
zh_hant: 暫停查詢歷史記錄擷取

# queryHistory.displayName
source: Query History
de: Abfrageverlauf
es: Historial de consultas
it: Cronologia delle query
ko: 쿼리 기록
ru: Журнал запросов
zh_hans: 查询历史记录
zh_hant: 查詢歷史記錄

# queryHistory.run
source: Run Query
de: Abfrage ausführen
es: Ejecutar consulta
it: Esegui query
ja: クエリの実行
ko: 쿼리 실행
ru: Запуск запроса
zh_hans: 运行查询
zh_hant: 執行查詢

# queryHistory.enableCapture
source: Start Query History Capture
de: Erfassung des Abfrageverlaufs starten
es: Iniciar la captura del historial de consultas
it: Avvia acquisizione della cronologia delle query
ja: Query History キャプチャの開始
ko: 쿼리 기록 캡처 시작
ru: Начать ведение Журнала запросов
zh_hans: 开始查询历史记录捕获
zh_hant: 開始查詢歷史記錄擷取

# queryHistory.doubleClickAction
source: The action taken when a history item is double clicked
de: Die Aktion, die ausgeführt wird, wenn auf ein Verlaufselement doppelt geklickt wird
es: Acción realizada cuando se hace doble clic en un elemento del historial
it: Azione eseguita quando si fa doppio clic su un elemento della cronologia
ja: 履歴項目がダブルクリックされたときに実行されるアクション
ko: 기록 항목을 두 번 클릭할 때 수행되는 작업
ru: Действие при двойном щелчке элемента журнала
zh_hans: 双击历史记录项时执行的操作
zh_hant: 按兩下歷程記錄項目時採取的動作

# queryHistory.description
source: View and run previously executed queries
de: Zuvor ausgeführte Abfragen anzeigen und ausführen
es: Ver y ejecutar consultas ejecutadas previamente
it: Visualizza ed esegue query eseguite in precedenza
ja: 以前に実行したクエリを表示して実行します
ko: 이전에 실행한 쿼리 보기 및 실행
ru: Просмотр и запуск ранее выполненных запросов
zh_hans: 查看并运行以前执行的查询
zh_hant: 檢視及執行先前執行的查詢

# queryHistory.captureEnabledDesc
source: Whether Query History capture is enabled. If false queries executed will not be captured.
de: Gibt an, ob die Erfassung des Abfrageverlaufs aktiviert ist. Bei Festlegung auf FALSE werden ausgeführte Abfragen nicht erfasst.
es: Si la captura del historial de consultas está habilitada. De no ser así, las consultas ejecutadas no se capturarán.
it: Indica se l'acquisizione della cronologia delle query è abilitata. Se è false, le query eseguite non verranno acquisite.
ja: Query History キャプチャが有効かどうか。false の場合、実行されたクエリはキャプチャされません。
ko: 쿼리 기록 캡처가 사용하도록 설정되어 있는지 여부입니다. false이면 실행된 쿼리가 캡처되지 않습니다.
ru: Включено ли ведение Журнала запросов. Если этот параметр имеет значение False, выполняемые запросы не будут записываться в истории.
zh_hans: 是否启用查询历史记录捕获。若为 false，则不捕获所执行的查询。
zh_hant: 是否啟用了查詢歷史記錄擷取。若未啟用，將不會擷取已經執行的查詢。

# queryHistory.persistHistory
source: Whether query history is persisted across restarts. If false then the history will be cleared when the application exits.
de: Gibt an, ob der Abfrageverlauf bei Neustarts beibehalten wird. FALSCH gibt an, dass der Verlauf beim Beenden der Anwendung gelöscht wird.
es: Si el historial de consultas se conserva entre reinicios. Si es false, el historial se borrará cuando se cierre la aplicación.
it: Indica se la cronologia delle query viene mantenuta tra i riavvii. Se false, la cronologia verrà cancellata alla chiusura dell'applicazione.
ja: クエリ履歴が再起動間で保持されるかどうか。false の場合、アプリケーションの終了時に履歴がクリアされます。
ko: 다시 시작할 때 쿼리 기록이 유지되는지 여부입니다. false이면 애플리케이션이 종료될 때 기록이 지워집니다.
ru: Сохраняется ли история запросов при перезапусках. Если ЛОЖЬ, то журнал будет очищен при выходе из приложения.
zh_hans: 查询历史记录是否在重新启动时保留。如果为 false，则在应用程序退出时清除历史记录。
zh_hant: 查詢歷程記錄是否在重新啟動時保存。如果為 false，則會在應用程式結束時清除歷程記錄。
