Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.schema.migration.windows.auth.error
source: Schema migration is not currently supported for connectivity to source instance using Windows Authentication. Please use SQL Authentication to enable schema migration support.
de: Die Schemamigration wird derzeit für Konnektivität mit der Quellinstanz mit Windows-Authentifizierung nicht unterstützt. Verwenden Sie die SQL-Authentifizierung, um die Unterstützung für die Schemamigration zu aktivieren.
es: Actualmente, no se admite la migración de esquemas para la conectividad para la instancia de origen que usan la autenticación de Windows. Use la autenticación de SQL para habilitar la compatibilidad con la migración de esquemas.
fr: La migration de schéma n’est actuellement pas prise en charge pour la connectivité à l’instance source utilisant l’Authentification Windows. Utilisez l’authentification SQL pour activer la prise en charge de la migration de schéma.
ja: スキーマの移行は、Windows 認証を使用するソース インスタンスへの接続では現在サポートされていません。スキーマ移行のサポートを有効にするには、SQL 認証を使用してください。
ko: 스키마 마이그레이션은 현재 Windows 인증을 사용하여 원본 인스턴스에 연결할 수 없습니다. SQL 인증을 사용하여 스키마 마이그레이션 지원을 사용하세요.
pt_br: Atualmente, não há suporte para a migração de esquema para conectividade com a instância de origem usando a Autenticação do Windows. Use a Autenticação SQL para habilitar o suporte à migração de esquema.
ru: Миграция схемы сейчас не поддерживается для подключения к исходному экземпляру с использованием проверки подлинности Windows. Используйте проверку подлинности SQL, чтобы включить поддержку миграции схемы.
zh_hans: 使用 Windows 身份验证的源实例连接当前不支持架构迁移。请使用 SQL 身份验证启用架构迁移支持。
zh_hant: 使用 Windows 驗證與來源執行個體的連線能力目前不支援結構描述移轉。請使用 SQL 驗證來啟用結構描述移轉支援。

# sql.schema.migration.update.ir.version.error
source: Schema migration requires an Integration Runtime version of [{0}] or higher. The current node version(s) are: [{1}]. Please install a newer version of the Integration Runtime to enable schema migration support.
de: Die Schemamigration erfordert eine Integration Runtime-Version von [{0}] oder höher. Die aktuellen Knotenversionen sind: [{1}]. Installieren Sie eine neuere Version der Integration Runtime, um die Unterstützung für die Schemamigration zu aktivieren.
es: La migración de esquema requiere una versión Integration Runtime de [{0}] o posterior. Las versiones de nodo actuales son: [{1}]. Instale una versión más reciente del Integration Runtime para habilitar la compatibilidad con la migración de esquemas.
fr: La migration de schéma nécessite une version Integration Runtime de [{0}] ou ultérieure. La ou les versions actuelles du nœud sont les suivantes : [{1}]. Installez une version plus récente d’Integration Runtime pour activer la prise en charge de la migration de schéma.
ja: スキーマの移行には、[{0}] 以上の Integration Runtime バージョンが必要です。現在のノード バージョンは [{1}] です。スキーマ移行サポートを有効にするには、新しいバージョンの Integration Runtime をインストールしてください。
ko: 스키마 마이그레이션에는 [{0}] 이상의 Integration Runtime 버전이 필요합니다. 현재 노드 버전은 [{1}]입니다. 스키마 마이그레이션 지원을 사용하도록 설정하려면 최신 버전의 Integration Runtime을 설치하세요.
pt_br: A migração de esquema requer uma versão [{0}] do Integration Runtime ou superior. As versões atuais do nó são: [{1}]. Instale uma versão mais recente do Integration Runtime para habilitar o suporte à migração de esquema.
ru: Для миграции схемы требуется Integration Runtime версии [{0}] или более поздней. Текущие версии узлов: [{1}]. Установите более новую версию Integration Runtime, чтобы включить поддержку миграции схемы.
zh_hans: 架构迁移需要 Integration Runtime 版本为 [{0}] 或更高版本。当前节点版本为: [{1}]。请安装更新版本的 Integration Runtime 以启用架构迁移支持。
zh_hant: 結構描述移轉需要 Integration Runtime 版本 [{0}] 或更新的版本。目前的節點版本為: [{1}]。請安裝較新版本的 Integration Runtime，以啟用結構描述移轉支援。

# sql.migration.schema.status
source: Schema migration status
de: Schemamigrationsstatus
es: Estado de la migración del esquema
fr: État de la migration de schéma
ja: スキーマの移行の状態
ko: 스키마 마이그레이션 상태
pt_br: Status de migração de esquema
ru: Состояние миграции схемы
zh_hans: 架构迁移状态
zh_hant: 結構描述移轉狀態

# sql.migration.schema.only
source: Schema only
de: Nur Schema
es: Solo esquema
fr: Schéma uniquement
ja: スキーマのみ
ko: 스키마만
pt_br: Somente esquema
ru: Только схема
zh_hans: 仅限架构
zh_hant: 僅限結構描述

# sql.migration.schema.no.missing
source: Schema was found on target. Schema migration is not required.
de: Das Schema wurde auf dem Ziel gefunden. Die Schemamigration ist nicht erforderlich.
es: Se ha encontrado el esquema en el objetivo. No es necesario migrar el esquema.
fr: Schéma trouvé sur la cible. La migration de schéma n’est pas requise.
ja: ターゲットでスキーマが見つかりました。スキーマの移行は必要ありません。
ko: 대상에서 스키마를 찾았습니다. 스키마 마이그레이션은 필요하지 않습니다.
pt_br: Esquema encontrado no destino. A migração de esquema não é necessária.
ru: Схема найдена в целевом объекте. Перенос схемы не требуется.
zh_hans: 在目标上找到架构。不需要架构迁移。
zh_hant: 在目標上找到架構。不需要架構移轉。

# sql.migration.schema.script.deployment
source: Script deployment
de: Skriptbereitstellung
es: Implementación de script
fr: Déploiement de script
ja: スクリプトのデプロイ
ko: 스크립트 배포
pt_br: Implantação de script
ru: Развертывание скрипта
zh_hans: 脚本部署
zh_hant: 指令碼部署

# sql.migration.schema.script.generation
source: Script generation
de: Skriptgenerierung
es: Generación de scripts
fr: Génération de script
ja: スクリプトの生成
ko: 스크립트 생성
pt_br: Geração de script
ru: Создание скрипта
zh_hans: 脚本生成
zh_hant: 指令碼產生

# sql.migration.schema.script.count
source: Scripted objects count
de: Anzahl skriptgesteuerter Objekte
es: Recuento de objetos generados por script
fr: Nombre d’objets scriptés
ja: スクリプト化されたオブジェクトの数
ko: 스크립팅된 개체 수
pt_br: Contagem de objetos com script
ru: Количество объектов со скриптами
zh_hans: 脚本对象计数
zh_hant: 已編寫指令碼的物件計數

# sql.migration.schema.script.ended
source: Scripting ended
de: Skripterstellung beendet
es: Fin del scripting
fr: Script terminé
ja: スクリプトが終了しました
ko: 스크립팅 종료됨
pt_br: O script terminou
ru: Написание скриптов завершено
zh_hans: 脚本编写已结束
zh_hant: 編寫指令碼已結束

# sql.migration.schema.script.fail.count
source: Scripting error count
de: Anzahl von Skriptfehlern
es: Recuento de errores de scripting
fr: Nombre d’erreurs de script
ja: スクリプトのエラー数
ko: 스크립팅 오류 수
pt_br: Contagem de erros de script
ru: Количество ошибок написания скриптов
zh_hans: 脚本错误计数
zh_hant: 編寫指令碼錯誤計數

# sql.migration.status.scriptindexes
source: Scripting indexes
de: Skripterstellung für Indizes
es: Índices de scripting
fr: Index de script
ja: インデックスのスクリプト作成
ko: 인덱스 스크립팅
pt_br: Índices de script
ru: Индексы написания скриптов
zh_hans: 脚本索引
zh_hant: 編寫指令碼索引

# sql.migration.status.scriptobjects
source: Scripting objects
de: Skripterstellung für Objekte
es: Objetos de scripting
fr: Générer un script pour objets
ja: オブジェクトのスクリプトを作成しています
ko: 개체 스크립팅
pt_br: Objetos de script
ru: Написание скриптов объектов
zh_hans: 编写对象脚本
zh_hant: 編寫指令碼物件

# sql.migration.status.scriptownership
source: Scripting ownerships
de: Skriptbesitz
es: Propiedad de scripting
fr: Script des propriétés
ja: スクリプティング所有権
ko: 소유권 스크립팅
pt_br: Propriedades de script
ru: Владение написанием скриптов
zh_hans: 脚本所有权
zh_hant: 編寫指令碼擁有權

# sql.migration.schema.script.started
source: Scripting started
de: Skripterstellung gestartet
es: Scripting iniciado
fr: Script démarré
ja: スクリプトを開始しました
ko: 스크립팅 시작됨
pt_br: Script iniciado
ru: Начато написание скриптов
zh_hans: 脚本已启动
zh_hant: 編寫指令碼已開始

# sql.migration.search
source: Search
de: Suchen
es: Buscar
fr: Recherche
ja: 検索
ko: 검색
pt_br: Pesquisar
ru: Поиск
zh_hans: 搜索
zh_hant: 搜尋

# sql.migration.restore.status.searching.backups
source: Searching backups
de: Sicherungen werden durchsucht
es: Buscando copias de seguridad
fr: Recherche des sauvegardes
ja: バックアップの検索
ko: 백업 검색 중
pt_br: Pesquisando backups
ru: Поиск резервных копий
zh_hans: 正在搜索备份
zh_hant: 正在搜尋備份

# sql.migration.wizard.troubleshooting
source: See link for more troubleshooting steps: https://aka.ms/dms-migrations-troubleshooting.
de: Weitere Schritte zur Problembehandlung finden Sie unter folgendem Link: https://aka.ms/dms-migrations-troubleshooting.
es: Consulte el vínculo para obtener más pasos de solución de problemas: https://aka.ms/dms-migrations-troubleshooting.
fr: Consultez le lien pour plus d’étapes de dépannage : https://aka.ms/dms-migrations-troubleshooting.
ja: 詳細なトラブルシューティング手順については、https://aka.ms/dms-migrations-troubleshooting のリンクを参照してください。
ko: 자세한 문제 해결 단계는 링크: https://aka.ms/dms-migrations-troubleshooting을 참조하세요.
pt_br: Confira o link para obter mais etapas de solução de problemas: https://aka.ms/dms-migrations-troubleshooting.
ru: Дополнительные действия по устранению неполадок см. по ссылке: https://aka.ms/dms-migrations-troubleshooting.
zh_hans: 有关更多故障排除步骤，请参阅链接: https://aka.ms/dms-migrations-troubleshooting。
zh_hant: 如需更多疑難排解步驟，請參閱連結: https://aka.ms/dms-migrations-troubleshooting。

# sql.migration.select
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

# sql.migration.select.storage.account.title
source: Select Azure Storage Account
zh_hans: 选择 Azure 存储帐户

# sql.migration.select.service.title
source: Select Database Migration Service
de: Database Migration Service auswählen
es: Seleccionar Database Migration Service
fr: Sélectionner Database Migration Service
ja: Database Migration Service の選択
ko: Database Migration Service 선택
pt_br: Selecionar o Serviço de Migração de Banco de Dados
ru: Выбрать службу миграции баз данных
zh_hans: 选择数据库迁移服务
zh_hant: 選取資料庫移轉服務

# sql.migration.select.service.prompt
source: Select a Database Migration Service
de: Database Migration Service auswählen
es: Seleccionar Database Migration Service
fr: Sélectionner un Database Migration Service
ja: Database Migration Service の選択
ko: Database Migration Service 선택
pt_br: Selecionar um Serviço de Migração de Banco de Dados
ru: Выберите службу Database Migration Service
zh_hans: 选择一项数据库迁移服务
zh_hant: 選取資料庫移轉服務

# sql.migration.select.service.select.a.service
source: Select a Database Migration Service
de: Database Migration Service auswählen
es: Seleccionar Database Migration Service
fr: Sélectionner un Database Migration Service
ja: Database Migration Service の選択
ko: Database Migration Service 선택
pt_br: Selecionar um Serviço de Migração de Banco de Dados
ru: Выберите службу Database Migration Service
zh_hans: 选择一项数据库迁移服务
zh_hant: 選取資料庫移轉服務

# sql.migration.invalid.migration.service.offline.error
source: Select a Database Migration Service that is connected to a node.
de: Wählen Sie einen Database Migration Service aus, der mit einem Knoten verbunden ist.
es: Seleccione un Database Migration Service que esté conectado a un nodo.
fr: Sélectionnez un Database Migration Service connecté à un nœud.
ja: ノードに接続された Database Migration Service を選択します。
ko: 노드에 연결된 Database Migration Service를 선택합니다.
pt_br: Selecione um Serviço de Migração de Banco de Dados que esteja conectado a um nó.
ru: Выберите службу Database Migration Service, подключенную к какому-либо узлу.
zh_hans: 选择连接到节点的数据库迁移服务。
zh_hant: 選取連線到節點的資料庫移轉服務。

# sql.migration.status.select.service.MESSAGE
source: Select a Database Migration Service to monitor migrations.
de: Wählen Sie eine Database Migration Service aus, um Migrationen zu überwachen.
es: Seleccionar Database Migration Service para supervisar las migraciones.
fr: Sélectionnez un Database Migration Service pour surveiller les migrations.
ja: 移行を監視する Database Migration Service を選択します。
ko: 마이그레이션을 모니터링할 Database Migration Service를 선택하세요.
pt_br: Selecione um Serviço de Migração de Banco de Dados para monitorar as migrações.
ru: Выберите службу Database Migration Service для отслеживания миграций.
zh_hans: 选择一项数据库迁移服务来监视迁移。
zh_hant: 選取要監視移轉的資料庫移轉服務。

# sql.migration.select.storage.select.a.storage.account
source: Select a Storage Account
zh_hans: 选择存储帐户

# sql.migration.blob.container.select
source: Select a blob container value first.
de: Wählen Sie zuerst einen BLOB-Containerwert aus.
es: Seleccione primero un valor de contenedor de blobs.
fr: Sélectionnez d’abord une valeur de conteneur d’objets Blob.
ja: 最初に BLOB コンテナーの値を選択します。
ko: 먼저 Blob 컨테이너 값을 선택합니다.
pt_br: Selecione um valor de contêiner blob primeiro.
ru: Сначала выберите значение контейнера больших двоичных объектов.
zh_hans: 首先选择一个 Blob 容器值。
zh_hant: 請先選取 BLOb 容器值。

# sql.migration.sku.import.performance.data.dialog.open.folder
source: Select a folder
de: Ordner auswählen
es: Seleccionar una carpeta
fr: Sélectionnez un dossier
ja: フォルダーを選択する
ko: 폴더 선택
pt_br: Selecionar uma pasta
ru: Выберите папку
zh_hans: 选择一个文件夹
zh_hant: 選取資料夾

# sql.migration.sku.import.performance.data.dialog.helper.message
source: Select a folder on your local drive
de: Wählen Sie einen Ordner auf Ihrem lokalen Laufwerk aus.
es: Seleccione una carpeta en la unidad local
fr: Sélectionnez un dossier sur votre disque local
ja: ローカル ドライブ上のフォルダーを選択する
ko: 로컬 드라이브에서 폴더 선택
pt_br: Selecionar uma pasta na unidade local
ru: Выберите папку на локальном диске
zh_hans: 选择本地驱动器上的文件夹
zh_hant: 選取您本機磁碟機上的資料夾

# sql.migration.sku.azureRecommendation.collectDataSelectFolder.instructions
source: Select a folder on your local drive where performance data will be saved
de: Wählen Sie einen Ordner auf dem lokalen Laufwerk aus, auf dem die Leistungsdaten gespeichert werden sollen.
es: Seleccione una carpeta en la unidad local donde se guardarán los datos de rendimiento
fr: Sélectionnez un dossier sur votre disque local où les données de performance seront enregistrées
ja: パフォーマンス データが保存されるローカル ドライブ上のフォルダーを選択します
ko: 성능 데이터를 저장할 로컬 드라이브의 폴더 선택
pt_br: Selecione uma pasta na sua unidade local onde os dados de desempenho serão salvos
ru: Выберите папку на локальном диске, где будут сохранены данные производительности
zh_hans: 在将保存性能数据的本地驱动器上选择一个文件夹
zh_hant: 選取本機磁碟機上要儲存效能資料的資料夾

# sql.migration.sku.azureRecommendation.openExistingSelectFolder.instructions
source: Select a folder on your local drive where previously collected performance data was saved
de: Wählen Sie einen Ordner auf dem lokalen Laufwerk aus, in dem zuvor gesammelte Leistungsdaten gespeichert wurden.
es: Seleccione una carpeta en la unidad local donde se guardaron los datos de rendimiento recopilados previamente
fr: Sélectionnez un dossier sur votre disque local où les données de performances précédemment collectées ont été enregistrées
ja: 以前に収集したパフォーマンス データが保存されているローカル ドライブ上のフォルダーを選択します
ko: 이전에 수집한 성능 데이터가 저장된 로컬 드라이브의 폴더 선택
pt_br: Selecione uma pasta em sua unidade local onde os dados de desempenho coletados anteriormente foram salvos
ru: Выберите папку на локальном диске, где сохранены ранее собранные данные производительности
zh_hans: 在保存以前收集的性能数据的本地驱动器上选择文件夹
zh_hant: 選取本機磁碟機上儲存先前收集效能資料的資料夾

# sql.migration.database.assessment.xevents.instructions
source: Select a folder where extended events session files (.xel and .xem) are stored
de: Wählen Sie einen Ordner aus, in dem Sitzungsdateien für erweiterte Ereignisse (.xel und .xem) gespeichert sind
es: Seleccione una carpeta donde se almacenen los archivos de sesión de eventos extendidos (.xel y .xem).
fr: Sélectionner un dossier où sont stockés les fichiers de session d’événements étendus (.xel et .xem)
ja: 拡張イベント セッション ファイル (.xel および .xem) が格納されているフォルダーを選択します
ko: 확장 이벤트 세션 파일(.xel 및 .xem)이 저장된 폴더를 선택하세요.
pt_br: Selecione uma pasta na qual os arquivos de sessão de eventos estendidos (.xel e .xem) são armazenados
ru: Выберите папку, в которой хранятся файлы расширенных сеансов событий (XEL и XEM)
zh_hans: 选择存储扩展事件会话文件(.xel 和 .xem)的文件夹
zh_hant: 選取儲存擴充事件工作階段檔案 (.xel 和 .xem) 位置的資料夾

# sql.migration.select.service.select.a.location
source: Select a location
de: Wählen Sie einen Speicherort aus
es: Seleccionar una ubicación
fr: Sélectionnez un emplacement
ja: 場所を選択してください
ko: 위치 선택
pt_br: Selecionar um local
ru: Выберите расположение
zh_hans: 选择位置
zh_hant: 選取位置

# sql.migration.select.service.select.a.resource.group
source: Select a resource group
de: Ressourcengruppe auswählen
es: Seleccionar un grupo de recursos
fr: Sélectionner un groupe de ressources
ja: リソース グループを選択します
ko: 리소스 그룹 선택
pt_br: Selecione um grupo de recursos
ru: Выберите группу ресурсов
zh_hans: 选择资源组
zh_hant: 選取資源群組

# sql.migration.blob.resourceGroup.select.prompt
source: Select a resource group value first.
de: Wählen Sie zuerst einen Ressourcengruppenwert aus.
es: Seleccione primero un valor de grupo de recursos.
fr: Sélectionnez d’abord une valeur de groupe de ressources.
ja: 最初にリソース グループの値を選択します。
ko: 먼저 리소스 그룹 값을 선택합니다.
pt_br: Selecione um valor de grupo de recursos primeiro.
ru: Сначала выберите значение группы ресурсов.
zh_hans: 首先选择资源组值。
zh_hant: 請先選取資源群組值。

# sql.migration.blob.resourceGroup.select
source: Select a resource group.
de: Wählen Sie eine Ressourcengruppe aus.
es: Seleccione un grupo de recursos.
fr: Sélectionnez un groupe de ressources.
ja: リソース グループを選択します。
ko: 리소스 그룹을 선택하세요.
pt_br: Selecione um grupo de recursos.
ru: Выберите группу ресурсов.
zh_hans: 选择资源组。
zh_hant: 選取資源群組。

# sql.migration.blob.storageAccount.select
source: Select a storage account value first.
de: Wählen Sie zuerst einen Speicherkontowert aus.
es: Seleccione primero un valor de cuenta de almacenamiento.
fr: Sélectionnez d’abord une valeur de compte de stockage.
ja: 最初にストレージ アカウントの値を選択します。
ko: 먼저 스토리지 계정 값을 선택합니다.
pt_br: Selecione um valor de conta de armazenamento primeiro.
ru: Сначала выберите значение учетной записи хранения.
zh_hans: 首先选择存储帐户值。
zh_hant: 請先選取儲存體帳戶值。

# sql.migration.select.service.select.a.subscription
source: Select a subscription
de: Abonnement auswählen
es: Seleccionar una suscripción
fr: Sélectionner un abonnement
ja: サブスクリプションの選択
ko: 구독 선택
pt_br: Selecionar uma assinatura
ru: Выберите подписку
zh_hans: 选择订阅
zh_hant: 選取訂用帳戶

# sql.migration.map.target.placeholder
source: Select a target database
de: Wählen Sie eine Zieldatenbank aus
es: Seleccionar una base de datos de destino
fr: Sélectionnez une base de données cible
ja: ターゲット データベースを選択する
ko: 대상 데이터베이스 선택
pt_br: Selecione um banco de dados de destino
ru: Выберите целевую базу данных
zh_hans: 选择目标数据库。
zh_hant: 請選取目標資料庫

# sql.migration.select.service.select.migration.target
source: Select a target server
de: Zielserver auswählen
es: Seleccione un servidor de destino
fr: Sélectionnez un serveur cible
ja: ターゲット サーバーを選択する
ko: 대상 서버 선택
pt_br: Selecione um servidor de destino.
ru: Выберите целевой сервер
zh_hans: 选择目标服务器
zh_hant: 選取目標伺服器

# sql.migration.select.service.select.a.tenant
source: Select a tenant
de: Mandanten auswählen
es: Seleccionar un inquilino
fr: Sélectionner un locataire
ja: テナントを選択してください
ko: 테넌트 선택
pt_br: Selecionar um locatário
ru: Выберите клиент
zh_hans: 选择租户
zh_hant: 選取租用戶

# sql.migration.unique.name
source: Select a unique name for this target database
de: Wählen Sie einen eindeutigen Namen für diese Zieldatenbank aus
es: Seleccione un nombre único para esta base de datos de destino
fr: Sélectionnez un nom unique pour cette base de données cible
ja: 対象データベースに一意の名前を選択する
ko: 이 대상 데이터베이스의 고유한 이름 선택
pt_br: Selecione um nome exclusivo para este banco de dados de destino
ru: Выберите уникальное имя для этой целевой базы данных
zh_hans: 为此目标数据库选择唯一名称
zh_hant: 為此目標資料庫選取唯一的名稱

# sql.migration.invalid.migration.service.error
source: Select a valid Database Migration Service.
de: Wählen Sie einen gültigen Database Migration Service aus.
es: Seleccione un Database Migration Service válido.
fr: Sélectionner Azure Database Migration Service
ja: 有効な Database Migration Service を選択してください。
ko: 유효한 데이터베이스 마이그레이션 서비스를 선택하세요.
pt_br: Selecione um Serviço de Migração de Banco de Dados válido.
ru: Выберите действительную Database Migration Service.
zh_hans: 选择有效的数据库迁移服务。
zh_hant: 選取有效的資料庫移轉服務。

# sql.migration.wizard.target.description
source: Select an Azure account and your target {0}.
de: Wählen Sie ein Azure-Konto und Ihre Ziel-{0} aus.
es: Seleccione una cuenta de Azure y su destino {0}.
fr: Sélectionnez un compte Azure et votre cible {0}.
ja: Azure アカウントとターゲット {0}を選択します。
ko: Azure 계정과 {0} 대상을 선택합니다.
pt_br: Selecione uma conta do Azure e seu destino {0}.
ru: Выберите учетную запись Azure и целевой {0}.
zh_hans: 选择 Azure 帐户和目标 {0}。
zh_hant: 選取 Azure 帳戶和您的目標 {0}。

# sql.migration.wizard.account.description
source: Select an Azure account linked to Azure Data Studio, or link one now.
de: Wählen Sie ein Azure-Konto aus, das mit Azure Data Studio verknüpft ist, oder verknüpfen Sie es jetzt.
es: Seleccione una cuenta de Azure vinculada a Azure Data Studio o vincule una ahora.
fr: Sélectionnez un compte Azure lié à Azure Data Studio ou liez-en un maintenant.
ja: Azure Data Studio にリンクされている Azure アカウントを選択するか、今すぐリンクします。
ko: Azure Data Studio에 연결된 Azure 계정을 선택하거나 지금 연결하세요.
pt_br: Selecione uma conta do Azure vinculada ao Azure Data Studio ou vincule uma agora.
ru: Выберите учетную запись Azure, связанную с Azure Data Studio, или свяжите ее сейчас.
zh_hans: 选择链接到 Azure Data Studio 的 Azure 账户，或立即链接一个账户。
zh_hant: 請選取連結到 Azure Data Studio 的 Azure 帳戶，或立即連結一個。

# sql.login.migration.select.page.title
source: Select login(s) to migrate
de: Zu migrierende Anmeldung(en) auswählen
es: Seleccionar inicios de sesión para migrar
fr: Sélectionner la ou les connexions à migrer
ja: 移行するログインの選択
ko: 마이그레이션할 로그인 선택
pt_br: Selecione o(s) logon(s) para migrar
ru: Выберите учетные данные для миграции
zh_hans: 选择要迁移的登录
zh_hant: 選取要移轉的登入

# sql.migration.database.table.tables.column.label
source: Select tables
de: Tabellen auswählen
es: Seleccionar las tablas
fr: Sélectionner des tables
ja: テーブルの選択
ko: 테이블 선택
pt_br: Selecionar tabelas
ru: Выбор таблиц
zh_hans: 选择表
zh_hant: 選取資料表

# sql.migration.select.migration.tables
source: Select tables for migration
de: Tabellen für die Migration auswählen
es: Seleccionar las tablas para la migración
fr: Sélectionner les tables à migrer
ja: 移行するテーブルの選択
ko: 마이그레이션할 테이블 선택
pt_br: Selecionar tabelas para migração
ru: Выбор таблиц для миграции
zh_hans: 请选择要迁移的表
zh_hant: 選取用於移轉的資料表

# sql.migration.table.select.label
source: Select tables for {0}
de: Tabellen für {0} auswählen
es: Seleccionar tablas para {0}
fr: Sélectionnez des tableaux pour {0}
ja: {0}のテーブルを選択する
ko: {0}에 대한 테이블 선택
pt_br: Selecione as tabelas para {0}
ru: Выберите таблицы для {0}
zh_hans: 选择 {0} 的表
zh_hant: 選取 {0} 的資料表

# sql.migration.data.migration.info
source: Select tables to migrate data to your Azure SQL target
de: Tabellen auswählen, um Daten zu Ihrem Azure SQL-Ziel zu migrieren
es: Seleccionar tablas para migrar datos al destino de Azure SQL
fr: Sélectionner les tables pour migrer les données vers votre cible Azure SQL
ja: Azure SQL ターゲットにデータを移行するテーブルを選択する
ko: Azure SQL 대상으로 데이터를 마이그레이션할 테이블 선택
pt_br: Selecione tabelas para migrar dados para seu destino SQL do Azure
ru: Выберите таблицы для переноса данных в целевой объект Azure SQL
zh_hans: 选择表以将数据迁移到 Azure SQL 目标
zh_hant: 選取資料表以移轉資料至您的 Azure SQL 目標

# sql.migration.select.service.select.target.type.
source: Select target Azure SQL Type
de: Ziel- Azure SQL-Typ auswählen
es: Seleccionar tipo de Azure SQL de destino
fr: Sélectionner le type de Azure SQL cible
ja: ターゲット Azure SQL の型の選択
ko: 대상 Azure SQL 유형 선택
pt_br: Selecione o Tipo SQL do Azure de destino
ru: Выберите целевой тип Azure SQL
zh_hans: 选择目标 Azure SQL 类型
zh_hant: 選取目標 Azure SQL 類型

# sql.migration.no.target.selected.label
source: Select target type
de: Zieltyp auswählen
es: Seleccionar tipo de destino
fr: Sélectionnez la version cible
ja: ターゲットの種類の選択
ko: 대상 유형 선택
pt_br: Selecionar tipo de destino
ru: Выберите тип целевого объекта
zh_hans: 选择目标类型
zh_hant: 選取目標類型
