Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.database.assessment.description
source: Select the databases that you want to assess for migration to Azure SQL.
de: Wählen Sie die Datenbanken aus, die Sie für die Migration zu Azure SQL bewerten möchten.
es: Seleccione las bases de datos que desea evaluar para migrar a Azure SQL.
fr: Sélectionnez les bases de données que vous souhaitez évaluer pour la migration vers Azure SQL.
ja: Azure SQLへの移行を評価するデータベースを選択します。
ko: Azure SQL으로의 마이그레이션을 평가할 데이터베이스를 선택하세요.
pt_br: Selecione os bancos de dados que você deseja avaliar para migração para o SQL do Azure.
ru: Выберите базы данных для оценки миграции в Azure SQL.
zh_hans: 选择要评估以迁移到 Azure SQL 的数据库。
zh_hant: 選取您要評定要移轉至 Azure SQL 的資料庫。

# sql.migrate.text
source: Select the databases that you want to migrate to Azure SQL.
de: Wählen Sie die Datenbank(en) aus, die Sie zu Azure SQL migrieren möchten.
es: Seleccione las bases de datos que desea migrar a Azure SQL.
fr: Sélectionnez les bases de données que vous souhaitez migrer vers Azure SQL.
ja: Azure SQL に移行するデータベースを選択します。
ko: Azure SQL로 마이그레이션할 데이터베이스를 선택합니다.
pt_br: Selecionar bancos de dados que deseja migrar para SQL do Azure.
ru: Выберите базы данных, которые вы хотите переместить в Azure SQL.
zh_hans: 选择要迁移到 Azure SQL 的数据库。
zh_hant: 選取要遷移至 Azure SQL 的資料庫。

# sql.migration.select.database.to.migrate
source: Select the databases to migrate.
de: Wählen Sie die Datenbanken aus, die Sie migrieren möchten.
es: Seleccione las bases de datos que se van a migrar.
fr: Sélectionner les bases de données à migrer
ja: 移行するデータベースを選択してください。
ko: 마이그레이션할 데이터베이스를 선택합니다.
pt_br: Selecione os bancos de dados a serem migrados.
ru: Выберите базы данных для миграции.
zh_hans: 选择要迁移的数据库。
zh_hant: 選取要移轉的資料庫。

# sql.migration.database.page.description
source: Select the location of the database backups to use during migration.
de: Wählen Sie den Speicherort der Datenbanksicherungen aus, die während der Migration verwendet werden sollen.
es: Seleccione la ubicación de las copias de seguridad de la base de datos que se usarán durante la migración.
fr: Sélectionnez l’emplacement des sauvegardes de base de données à utiliser pendant la migration.
ja: 移行中に使用するデータベース バックアップの場所を選択します。
ko: 마이그레이션 중에 사용할 데이터베이스 백업의 위치를 ​​선택합니다.
pt_br: Selecione o local dos backups de banco de dados a serem usados durante a migração.
ru: Выберите расположение резервных копий базы данных, используемых во время миграции.
zh_hans: 选择要在迁移期间使用的数据库备份的位置。
zh_hant: 選取要於移轉期間使用的資料庫備份位置。

# sql.migration.quick.pick.placeholder
source: Select the operation you'd like to perform.
de: Wählen Sie den Vorgang aus, den Sie ausführen möchten.
es: Seleccione la operación que desea realizar.
fr: Sélectionnez l’opération que vous souhaitez effectuer.
ja: 実行する操作を選択します。
ko: 수행하려는 작업을 선택합니다.
pt_br: Selecionar a operação que deseja realizar.
ru: Выберите нужную операцию.
zh_hans: 选择要执行的操作。
zh_hant: 選取您要執行的作業。

# sql.login.migration.wizard.target.description
source: Select the target Azure SQL Managed Instance, Azure SQL VM, or Azure SQL database(s) where you want to migrate your logins.
de: Wählen Sie die Ziel-Azure SQL Managed Instance, Azure SQL-VM oder Azure SQL-Datenbank(en) aus, in die Sie Ihre Anmeldungen migrieren möchten.
es: Seleccione Azure SQL Managed Instance de destino, la VM de Azure SQL o las bases de datos de Azure SQL en las que quiera migrar los inicios de sesión.
fr: Sélectionnez Azure SQL Managed Instance, Azure SQL Machine virtuelle ou la ou les base de données Azure SQL où vous voulez migrer vos connexions.
ja: ログインを移行するターゲット Azure SQL Managed Instance、Azure SQL VM、Azure SQL Database を選択します。
ko: 로그인을 마이그레이션할 대상 Azure SQL Managed Instance, Azure SQL VM 또는 Azure SQL 데이터베이스를 선택합니다.
pt_br: Selecione a Instância Gerenciada de SQL do Azure de destino, a VM de SQL do Azure ou o(s) banco(s) de dados de SQL do Azure para onde você deseja migrar seus logons.
ru: Выберите целевой Управляемый экземпляр SQL Azure, виртуальную машину Azure SQL или базы данных SQL Azure, куда нужно перенести ваши учетные данные.
zh_hans: 选择要在其中迁移登录的目标 Azure SQL 托管实例、Azure SQL VM 或 Azure SQL 数据库。
zh_hant: 選取您要移轉登入的位置: 目標 Azure SQL 受控執行個體、Azure SQL VM 或 Azure SQL 資料庫。

# sql.migration.map.target.description
source: Select the target database where you would like to migrate your source database to. You can choose a target database for only one source database.
de: Wählen Sie die Zieldatenbank aus, zu der Sie Ihre Quelldatenbank migrieren möchten. Sie können eine Zieldatenbank nur für eine Quelldatenbank auswählen.
es: Seleccione la base de datos de destino a la que desea migrar la base de datos de origen. Puede elegir una base de datos de destino solo para una base de datos de origen.
fr: Sélectionnez la base de données cible vers laquelle vous souhaitez migrer votre base de données source. Vous pouvez choisir une base de données cible pour une seule base de données source.
ja: ソース データベースの移行先となるターゲット データベースを選択します。 1 つのソース データベースに対してのみターゲット データベースを選択できます。
ko: 원본 데이터베이스를 마이그레이션할 대상 데이터베이스를 선택합니다. 하나의 원본 데이터베이스에 대해서만 대상 데이터베이스를 선택할 수 있습니다.
pt_br: Selecione o banco de dados de destino para o qual você gostaria de migrar o banco de dados de origem. Você pode escolher um banco de dados de destino para apenas um banco de dados de origem.
ru: Выберите целевую базу данных, в которую следует перенести базу данных-источник. Можно выбрать целевую базу данных только для одной базы данных-источника.
zh_hans: 选择要将源数据库迁移到的目标数据库。只能为一个源数据库选择目标数据库。
zh_hant: 選取您要將來源資料庫移轉至的目標資料庫位置。您只能為一個來源資料庫選擇目標資料庫。

# sql.migration.schema.migration.info
source: Select this option to migrate missing tables on your Azure SQL target
de: Wählen Sie diese Option aus, um fehlende Tabellen auf Ihrem Azure SQL Ziel zu migrieren.
es: Seleccione esta opción para migrar las tablas que faltan en su destino Azure SQL
fr: Sélectionnez cette option pour migrer les tables manquantes sur votre cible Azure SQL
ja: Azure SQL ターゲットで不足しているテーブルを移行するには、このオプションを選択します
ko: Azure SQL 대상에서 누락된 테이블을 마이그레이션하려면 이 옵션을 선택합니다.
pt_br: Selecione essa opção para migrar tabelas ausentes no seu destino SQL do Azure
ru: Выберите этот параметр, чтобы перенести отсутствующие таблицы в целевой объект Azure SQL
zh_hans: 选择此选项可迁移 Azure SQL 目标上缺少的表
zh_hant: 選取此選項，以移轉 Azure SQL 目標上遺失的資料表

# sql.migration.select.azure.vm
source: Select your target Azure Subscription and your target SQL Server on Azure Virtual Machine for your target.
de: Wählen Sie Ihr Azure-Zielabonnement und Ihr Ziel SQL Server auf dem virtuellen Azure-Computer für Ihr Ziel aus.
es: Seleccione la suscripción de Azure de destino y el SQL Server de destino de la máquina virtual de Azure de su destino.
fr: Sélectionnez votre abonnement Azure cible et votre SQL Server cible sur la machine virtuelle Azure pour votre cible.
ja: 対象の Azure サブスクリプションと Azure Virtual Machine 上の対象の SQL Server で選択します。
ko: 대상에 대한 Azure 가상 머신에서 대상 Azure 구독 및 대상 SQL Server를 선택합니다.
pt_br: Selecione sua Assinatura do Azure de destino e seu SQL Server de destino na Máquina Virtual do Azure para seu destino.
ru: Выберите целевую подписку Azure и целевой SQL Server на виртуальной машине Azure для целевого объекта.
zh_hans: 为目标在 Azure 虚拟机上选择目标 Azure 订阅和目标 SQL Server。
zh_hant: 選取您的目標 Azure 訂用帳戶，以及 Azure 虛擬機器上的目標 SQL Server 作為您的目標。

# sql.migration.select.azure.mi
source: Select your target Azure subscription and your target Azure SQL Managed Instance.
de: Wählen Sie Ihr Azure-Zielabonnement und Ihre Ziel-Azure SQL Managed Instance.
es: Seleccione la suscripción de Azure de destino y la Azure SQL Managed Instance de destino.
fr: Sélectionnez votre abonnement Azure cible et votre Azure SQL Managed Instance cible.
ja: 対象の Azure サブスクリプションと対象の Azure SQL Managed Instance を選択します。
ko: 대상 Azure 구독 및 대상 Azure SQL Managed Instance를 선택합니다.
pt_br: Selecionar sua assinatura Azure alvo e sua Instância Gerenciada de SQL do Azure.
ru: Выберите целевую подписку Azure и целевой управляемый экземпляр SQL Azure.
zh_hans: 选择目标 Azure 订阅和目标 Azure SQL 托管实例。
zh_hant: 選取您的目標 Azure 訂用帳戶以及目標 Azure SQL 受控執行個體。

# sql.migration.service.details.ir.label
source: Self-hosted integration runtime node
de: Knoten für selbstgehostete Integration Runtime
es: Nodo de entorno de ejecución de integración autohospedado
fr: Nœuds de runtime d'intégration auto-hébergé
ja: セルフホステッド統合ランタイム ノード
ko: 자체 호스팅 통합 런타임 노드
pt_br: Nó de runtime de integração auto-hospedada
ru: Узел локальной среды выполнения интеграции
zh_hans: 自承载集成运行时节点
zh_hant: 自我裝載整合執行階段節點

# sql.migration.shir
source: Self-hosted integration runtime node
de: Knoten für selbstgehostete Integration Runtime
es: Nodo de entorno de ejecución de integración autohospedado
fr: Nœuds de runtime d'intégration auto-hébergé
ja: セルフホステッド統合ランタイム ノード
ko: 자체 호스팅 통합 런타임 노드
pt_br: Nó de runtime de integração auto-hospedada
ru: Узел локальной среды выполнения интеграции
zh_hans: 自承载集成运行时节点
zh_hant: 自我裝載整合執行階段節點

# sql.migration.server
source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器

# sql.migration.instance.finding.summary
source: Server instance assessment findings summary
de: Zusammenfassung der Bewertungsergebnisse der Serverinstanz
es: Resumen de resultados de la evaluación de instancias de servidor
fr: Résumé des résultats de l'évaluation des instances de serveur
ja: サーバー インスタンス評価の結果の概要
ko: 서버 인스턴스 평가 결과 요약
pt_br: Resumo das conclusões da avaliação da instância do servidor
ru: Сводка результатов оценки экземпляра сервера
zh_hans: 服务器实例评估结果摘要
zh_hant: 伺服器執行個體評定結果摘要

# sql.migration.details.serverobjects.label
source: Server objects
de: Serverobjekte
es: Objetos de servidor
fr: Objets serveur
ja: サーバー オブジェクト
ko: 서버 개체
pt_br: Objetos do servidor
ru: Объекты сервера
zh_hans: 服务器对象
zh_hant: 伺服器物件

# sql.migration.details.serverobjects.field.label
source: Server objects
de: Serverobjekte
es: Objetos de servidor
fr: Objets serveur
ja: サーバー オブジェクト
ko: 서버 개체
pt_br: Objetos do servidor
ru: Объекты сервера
zh_hans: 服务器对象
zh_hant: 伺服器物件

# serviceCrashed
source: Service component crashed.
de: Die Dienstkomponente ist abgestürzt.
es: El componente de servicio se bloqueó.
fr: Le composant de service s’est arrêté.
ja: サービス コンポーネントがクラッシュしました。
ko: 서비스 구성 요소가 충돌했습니다.
pt_br: O componente de serviço travou.
ru: Сбой компонента службы.
zh_hans: 服务组件崩溃。
zh_hant: 服務元件當機。

# serviceProviderIntializationError
source: Service provider could not be initialized.
de: Der Dienstanbieter konnte nicht initialisiert werden.
es: No se pudo inicializar el proveedor de servicios.
fr: Impossible d’initialiser le fournisseur de services.
ja: データ プロバイダーを初期化できませんでした。
ko: 서비스 공급자를 초기화할 수 없습니다.
pt_br: O provedor de serviços não pôde ser inicializado.
ru: Не удалось инициализировать поставщик службы.
zh_hans: 无法初始化服务提供程序。
zh_hant: 無法初始化服務提供者。

# sql.migration.service.container.heading
source: Set up integration runtime
de: Integration Runtime einrichten
es: Configuración del entorno de ejecución de integración
fr: Configurer le runtime d’intégration
ja: 統合ランタイムのセットアップ
ko: 통합 런타임 설정
pt_br: Configurar o runtime de integração
ru: Настройка среды выполнения интеграции
zh_hans: 设置集成运行时
zh_hant: 設定整合執行階段

# sql.migration.show.status
source: Show status
de: Status anzeigen
es: Mostrar estado
fr: Afficher l'état
ja: 状態の表示
ko: 상태 표시
pt_br: Mostrar status
ru: Показать состояние
zh_hans: 显示状态
zh_hant: 顯示狀態

# sql.migration.select.service.select.a.
source: Sign into Azure and select an account
de: Melden Sie sich bei Azure an, und wählen Sie ein Konto aus
es: Iniciar sesión en Azure y seleccionar una cuenta
fr: Connectez-vous à Azure et sélectionnez un compte
ja: Azure にサインインしてアカウントを選択する
ko: Azure에 로그인하여 계정 선택
pt_br: Entrar no Azure e selecionar uma conta
ru: Войдите в Azure и выберите учетную запись
zh_hans: 登录 Azure 并选择帐户
zh_hant: 登入 Azure 並選取帳戶

# sql.migration.size.column.header
source: Size
de: Größe
es: Tamaño
fr: Taille
ja: サイズ
ko: 크기
pt_br: Tamanho
ru: Размер
zh_hans: 大小
zh_hant: 大小

# sql.migration.size
source: Size (MB)
de: Größe (MB)
es: Tamaño (MB)
fr: Taille (Mo)
ja: サイズ (MB)
ko: 크기(MB)
pt_br: Tamanho (MB)
ru: Размер (МБ)
zh_hans: 大小(MB)
zh_hant: 大小 (MB)

# sql.migration.restore.backupset.status.skipped
source: Skipped
de: Übersprungen
es: Omitido
fr: Ignoré
ja: スキップされました
ko: 건너뜀
pt_br: Ignorado
ru: Пропущено
zh_hans: 已跳过
zh_hant: 已跳過

# sql.migration.field.label.skipped.files
source: Skipped files
de: Übersprungene Dateien
es: Archivos omitidos
fr: Fichiers ignorés
ja: スキップされたファイル
ko: 건너뛴 파일
pt_br: Arquivos ignorados
ru: Пропущенные файлы
zh_hans: 跳过的文件
zh_hant: 跳過的檔案

# sql.migration.multi.step.some.steps.are.still.running
source: Some steps are still running.
de: Einige Schritte werden noch ausgeführt.
es: Algunos pasos aún se están ejecutando.
fr: Certaines étapes sont toujours en cours d’exécution.
ja: 一部のステップはまだ実行中です。
ko: 일부 단계가 아직 실행 중입니다.
pt_br: Algumas etapas ainda estão em execução.
ru: Некоторые шаги все еще выполняются.
zh_hans: 一些步骤仍在运行。
zh_hant: 部分步驟仍在執行中。

# sql.migration.migration.list.sort.label
source: Sort
de: Sortieren
es: Ordenar
fr: Tri
ja: ソート
ko: 정렬
pt_br: Classificar
ru: Сортировка
zh_hans: 排序
zh_hant: 排序

# sql.migration.source.configuration
source: Source configuration
de: Quellkonfiguration
es: Configuración de origen
fr: Configuration de la source
ja: ソース構成
ko: 원본 구성
pt_br: Configuração de origem
ru: Конфигурация источника
zh_hans: 源配置
zh_hant: 來源設定

# sql.migration.source.credentials
source: Source credentials
de: Quellanmeldeinformationen
es: Credenciales de origen
fr: Informations d’identification sources
ja: ソースの資格情報
ko: 원본 자격 증명
pt_br: Credenciais de origem
ru: Исходные учетные данные.
zh_hans: 源凭据
zh_hant: 來源認證

# sql.migration.src.database
source: Source database
de: Quelldatenbank
es: Base de datos de origen
fr: Base de données source
ja: ソース データベース
ko: 원본 데이터베이스
pt_br: Banco de dados de origem
ru: База данных-источник
zh_hans: 源数据库
zh_hant: 來源資料庫

# sql.migration.map.source.column
source: Source database
de: Quelldatenbank
es: Base de datos de origen
fr: Base de données source
ja: ソース データベース
ko: 원본 데이터베이스
pt_br: Banco de dados de origem
ru: База данных-источник
zh_hans: 源数据库
zh_hant: 來源資料庫

# sql.migration.database.table.source.column.label
source: Source database
de: Quelldatenbank
es: Base de datos de origen
fr: Base de données source
ja: ソース データベース
ko: 원본 데이터베이스
pt_br: Banco de dados de origem
ru: База данных-источник
zh_hans: 源数据库
zh_hant: 來源資料庫

# sql.migration.validate.ir.validation.result.label.source.database
source: Source database connectivity: '{0}'
de: Quelldatenbankkonnektivität: „{0}“
es: Conectividad de la base de datos de origen: '{0}'
fr: Connexion de base de données source : '{0}'
ja: ソース データベースの接続性: '{0}'
ko: 원본 데이터베이스 연결: '{0}'
pt_br: Conectividade do banco de dados de origem: '{0}'
ru: Подключение к базе данных-источнику: "{0}"
zh_hans: 源数据库连接:“{0}”
zh_hant: 來源資料庫連線: '{0}'

# sql.migration.source.database
source: Source database name
de: Name der Quelldatenbank
es: Nombre de la base de datos de origen
fr: Nom de la base de données source
ja: 転送元データベース名
ko: 원본 데이터베이스 이름
pt_br: Nome do banco de dados de origem
ru: Имя базы данных-источника
zh_hans: 源数据库名
zh_hant: 來源資料庫名稱

# sql.migration.source.databases
source: Source databases
de: Quelldatenbanken
es: Bases de datos de origen
fr: Bases de données sources
ja: ソース データベース
ko: 원본 데이터베이스
pt_br: Bancos de dados de origem
ru: Базы данных — источники
zh_hans: 源数据库
zh_hant: 來源資料庫

# sql.migration.source.login
source: Source login
de: Quellanmeldung
es: Inicio de sesión de origen
fr: Connexion source
ja: ソース ログイン
ko: 원본 로그인
pt_br: Logon de origem
ru: Исходные учетные данные
zh_hans: 源登录
zh_hant: 來源登入

# sql.migration.src.server
source: Source name
de: Quellenname
es: Nombre de origen
fr: Nom de la source
ja: ソース名
ko: 원본 이름
pt_br: Nome da fonte
ru: Имя источника
zh_hans: 源名称
zh_hant: 來源名稱

# sql.migration.sku.sourceProperties
source: Source properties
de: Quelleigenschaften
es: Propiedades de origen
fr: Propriétés de la source
ja: ソースのプロパティ
ko: 원본 속성
pt_br: Propriedades da origem
ru: Свойства источника
zh_hans: 源属性
zh_hant: 來源屬性

# sql.migration.source.server
source: Source server
de: Quellserver
es: Servidor de origen
fr: Serveur source
ja: ソース サーバー
ko: 원본 서버
pt_br: Servidor de origem
ru: Исходный сервер
zh_hans: 源服务器
zh_hant: 來源伺服器

# sql.migration.source.version
source: Source version
de: Quellversion
es: Versión de origen
fr: Version source
ja: ソース バージョン
ko: 원본 버전
pt_br: Versão de origem
ru: Исходная версия
zh_hans: 源版本
zh_hant: 來源版本

# sql.migration.sku.targetStorageConfiguration.disktype.standardHdd
source: Standard HDD
de: HDD Standard
es: HDD estándar
fr: HDD Standard
ko: 표준 HDD
pt_br: HDD Standard
ru: HDD (цен. категория "Стандартный")
zh_hans: 标准 HDD
zh_hant: 標準 HDD

# sql.migration.sku.targetStorageConfiguration.disktype.StandardSsd
source: Standard SSD
de: SSD Standard
es: SSD estándar
fr: SSD Standard
ko: 표준 SSD
pt_br: SSD Standard
ru: SSD (цен. категория "Стандартный")
zh_hans: 标准 SSD
zh_hant: 標準 SSD

# sql.migration.sku.azureRecommendation.start
source: Start
de: Starten
es: Inicio
fr: Démarrer
ja: 開始
ko: 시작
pt_br: Iniciar
ru: Запустить
zh_hans: 开始
zh_hant: 開始

# sql.migration.start.session
source: Start a new session
de: Neue Sitzung starten
es: Iniciar una nueva sesión
fr: Démarrer une nouvelle session
ja: 新しいセッションを開始
ko: 새 세션 시작
pt_br: Iniciar nova sessão
ru: Начать новый сеанс
zh_hans: 启动新会话
zh_hant: 啟動新的工作階段

# sql.migration.sku.start.performance.collection
source: Start data collection
de: Datensammlung starten
es: Iniciar recopilación de datos
fr: Démarrer la collecte de données
ja: データ収集を開始する
ko: 데이터 수집 시작
pt_br: Iniciar coleta de dados
ru: Начать сбор данных
zh_hans: 开始数据收集
zh_hant: 開始資料收集

# sql.migration.start.migration.button
source: Start migration
de: Migration starten
es: Iniciar la migración
fr: Démarrer la migration
ja: 移行の開始
ko: 마이그레이션 시작
pt_br: Iniciar migração
ru: Запуск миграции
zh_hans: 开始迁移
zh_hant: 開始移轉

# sql.migration.start.time
source: Start time
de: Startzeit
es: Hora de inicio
fr: Heure de début
ja: 開始時刻
ko: 시작 시간
pt_br: Hora de início
ru: Время начала
zh_hans: 开始时间
zh_hant: 開始時間

# sql.migration.validate.ir.start.validation
source: Start validation
de: Validierung starten
es: Iniciar validación
fr: Démarrer la validation
ja: 検証を開始
ko: 유효성 검사 시작
pt_br: Iniciar validação
ru: Начать проверку
zh_hans: 开始验证
zh_hant: 開始驗證

# sql.migration.sku.azureRecommendation.start.popup
source: Starting performance data collection...
de: Leistungsdatensammlung wird gestartet...
es: Iniciando recopilación de datos de rendimiento...
fr: Début de la collecte des données de performances...
ja: パフォーマンス データの収集を開始しています...
ko: 성능 데이터 수집을 시작하는 중...
pt_br: Iniciando a coleta de dados de desempenho...
ru: Запуск сбора данных о производительности…
zh_hans: 正在启动性能数据收集...
zh_hant: 正在啟動效能資料收集...

# sql.migration.tde.migrate.column.status
source: Status
es: Estado
fr: État
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# sql.migration.status.status.label
source: Status
es: Estado
fr: État
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# sql.login.migration.status.column
source: Status
es: Estado
fr: État
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# sql.migration.status
source: Status
es: Estado
fr: État
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# sql.migration.validate.ir.column.status
source: Status
es: Estado
fr: État
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# sql.migration.status.dropdown.all
source: Status: All
de: Status: Alle
es: Estado: Todos
fr: État : Tout
ja: 状態: すべて
ko: 상태: 모두
pt_br: Status: todos
ru: Состояние: все
zh_hans: 状态: 所有
zh_hant: 狀態: 全部

# sql.migration.status.dropdown.completing
source: Status: Completing
de: Status: Wird abgeschlossen
es: Estado: completando
fr: État : terminé
ja: 状態: 完了しています
ko: 상태: 완료 중
pt_br: Status: Concluindo
ru: Состояние: завершение
zh_hans: 状态: 正在完成
zh_hant: 狀態:正在完成

# sql.migration.status.dropdown.failed
source: Status: Failed
de: Status: Fehler
es: Estado: Error
fr: État : Échec
ja: 状態: 失敗
ko: 상태: 실패함
pt_br: Status: com falha
ru: Состояние: сбой
zh_hans: 状态: 失败
zh_hant: 狀態: 失敗

# sql.migration.status.dropdown.ongoing
source: Status: Ongoing
de: Status: Fortlaufend
es: Estado: en curso
fr: État : en cours
ja: 状態: 進行中
ko: 상태: 진행 중
pt_br: Status: Em andamento
ru: Состояние: текущее
zh_hans: 状态: 正在进行
zh_hant: 狀態:進行中

# sql.migration.status.dropdown.succeeded
source: Status: Succeeded
de: Status: Erfolgreich
es: Estado: Correcto
fr: État : Réussite
ja: 状態: 成功
ko: 상태: 성공함
pt_br: Status: com êxito
ru: Состояние: выполнено
zh_hans: 状态: 已成功
zh_hant: 狀態: 成功

# sql.migration.ir.setup.step1
source: Step 1: {0}
de: Schritt 1: {0}
es: Paso 1: {0}
fr: Étape 1 : {0}
ja: ステップ 1: {0}
ko: 1단계: {0}
pt_br: Etapa 1: {0}
ru: Шаг 1. {0}
zh_hans: 步骤 1: {0}
zh_hant: 步驟 1: {0}

# sql.migration.ir.setup.step2
source: Step 2: Use the keys below to register your integration runtime
de: Schritt 2: Verwenden Sie die Schlüssel unten zum Registrieren Ihrer Integration Runtime.
es: Paso 2: Use las claves siguientes para registrar el entorno de ejecución de integración
fr: Étape 2 : Utiliser les clés ci-dessous pour inscrire votre runtime d’intégration
ja: 手順 2: 以下のキーを使用して統合ランタイムを登録します
ko: 2단계: 아래 키를 사용하여 통합 런타임을 등록합니다.
pt_br: Etapa 2: usar as chaves abaixo para registrar o seu runtime de integração
ru: Шаг 2. Используйте приведенные ниже ключи для регистрации среды выполнения интеграции.
zh_hans: 步骤 2: 使用以下密钥注册集成运行时
zh_hant: 步驟 2: 使用下列金鑰註冊您的整合執行階段

# sql.migration.ir.setup.step3
source: Step 3: Click on the 'Test connection' button to check the connection between Azure Database Migration Service and integration runtime
de: Schritt 3: Klicken Sie auf die Schaltfläche "Verbindung testen", um die Verbindung zwischen Azure Database Migration Service und Integration Runtime zu überprüfen
es: Paso 3: Haga clic en el botón "Prueba de conexión" para comprobar la conexión entre Azure Database Migration Service y el entorno de ejecución de integración
fr: Étape 3 : cliquez sur le bouton « Tester la connexion » pour vérifier la connexion entre Azure Database Migration Service et le runtime d’intégration
ja: 手順 3: [接続テスト] ボタンをクリックして、Azure Database Migration Service と統合ランタイムの間の接続を確認します
ko: 3단계: '연결 테스트' 단추를 클릭하여 Azure Database Migration Service와 통합 런타임 간의 연결을 확인합니다.
pt_br: Etapa 3: clique no botão “Testar conectividade” para verificar a conexão entre o Serviço de Migração de Banco de Dados do Azure e o runtime de integração
ru: Шаг 3. Нажмите кнопку "Тестирование подключения", чтобы проверить соединение между Azure Database Migration Service и средой выполнения интеграции.
zh_hans: 步骤 3: 单击“测试连接”按钮，以检查 Azure 数据库迁移服务与集成运行时之间的连接
zh_hant: 步驟 3: 按一下 [測試連接] 按鈕，檢查 Azure 資料庫移轉服務與整合執行階段之間的連線
