Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# mssql.connectionOptions.encrypt.description
source: When 'Mandatory' or 'Strict', SQL Server uses SSL encryption for all data sent between the client and server if the server has a certificate installed. When set to 'Strict', SQL Server uses TDS 8.0 for all data transfer between the client and server. 'Strict' is supported on SQL Server 2022 onwards.
de: Bei „Mandatory“ oder „Strict“ verwendet SQL Server die SSL-Verschlüsselung für alle Daten, die zwischen Client und Server gesendet werden, wenn auf dem Server ein Zertifikat installiert ist. Bei Festlegung auf „Strict“ verwendet SQL Server TDS 8.0 für die gesamte Datenübertragung zwischen Client und Server. „Strict“ wird ab SQL Server 2022 unterstützt.
es: Cuando es "Mandatory" o "Strict", SQL Server usa cifrado SSL para todos los datos enviados entre el cliente y el servidor si el servidor tiene un certificado instalado. Cuando se establece en "Strict", SQL Server usa TDS 8.0 para toda la transferencia de datos entre el cliente y el servidor. El cifrado "Strict" se admite en SQL Server 2022 y posteriores.
fr: En cas de chiffrement « Obligatoire » ou « Strict », SQL Server utilise le chiffrement SSL pour toutes les données envoyées entre le client et le serveur si un certificat est installé sur le serveur. Lorsqu’il est défini sur « Strict », SQL Server utilise TDS 8.0 pour tout transfert de données entre le client et le serveur. « Strict » est pris en charge à partir de SQL Server 2022.
it: Quando è 'Obbligatorio' o 'Restrittivo', SQL Server utilizza la crittografia SSL per tutti i dati inviati tra il client e il server se nel server è installato un certificato. Se impostato su 'Restrittivo', SQL Server utilizza TDS 8.0 per tutti i trasferimenti di dati tra il client e il server. 'Restrittivo' è supportato a partire da SQL Server 2022.
ja: '必須' または '厳密' の場合、SQL Server は、サーバーに証明書がインストールされていれば、クライアントとサーバー間のすべてのデータ送信に SSL 暗号化を使用します。'厳密' に設定すると、SQL Server はクライアントとサーバー間のすべてのデータ転送に TDS 8.0 を使用します。'厳密' は、SQL Server 2022 以降でサポートされています。
ko: 'Mandatory' 또는 'Strict'로 설정하면 SQL Server는 인증서가 설치된 경우 클라이언트와 서버 간의 모든 데이터 전송에 SSL 암호화를 사용합니다. 'Strict'로 설정하면 SQL Server는 클라이언트와 서버 간의 모든 데이터 전송에 TDS 8.0을 사용합니다. 'Strict'는 SQL Server 2022 이상에서 지원됩니다.
pt_br: Quando 'Obrigatório' ou 'Estrito', o SQL Server usa criptografia SSL para todos os dados enviados entre o cliente e o servidor se o servidor tiver um certificado instalado. Quando definido como 'Strict', o SQL Server usa o TDS 8.0 para todas as transferências de dados entre o cliente e o servidor. 'Strict' tem suporte no SQL Server 2022 em diante.
ru: Если задано значение "Mandatory" или "Strict", SQL Server использует SSL-шифрование для всех данных, отправляемых между клиентом и сервером, если на сервере установлен сертификат. Если установлено значение "Strict", SQL Server использует TDS 8.0 для передачи всех данных между клиентом и сервером. Значение "Strict" поддерживается в SQL Server 2022 и более поздних версиях.
zh_hans: 在值为 'Mandatory' 或 'Strict' 时，如果服务器安装了证书，SQL Server 将对客户端与服务器之间发送的所有数据使用 SSL 加密。在设置为 'Strict' 时，SQL Server 使用 TDS 8.0 在客户端与服务器之间传输所有数据。SQL Server 2022 及之后的版本均支持 'Strict'。
zh_hant: 當 [強制] 或 [嚴格] 時，若伺服器已安裝憑證，SQL Server 會為所有在用戶端和伺服器之間傳輸的資料使用 SSL 加密。當設定為 [嚴格] 時，SQL Server 會為所有在用戶端和伺服器之間傳輸的資料使用 TDS 8.0。SQL Server 2022 與更新版本支援 [嚴格]。

# mssql.objectExplorer.groupBySchema
source: When enabled, the database objects in Object Explorer will be categorized by schema.
de: Wenn diese Option aktiviert ist, werden die Datenbankobjekte im Objekt-Explorer nach Schema kategorisiert.
es: Cuando se habilita, los objetos de base de datos del Explorador de objetos se clasificarán por esquema.
fr: Lorsque cette option est activée, les objets de base de données dans l’Explorateur d'objets sont classés par schéma.
it: Se questa opzione è abilitata, gli oggetti di database in Esplora oggetti verranno categorizzati in base allo schema.
ja: 有効にすると、オブジェクト エクスプローラー内のデータベース オブジェクトがスキーマ別に分類されます。
ko: 사용하도록 설정하면 개체 탐색기의 데이터베이스 개체가 스키마로 분류됩니다.
pt_br: Quando habilitados, os objetos de banco de dados no Pesquisador de Objetos serão categorizados por esquema.
ru: Если этот параметр включен, объекты базы данных в обозревателе объектов будут классифицированы по схеме.
zh_hans: 启用后，对象资源管理器中的数据库对象将按架构进行分类。
zh_hant: 啟用時，物件總管中的資料庫物件會依架構分類。

# mssql.connectionOptions.persistSecurityInfo.description
source: When false, security-sensitive information, such as the password, is not returned as part of the connection
de: Bei Festlegung auf FALSE werden sicherheitsrelevante Informationen, z. B. das Kennwort, nicht als Teil der Verbindung zurückgegeben.
es: Si el valor es false, no se devuelve información confidencial de seguridad, como la contraseña, como parte de la conexión
fr: Quand la valeur est false, les informations de sécurité, comme le mot de passe, ne sont pas retournées dans le cadre de la connexion
it: Se è false, le informazioni sensibili dal punto di vista della sicurezza, come la password, non vengono restituite nell'ambito della connessione
ja: False の場合、パスワードなどのセキュリティによる保護が要求される情報は、接続しても返されません
ko: false이면 보안상 중요한 정보(예: 암호)를 연결의 일부로 반환하지 않습니다.
pt_br: Quando false, as informações confidenciais de segurança, como a senha, não são retornadas como parte da conexão
ru: Если задано значение FALSE, то секретные данные (например, пароль) не возвращаются в составе подключения
zh_hans: 为 false 时，安全敏感信息(如密码)不作为连接的一部分返回
zh_hant: 若為 False，則不會於連線中傳回密碼等安全性敏感資訊

# mssql.connectionOptions.trustServerCertificate.description
source: When true (and encrypt=true), SQL Server uses SSL encryption for all data sent between the client and server without validating the server certificate. This property is not supported with Encrypt=Strict.
de: Bei WAHR (und encrypt=true) verwendet SQL Server SSL-Verschlüsselung für alle Daten, die zwischen Client und Server gesendet werden, ohne das Serverzertifikat zu überprüfen. Diese Eigenschaft wird bei Encrypt=Strict nicht unterstützt.
es: Cuando es true (y encrypt=true), SQL Server usa el cifrado SSL para todos los datos enviados entre el cliente y el servidor sin validar el certificado de servidor. Esta propiedad no se admite con Encrypt=Strict.
fr: Quand la valeur est true (et encrypt=true), SQL Server utilise le chiffrement SSL pour toutes les données envoyées entre le client et le serveur sans valider le certificat de serveur. Cette propriété n’est pas prise en charge avec Encrypt=Strict.
it: Se il valore è true (e encrypt=true), SQL Server usa la crittografia SSL per tutti i dati inviati tra il client e il server senza convalidare il certificato del server. Questa proprietà non è supportata con Encrypt=Strict.
ja: true (および encrypt=true) の場合、SQL Server はサーバー証明書を検証せずに、クライアントとサーバーの間で送信されるすべてのデータに SSL 暗号化を使用します。このプロパティは Encrypt=Strict ではサポートされていません。
ko: true(및 encrypt=true)인 경우 SQL Server는 서버 인증서의 유효성을 검사하지 않고 클라이언트와 서버 간에 전송되는 모든 데이터에 SSL 암호화를 사용합니다. 이 속성은 Encrypt=Strict와는 지원되지 않습니다.
pt_br: Quando verdadeiro (e encrypt=true), o SQL Server usa criptografia SSL para todos os dados enviados entre o cliente e o servidor sem validar o certificado do servidor. Esta propriedade não é suportada com Encrypt=Strict.
ru: Если задано значение "true" (и параметр "encrypt" имеет значение "true"), SQL Server использует шифрование SSL для всех данных, которыми сервер обменивается с клиентом, без проверки сертификата сервера. Это свойство не поддерживается, если параметр "Encrypt" имеет значение "Strict".
zh_hans: 在值为 true (且 encrypt=true)时，SQL Server 将对客户端与服务器之间发送的所有数据使用 SSL 加密，而无需验证服务器证书。此属性不支持 Encrypt=Strict 的设置。
zh_hant: 當 True 時 (且 encrypt=true)，SQL Server 會為所有在用戶端和伺服器之間傳輸的資料使用 SSL 加密，且不驗證伺服器憑證。Encrypt=Strict 不支援此屬性。

# mssql.connectionOptions.contextConnection.description
source: When true, indicates the connection should be from the SQL server context. Available only when running in the SQL Server process
de: Bei Festlegung auf TRUE muss die Verbindung aus dem SQL-Serverkontext stammen. Nur verfügbar bei Ausführung im SQL Server-Prozess.
es: Cuando es true, indica que la conexión debe ser desde el contexto de SQL Server. Disponible sólo cuando se ejecuta en el proceso de SQL Server
fr: Quand la valeur est true, indique que la connexion doit provenir du contexte du serveur SQL. Disponible uniquement en cas d'exécution dans le processus SQL Server
it: Se è true, indica che la connessione deve provenire dal contesto SQL Server. Disponibile solo quando è in esecuzione nel processo SQL Server
ja: True の場合は、接続元が SQL Server のコンテキストであることを示します。SQL Server のプロセスで実行する場合のみ使用できます
ko: true인 경우 연결이 SQL Server 컨텍스트에서 시작되어야 함을 나타냅니다. SQL Server 프로세스에서 실행 중인 경우에만 사용할 수 있습니다.
pt_br: Quando true, indica que a conexão deve ser do contexto do SQL Server. Disponível somente quando executado no processo do SQL Server
ru: Если задано значение TRUE, указывает, что подключение должно быть произведено в контексте SQL Server. Доступно только при выполнении в процессе SQL Server.
zh_hans: 为 true 时，指示连接应来自 SQL Server 上下文。仅在 SQL Server 进程中运行时可用
zh_hant: 若為 True，則表示連線應來自 SQL 伺服器內容。僅可在於 SQL Server 處理序中執行時可用

# mssql.connectionOptions.multipleActiveResultSets.description
source: When true, multiple result sets can be returned and read from one connection
de: Bei Festlegung auf TRUE können mehrere Resultsets zurückgegeben und aus einer Verbindung gelesen werden.
es: Cuando el valor es true, se pueden devolver varios conjuntos de resultados y leerlos desde una conexión.
fr: Quand la valeur est true, plusieurs jeux de résultats peuvent être retournés et lus sur une même connexion
it: Se è true, possono essere restituiti e letti più set di risultati da un'unica connessione
ja: True の場合は、1 つの接続から複数の結果セットが返され、これらを読み取ることができます
ko: true인 경우 한 연결에서 여러 결과 집합을 반환하고 읽을 수 있습니다.
pt_br: Quando true, conjuntos de resultados múltiplos podem ser retornados e lidos de uma conexão
ru: Если задано значение TRUE, из одного подключения может быть возвращено и считано несколько результирующих наборов
zh_hans: 为 true 时，可从一个连接返回和读取多个结果集
zh_hant: 若為 True，則可傳回多個結果集並從一個連線讀取

# mssql.connectionOptions.pooling.description
source: When true, the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool
de: Bei Festlegung auf TRUE wird das Verbindungsobjekt aus dem geeigneten Pool abgerufen oder bei Bedarf erstellt und dem geeigneten Pool hinzugefügt.
es: Cuando el valor es true, el objeto de conexión se obtiene del grupo apropiado, o si es necesario, se crea y agrega al grupo apropiado
fr: Quand la valeur est true, l'objet de connexion est tiré du pool approprié ou, si nécessaire, est créé et ajouté au pool approprié
it: Se è true, l'oggetto connessione viene prelevato dal pool appropriato oppure, se necessario, viene creato e aggiunto al pool appropriato
ja: True の場合、接続オブジェクトが適切なプールから取得されるか、または、必要に応じて接続オブジェクトが作成され、適切なプールに追加されます
ko: true이면 해당 풀에서 연결 개체를 끌어 오거나 필요한 경우 연결 개체를 만들어 해당 풀에 추가합니다.
pt_br: Quando true, o objeto de conexão é extraído do pool apropriado ou, se necessário, é criado e adicionado ao pool apropriado
ru: Если задано значение TRUE, объект соединения извлекается из соответствующего пула или при необходимости создается и добавляется в соответствующий пул
zh_hans: 为 true 时，从相应的池中取出连接对象，或根据需要创建连接对象并将其添加到相应的池中
zh_hant: 若為 True，則會從適當的集區提取連線物件，或在有需要時建立並新增至適當的集區

# mssql.parallelMessageProcessing
source: Whether the requests to the backend SQL Tools Service should be handled in parallel. This brings performance benefits to MSSQL queries and connections. The default value is true. Azure Data Studio is required to be relaunched when the value is changed.
de: Legt fest, ob die Anforderungen an die Back-End-Instanz von SQL Tools Service parallel verarbeitet werden sollen. Dies bietet Leistungsvorteile für MSSQL-Abfragen und -Verbindungen. Der Standardwert ist TRUE. Azure Data Studio muss nach dem Ändern des Werts neu gestartet werden.
es: Si las solicitudes al servicio de herramientas SQL back-end deben manejarse en paralelo. Esto aporta ventajas de rendimiento a las consultas y conexiones de MSSQL. El valor predeterminado es true. Azure Data Studio es necesario volver a iniciar cuando se cambia el valor.
fr: Indique si les requêtes adressées au service SQL Tools backend doivent être traitées en parallèle. Cela apporte des avantages en termes de performances aux requêtes et connexions MSSQL. La valeur par défaut est vraie. Azure Data Studio doit être relancé lorsque la valeur est modifiée.
it: Indica se le richieste al servizio strumenti SQL di back-end devono essere gestite in parallelo. Ciò offre vantaggi a livello di prestazioni per le query e le connessioni MSSQL. Il valore predefinito è true. È necessario riavviare Azure Data Studio quando il valore viene modificato.
ja: バックエンド SQL Tools サービスへの要求を並列で処理する必要があるかどうか。これにより、MSSQL クエリと接続にパフォーマンス上の利点がもたらされます。既定値は true です。Azure Data Studio は、値が変更されたときに再起動する必要があります。
ko: 백 엔드 SQL Tools Service에 대한 요청을 병렬로 처리할지 여부입니다. 이렇게 하면 MSSQL 쿼리 및 연결에 성능상의 이점이 있습니다. 기본값은 true입니다. 값이 변경되면 Azure Data Studio를 다시 시작해야 합니다.
pt_br: Se as solicitações para o Serviço de Ferramentas SQL de back-end devem ser tratadas em paralelo. Isso traz benefícios de desempenho para consultas e conexões MSSQL. O valor padrão é true. O Azure Data Studio deve ser reinicializado quando o valor é alterado.
ru: Следует ли параллельно обрабатывать запросы к службе SQL Tools Это повышает производительность запросов и соединений MSSQL. Значение по умолчанию — ИСТИНА. Azure Data Studio необходимо перезапустить при изменении значения.
zh_hans: 是否应并行处理对后端 SQL 工具服务的请求。这会为 MSSQL 查询和连接带来性能优势。默认值为 true。更改值时，需要重新启动 Azure Data Studio。
zh_hant: 是否應該平行處理對後端 SQL Tools Service 的要求。這會為 MSSQL 查詢和連線帶來效能優點。預設值為 true。值變更時，需要重新啟動 Azure Data Studio。

# mssql.tableDesigner.allowDisableAndReenableDdlTriggers
source: Whether to allow table designer to disable and re-enable DDL triggers during publish
de: Gibt an, ob der Tabellen-Designer DDL-Trigger während der Veröffentlichung deaktivieren und erneut aktivieren darf.
es: Indica si se permite que el diseñador de tablas deshabilite y vuelva a habilitar los desencadenadores DDL durante la publicación.
fr: Indique s’il faut autoriser le Concepteur de tables à désactiver et réactiver les déclencheurs DDL pendant la publication
it: Indica se consentire a Progettazione tabelle di disabilitare e riabilitare i trigger DDL durante la pubblicazione
ja: パブリッシュ中にテーブル デザイナーが DDL トリガーを無効化および再有効化を許可するかどうか
ko: 게시하는 동안 테이블 디자이너가 DDL 트리거를 사용하지 않도록 설정하고 다시 사용하도록 설정할지 여부
pt_br: Se deve permitir que o designer da tabela desative e reative os gatilhos DDL durante a publicação
ru: Разрешить ли конструктору таблиц отключать и повторно включать триггеры DDL во время публикации
zh_hans: 是否允许表设计器在发布期间禁用和重新启用 DDL 触发器
zh_hant: 是否允許資料表設計工具在發行期間停用和重新啟用 DDL 觸發程序

# mssql.tableDesigner.preloadDatabaseModel
source: Whether to preload the database model when the database node in the object explorer is expanded. When enabled, the loading time of table designer can be reduced. Note: You might see higher than normal memory usage if you need to expand a lot of database nodes.
de: Gibt an, ob das Datenbankmodell vorab geladen werden soll, wenn der Datenbankknoten im Objekt-Explorer erweitert wird. Wenn diese Option aktiviert ist, kann die Ladezeit des Tabellen-Designers reduziert werden. Hinweis: Wenn Sie viele Datenbankknoten erweitern müssen, wird möglicherweise eine höhere Speicherauslastung als normal angezeigt.
es: Indica si se debe cargar previamente el modelo de base de datos cuando se expande el nodo de base de datos en el explorador de objetos. Cuando se habilita, se puede reducir el tiempo de carga del diseñador de tablas. Nota: Es posible que vea un uso de memoria mayor que el normal si necesita expandir una gran cantidad de nodos de base de datos.
fr: Indique s’il faut précharger le modèle de base de données lorsque le nœud de base de données dans l’Explorateur d’objets est développé. Lorsque cette option est activée, la durée de chargement du Concepteur de tables peut être réduite. Remarque : l’utilisation de la mémoire peut être supérieure à la normale si vous devez développer un grand nombre de nœuds de base de données.
it: Indica se precaricare il modello di database quando si espande il nodo del database in Esplora oggetti. Se l’opzione è abilitata, è possibile ridurre il tempo di caricamento di Progettazione tabelle. Nota: l'utilizzo della memoria potrebbe essere superiore al normale quando si espandono molti nodi del database.
ja: オブジェクト エクスプローラーのデータベース ノードが展開されたときに、データベース モデルを事前に読み込むかどうか。有効にすると、テーブル デザイナーの読み込み時間を短縮できます。注: 多数のデータベース ノードの展開が必要な場合、通常よりも多くのメモリが使用される可能性があります。
ko: 개체 탐색기에서 데이터베이스 노드를 확장할 때 데이터베이스 모델을 미리 로드할지 여부입니다. 활성화하면 테이블 디자이너의 로딩 시간을 줄일 수 있습니다. 참고: 많은 데이터베이스 노드를 확장해야 하는 경우 일반 메모리 사용량보다 높을 수 있습니다.
pt_br: Se o modelo de banco de dados deve ser pré-carregado quando o nó do banco de dados no explorador de objetos for expandido. Quando ativado, o tempo de carregamento do designer de tabela pode ser reduzido. Nota: Você pode ver um uso de memória maior do que o normal se precisar expandir muitos nós de banco de dados.
ru: Следует ли предварительно загружать модель базы данных при расширении узла базы данных в проводнике объектов. При включении время загрузки конструктора таблиц может быть уменьшено. Примечание. Если вам нужно расширить множество узлов базы данных, использование памяти может быть выше обычного.
zh_hans: 是否在对象资源管理器中的数据库节点展开时预加载数据库模型。启用后，可以减少表设计器的加载时间。注意: 如果需要展开大量数据库节点，内存使用率可能会高于正常情况。
zh_hant: 當物件總管中的資料庫節點展開時，是否要預先載入資料庫模型。啟用時，可以縮短資料表設計工具的載入時間。注意: 如果您需要展開許多資料庫節點，可能會看到高於一般的記憶體使用量。

# mssql.connectionOptions.authType.categoryValues.integrated
source: Windows Authentication
de: Windows-Authentifizierung
es: Autenticación de Windows
fr: Authentification Windows
it: Autenticazione di Windows
ja: Windows 認証
ko: Windows 인증
pt_br: Autenticação do Windows
ru: Проверка подлинности Windows.
zh_hans: Windows 身份验证
zh_hant: Windows 驗證

# mssql.connectionOptions.workstationId.displayName
source: Workstation Id
de: Arbeitsstations-ID
es: Id. de estación de trabajo
fr: ID de station de travail
it: ID workstation
ja: ワークステーション ID
ko: 워크스테이션 ID
pt_br: Id da Estação de trabalho
ru: Идентификатор рабочей станции
zh_hans: 工作站 ID
zh_hant: 工作站識別碼

# mssql.ignorePlatformWarning
source: [Optional] Do not show unsupported platform warnings
de: [Optional] Keine Anzeige von Warnungen zu nicht unterstützten Plattformen.
es: [Opcional] No mostrar advertencias de plataformas no compatibles
fr: [Facultatif] Ne pas afficher les avertissements de plateforme non prise en charge
it: [Facoltativa] Non visualizzare avvisi su piattaforme non supportate
ja: [省略可能] サポートされていないプラットフォームの警告を表示しない
ko: [옵션] 지원되지 않는 플랫폼 경고 표시 안 함
pt_br: [Opcional] Não mostrar os avisos de plataforma sem suporte
ru: [Необязательно] Не показывать предупреждения для неподдерживаемых платформ
zh_hans: [可选] 不显示不受支持的平台警告
zh_hant: [選用] 不要顯示不支援的平台警告

# mssql.logDebugInfo
source: [Optional] Log debug output to the console (View -> Output) and then select appropriate output channel from the dropdown
de: [Optional] Protokollieren Sie die Debugausgabe in der Konsole (Ansicht > Ausgabe), und wählen Sie dann in der Dropdownliste den geeigneten Ausgabekanal aus.
es: [Opcional] Registre la salida de depuración en a la consola (Ver -> Salida) y después seleccione el canal de salida apropiado del menú desplegable
fr: [Facultatif] Journaliser la sortie de débogage dans la console (Voir -> Sortie) et sélectionner le canal de sortie approprié dans la liste déroulante
it: [Facoltativa] Registrare l'output di debug nella console (Visualizza -> Output), quindi selezionare il canale di output appropriato dall'elenco a discesa
ja: [省略可能] コンソールへのデバッグ出力をログに記録し ([表示] -> [出力])、ドロップダウンから適切な出力チャネルを選択します
ko: [옵션] 디버그 출력을 콘솔에 로깅한 다음(보기 -> 출력), 드롭다운에서 해당 출력 채널을 선택합니다.
pt_br: [Opcional] Registre a saída da depuração no console (Exibir -> Saída) e, em seguida, selecione o canal de saída apropriado no menu suspenso
ru: [Необязательно] Выведите выходные данные отладки в консоль (Вид -> Вывод), а затем выберите подходящий выходной канал в раскрывающемся списке
zh_hans: [可选] 将调试输出记录到控制台(“查看”->“输出”)，然后从下拉列表中选择相应的输出通道
zh_hant: [選用] 將偵錯記錄輸出至主控台 ([檢視] -> [輸出])，並從下拉式清單選取適當的輸出通道
