Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# mssql.connectionOptions.authType.displayName
source: Authentication type
de: Authentifizierungstyp
es: Tipo de autenticación
fr: Type d'authentification
it: Tipo di autenticazione
ja: 認証の種類
ko: 인증 유형
pt_br: Tipo de autenticação
ru: Тип проверки подлинности
zh_hans: 身份验证类型
zh_hant: 驗證類型

# mssql.connectionOptions.enclaveAttestationProtocol.categoryValues.AAS
source: Azure Attestation
es: Atestación de Azure
it: Attestazione di Azure
pt_br: Atestado do Azure
ru: Аттестация Azure
zh_hans: Azure 证明
zh_hant: Azure 證明

# title.backupDatabase
source: Backup Database (Preview)
de: Sicherungsdatenbank (Vorschau)
es: Base de datos de copia de seguridad (versión preliminar)
fr: Supprimez la base de données (préversion)
it: Database di backup (anteprima)
ja: バックアップ データベース (プレビュー)
ko: 백업 데이터베이스(미리 보기)
pt_br: Banco de Dados de Backup (Versão Prévia)
ru: Резервная копия базы данных (предварительная версия)
zh_hans: 备份数据库(预览版)
zh_hant: 備份資料庫 (預覽)

# title.changeNotebookConnection
source: Change SQL Notebook Connection
de: SQL-Notebook-Verbindung ändern
es: Cambiar conexión de SQL Notebook
fr: Modifier la connexion au notebook SQL
it: Modifica connessione notebook SQL
ja: SQL Notebook 接続の変更
ko: SQL Notebook 연결 변경
pt_br: Alterar a conexão de Notebook SQL
ru: Изменить подключение к записной книжке SQL
zh_hans: 更改 SQL 笔记本连接
zh_hant: 變更 SQL Notebook 連線

# mssql.connection.clearPooledConnections
source: Clear Pooled Connections
de: Gepoolte Verbindungen löschen
es: Borrar conexiones agrupadas
fr: Effacer les connexions groupées
it: Cancella connessioni in pool
ja: プールされた接続のクリア
ko: 풀된 연결 지우기
pt_br: Limpar Conexões em Pool
ru: Очистить подключения в пулах
zh_hans: 清除共用连接
zh_hant: 清除集區連線

# mssql.connectionOptions.commandTimeout.displayName
source: Command timeout
de: Befehlstimeout
es: Tiempo de espera del comando
fr: Expiration de commande
it: Timeout del comando
ja: コマンドのタイムアウト
ko: 명령 시간 제한
pt_br: Tempo limite do comando
ru: Время ожидания команды
zh_hans: 命令超时
zh_hant: 命令逾時

# cloud.databaseProperties.compatibilityLevel
source: Compatibility Level
de: Kompatibilitätsgrad
es: Nivel de compatibilidad
fr: Niveau de compatibilité
it: Livello di compatibilità
ja: 互換性レベル
ko: 호환성 수준
pt_br: Nível de Compatibilidade
ru: Уровень совместимости
zh_hans: 兼容级别
zh_hant: 相容性層級

# onprem.databaseProperties.compatibilityLevel
source: Compatibility Level
de: Kompatibilitätsgrad
es: Nivel de compatibilidad
fr: Niveau de compatibilité
it: Livello di compatibilità
ja: 互換性レベル
ko: 호환성 수준
pt_br: Nível de Compatibilidade
ru: Уровень совместимости
zh_hans: 兼容级别
zh_hant: 相容性層級

# onprem.serverProperties.machineName
source: Computer Name
es: Nombre del equipo
fr: Nom de l'ordinateur
it: Nome del computer
ja: コンピューター名
ko: 컴퓨터 이름
pt_br: Nome do Computador
ru: Имя компьютера
zh_hans: 计算机名
zh_hant: 電腦名稱

# mssql.connectionOptions.connectRetryCount.displayName
source: Connect retry count
de: Anzahl der Verbindungswiederholungen
es: Recuento de reintentos de conexión
fr: Nombre de tentatives de connexion
it: Conteggio tentativi di connessione
ja: 接続の再試行回数
ko: 연결 다시 시도 횟수
pt_br: Contagem de tentativas de conexão
ru: Счетчик повторных попыток для подключения
zh_hans: 连接重试次数
zh_hant: 連線重試次數

# mssql.connectionOptions.connectRetryInterval.displayName
source: Connect retry interval
de: Intervall für Verbindungswiederholung
es: Intervalo de reintento de conexión
fr: Intervalle entre les tentatives de connexion
it: Intervallo tentativi di connessione
ja: 接続の再試行間隔
ko: 연결 다시 시도 간격
pt_br: Intervalo de tentativa de conexão
ru: Интервал повторных попыток подключения
zh_hans: 连接重试间隔
zh_hant: 連線重試間隔

# mssql.connectionOptions.connectTimeout.displayName
source: Connect timeout
de: Verbindungstimeout
es: Tiempo de espera de la conexión
fr: Délai d'expiration de la connexion
it: Timeout di connessione
ja: 接続タイムアウト
ko: 연결 시간 제한
pt_br: Tempo limite de conexão
ru: Истекло время ожидания подключения
zh_hans: 连接超时
zh_hant: 連線逾時

# mssql.connectionOptions.groupName.connectionResiliency
source: Connection Resiliency
de: Verbindungsresilienz
es: Resistencia de la conexión
fr: Résilience de la connexion
it: Resilienza connessione
ja: 接続の復元性
ko: 연결 복구
pt_br: Resiliência da Conexão
ru: Устойчивость подключений
zh_hans: 连接复原力
zh_hant: 恢復連接

# mssql.connectionOptions.groupName.context
source: Context
de: Kontext
es: Contexto
fr: Contexte
it: Contesto
ja: コンテキスト
ko: 컨텍스트
pt_br: Contexto
ru: Контекст
zh_hans: 上下文
zh_hant: 內容

# mssql.connectionOptions.contextConnection.displayName
source: Context connection
de: Kontextverbindung
es: Conexión contextual
fr: Connexion contextuelle
it: Connessione al contesto
ja: コンテキスト接続
ko: 컨텍스트 연결
pt_br: Conexão de contexto
ru: Контекстное подключение
zh_hans: 上下文连接
zh_hant: 內容連線

# mssql.connectionOptions.currentLanguage.displayName
source: Current language
de: Aktuelle Sprache
es: Idioma actual
fr: Langage actuel
it: Lingua corrente
ja: 現在の言語
ko: 현재 언어
pt_br: Idioma atual
ru: Текущий язык
zh_hans: 当前语言
zh_hant: 目前的語言

# mssql.connectionOptions.connectionName.description
source: Custom name of the connection
de: Benutzerdefinierter Name der Verbindung
es: Nombre personalizado de la conexión
fr: Nom personnalisé de la connexion
it: Nome personalizzato della connessione
ja: 接続のカスタム名
ko: 연결의 사용자 지정 이름
pt_br: Nome personalizado da conexão
ru: Настраиваемое имя подключения
zh_hans: 连接的自定义名称
zh_hant: 連線的自訂名稱

# mssql.connectionOptions.databaseName.displayName
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de Dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# mssql.connectionOptions.applicationIntent.description
source: Declares the application workload type when connecting to a server
de: Deklariert den Anwendungsauslastungstyp beim Herstellen einer Verbindung mit einem Server.
es: Declara el tipo de carga de trabajo de la aplicación al conectarse a un servidor
fr: Déclare le type de charge de travail de l'application pendant la connexion à un serveur
it: Dichiara il tipo di carico di lavoro dell'applicazione durante la connessione a un server
ja: サーバーに接続するときにアプリケーションのワークロードの種類を宣言します
ko: 서버에 연결할 때 애플리케이션 워크로드 형식을 선언합니다.
pt_br: Declara o tipo de carga de trabalho do aplicativo ao conectar-se a um servidor
ru: Объявляет тип рабочей нагрузки приложения при подключении к серверу
zh_hans: 声明连接到服务器时的应用程序工作负荷类型
zh_hant: 在連線至伺服器時宣告應用程式工作負載類型

# mssql.connectionOptions.connectRetryInterval.description
source: Delay between attempts to restore connection
de: Verzögerung zwischen Versuchen zur Verbindungswiederherstellung
es: Retraso entre intentos para restaurar la conexión
fr: Délai entre les tentatives de restauration de connexion
it: Ritardo tra tentativi di ripristino della connessione
ja: 接続を復元するための試行間の遅延
ko: 연결 복구 시도 간 지연 시간
pt_br: Atraso entre as tentativas de restauração de conexão
ru: Задержка между попытками восстановления подключения
zh_hans: 两次尝试恢复连接之间的延迟
zh_hant: 嘗試還原連線之間的延遲

# title.designTable
source: Design
de: Entwurf
es: Diseño
fr: Conception
it: Progettazione
ja: デザイン
ko: 디자인
ru: Конструктор
zh_hans: 设计
zh_hant: 設計

# title.detachDatabase
source: Detach Database (Preview)
de: Datenbank trennen (Vorschau)
es: Desasociar base de datos (versión preliminar)
fr: Détacher la base de données (préversion)
it: Scollega database (anteprima)
ja: データベースのデタッチ (プレビュー)
ko: 데이터베이스 분리(미리 보기)
pt_br: Desanexar banco de dados (versão prévia)
ru: Окончательное удаление базы данных (предварительная версия)
zh_hans: 拆离数据库(预览版)
zh_hant: 卸離資料庫 (預覽)

# mssql.objectExplorer.disableGroupBySchema
source: Disable Group By Schema
de: Gruppen nach Schema deaktivieren
es: Deshabilitar Agrupar por esquema
fr: Désactiver Grouper par schéma
it: Disabilita raggruppa per schema
ja: スキーマによるグループ化を無効にする
ko: 스키마별 그룹화 사용 안 함
pt_br: Desabilitar Agrupar por Esquema
ru: Отключить группирование по схеме
zh_hans: 禁用分组依据架构
zh_hant: 依架構停用群組

# mssql.disabled
source: Disabled
de: Deaktiviert
es: Deshabilitado
fr: Désactivé
it: Disabilitato
ja: 無効
ko: 사용 안 함
pt_br: Desabilitado
ru: Отключено
zh_hans: 已禁用
zh_hant: 已停用

# title.dropObject
source: Drop (Preview)
de: Löschen (Vorschau)
es: Quitar (versión preliminar)
fr: Supprimer (préversion)
it: Escludi (anteprima)
ja: 削除 (プレビュー)
ko: 놓기(미리 보기)
pt_br: Remover (Visualização)
ru: Удалить (предварительная версия)
zh_hans: 删除(预览版)
zh_hant: 刪除 (預覽)

# cloud.databaseProperties.azureEdition
source: Edition
es: Edición
fr: Édition
it: Edizione
ja: エディション
ko: 버전
pt_br: Edição
ru: Выпуск
zh_hans: 版本
zh_hant: 版本

# onprem.serverProperties.serverEdition
source: Edition
es: Edición
fr: Édition
it: Edizione
ja: エディション
ko: 버전
pt_br: Edição
ru: Выпуск
zh_hans: 版本
zh_hant: 版本

# mssql.objectExplorer.enableGroupBySchema
source: Enable Group By Schema
de: Gruppen nach Schema aktivieren
es: Habilitar Agrupar por esquema
fr: Activer Grouper par schéma
it: Abilita raggruppa per schema
ja: スキーマによるグループ化を有効にする
ko: 스키마별 그룹화 사용
pt_br: Habilitar Agrupar por Esquema
ru: Включить группирование по схеме
zh_hans: 按架构启用分组
zh_hant: 依架構啟用群組

# mssql.query.alwaysEncryptedParameterization
source: Enable Parameterization for Always Encrypted
de: Parametrisierung für Always Encrypted aktivieren
es: Habilitar parametrización de Always Encrypted
fr: Activer la paramétrisation pour Always Encrypted
it: Abilita parametrizzazione per Always Encrypted
ja: Always Encrypted のパラメーター化を有効にする
ko: Always Encrypted에 매개 변수화 사용
pt_br: Habilitar a Parametrização para Always Encrypted
ru: Включить параметризацию для Always Encrypted
zh_hans: 启用 Always Encrypted 参数化
zh_hant: 啟用 Always Encrypted 的參數化

# mssql.query.ansiDefaults
source: Enable SET ANSI_DEFAULTS
de: SET ANSI_DEFAULTS aktivieren
es: Habilitar SET ANSI_DEFAULTS
fr: Activer SET ANSI_DEFAULTS
it: Abilita SET ANSI_DEFAULTS
ja: SET ANSI_DEFAULTS を有効にする
ko: SET ANSI_DEFAULTS 사용
pt_br: Habilitar SET ANSI_DEFAULTS
ru: Установить параметр SET ANSI_DEFAULTS
zh_hans: 启用 SET ANSI_DEFAULTS
zh_hant: 啟用 SET ANSI_DEFAULTS

# mssql.query.ansiNulls
source: Enable SET ANSI_NULLS
de: SET ANSI_NULLS aktivieren
es: Habilitar SET ANSI_NULLS
fr: Activer SET ANSI_NULLS
it: Abilita SET ANSI_NULLS
ja: SET ANSI_NULLS を有効にする
ko: SET ANSI_NULLS 사용
pt_br: Habilitar SET ANSI_NULLS
ru: Установить параметр SET ANSI_NULLS
zh_hans: 启用 SET ANSI_NULLS
zh_hant: 啟用 SET ANSI_NULLS

# mssql.query.ansiNullDefaultOn
source: Enable SET ANSI_NULL_DFLT_ON
de: SET ANSI_NULL_DFLT_ON aktivieren
es: Habilitar SET ANSI_NULL_DFLT_ON
fr: Activer SET ANSI_NULL_DFLT_ON
it: Abilita SET ANSI_NULL_DFLT_ON
ja: SET ANSI_NULL_DFLT_ON を有効にする
ko: SET ANSI_NULL_DFLT_ON 사용
pt_br: Habilitar SET ANSI_NULL_DFLT_ON
ru: Установить параметр SET ANSI_NULL_DFLT_ON
zh_hans: 启用 SET ANSI_NULL_DFLT_ON
zh_hant: 啟用 SET ANSI_NULL_DFLT_ON

# mssql.query.ansiPadding
source: Enable SET ANSI_PADDING
de: SET ANSI_PADDING aktivieren
es: Habilitar SET ANSI_PADDING
fr: Activer SET ANSI_PADDING
it: Abilita SET ANSI_PADDING
ja: SET ANSI_PADDING を有効にする
ko: SET ANSI_PADDING 사용
pt_br: Habilitar SET ANSI_PADDING
ru: Установить параметр SET ANSI_PADDING
zh_hans: 启用 SET ANSI_PADDING
zh_hant: 啟用 SET ANSI_PADDING

# mssql.query.ansiWarnings
source: Enable SET ANSI_WARNINGS
de: SET ANSI_WARNINGS aktivieren
es: Habilitar SET ANSI_WARNINGS
fr: Activer SET ANSI_WARNINGS
it: Abilita SET ANSI_WARNINGS
ja: SET ANSI_WARNINGS を有効にする
ko: SET ANSI_WARNINGS 사용
pt_br: Habilitar SET ANSI_WARNINGS
ru: Установить параметр SET ANSI_WARNINGS
zh_hans: 启用 SET ANSI_WARNINGS
zh_hant: 啟用 SET ANSI_WARNINGS

# mssql.query.arithAbort
source: Enable SET ARITHABORT option
de: Set ARITHABORT-Option aktivieren
es: Habilitar la opción SET ARITHABORT
fr: Activer l'option SET ARITHABORT
it: Abilita l'opzione SET ARITHABORT
ja: SET ARITHABORT オプションを有効にする
ko: SET ARITHABORT 옵션 사용
pt_br: Habilitar a opção SET ARITHABORT
ru: Установить параметр SET ARITHABORT
zh_hans: 启用 SET ARITHABORT 选项
zh_hant: 啟用 SET ARITHABORT 選項

# mssql.query.cursorCloseOnCommit
source: Enable SET CURSOR_CLOSE_ON_COMMIT
de: SET CURSOR_CLOSE_ON_COMMIT aktivieren
es: Habilitar SET CURSOR_CLOSE_ON_COMMIT
fr: Activer SET CURSOR_CLOSE_ON_COMMIT
it: Abilita SET CURSOR_CLOSE_ON_COMMIT
ja: SET CURSOR_CLOSE_ON_COMMIT を有効にする
ko: SET CURSOR_CLOSE_ON_COMMIT 사용
pt_br: Habilitar SET CURSOR_CLOSE_ON_COMMIT
ru: Установить параметр SET CURSOR_CLOSE_ON_COMMIT
zh_hans: 启用 SET CURSOR_CLOSE_ON_COMMIT
zh_hant: 啟用 SET CURSOR_CLOSE_ON_COMMIT

# mssql.query.deadlockPriority
source: Enable SET DEADLOCK_PRIORITY option
de: SET DEADLOCK_PRIORITY-Option aktivieren
es: Habilitar la opción SET DEADLOCK_PRIORITY
fr: Activer l'option SET DEADLOCK_PRIORITY
it: Abilita l'opzione SET DEADLOCK_PRIORITY
ja: SET DEADLOCK_PRIORITY オプションを有効にする
ko: SET DEADLOCK_PRIORITY 옵션 사용
pt_br: Habilitar a opção SET DEADLOCK_PRIORITY
ru: Установить параметр SET DEADLOCK_PRIORITY
zh_hans: 启用 SET DEADLOCK_PRIORITY 选项
zh_hant: 啟用 SET DEADLOCK_PRIORITY 選項

# mssql.query.implicitTransactions
source: Enable SET IMPLICIT_TRANSACTIONS
de: SET IMPLICIT_TRANSACTIONS aktivieren
es: Habilitar SET IMPLICIT_TRANSACTIONS
fr: Activer SET IMPLICIT_TRANSACTIONS
it: Abilita SET IMPLICIT_TRANSACTIONS
ja: SET IMPLICIT_TRANSACTIONS を有効にする
ko: SET IMPLICIT_TRANSACTIONS 사용
pt_br: Habilitar SET IMPLICIT_TRANSACTIONS
ru: Установить параметр SET IMPLICIT_TRANSACTIONS
zh_hans: 启用 SET IMPLICIT_TRANSACTIONS
zh_hant: 啟用 SET IMPLICIT_TRANSACTIONS

# mssql.query.lockTimeout
source: Enable SET LOCK TIMEOUT option (in milliseconds)
de: SET LOCK TIMEOUT-Option aktivieren (in Millisekunden)
es: Habilitar la opción SET LOCK TIMEOUT (en milisegundos)
fr: Activer l'option SET LOCK TIMEOUT (en millisecondes)
it: Abilita l'opzione SET LOCK TIMEOUT (in millisecondi)
ja: SET LOCK TIMEOUT オプションを有効にする (ミリ秒単位)
ko: SET LOCK TIMEOUT 옵션 사용(밀리초)
pt_br: Habilitar a opção SET LOCK TIMEOUT (em milissegundos)
ru: Установить параметр SET LOCK TIMEOUT (в миллисекундах)
zh_hans: 启用 SET LOCK TIMEOUT 选项(毫秒)
zh_hant: 啟用 SET LOCK TIMEOUT 選項 (毫秒)

# mssql.query.noCount
source: Enable SET NOCOUNT option
de: SET NOCOUNT-Option aktivieren
es: Habilitar la opción SET NOCOUNT
fr: Activer l'option SET NOCOUNT
it: Abilita l'opzione SET NOCOUNT
ja: SET NOCOUNT オプションを有効にする
ko: SET NOCOUNT 옵션 사용
pt_br: Habilitar a opção SET NOCOUNT
ru: Установить параметр SET NOCOUNT
zh_hans: 启用 SET NOCOUNT 选项
zh_hant: 啟用 SET NOCOUNT 選項

# mssql.query.noExec
source: Enable SET NOEXEC option
de: SET NOEXEC-Option aktivieren
es: Habilitar la opción SET NOEXEC
fr: Activer l'option SET NOEXEC
it: Abilita l'opzione SET NOEXEC
ja: SET NOEXEC オプションを有効にする
ko: SET NOEXEC 옵션 사용
pt_br: Habilitar a opção SET NOEXEC
ru: Установить параметр SET NOEXEC
zh_hans: 启用 SET NOEXEC 选项
zh_hant: 啟用 SET NOEXEC 選項

# mssql.query.parseOnly
source: Enable SET PARSEONLY option
de: SET PARSEONLY-Option aktivieren
es: Habilitar la opción SET PARSEONLY
fr: Activer l'option SET PARSEONLY
it: Abilita l'opzione SET PARSEONLY
ja: SET PARSEONLY オプションを有効にする
ko: SET PARSEONLY 옵션 사용
pt_br: Habilitar a opção SET PARSEONLY
ru: Установить параметр SET PARSEONLY
zh_hans: 启用 SET PARSEONLY 选项
zh_hant: 啟用 SET PARSEONLY 選項

# mssql.query.queryGovernorCostLimit
source: Enable SET QUERY_GOVERNOR_COST_LIMIT
de: SET QUERY_GOVERNOR_COST_LIMIT aktivieren
es: Habilitar SET QUERY_GOVERNOR_COST_LIMIT
fr: Activer SET QUERY_GOVERNOR_COST_LIMIT
it: Abilita SET QUERY_GOVERNOR_COST_LIMIT
ja: SET QUERY_GOVERNOR_COST_LIMIT を有効にする
ko: SET QUERY_GOVERNOR_COST_LIMIT 사용
pt_br: Habilitar SET QUERY_GOVERNOR_COST_LIMIT
ru: Установить параметр SET QUERY_GOVERNOR_COST_LIMIT
zh_hans: 启用 SET QUERY_GOVERNOR_COST_LIMIT
zh_hant: 啟用 SET QUERY_GOVERNOR_COST_LIMIT

# mssql.query.quotedIdentifier
source: Enable SET QUOTED_IDENTIFIER
de: SET QUOTED_IDENTIFIER aktivieren
es: Habilitar SET QUOTED_IDENTIFIER
fr: Activer SET QUOTED_IDENTIFIER
it: Abilita SET QUOTED_IDENTIFIER
ja: SET QUOTED_IDENTIFIER を有効にする
ko: SET QUOTED_IDENTIFIER 사용
pt_br: Habilitar SET QUOTED_IDENTIFIER
ru: Установить параметр SET QUOTED_IDENTIFIER
zh_hans: 启用 SET QUOTED_IDENTIFIER
zh_hant: 啟用 SET QUOTED_IDENTIFIER

# mssql.query.statisticsIO
source: Enable SET STATISTICS IO option
de: Set STATISTICS IO-Option aktivieren
es: Habilitar la opción SET STATISTICS IO
fr: Activer l'option SET STATISTICS IO
it: Abilita L'opzione SET STATISTICS IO
ja: SET STATISTICS IO オプションを有効にする
ko: SET STATISTICS IO 옵션 사용
pt_br: Habilitar a opção SET STATISTICS IO
ru: Установить параметр SET STATISTICS IO
zh_hans: 启用 SET STATISTICS IO 选项
zh_hant: 啟用 SET STATISTICS IO 選項

# mssql.query.statisticsTime
source: Enable SET STATISTICS TIME option
de: SET STATISTICS TIME-Option aktivieren
es: Habilitar la opción SET STATISTICS TIME
fr: Activer l'option SET STATISTICS TIME
it: Abilita l'opzione SET STATISTICS TIME
ja: SET STATISTICS TIME オプションを有効にする
ko: SET STATISTICS TIME 옵션 사용
pt_br: Habilitar a opção SET STATISTICS TIME
ru: Установить параметр SET STATISTICS TIME
zh_hans: 启用 SET STATISTICS TIME 选项
zh_hant: 啟用 SET STATISTICS TIME 選項

# mssql.query.transactionIsolationLevel
source: Enable SET TRANSACTION ISOLATION LEVEL option
de: SET TRANSACTION ISOLATION LEVEL-Option aktivieren
es: Habilitar la opción SET TRANSACTION ISOLATION LEVEL
fr: Activer l'option SET TRANSACTION ISOLATION LEVEL
it: Abilita l'opzione SET TRANSACTION ISOLATION LEVEL
ja: SET TRANSACTION ISOLATION LEVEL オプションを有効にする
ko: SET TRANSACTION ISOLATION LEVEL 옵션 사용
pt_br: Habilitar a opção SET TRANSACTION ISOLATION LEVEL
ru: Установить параметр SET TRANSACTION ISOLATION LEVEL
zh_hans: 启用 SET TRANSACTION ISOLATION LEVEL 选项
zh_hant: 啟用 SET TRANSACTION ISOLATION LEVEL 選項

# mssql.query.xactAbortOn
source: Enable SET XACT_ABORT ON option
de: SET XACT_ABORT ON-Option aktivieren
es: Habilitar la opción SET XACT_ABORT ON
fr: Activer l'option SET XACT-ABORT ON
it: Abilita l'opzione SET XACT_ABORT ON
ja: SET XACT_ABORT ON オプションを有効にする
ko: SET XACT_ABORT ON 옵션 사용
pt_br: Habilitar a opção SET XACT_ABORT ON
ru: Установить параметр SET XACT_ABORT ON
zh_hans: 启用 SET XACT_ABORT ON 选项
zh_hant: 啟用 SET XACT_ABORT ON 選項

# json.format.enable.desc
source: Enable/disable default JSON formatter (requires restart)
de: Standard-JSON-Formatierer aktivieren/deaktivieren (Neustart erforderlich)
es: Habilitar/deshabilitar formateador JSON predeterminado (requiere reiniciar)
fr: Activer/désactiver le formateur JSON par défaut (nécessite un redémarrage)
it: Abilita/Disabilita il formattatore JSON predefinito (richiede il riavvio)
ja: 既定の JSON フォーマッタを有効/無効にします (再起動が必要です)
ko: 기본 JSON 포맷터 사용/사용 안 함(다시 시작해야 함)
pt_br: Habilitar/desabilitar o formatador JSON padrão (requer reinicialização)
ru: Включение или отключение модуля форматирования JSON по умолчанию (требуется перезагрузка)
zh_hans: 启用/禁用默认 JSON 格式化程序(需要重启)
zh_hant: 啟用/停用預設 JSON 格式器 (需要重新啟動)

# mssql.enabled
source: Enabled
de: Aktiviert
es: Habilitado
fr: Activé
it: Abilitato
ja: 有効
ko: 사용
pt_br: Habilitado
ru: Включено
zh_hans: 已启用
zh_hant: 已啟用

# mssql.enableConnectionPooling
source: Enables connection pooling on MSSQL connections to improve overall performance of Azure Data Studio connectivity. This setting is enabled by default. Azure Data Studio is required to be relaunched when the value is changed. To clear pooled connections, run the command: 'MSSQL: Clear Pooled Connections'
de: Aktiviert das Verbindungspooling für MSSQL-Verbindungen, um die Gesamtleistung der Azure Data Studio-Konnektivität zu verbessern. Diese Einstellung ist standardmäßig aktiviert. Azure Data Studio muss nach dem Ändern des Werts neu gestartet werden. Führen Sie den folgenden Befehl aus, um gepoolte Verbindungen zu löschen: „MSSQL: Gepoolte Verbindungen löschen“
es: Habilite la agrupación de conexiones en conexiones MSSQL para mejorar el rendimiento general de la conectividad de Azure Data Studio. Esta configuración está habilitada de forma predeterminada. Azure Data Studio es necesario volver a iniciar cuando se cambia el valor. Para borrar las conexiones agrupadas, ejecute el comando "MSSQL: (borrar conexiones agrupadas"
fr: Active le regroupement de connexions sur les connexions MSSQL pour améliorer le niveau de performance global de la connectivité Azure Data Studio. Ce paramètre est activé par défaut. Azure Data Studio doit être relancé lorsque la valeur est modifiée. Pour effacer les connexions regroupées, exécutez la commande « MSSQL : Effacer les connexions groupées »
it: Abilita il pool di connessioni nelle connessioni MSSQL per migliorare le prestazioni complessive della connettività di Azure Data Studio. Questa opzione è abilitata per impostazione predefinita. È necessario riavviare Azure Data Studio quando il valore viene modificato. Per cancellare le connessioni in pool, eseguire il comando: 'MSSQL: Cancella connessioni in pool'
ja: MSSQL 接続で接続プールを有効にして、Azure Data Studio 接続の全体的なパフォーマンスを向上させます。この設定は既定で有効になっています。Azure Data Studio は、値が変更されたときに再起動する必要があります。プールされた接続をクリアするには、次のコマンドを実行します: 'MSSQL: プールされた接続のクリア'
ko: MSSQL 연결에서 연결 풀링을 사용하도록 설정하여 Azure Data Studio 연결의 전체 성능을 향상시킵니다. 이 설정은 기본적으로 사용하도록 설정되어 있습니다. 값이 변경되면 Azure Data Studio를 다시 시작해야 합니다. 풀된 연결을 지우려면 ‘MSSQL: 풀된 연결 지우기’ 명령을 실행합니다.
pt_br: Habilita o pool das conexões nas conexões MSSQL para melhorar o desempenho geral da conectividade do Azure Data Studio. Essa configuração está habilitada por padrão. O Azure Data Studio deve ser reinicializado quando o valor é alterado. Para limpar as conexões em pool, execute o comando: "MSSQL: Limpar Conexões em Pool"
ru: Позволяет использовать пулы подключений для подключений MSSQL, чтобы повысить общую производительность подключения Azure Data Studio. Этот параметр включен по умолчанию. Azure Data Studio необходимо перезапустить при изменении значения. Чтобы очистить подключения в пулах, выполните команду "MSSQL: Clear Pooled Connections"
zh_hans: 在 MSSQL 连接上启用连接池，以提高 Azure Data Studio 连接的整体性能。默认启用此设置。更改值时，需要重新启动 Azure Data Studio。若要清除共用连接，请运行以下命令:“MSSQL: Clear Pooled Connections”
zh_hant: 在 MSSQL 連線上啟用連線共用，以改善 Azure Data Studio 連線的整體效能。預設會啟用此設定。值變更時，需要重新啟動 Azure Data Studio。若要清除已建立資料庫的連線，請執行命令: 'MSSQL: 清除集區連線'

# mssql.connectionOptions.columnEncryptionSetting.description
source: Enables or disables Always Encrypted for the connection
de: Aktiviert oder deaktiviert Always Encrypted für die Verbindung.
es: Habilita o deshabilita Always Encrypted para la conexión.
fr: Active ou désactive Always Encrypted pour la connexion
it: Abilita o disabilita Always Encrypted per la connessione
ja: 接続の Always Encrypted を有効または無効にする
ko: 연결에 Always Encrypted 기능 사용 또는 사용 안 함
pt_br: Habilita ou desabilita o Always Encrypted para a conexão
ru: Включает или отключает Always Encrypted для подключения
zh_hans: 启用或禁用连接的 Always Encrypted 功能
zh_hant: 啟用或停用連線的 Always Encrypted 功能

# mssql.connectionOptions.secureEnclaves.description
source: Enables or disables Secure enclaves for the connection
de: Aktiviert oder deaktiviert sichere Enklaven für die Verbindung.
es: Habilitar o deshabilitar enclaves seguros para la conexión
fr: Active ou désactive les enclaves sécurisées pour la connexion
it: Abilita o disabilita enclave sicuri per la connessione
ja: 接続のセキュリティで保護されたエンクレーブを有効または無効にします
ko: 연결에 대해 보안 Enclave를 사용하거나 사용하지 않도록 설정합니다.
pt_br: Habilita ou desabilita enclaves Seguros para a conexão
ru: Включает или отключает защищенные анклавы для подключения
zh_hans: 启用或禁用连接的安全 enclave
zh_hant: 啟用或停用連線的安全隔離區
