Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# objectManagement.restoreDatabase.backupFilePathText
source: Backup file path
de: Sicherungsdateipfad
es: Ruta del archivo de copia de seguridad
fr: Chemin du fichier de sauvegarde
it: Percorso del file di backup
ja: バックアップ ファイルのパス
ko: 백업 파일 경로
pt_br: Caminho do arquivo de backup
ru: Путь к файлу резервной копии
zh_hans: 备份文件路径
zh_hant: 備份檔案路徑

# objectManagement.backupFailedError
source: Backup operation failed.
de: Fehler beim Sicherungsvorgang.
es: Error en la operación de copia de seguridad.
fr: L'opération de sauvegarde a échoué.
it: L'operazione di backup non è riuscita.
ja: バックアップ操作に失敗しました。
ko: 백업 작업에 실패했습니다.
pt_br: Falha na operação de backup.
ru: Ошибка при создании резервной копии.
zh_hans: 备份操作失败。
zh_hant: 備份作業失敗。

# objectManagement.backupNameLabel
source: Backup set name
de: Name des Sicherungssatzes
es: Nombre del conjunto de copia de seguridad
fr: Nom du jeu de sauvegarde
it: Nome set di backup
ja: バックアップ セット名
ko: 백업 세트 이름
pt_br: Nome do conjunto de backup
ru: Имя резервного набора данных
zh_hans: 备份集名称
zh_hant: 備份組名稱

# objectManagement.backupTypeLabel
source: Backup type
de: Sicherungstyp
es: Tipo de copia de seguridad
fr: Type de sauvegarde
it: Tipo di backup
ja: バックアップの種類
ko: 백업 유형
pt_br: Tipo de backup
ru: Тип резервной копии
zh_hans: 备份类型
zh_hant: 備份類型

# objectManagement.blockedProcThresholdLabel
source: Blocked Process Threshold
de: Schwellenwert für blockierte Prozesse
es: Umbral de procesos bloqueados
fr: Seuil de processus bloqué
it: Soglia processo bloccato
ja: ブロックされたプロセスのしきい値
ko: 차단된 프로세스 임계값
pt_br: Limite de Processo Bloqueado
ru: Порог блокированного процесса
zh_hans: 阻塞的进程阈值
zh_hant: 已封鎖的處理序臨界值

# objectManagement.bothFailedAndSuccessfulLoginsText
source: Both failed and successful logins
de: Erfolgreiche und fehlerhafte Anmeldungen
es: Inicios de sesión correctos y erróneos
fr: Connexions échouées et réussies
it: Accessi riusciti e non riusciti
ja: 失敗したログインと成功したログインの両方
ko: 실패한 로그인과 성공한 로그인 모두
pt_br: Logons com falha e bem-sucedidos
ru: Все попытки входа (удачные и неудачные)
zh_hans: 失败和成功的登录
zh_hant: 失敗和成功的登入

# objectManagement.browseFilesLabel
source: Browse files
de: Dateien durchsuchen
es: Examinar archivos
fr: Parcourir les fichiers
it: Esplora file
ja: ファイルの参照
ko: 파일 찾아보기
pt_br: Procurar arquivos
ru: Обзор файлов
zh_hans: 浏览文件
zh_hant: 瀏覽檔案

# objectManagement.browseForOwnerText
source: Browse for an owner
de: Nach einem Besitzer suchen
es: Buscar una propietario
fr: Rechercher un propriétaire
it: Cerca un proprietario
ja: 所有者を参照する
ko: 소유자 찾아보기
pt_br: Procurar um proprietário
ru: Поиск владельца
zh_hans: 浏览所有者
zh_hant: 瀏覽擁有者

# objectManagement.browseText
source: Browse…
de: Durchsuchen...
es: Examinar…
fr: Parcourir…
it: Sfoglia…
ja: 参照...
ko: 찾아보기...
pt_br: Procurar…
ru: Обзор…
zh_hans: 浏览...
zh_hant: 瀏覽...

# objectManagement.serverCPULabel
source: CPU {0}
fr: UC {0}
ru: ЦП {0}

# objectManagement.databaseProperties.fileNameExistsError
source: Cannot create file '{0}' because it already exists.
de: Die Datei „{0}“ kann nicht erstellt werden, da sie bereits vorhanden ist.
es: No se puede crear el archivo '{0}' porque ya existe.
fr: Impossible de créer le fichier « {0} » car il existe déjà.
it: Il file '{0}' esiste già. Non è possibile crearlo.
ja: ファイル '{0}' は既に存在するため、作成できません。
ko: '{0}' 파일이 이미 있으므로 이 파일을 만들 수 없습니다.
pt_br: Não é possível criar o arquivo '{0}' porque ele já existe.
ru: Невозможно создать файл "{0}", так как он уже существует.
zh_hans: 无法创建文件“{0}”，因为它已存在。
zh_hant: 無法建立檔案 '{0}'，因為檔案已存在。

# objectManagement.databaseProperties.emptyFilegroupNameError
source: Cannot use empty object names for filegroups.
de: Leere Objektnamen können nicht für Dateigruppen verwendet werden.
es: No se pueden usar nombres de objeto vacíos para grupos de archivos.
fr: Impossible d’utiliser des noms d’objets vides pour les groupes de fichiers.
it: Non è possibile utilizzare nomi di oggetto vuoti per gruppi di file.
ja: ファイル グループに空のオブジェクト名を使用することはできません。
ko: 파일 그룹에 빈 개체 이름을 사용할 수 없습니다.
pt_br: Não é possível usar nomes de objetos vazios para grupos de arquivo.
ru: Нельзя указывать пустые имена объектов для файловых групп.
zh_hans: 无法将空对象名用于文件组。
zh_hant: 不可將空的物件名稱用於檔案群組。

# objectManagement.backupCertificate
source: Certificate or Asymmetric key
de: Zertifikat oder asymmetrischer Schlüssel
es: Certificado o clave asimétrica
fr: Certificat ou clé asymétrique
it: Certificato o chiave asimmetrica
ja: 証明書または非対称キー
ko: 인증서 또는 비대칭 키
pt_br: Chave de Certificado ou Assimétrica
ru: Сертификат или асимметричный ключ
zh_hans: 证书或非对称密钥
zh_hant: 憑證或非對稱金鑰

# objectManagement.needToRestartServer
source: Changes require server restart in order to be effective
de: Änderungen erfordern einen Neustart des Servers, damit sie wirksam werden.
es: Los cambios requieren reiniciar el servidor para que sean efectivos
fr: Les modifications nécessitent le redémarrage du serveur pour être efficaces
it: Le modifiche richiedono il riavvio del server per essere effettive
ja: 変更を有効にするには、サーバーの再起動が必要です
ko: 변경 내용을 적용하려면 서버를 다시 시작해야 합니다.
pt_br: As alterações exigem a reinicialização do servidor para entrar em vigor
ru: Чтобы изменения вступили в силу, требуется перезапуск сервера
zh_hans: 更改需要重新启动服务器才能生效
zh_hant: 變更需要重新啟動伺服器才能生效

# objectManagement.restoreDatabase.restorePlan.checkpointLSNText
source: Checkpoint LSN
de: Prüfpunkt-LSN
es: LSN de punto de comprobación
fr: NSE du point de contrôle
it: LSN checkpoint
ja: チェックポイントの LSN
ko: 검사점 LSN
pt_br: LSN do Ponto de Verificação
ru: Номер LSN для контрольной точки
zh_hans: 检查点 LSN
zh_hant: 檢查點 LSN

# objectManagement.closeConnections
source: Close existing connections
de: Vorhandene Verbindungen schließen
es: Cerrar las conexiones existentes
fr: Fermer les connexions existantes
it: Chiudi connessioni esistenti
ja: 既存の接続を閉じる
ko: 기존 연결 닫기
pt_br: Fechar conexões existentes
ru: Закрыть существующие соединения
zh_hans: 关闭现有连接
zh_hant: 關閉現有的連接

# objectManagement.restoreDatabase.closeExistingConnectionText
source: Close existing connections to destination database
de: Bestehende Verbindungen mit der Zieldatenbank schließen
es: Cerrar las conexiones existentes a la base de datos de destino
fr: Fermer les connexions existantes à la base de données de destination
it: Chiudi connessioni esistenti ai database di destinazione
ja: 接続先データベースへの既存の接続を閉じる
ko: 대상 데이터베이스에 대한 기존 연결 닫기
pt_br: Fechar as conexões existentes com o banco de dados de destino
ru: Закрыть существующие соединения с базой данных назначения
zh_hans: 关闭到目标数据库的现有连接
zh_hant: 關閉目的地資料庫的現有連接

# objectManagement.collationLabel
source: Collation
de: Sortierung
es: Intercalación
fr: Classement
it: Regole di confronto
ja: 照合
ko: 데이터 정렬
pt_br: Agrupamento
ru: Параметры сортировки
zh_hans: 排序规则
zh_hant: 定序

# objectManagement.compatibilityLevelLabel
source: Compatibility Level
de: Kompatibilitätsgrad
es: Nivel de compatibilidad
fr: Niveau de compatibilité
it: Livello di compatibilità
ja: 互換性レベル
ko: 호환성 수준
pt_br: Nível de Compatibilidade
ru: Уровень совместимости
zh_hans: 兼容级别
zh_hant: 相容性層級

# objectManagement.restoreDatabase.restorePlan.componentText
source: Component
de: Komponente
es: Componente
fr: Composant
it: Componente
ja: コンポーネント
ko: 구성 요소
pt_br: Componente
ru: Компонент
zh_hans: 组件
zh_hant: 元件

# objectManagement.compressBackupText
source: Compress Backup
de: Sicherung komprimieren
es: Comprimir Backup
fr: Compresser Sauvegarde Microsoft Azure
it: Comprimi backup
ja: バックアップを圧縮する
ko: 백업 압축
pt_br: Compactar Backup
ru: Сжатие резервной копии
zh_hans: 压缩备份
zh_hant: 壓縮備份

# objectManagement.compressBackup
source: Compress backup
de: Sicherung komprimieren
es: Comprimir copia de seguridad
fr: Compressez la sauvegarde
it: Comprimi backup
ja: バックアップの圧縮
ko: 백업 압축
pt_br: Compactar backup
ru: Сжимать резервные копии
zh_hans: 压缩备份
zh_hant: 壓縮備份

# objectManagement.configureSLOSectionHeader
source: Configure SLO
de: SLO konfigurieren
es: Configurar SLO
fr: Configurer l’objectif de niveau de service
it: Configurare SLO
ja: SLO の構成
ko: SLO 구성
pt_br: Configurar o SLO
ru: Настройка целевого уровня обслуживания
zh_hans: 配置 SLO
zh_hant: 設定 SLO

# objectManagement.confirmPasswordLabel
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# objectManagement.containmentTypeLabel
source: Containment Type
de: Eigenständigkeitstyp
es: Tipo de independencia
fr: Type d'autonomie
it: Tipo di indipendenza
ja: 包含の種類
ko: 포함 유형
pt_br: Tipo de Contenção
ru: Тип автономности
zh_hans: 包含类型
zh_hant: 內含項目類型

# objectManagement.backupContinueOnError
source: Continue on error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuez en cas d’erreur
it: Continuare in caso di errore
ja: エラー時に続行
ko: 오류 발생 시 계속
pt_br: Continuar em caso de erro
ru: Продолжить при ошибке
zh_hans: 出错时继续
zh_hant: 錯誤時繼續

# objectManagement.backupCopyLabel
source: Copy-only backup
de: Kopiesicherung
es: Copia de seguridad de solo copia
fr: Sauvegarde de copie uniquement
it: Backup di sola copia
ja: コピーのみのバックアップ
ko: 복사 전용 백업
pt_br: Backup somente cópia
ru: Только архивное копирование
zh_hans: 仅复制备份
zh_hant: 僅複製備份

# objectManagement.costThresholdParallelismLabel
source: Cost Threshold Parallelism
de: Parallelität des Kostenschwellenwerts
es: Paralelismo del umbral de costo
fr: Parallélisme du seuil de coût
it: Parallelismo soglia di costo
ja: コストしきい値の並列処理
ko: 비용 임계값 병렬 처리
pt_br: Paralelismo de Limite de Custo
ru: Стоимостный порог параллелизма
zh_hans: 成本阈值并行度
zh_hant: 成本閾值平行處理原則

# objectManagement.noDialogFoundError
source: Could not find a supported dialog for node type '{0}' and object type '{1}'.
de: Es wurde kein unterstütztes Dialogfeld für Knotentyp '{0}' und Objekttyp '{1}' gefunden.
es: No se encontró un cuadro de diálogo compatible para el tipo de nodo "{0}" y el tipo de objeto "{1}".
fr: Impossible de trouver une boîte de dialogue prise en charge pour le type de nœud '{0}' et le type d'objet '{1}'.
it: Impossibile trovare una finestra di dialogo supportata per il tipo di nodo '{0}' e il tipo di oggetto '{1}'.
ja: ノードの種類 '{0}' とオブジェクトの種類 '{1}' でサポートされているダイアログが見つかりませんでした。
ko: 노드 유형 '{0}' 및 개체 유형 '{1}'에 대해 지원되는 대화 상자를 찾을 수 없습니다.
pt_br: Não foi possível localizar uma caixa de diálogo com suporte para o tipo de nó '{0}' e o tipo de objeto '{1}'.
ru: Не удалось найти поддерживаемое диалоговое окно для типа узла "{0}" и типа объекта "{1}".
zh_hans: 找不到节点类型“{0}”和对象类型“{1}”支持的对话框。
zh_hant: 找不到節點類型 '{0}' 和物件類型 '{1}' 支援的對話方塊。

# objectManagement.createObjectLabel
source: Create
de: Erstellen
es: Crear
fr: Créer
it: Crea
ja: 作成
ko: 만들기
pt_br: Criar
ru: Создать
zh_hans: 创建
zh_hant: 建立

# objectManagement.createObjectOperationName
source: Create {0}
de: {0} erstellen
es: Crear {0}
fr: Créer {0}
it: Crea {0}
ja: {0} の作成
ko: {0} 만들기
pt_br: Criar {0}
ru: Создать {0}
zh_hans: 创建 {0}
zh_hant: 建立 {0}

# objectManagement.blankPasswordConfirmation
source: Creating a login with a blank password is a security risk. Are you sure you want to continue?
de: Das Erstellen eines Anmeldenamens mit leerem Kennwort stellt ein Sicherheitsrisiko dar. Möchten Sie den Vorgang wirklich fortsetzen?
es: La creación de un inicio de sesión con una contraseña en blanco presenta un riesgo de seguridad. ¿Está seguro de que desea continuar?
fr: La création d'une connexion avec un mot de passe vide pose un problème de sécurité. Êtes-vous sûr de vouloir continuer ?
it: La creazione di un account di accesso con password vuota rappresenta un rischio per la sicurezza. Continuare?
ja: パスワードを空白にしてログインを作成すると、セキュリティ上の危険を伴います。続行しますか?
ko: 암호가 없는 로그인을 만들면 보안상 위험합니다. 계속하시겠습니까?
pt_br: A criação de um logon com uma senha em branco é um risco à segurança. Tem certeza de que deseja continuar?
ru: Создание имени для входа с пустым паролем создает угрозу безопасности. Продолжить?
zh_hans: 创建登录名时使用空密码将会带来安全隐患。是否确实要继续?
zh_hant: 建立密碼為空白的登入，會有安全性的風險。您確定要繼續嗎?

# objectManagement.databaseProperties.queryStoreCurrentDiskUsageSectionText
source: Current Disk Usage
de: Aktuelle Datenträgernutzung
es: Uso de disco actual
fr: Utilisation du disque actuelle
it: Utilizzo disco corrente
ja: 現在のディスク使用状況
ko: 현재 디스크 사용
pt_br: Uso do Disco Atual
ru: Текущее использование диска
zh_hans: 当前磁盘使用情况
zh_hant: 目前的磁碟使用量

# objectManagement.currentSLOLabel
source: Current Service Level Objective
de: Aktuelles SLO
es: Objetivo de nivel de servicio actual
fr: Objectif de niveau de service actuel
it: Obiettivo di livello di servizio corrente
ja: 現在のサービス レベル目標
ko: 현재 서비스 수준 목표
pt_br: Objetivo de Nível de Serviço Atual
ru: Текущая цель уровня обслуживания
zh_hans: 当前服务级别目标
zh_hant: 目前的服務等級目標

# objectManagement.cursorThresholdLabel
source: Cursor Threshold
de: Cursorschwellenwert
es: Umbral de cursor
fr: Seuil du curseur
it: Soglia cursore
ja: カーソルのしきい値
ko: 커서 임계값
pt_br: Limite de Cursor
ru: Порог курсора
zh_hans: 游标阈值
zh_hant: 資料指標臨界值

# objectManagement.databaseProperties.queryStoreCapturemodeCustomText
source: Custom
de: Benutzerdefiniert
es: Personalizado
fr: Personnalisé
it: Personalizzato
ja: カスタム
ko: 사용자 지정
pt_br: Personalizado
ru: Настраиваемый
zh_hans: 自定义
zh_hant: 自訂

# objectManagement.databaseName
source: DB Name
de: Datenbankname
es: Nombre de BD
fr: Nom de base de données
it: Nome database
ja: DB 名
ko: DB 이름
pt_br: Nome do Banco de dados
ru: Имя базы данных
zh_hans: DB 名称
zh_hant: 資料庫名稱

# objectManagement.dataLocationText
source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
ru: Данные
zh_hans: 数据
zh_hant: 資料

# objectManagement.dataFileLabel
source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
ru: Данные
zh_hans: 数据
zh_hant: 資料

# objectManagement.restoreDatabase.dataFileFolderText
source: Data File Folder
de: Datendateiordner
es: Carpeta de archivos de datos
fr: Dossier du fichier de données
it: Cartella file di dati:
ja: データ ファイル フォルダー
ko: 데이터 파일 폴더
pt_br: Pasta do Arquivo de Dados
ru: Папка файла данных
zh_hans: 数据文件文件夹
zh_hant: 資料檔案資料夾

# objectManagement.databaseProperties.dataFlushIntervalInMinutesText
source: Data Flush Interval (Minutes)
de: Datenleerungsintervall (Minuten)
es: Intervalo de vaciado de datos (minutos)
fr: Intervalle de vidage des données (minutes)
it: Intervallo di scaricamento dati (minuti)
ja: データのフラッシュ間隔 (分)
ko: 데이터 플러시 간격(분)
pt_br: Intervalo de liberação de dados (minutos)
ru: Интервал записи данных на диск (в минутах)
zh_hans: 数据刷新间隔(分钟)
zh_hant: 資料排清間隔 (分鐘)

# objectManagement.databaseProperties.fileGroupNotApplicableText
source: DataFile '{0}' could not be added to the collection, because it already exists.
de: DataFile „{0}“ konnte nicht zur Auflistung hinzugefügt werden, da bereits vorhanden.
es: El archivo de datos '{0}' no se ha podido agregar a la colección porque ya existe.
fr: Le DataFile « {0} » n'a pas pu être ajouté à la collection, car il existe déjà.
it: Impossibile aggiungere DataFile '{0}' alla raccolta perché esiste già.
ja: DataFile '{0}' は既に存在するため、コレクションに追加できませんでした。
ko: '{0}' DataFile이 이미 있으므로 컬렉션에 추가할 수 없습니다.
pt_br: o DataFile '{0}' não pôde ser adicionado à coleção, porque ele já existe.
ru: Не удалось добавить файл данных "{0}" в коллекцию, так как он уже существует.
zh_hans: DataFile "{0}" 无法添加到集合中，因为它已存在。
zh_hant: 因為 DataFile '{0}' 已存在，所以無法將其新增至集合中。

# objectManagement.databaseProperties.databaseSectionHeader
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Base de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# objectManagement.restoreDatabase.restoreFromDatabaseOptionText
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# objectManagement.restoreDatabase.databaseText
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# objectManagement.DatabaseDisplayNameInTitle
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# objectManagement.restoreDatabase
source: Database '{0}' already exists. Choose a different database name.
de: Datenbank „{0}“ existiert bereits. Wählen Sie einen anderen Datenbanknamen.
es: La base de datos \"{0}\" ya existe. Elija otro nombre de base de datos distinto.
fr: La base de données '{0}' existe déjà. Choisissez un autre nom de base de données.
it: Il database '{0}' esiste già. Scegliere un nome di database diverso.
ja: データベース '{0}' は既に存在します。別のデータベース名を選択してください。
ko: 데이터베이스 '{0}'이(가) 이미 있습니다. 다른 데이터베이스 이름을 선택하세요.
pt_br: O banco de dados '{0}' já existe. Escolha um nome de banco de dados diferente.
ru: База данных \"{0}\" уже существует. Выберите другое имя базы данных.
zh_hans: 数据库 '{0}' 已存在。请选择其他数据库名称。
zh_hant: 資料庫 '{0}' 已存在。請選擇其他資料庫名稱。

# objectManagement.databaseFilesFilterLabel
source: Database Data Files
de: Datenbankdatendateien
es: Archivos de datos de base de datos
fr: Fichiers de données de base de données
it: File di dati del database
ja: データベース データ ファイル
ko: 데이터베이스 데이터 파일
pt_br: Arquivos de Dados do Banco de Dados
ru: Файлы данных базы данных
zh_hans: 数据库数据文件
zh_hant: 資料庫資料檔案

# objectManagement.databaseDetails
source: Database Details
de: Datenbankdetails
es: Detalles de la base de datos
fr: Détails de la base de données
it: Dettagli database
ko: 데이터베이스 세부 정보
pt_br: Detalhes do Banco de Dados
ru: Сведения о базе данных
zh_hans: 数据库详细信息
zh_hant: 資料庫詳細資料

# objectManagement.databaseFiles
source: Database Files
de: Datenbankdateien
es: Archivos de la base de datos
fr: Fichiers de la base de données
it: File di database
ja: データベース File
ko: 데이터베이스 파일
pt_br: Arquivos de Banco de Dados
ru: Файлы базы данных
zh_hans: 数据库文件
zh_hant: 資料庫檔案

# objectManagement.databaseProperties.databaseNameLabel
source: Database Name
de: Datenbankname
es: Nombre de la base de datos
fr: Nom de la base de données
it: Nome database
ja: データベース名
ko: 데이터베이스 이름
pt_br: Nome do Banco de Dados
ru: Имя базы данных
zh_hans: 数据库名称
zh_hant: 資料庫名稱

# objectManagement.databaseProperties.databaseReadOnlyText
source: Database Read-Only
de: Datenbank schreibgeschützt
es: Base de datos de solo lectura
fr: Base de données en lecture seule
it: Database di sola lettura
ja: 読み取り専用データベース
ko: 데이터베이스 읽기 전용
pt_br: Banco de Dados Somente Leitura
ru: База данных только для чтения
zh_hans: 数据库为只读的
zh_hant: 資料庫唯讀

# objectManagement.DatabaseRoleTypeDisplayNameInTitle
source: Database Role
de: Datenbankrolle
es: Rol de base de datos
fr: Rôle de base de données
it: Ruolo del database
ja: データベース ロール
ko: 데이터베이스 역할
pt_br: Função de Banco de Dados
ru: Роль базы данных
zh_hans: 数据库角色
zh_hant: 資料庫角色

source: Database Scoped Configuration
de: Datenbankweit gültige Konfiguration
es: Configuración con ámbito de base de datos
fr: Configuration étendue de la base de données
it: Configurazione con ambito database
ja: データベース スコープ構成
ko: 데이터베이스 범위 구성
pt_br: Configuração de Escopo do Banco de Dados
ru: Конфигурация области баз данных
zh_hans: 数据库范围的配置
zh_hant: 資料庫範圍設定

# objectManagement.databaseProperties.databaseScopedOptionsColumnHeader
source: Database Scoped Options
de: Datenbankbezogene Optionen
es: Opciones de ámbito de base de datos
fr: Configuration étendue de la base de données
it: Opzioni con ambito database
ja: データベース スコープ オプション
ko: 데이터베이스 범위 옵션
pt_br: Opções no Escopo do Banco de Dados
ru: Параметры области базы данных
zh_hans: 数据库作用域选项
zh_hant: 資料庫範圍選項

# objectManagement.databaseSettings
source: Database Settings
de: Datenbankeinstellungen
es: Configuración de la base de datos
fr: Paramètres de base de données
it: Impostazioni database
ja: データベースの設定
ko: 데이터베이스 설정
pt_br: Configurações do Banco de Dados
ru: Параметры базы данных
zh_hans: 数据库设置
zh_hant: 資料庫設定

# objectManagement.databaseProperties.databaseStateText
source: Database State
de: Datenbankzustand
es: Estado de la base de datos
fr: État de la base de données
it: Stato database
ja: データベース状態
ko: 데이터베이스 상태
pt_br: Estado do Banco de Dados
ru: Состояние базы данных
zh_hans: 数据库状态
zh_hant: 資料庫狀態

# objectManagement.defaultLocationsLabel
source: Database default locations
de: Standardspeicherorte für Datenbank
es: Ubicaciones predeterminadas de la base de datos
fr: Emplacements par défaut de la base de données
it: Percorsi predefiniti database
ja: データベースの既定の場所
ko: 데이터베이스 기본 위치
pt_br: Locais padrão de banco de dados
ru: Места хранения, используемые базой данных по умолчанию
zh_hans: 数据库默认位置
zh_hant: 資料庫預設位置

# objectManagement.databaseProperties.databaseFilesText
source: Database files
de: Datenbankdateien
es: Archivos de base de datos
fr: Fichiers de base de données
it: File di database
ja: データベース ファイル
ko: 데이터베이스 파일
pt_br: Arquivos de banco de dados
ru: Файлы баз данных
zh_hans: 数据库文件
zh_hant: 資料庫檔案

# objectManagement.databasesToAttach
source: Databases to Attach
de: Anzufügende Datenbanken
es: Bases de datos para adjuntar
fr: Bases de données à attacher
it: Database da collegare
ja: アタッチするデータベース
ko: 연결할 데이터베이스
pt_br: Bancos de dados a serem anexados:
ru: Базы данных для подключения
zh_hans: 要附加的数据库
zh_hant: 要附加的資料庫

# objectManagement.databaseProperties.dateCreated
source: Date Created
de: Erstellungsdatum
es: Fecha de creación
fr: Date Créée
it: Data di creazione
ja: 作成日
ko: 만든 날짜
pt_br: Data de Criação
ru: Дата создания
zh_hans: 创建日期
zh_hant: 建立日期

# objectManagement.databaseProperties.defaultText
source: Default
de: Standard
es: Predeterminado
fr: Par défaut
it: Predefinito
ja: 既定
ko: 기본값
pt_br: Padrão
ru: По умолчанию
zh_hans: 默认
zh_hant: 預設

# objectManagement.defaultFullTextLanguageLabel
source: Default Full-Text Language
de: Volltext-Standardsprache
es: Idioma de texto completo predeterminado
fr: Langue de texte intégral par défaut
it: Lingua predefinita full-text
ja: 既定のフルテキスト言語
ko: 기본 전체 텍스트 언어
pt_br: Idioma de Texto Completo Padrão
ru: Язык полнотекстового поиска по умолчанию
zh_hans: 默认全文语言
zh_hant: 預設全文檢索語言

# objectManagement.defaultLanguageLabel
source: Default Language
de: Standardsprache
es: Idioma predeterminado
fr: Langue par défaut
it: Lingua predefinita
ja: 既定の言語
ko: 기본 언어
pt_br: Idioma Padrão
ru: Язык по умолчанию
zh_hans: 默认语言
zh_hant: 預設語言

# objectManagement.login.defaultDatabaseLabel
source: Default database
de: Standarddatenbank
es: Base de datos predeterminada
fr: Base de données par défaut
it: Database predefinito
ja: 既定のデータベース
ko: 기본 데이터베이스
pt_br: Banco de dados padrão
ru: База данных по умолчанию
zh_hans: 默认数据库
zh_hant: 預設資料庫

# objectManagement.login.defaultLanguageLabel
source: Default language
de: Standardsprache
es: Idioma predeterminado
fr: Langue par défaut
it: Lingua predefinita
ja: 既定の言語
ko: 기본 언어
pt_br: Idioma padrão
ru: Язык по умолчанию
zh_hans: 默认语言
zh_hant: 預設語言

# objectManagement.user.defaultSchemaLabel
source: Default schema
de: Standardschema
es: Esquema predeterminado
fr: Schéma par défaut
it: Schema predefinito
ja: 既定のスキーマ
ko: 기본 스키마
pt_br: Esquema padrão
ru: Схема по умолчанию
zh_hans: 默认架构
zh_hant: 預設結構描述

# objectManagement.deleteBackupHistory
source: Delete backup and restore history information for database
de: Informationen zum Sicherungs- und Wiederherstellungsverlauf für Datenbanken löschen
es: Eliminar la información del historial de copia de seguridad y restauración de la base de datos
fr: Supprimer les informations d’historique de sauvegarde et de restauration pour la base de données
it: Eliminare informazioni cronologia di backup e ripristino per database
ja: データベースのバックアップと復元の履歴情報を削除する
ko: 백업 삭제 후 데이터베이스에 대한 기록 정보 복원
pt_br: Excluir backup e restaurar informações de histórico para banco de dados
ru: Удалить для базы данных данные журнала резервного копирования и восстановления
zh_hans: 删除数据库的备份和还原历史记录信息
zh_hant: 刪除資料庫的備份和還原記錄資訊
