Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.ir.setup.step3.alternate
source: Step 3: Click on the Refresh button above to check the connection between Azure Database Migration Service and integration runtime
de: Schritt 3: Klicken Sie oben auf die Schaltfläche "Aktualisieren", um die Verbindung zwischen Azure Database Migration Service und Integration Runtime zu überprüfen
es: Paso 3: Haga clic en el botón "Actualizar" para comprobar la conexión entre Azure Database Migration Service y el entorno de ejecución de integración
fr: Étape 3 : Cliquez sur le bouton Actualiser ci-dessus pour vérifier la connexion entre Azure Database Migration Service et le runtime d’intégration
ja: 手順 3: 上の [最新の情報に更新] ボタンをクリックして、Azure Database Migration Service と統合ランタイムの間の接続を確認します
ko: 3단계: 위의 새로 고침 단추를 클릭하여 Azure Database Migration Service와 통합 런타임 간의 연결을 확인합니다.
pt_br: Etapa 3: clique no botão acima Atualizar para verificar a conexão entre o Serviço de Migração de Banco de Dados do Azure e o runtime de integração
ru: Шаг 3. Нажмите выше кнопку "Обновить", чтобы проверить соединение между Azure Database Migration Service и средой выполнения интеграции.
zh_hans: 步骤 3: 单击上方“刷新”按钮，以检查 Azure 数据库迁移服务与集成运行时之间的连接
zh_hant: 步驟 3: 按一下上方的 [重新整理] 按鈕，檢查 Azure 資料庫移轉服務與整合執行階段之間的連線

# sql.migration.multi.step.status.dialog.heading
source: Step details
de: Schrittdetails
es: Detalles del paso
fr: Détails de l’étape
ja: ステップの詳細
ko: 단계 세부 정보
pt_br: Detalhes da etapa
ru: Сведения о шаге
zh_hans: 步骤详细信息
zh_hant: 步驟詳細資料

# sql.migration.multi.step.status
source: Step status: {0}
de: Schrittstatus: {0}
es: Estado del paso: {0}
fr: État de l’étape : {0}
ja: ステップの状態: {0}
ko: 단계 상태: {0}
pt_br: Status da etapa: {0}
ru: Состояние шага: {0}
zh_hans: 步骤状态: {0}
zh_hant: 步驟狀態: {0}

# sql.migration.multi.step.status.errors
source: Step status: {0}{1}{2}
de: Schrittstatus: {0}{1}{2}
es: Estado del paso: {0}{1}{2}
fr: État de l’étape : {0}{1}{2}
ja: ステップの状態: {0}{1}{2}
ko: 단계 상태: {0}{1}{2}
pt_br: Status da etapa: {0}{1}{2}
ru: Состояние шага: {0}{1}{2}
zh_hans: 步骤状态: {0}{1}{2}
zh_hant: 步驟狀態: {0}{1}{2}

# sql.migration.multi.step.status.steps.title
source: Steps
de: Schritte
es: Pasos
fr: Étapes
ja: ステップ
ko: 단계
pt_br: Etapas
ru: Шаги
zh_hans: 步骤
zh_hant: 步驟

# sql.migration.sku.stop.performance.collection
source: Stop data collection
de: Datensammlung beenden
es: Detener recopilación de datos
fr: Arrêter la collecte de données
ja: データ収集の停止
ko: 데이터 수집 중지
pt_br: Interromper a Coleta de Dados
ru: Остановить сбор данных
zh_hans: 停止数据收集
zh_hant: 停止資料收集

# sql.migration.validate.ir.stop.validation
source: Stop validation
de: Validierung beenden
es: Detener validación
fr: Arrêter la validation
ja: 検証を停止
ko: 유효성 검사 중지
pt_br: Parar validação
ru: Остановить проверку
zh_hans: 停止验证
zh_hant: 停止驗證

# sql.migration.sku.azureRecommendation.stop.popup
source: Stopping performance data collection...
de: Leistungsdatensammlung wird beendet...
es: Deteniendo la recopilación de datos de rendimiento...
fr: Arrêt de la collecte des données de performances...
ja: パフォーマンス データ収集を停止しています...
ko: 성능 데이터 수집을 중지하는 중...
pt_br: Interrompendo a coleta de dados de desempenho...
ru: Остановка сбора данных о производительности…
zh_hans: 正在停止性能数据收集...
zh_hant: 正在停止效能資料收集...

# sql.migration.sku.targetStorageConfiguration.storage
source: Storage
de: Speicher
es: Almacenamiento
fr: Stockage
ja: ストレージ
ko: 스토리지
pt_br: Armazenamento
ru: Хранилище
zh_hans: 存储
zh_hant: 儲存體

# sql.migration.select.storage.account.label
source: Storage Account
zh_hans: 存储帐户

# sql.migration.storage.account.details.label
source: Storage account
zh_hans: 存储帐户

# sql.migration.network.share.azure.header
source: Storage account details
de: Speicherkontodetails
es: Detalles de la cuenta de almacenamiento
fr: Détails du compte de stockage
ja: ストレージ アカウントの詳細
ko: 스토리지 계정 세부 정보
pt_br: Detalhes da conta de armazenamento
ru: Сведения об учетной записи хранения
zh_hans: 存储帐户详细信息
zh_hant: 儲存體帳戶詳細資料

# sql.migration.subscription
source: Subscription
de: Abonnement
es: Suscripción
fr: Abonnement
ja: サブスクリプション
ko: 구독
pt_br: Assinatura
ru: Подписка
zh_hans: 订阅
zh_hant: 訂用帳戶

# sql.migration.blob.storage.subscription.label
source: Subscription
de: Abonnement
es: Suscripción
fr: Abonnement
ja: サブスクリプション
ko: 구독
pt_br: Assinatura
ru: Подписка
zh_hans: 订阅
zh_hant: 訂用帳戶

# sql.migration.dms.subscription
source: Subscription name for your Azure Database Migration Service
de: Abonnementname für Ihren Azure Database Migration Service
es: Nombre de suscripción para su servicio de Azure Database Migration Service.
fr: Nom de l’abonnement pour votre Azure Database Migration Service
ja: Azure Database Migration Service のサブスクリプション名。
ko: Azure Database Migration Service의 구독 이름
pt_br: Nome da assinatura para seu Serviço de Migração de Banco de Dados do Azure
ru: Имя подписки для Azure Database Migration Service
zh_hans: Azure 数据库迁移服务的订阅名称
zh_hant: Azure 資料庫移轉服務的訂用帳戶名稱

# sql.migration.services.subscription
source: Subscription name for your Azure Database Migration Service.
de: Abonnementname für Ihren Azure Database Migration Service.
es: Nombre de suscripción para su Azure Database Migration Service.
fr: Nom de l’abonnement pour votre Azure Database Migration Service.
ja: Azure Database Migration Service のサブスクリプション名。
ko: Azure Database Migration Service의 구독 이름입니다.
pt_br: Nome da assinatura para o seu Serviço de Migração de Banco de Dados do Azure.
ru: Имя подписки для Azure Database Migration Service.
zh_hans: Azure 数据库迁移服务的订阅名称。
zh_hant: Azure 資料庫移轉服務的訂用帳戶名稱。

# sql.migration.sku.subscription
source: Subscription name for your Azure SQL target
de: Abonnementname für Ihr Azure SQL-Ziel
es: Nombre de la suscripción para su destino de Azure SQL
fr: Nom de l’abonnement pour votre cible Azure SQL
ja: Azure SQL ターゲットのサブスクリプション名
ko: Azure SQL 대상의 구독 이름
pt_br: Nome da assinatura para o destino do SQL do Azure
ru: Имя подписки для целевого объекта Azure SQL
zh_hans: Azure SQL 目标的订阅名称
zh_hant: Azure SQL 目標的訂用帳戶名稱

# sql.migration.storage.account.subscription
source: Subscription name for your Storage Account
zh_hans: 存储帐户的订阅名称

# sql.migration.state.succeeded
source: Succeeded
de: Erfolgreich
es: Correcto
fr: Réussite
ja: 成功
ko: 성공
pt_br: Com êxito
ru: Выполнено
zh_hans: 成功
zh_hant: 已成功

# sql.migration.tde.validation.status.succeeded
source: Succeeded
de: Erfolgreich
es: Correcto
fr: Réussi
ja: 成功
ko: 성공
pt_br: Bem-sucedido
ru: Успешно
zh_hans: 成功
zh_hant: 已成功

# sql.migration.copy.status.succeeded
source: Succeeded
de: Erfolgreich
es: Correcto
fr: Réussite
ja: 成功
ko: 성공
pt_br: Com êxito
ru: Успешно
zh_hans: 成功
zh_hant: 已成功

# sql.migration.status.succeeded
source: Succeeded
de: Erfolgreich
es: Correcto
fr: Réussite
ja: 成功しました
ko: 성공함
pt_br: Com êxito
ru: Успешно
zh_hans: 成功
zh_hant: 已成功

# sql.migration.validation.state.succeeded
source: Succeeded
de: Erfolgreich
es: Correcto
fr: Réussite
ja: 成功
ko: 성공
pt_br: Êxito
ru: Успешно
zh_hans: 成功
zh_hant: 已成功

# sql.login.migration.status.succeeded
source: Succeeded
de: Erfolgreich
es: Correcto
fr: Opération réussie
ja: 成功しました
ko: 성공
pt_br: Com êxito
ru: Успешно
zh_hans: 成功
zh_hant: 已成功

# sql.migration.details.serverobjects.successful.tables.label
source: Successful
de: Erfolgreich
es: Correcto
fr: Réussi
ja: 成功
ko: 성공
pt_br: Bem-sucedido
ru: Успешно
zh_hans: 成功
zh_hant: 成功

# sql.migration.database.migration.service.created.successfully
source: Successfully created a Database Migration Service.
de: Ein Database Migration Service wurde erfolgreich erstellt.
es: Se creó correctamente un Database Migration Service.
fr: Création réussie d’un Database Migration Service
ja: Database Migration Service が正常に作成されました。
ko: 데이터베이스 마이그레이션 서비스를 생성했습니다.
pt_br: Um Serviço de Migração de Banco de Dados foi criado com êxito.
ru: Создание Database Migration Service выполнено.
zh_hans: 已成功创建数据库迁移服务。
zh_hant: 已成功建立資料庫移轉服務。

# sql.migration.save.assessment.report.success
source: Successfully saved assessment report to {0}.
de: Der Bewertungsbericht wurde erfolgreich in {0} gespeichert.
es: El informe de evaluación se guardó correctamente en {0}.
fr: Rapport d’évaluation enregistré dans {0}.
ja: 評価レポートが {0} に正常に保存されました。
ko: 평가 보고서를 {0}에 저장했습니다.
pt_br: Relatório de avaliação salvo com êxito em {0}.
ru: Отчет об оценке успешно сохранен в {0}.
zh_hans: 已成功将评估报告保存到 {0}。
zh_hant: 已成功將評定報告儲存至 {0}。

# sql.migration.save.recommendation.report.success
source: Successfully saved recommendation report to {0}.
de: Der Empfehlungsbericht wurde erfolgreich in {0} gespeichert.
es: El informe de recomendaciones se guardó correctamente en {0}.
fr: Rapport de recommandation enregistré dans {0}.
ja: 推奨事項レポートが {0} に正常に保存されました。
ko: 권장 사항 보고서를 {0}에 저장했습니다.
pt_br: Relatório de recomendação salvo com êxito em {0}.
ru: Отчет о рекомендациях успешно сохранен в {0}.
zh_hans: 已成功将建议报告保存到 {0}。
zh_hant: 已成功將建議報告儲存至 {0}。

# sql.migration.summary.page.title
source: Summary
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
ja: 概要
ko: 요약
pt_br: Resumo
ru: Сводка
zh_hans: 摘要
zh_hant: 摘要

# sql.migration.summary.title
source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
ja: 要約
ko: 요약
pt_br: Resumo
ru: Сводка
zh_hans: 摘要
zh_hant: 摘要

# sql.migration.support.request.title
source: Support request
de: Supportanfrage
es: Solicitud de soporte técnico
fr: Demande de support
ko: 지원 요청
pt_br: Solicitação de suporte
ru: Запрос на поддержку
zh_hans: 支持请求
zh_hant: 支援要求

# sql.migration.support.resources.title
source: Support resources
de: Supportressourcen
es: Recursos de soporte técnico
fr: Ressources de support
ja: サポート リソース
ko: 지원 리소스
pt_br: Recursos de suporte
ru: Ресурсы поддержки
zh_hans: 支持资源
zh_hant: 支援資源

# sql.migration.tde.migrate.required
source: TDE certificate migration must be successful before continuing.
de: Bevor Sie fortfahren können, muss die TDE-Zertifikatmigration erfolgreich durchgeführt worden sein.
es: La migración de certificados TDE debe realizarse correctamente antes de continuar.
fr: La migration du certificat TDE doit réussir avant de continuer.
ja: 続行する前に、TDE 証明書の移行が正常に行われる必要があります。
ko: 계속하려면 먼저 TDE 인증서 마이그레이션에 성공해야 합니다.
pt_br: A migração do certificado TDE deve ser bem-sucedida antes de continuar.
ru: Прежде чем продолжить, необходимо успешно выполнить миграцию сертификата TDE.
zh_hans: 必须先成功迁移 TDE 证书，然后才能继续。
zh_hant: TDE 憑證移轉必須成功才能繼續。

# sql.migration.table.error.title
source: Table migration status details
de: Details zum Tabellenmigrationsstatus
es: Detalles del estado de migración de la tabla
fr: Détails de l'état de la migration des tables
ja: テーブル移行状態の詳細
ko: 테이블 마이그레이션 상태 세부 정보
pt_br: Detalhes do status de migração de tabela
ru: Сведения о состоянии миграции таблицы
zh_hans: 表迁移状态详细信息
zh_hant: 資料表移轉狀態詳細資料

# sql.migration.table.migration.status.label
source: Table migration status: {0}
de: Tabellenmigrationsstatus: {0}
es: Estado de migración de la tabla: {0}
fr: État de la migration des tables : {0}
ja: テーブル移行の状態: {0}
ko: 테이블 마이그레이션 상태: {0}
pt_br: Status de migração de tabela: {0}
ru: Состояние переноса таблицы: {0}
zh_hans: 表迁移状态: {0}
zh_hant: 資料表移轉狀態: {0}

# sql.migration.unavailable.table.name.column
source: Table name
de: Tabellenname
es: Nombre de la tabla
fr: Nom de la table
ja: テーブル名
ko: 테이블 이름
pt_br: Nome da tabela
ru: Имя таблицы
zh_hans: 表名
zh_hant: 資料表名稱

# sql.migration.sqldb.column.tablename
source: Table name
de: Tabellenname
es: Nombre de la tabla
fr: Nom de la table
ja: テーブル名
ko: 테이블 이름
pt_br: Nome da tabela
ru: Имя таблицы
zh_hans: 表单名称
zh_hant: 資料表名稱

# sql.migration.table.selection.tablename.column
source: Table name
de: Tabellenname
es: Nombre de la tabla
fr: Nom de la table
ja: テーブル名
ko: 테이블 이름
pt_br: Nome da tabela
ru: Имя таблицы
zh_hans: 表名
zh_hant: 資料表名稱

# sql.migration.missing.table.name.column
source: Table name
de: Tabellenname
es: Nombre de la tabla
fr: Nom de la table
ja: テーブル名
ko: 테이블 이름
pt_br: Nome da tabela
ru: Имя таблицы
zh_hans: 表名
zh_hant: 資料表名稱

# sql.migration.database.table.selection.label
source: Table selection
de: Tabellenauswahl
es: Selección de tabla
fr: Sélection de table
ja: テーブルの選択
ko: 테이블 선택
pt_br: Seleção da tabela
ru: Выбрать таблицу
zh_hans: 表选择
zh_hant: 資料表選取範圍

# sql.migration.target.table.count.name
source: Tables selected
de: Tabellen ausgewählt
es: Tablas seleccionadas
fr: Tables sélectionnées
ja: 選択されたテーブル
ko: 선택한 테이블
pt_br: Tabelas selecionadas
ru: Выбранные таблицы
zh_hans: 已选择表
zh_hant: 選取的資料表

# sql.migration.target
source: Target
de: Ziel
es: Destino
fr: Cible
ja: ターゲット
ko: 대상
pt_br: Alvo
ru: Целевой объект
zh_hans: 目标
zh_hant: 目標

# sql.login.migration.target.status.column
source: Target Status
de: Zielstatus
es: Estado de destino
fr: État de la cible
ja: ターゲットの状態
ko: 대상 상태
pt_br: Status de Destino
ru: Целевое состояние
zh_hans: 目标状态
zh_hant: 目標狀態

# sql.migration.target.azure.sql.instance.database.name
source: Target database
de: Zieldatenbank
es: Base de datos de destino
fr: Base de données cible
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de dados de destino
ru: Целевая база данных
zh_hans: 目标数据库
zh_hant: 目標資料庫

# sql.migration.map.target.column
source: Target database
de: Zieldatenbank
es: Base de datos de destino
fr: Base de données cible
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de dados de destino
ru: Целевая база данных
zh_hans: 目标数据库
zh_hant: 目標資料庫

# sql.migration.database.table.target.column.label
source: Target database
de: Zieldatenbank
es: Base de datos de destino
fr: Base de données cible
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de dados de destino
ru: Целевая база данных
zh_hans: 目标数据库
zh_hant: 目標資料庫

# sql.migration.validate.ir.validation.result.label.target.database
source: Target database connectivity: '{0}'
de: Zieldatenbankkonnektivität: „{0}“
es: Conectividad de la base de datos de destino: "{0}"
fr: Connectivité de base de données : '{0}'
ja: ターゲット データベースの接続性: '{0}'
ko: 대상 데이터베이스 연결: '{0}'
pt_br: Conectividade de banco de dados de destino: '{0}'
ru: Подключение к целевой базе данных: "{0}"
zh_hans: 目标数据库连接:“{0}”
zh_hant: 目標資料庫連線能力: '{0}'

# sql.migration.target.database.name
source: Target database name
de: Name der Zieldatenbank
es: Nombre de la base de datos de destino
fr: Nom de la base de données cible
ja: ターゲット データベース名
ko: 대상 데이터베이스 이름
pt_br: Nome do banco de dados de destino
ru: Имя целевой базы данных
zh_hans: 目标数据库名
zh_hant: 目標資料庫名稱

# sql.migration.sku.targetDeploymentType
source: Target deployment type
de: Typ der Zielbereitstellung
es: Tipo de implementación de destino
fr: Type de déploiement cible
ja: ターゲットのデプロイの種類
ko: 대상 배포 유형
pt_br: Tipo de implantação de destino
ru: Целевой тип развертывания
zh_hans: 目标部署类型
zh_hant: 目標部署類型

# sql.migration.storageAccount.warning.many
source: Target instance '{0}' may not be able to access storage account '{1}'. Ensure that the subnet of the target instance is whitelisted on the storage account, and if applicable, that the private endpoint is in the same virtual network as the target server.
de: Die Zielinstanz „{0}“ kann möglicherweise nicht auf das Speicherkonto „{1}“ zugreifen. Stellen Sie sicher, dass das Subnetz der Zielinstanz auf der Whitelist des Speicherkontos steht und dass sich der private Endpunkt im selben virtuellen Netzwerk wie der Zielserver befindet.
es: Es posible que la instancia de destino "{0}" no pueda acceder a la cuenta de almacenamiento "{1}". Asegúrese de que la subred de la instancia de destino está en la lista blanca de la cuenta de almacenamiento y, si procede, de que el punto de conexión privado se encuentra en la misma red virtual que el servidor de destino.
fr: L’instance cible '{0}' n’est peut-être pas en mesure d’accéder aux '{1}' du compte de stockage. Vérifiez que le sous-réseau du instance cible est sur liste verte sur le compte de stockage et, le cas échéant, que le point de terminaison privé se trouve dans le même réseau virtuel que le serveur cible.
ja: ターゲット インスタンス '{0}' はストレージ アカウント '{1}' にアクセスできない可能性があります。ターゲット インスタンスのサブネットがストレージ アカウントでホワイトリストに登録されていることを確認し、該当する場合は、プライベート エンドポイントがターゲット サーバーと同じ仮想ネットワーク内にあることを確認します。
ko: '{0}' 대상 인스턴스가 '{1}' 스토리지 계정에 액세스하지 못할 수 있습니다. 대상 인스턴스의 서브넷이 스토리지 계정의 허용 목록에 있는지 확인하고, 해당하는 경우 프라이빗 엔드포인트가 대상 서버와 동일한 가상 네트워크에 있는지 확인하세요.
pt_br: A instância de destino '{0}' pode não conseguir acessar a conta de armazenamento '{1}'. Verifique se a sub-rede da instância de destino está na lista de permissões da conta de armazenamento e, se aplicável, se o ponto de extremidade privado está na mesma rede virtual que o servidor de destino.
ru: Возможно, целевой экземпляр "{0}" не сможет получить доступ к учетной записи хранения "{1}". Добавьте подсеть целевого экземпляра в список разрешенных в учетной записи хранения и, если применимо, разместите частную конечную точку в той же виртуальной сети, что и целевой сервер.
zh_hans: 目标实例 "{0}" 可能无法访问存储帐户 "{1}"。请确保目标实例的子网已列入存储帐户允许列表; 如果适用，则确保专用终结点与目标服务器位于同一虚拟网络中。
zh_hant: 目標執行個體 '{0}' 可能無法存取儲存體帳戶 '{1}'。請確保目標執行個體的子網路已列入儲存體帳戶的允許清單中，而且如適用，私人端點和目標伺服器會位於相同的虛擬網路。

# sql.migration.storageAccount.warning.one
source: Target instance '{0}' may not be able to access storage accounts '{1}'. Ensure that the subnet of the target instance is whitelisted on the storage accounts, and if applicable, that the private endpoints are on the same virtual network as the target server.
de: Die Zielinstanz „{0}“ kann möglicherweise nicht auf die Speicherkonten „{1}“ zugreifen. Stellen Sie sicher, dass das Subnetz der Zielinstanz auf den Speicherkonten auf der Whitelist steht und dass sich die privaten Endpunkte im selben virtuellen Netzwerk wie der Zielserver befinden.
es: Es posible que la instancia de destino "{0}" no pueda acceder a las cuentas de almacenamiento "{1}". Asegúrese de que la subred de la instancia de destino está en la lista blanca de las cuentas de almacenamiento y, si procede, de que los puntos de conexión privados están en la misma red virtual que el servidor de destino.
fr: L’instance cible '{0}' n’est peut-être pas en mesure d’accéder aux '{1}' du compte de stockage. Vérifiez que le sous-réseau de l’instance cible est sur liste verte sur le compte de stockage et, le cas échéant, que les points de terminaison privés se trouvent dans le même réseau virtuel que le serveur cible.
ja: ターゲット インスタンス '{0}' はストレージ アカウント '{1}' にアクセスできない可能性があります。ターゲット インスタンスのサブネットがストレージ アカウントでホワイトリストに登録されていることを確認し、該当する場合は、プライベート エンドポイントがターゲット サーバーと同じ仮想ネットワーク上にあることを確認します。
ko: '{0}' 대상 인스턴스가 '{1}' 스토리지 계정에 액세스하지 못할 수 있습니다. 대상 인스턴스의 서브넷이 스토리지 계정의 허용 목록에 있는지 확인하고, 해당하는 경우 프라이빗 엔드포인트가 대상 서버와 동일한 가상 네트워크에 있는지 확인하세요.
pt_br: A instância de destino '{0}' pode não conseguir acessar as contas de armazenamento '{1}'. Certifique-se de que a sub-rede da instância de destino esteja na lista de permissões das contas de armazenamento e, se aplicável, de que os pontos de extremidade privados estejam na mesma rede virtual que o servidor de destino.
ru: Возможно, целевой экземпляр "{0}" не сможет получить доступ к учетным записям хранения "{1}". Добавьте подсеть целевого экземпляра в список разрешенных в учетных записях хранения и, если применимо, разместите частные конечные точки в той же виртуальной сети, что и целевой сервер.
zh_hans: 目标实例 "{0}" 可能无法访问存储帐户 "{1}"。请确保目标实例的子网已列入存储帐户允许列表; 如果适用，则确保专用终结点与目标服务器位于同一虚拟网络中。
zh_hant: 目標執行個體 '{0}' 可能無法存取儲存體帳戶 '{1}'。請確保目標執行個體的子網路已列入儲存體帳戶的允許清單中，而且如適用，私人端點和目標伺服器會位於相同的虛擬網路。

# sql.migration.target.azure.sql.instance.server.name
source: Target name
de: Zielname
es: Nombre de destino
fr: Nom de la cible
ja: ターゲット名
ko: 대상 이름
pt_br: Nome de destino
ru: Целевое имя
zh_hans: 目标名
zh_hant: 目標名稱

# sql.migration.target.azure.sql.instance.name
source: Target name
de: Zielname
es: Nombre de destino
fr: Nom de la cible
ja: ターゲット名
ko: 대상 이름
pt_br: Nome de destino
ru: Целевое имя
zh_hans: 目标名
zh_hant: 目標名稱

# sql.migration.password.label
source: Target password
de: Zielkennwort
es: Contraseña de destino
fr: Mot_passe_cible
ja: ターゲット パスワード
ko: 대상 암호
pt_br: Senha de destino
ru: Целевой пароль
zh_hans: 目标密码
zh_hant: 目標密碼

# sql.migration.target.platform
source: Target platform
de: Zielplattform
es: Plataforma de destino
fr: Plateforme cible
ja: ターゲット プラットフォーム
ko: 대상 플랫폼
pt_br: Plataforma de destino
ru: Целевая платформа
zh_hans: 目标平台
zh_hant: 目標平台

# sql.migration.assessment.results.title
source: Target platform & assessment results
de: Zielplattform und Bewertungsergebnisse
es: Plataforma de destino y resultados de la evaluación
fr: Plateforme cible et résultats de l'évaluation
ja: ターゲット プラットフォームと評価の結果
ko: 대상 플랫폼 및 평가 결과
pt_br: Plataforma de destino e resultados de avaliação
ru: Целевая платформа и результаты оценки
zh_hans: 目标平台和评估结果
zh_hant: 目標平台與評定結果

# sql.migration.target.server
source: Target server
de: Zielserver
es: Servidor de destino
fr: Serveur cible
ja: ターゲット サーバー
ko: 대상 서버
pt_br: Servidor de destino
ru: Целевой сервер
zh_hans: 目标服务器
zh_hant: 目標伺服器

# sql.migration.storageAccount.warning.vm.many
source: Target server '{0}' may not be able to access storage account '{1}'. Ensure that the subnet of the target server is whitelisted on the storage account.
de: Der Zielserver "{0}" kann möglicherweise nicht auf das Speicherkonto "{1}" zugreifen. Stellen Sie sicher, dass das Subnetz des Zielservers in das Speicherkonto in der Whitelist enthalten ist.
es: Es posible que el servidor de destino "{0}" no pueda acceder a la cuenta de almacenamiento "{1}". Asegúrese de que la subred del servidor de destino está en la lista aprobada de la cuenta de almacenamiento.
fr: Le serveur cible «{0}» n’est peut-être pas en mesure d’accéder au compte de stockage «{1}». Assurez-vous que le sous-réseau du serveur cible figure sur la liste verte sur le compte de stockage.
ja: ターゲット サーバー '{0}' は、ストレージ アカウント '{1}' にアクセスできない可能性があります。ターゲット サーバーのサブネットがストレージ アカウントのホワイトリストに登録されていることを確認してください。
ko: 대상 서버 '{0}'이(가) 스토리지 계정 '{1}'에 액세스하지 못할 수 있습니다. 대상 서버의 서브넷이 스토리지 계정의 허용 목록에 있는지 확인하세요.
pt_br: O servidor de destino '{0}' pode não conseguir acessar a conta de armazenamento '{1}'. Certifique-se de que a sub-rede do servidor de destino esteja na lista de permissões da conta de armazenamento.
ru: Целевой сервер "{0}", возможно, не сможет получить доступ к учетной записи хранения "{1}". Убедитесь, что подсеть целевого сервера добавлена в список разрешенных для учетной записи хранения.
zh_hans: 目标服务器“{0}”可能无法访问存储帐户“{1}”。请确保目标服务器的子网在存储帐户的白名单上。
zh_hant: 目標伺服器 '{0}' 可能無法存取儲存體帳戶 '{1}'。確保目標伺服器的子網路已列入儲存體帳戶的允許清單。

# sql.migration.storageAccount.warning.vm.one
source: Target server '{0}' may not be able to access storage accounts '{1}'. Ensure that the subnet of the target server is whitelisted on the storage accounts.
de: Der Zielserver "{0}" kann möglicherweise nicht auf Speicherkonten "{1}" zugreifen. Stellen Sie sicher, dass das Subnetz des Zielservers in den Speicherkonten in der Whitelist enthalten ist.
es: Es posible que el servidor de destino "{0}" no pueda acceder a las cuentas de almacenamiento "{1}". Asegúrese de que la subred del servidor de destino está en la lista aprobada de las cuentas de almacenamiento.
fr: Le serveur cible «{0}» n’est peut-être pas en mesure d’accéder aux comptes de stockage «{1}». Assurez-vous que le sous-réseau du serveur cible figure dans la liste verte sur les comptes de stockage.
ja: ターゲット サーバー '{0}' は、ストレージ アカウント '{1}' にアクセスできない可能性があります。ターゲット サーバーのサブネットがストレージ アカウントのホワイトリストに登録されていることを確認してください。
ko: 대상 서버 '{0}'이(가) 스토리지 계정 '{1}'에 액세스하지 못할 수 있습니다. 대상 서버의 서브넷이 스토리지 계정의 허용 목록에 있는지 확인하세요.
pt_br: O servidor de destino '{0}' pode não conseguir acessar as contas de armazenamento '{1}'. Certifique-se de que a sub-rede do servidor de destino esteja na lista de permissões nas contas de armazenamento.
ru: Целевой сервер "{0}", возможно, не сможет получить доступ к учетным записям хранения "{1}". Убедитесь, что подсеть целевого сервера добавлена в список разрешенных для учетных записей хранения.
zh_hans: 目标服务器“{0}”可能无法访问存储帐户“{1}”。请确保目标服务器的子网在存储帐户的白名单上。
zh_hant: 目標伺服器 '{0}' 可能無法存取儲存體帳戶 '{1}'。確保目標伺服器的子網路已列入儲存體帳戶的允許清單。
