Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# objectManagement.allowTriggerToFireOthersLabel
source: Allow Triggers to Fire Others
de: Triggern ermöglichen, weitere Trigger auszulösen
es: Permitir que los desencadenadores activen otros
fr: Autoriser les déclencheurs à activer d'autres déclencheurs
it: Consenti attivazione trigger da altri trigger
ja: トリガーから他のトリガーの起動を許可する
ko: 다른 트리거를 발생시키는 트리거 허용
pt_br: Permitir que Gatilhos Disparem Outros Gatilhos
ru: Разрешить триггерам запускать другие триггеры
zh_hans: 允许触发器激发其他触发器
zh_hant: 允許觸發程序引發其他觸發程序

# objectManagement.dropObjectError
source: An error occurred while dropping the {0}: {1}. {2}
de: Fehler beim Löschen von {0}: {1}. {2}
es: Error al quitar el {0}: {1}. {2}
fr: Une erreur s’est produite lors de la suppression du {0}: {1}. {2}
it: Si è verificato un errore durante l'esclusione di {0}: {1}. {2}
ja: {0} の削除中にエラーが発生しました: {1}。{2}
ko: {0}을(를) 삭제하는 동안 오류가 발생했습니다. {1}. {2}
pt_br: Ocorreu um erro ao descartar o {0}: {1}. {2}
ru: Произошла ошибка при удалении {0}: {1}. {2}
zh_hans: 删除 {0} 时出错: {1}。{2}
zh_hant: 刪除 {0}: {1} 時發生錯誤。{2}

# objectManagement.openAttachDatabaseDialogError
source: An error occurred while opening the attach database dialog. {0}
de: Fehler beim Öffnen des Dialogfelds "Datenbank anfügen". {0}
es: Error al abrir el cuadro de diálogo adjuntar base de datos. {0}
fr: Une erreur s’est produite lors de l’ouverture de la boîte de dialogue Attacher la base de données. {0}
it: Errore durante l'apertura della finestra di dialogo Scollega database. {0}
ja: アタッチ データベース ダイアログを開いているときにエラーが発生しました。{0}
ko: 데이터베이스 첨부 대화 상자를 여는 동안 오류가 발생했습니다. {0}
pt_br: Erro ao abrir a caixa de diálogo desanexar banco de dados. {0}
ru: Произошла ошибка при открытии диалогового окна подключения базы данных. {0}
zh_hans: 打开附加数据库对话框时出错。{0}
zh_hant: 開啟附加資料庫對話方塊時發生錯誤。{0}

# objectManagement.openBackupDatabaseDialogError
source: An error occurred while opening the backup database dialog. {0}
de: Fehler beim Öffnen des Dialogfelds "Sicherungsdatenbank". {0}
es: Se ha producido un error al abrir el cuadro de diálogo de base de datos de copia de seguridad.{0}
fr: Une erreur s’est produite lors de l’ouverture de la boîte de dialogue de sauvegarde de la base de données. {0}
it: Si è verificato un errore durante l'apertura della finestra di dialogo del database di backup. {0}
ja: バックアップ データベースのダイアログを開いているときにエラーが発生しました。{0}
ko: 백업 데이터베이스 대화를 여는 동안 오류가 발생했습니다. {0}
pt_br: Ocorreu um erro ao abrir a caixa de diálogo de backup do banco de dados. {0}
ru: Произошла ошибка при открытии диалогового окна резервной копии базы данных. {0}
zh_hans: 打开备份数据库对话框时出错。{0}
zh_hant: 開啟備份資料庫對話方塊時發生錯誤。{0}

# objectManagement.openDetachDatabaseDialogError
source: An error occurred while opening the detach database dialog. {0}
de: Fehler beim Öffnen des Dialogfelds zum Trennen der Datenbank. {0}
es: Error al abrir el cuadro de diálogo Desasociar base de datos. {0}
fr: Une erreur s'est produite lors de l'ouverture de la boîte de dialogue de détachement de la base de données. {0}
it: Errore durante l'apertura della finestra di dialogo Scollega database. {0}
ja: データベースのデタッチ ダイアログを開いているときにエラーが発生しました。{0}
ko: 데이터베이스 분리 대화 상자를 여는 동안 오류가 발생했습니다. {0}
pt_br: Erro ao abrir a caixa de diálogo desanexar banco de dados. {0}
ru: Произошла ошибка при открытии диалогового окна отсоединения базы данных. {0}
zh_hans: 打开拆离数据库对话框时出错。{0}
zh_hant: 開啟分離資料庫對話方塊時發生錯誤。{0}

# objectManagement.openDropDatabaseDialogError
source: An error occurred while opening the drop database dialog. {0}
de: Fehler beim Öffnen des Dialogfelds zum Löschen der Datenbank. {0}
es: Se ha producido un error al abrir el cuadro de diálogo para quitar la base de datos.{0}
fr: Une erreur s’est produite lors de l’ouverture de la boîte de dialogue supprimer la base de données. {0}
it: Errore durante l'apertura della finestra di dialogo Escludi database. {0}
ja: データベースのデタッチ ダイアログを開いているときにエラーが発生しました。{0}
ko: 데이터베이스 삭제 대화 상자를 여는 동안 오류가 발생했습니다. {0}
pt_br: Erro ao abrir a caixa de diálogo remover banco de dados. {0}
ru: Произошла ошибка при открытии диалогового окна удаления базы данных. {0}
zh_hans: 打开放置数据库对话框时出错。{0}
zh_hant: 開啟刪除資料庫對話方塊時發生錯誤。{0}

# objectManagement.openNewObjectDialogError
source: An error occurred while opening the new {0} dialog. {1}
de: Fehler beim Öffnen des neuen {0}-Dialogfelds. {1}
es: Error al abrir el nuevo cuadro de diálogo {0}. {1}
fr: Une erreur s’est produite lors de l’ouverture d’un nouveau dialogue {0} : {1}
it: Errore durante l'apertura della nuova finestra di dialogo {0}. {1}
ja: 新しい {0} ダイアログを開くときにエラーが発生しました。{1}
ko: 새 {0} 대화 상자를 여는 동안 오류가 발생했습니다. {1}
pt_br: Erro ao abrir o novo diálogo {0}. {1}
ru: Произошла ошибка при открытии нового {0} диалога. {1}
zh_hans: 打开新 {0} 对话框时出错。{1}
zh_hant: 開啟新 {0} 對話方塊時發生錯誤。{1}

# objectManagement.openObjectPropertiesDialogError
source: An error occurred while opening the properties dialog for {0}: {1}. {2}
de: Fehler beim Öffnen des Eigenschaftendialogfelds für {0}: {1}. {2}
es: Error al abrir el cuadro de diálogo de propiedades para {0}: {1}. {2}
fr: Une erreur s’est produite lors de l’ouverture du dialogue des propriétés de {0} : {1}. {2}
it: Errore durante l'apertura della finestra di dialogo delle proprietà per {0}: {1}. {2}
ja: {0}: {1} のプロパティ ダイアログを開いているときにエラーが発生しました。{2}
ko: {0}: {1}에 대한 속성 대화 상자를 여는 동안 오류가 발생했습니다. {2}
pt_br: Erro ao abrir a caixa de diálogo de propriedades para {0}: {1}. {2}
ru: Произошла ошибка при открытии диалогового окно свойств для {0}: {1}. {2}
zh_hans: 打开 {0}: {1} 的属性对话框时出错。{2}
zh_hant: 開啟 {0} 的內容對話方塊時發生錯誤: {1}。{2}

# objectManagement.openRestoreDatabaseDialogError
source: An error occurred while opening the restore database dialog. {0}
de: Fehler beim Öffnen des Dialogfelds "Datenbank wiederherstellen". {0}
es: Error al abrir el cuadro de diálogo restaurar base de datos. {0}
fr: Une erreur s’est produite lors de l’ouverture de la boîte de dialogue restaurer la base de données. {0}
it: Errore durante l'apertura della finestra di dialogo Ripristina database. {0}
ja: データベースの復元ダイアログを開いているときにエラーが発生しました。{0}
ko: 데이터베이스 대화 상자 복원을 여는 동안 오류가 발생했습니다. {0}
pt_br: Ocorreu um erro ao abrir a caixa de diálogo restaurar o banco de dados. {0}
ru: Произошла ошибка при открытии диалогового окна восстановления базы данных. {0}
zh_hans: 打开还原数据库对话框时出错。{0}
zh_hant: 開啟還原資料庫對話方塊時發生錯誤。{0}

# objectManagement.refreshOEError
source: An error occurred while refreshing the object explorer. {0}
de: Fehler beim Aktualisieren des Objekt-Explorers. {0}
es: Error al actualizar el explorador de objetos. {0}
fr: Une erreur s’est produite lors de l’actualisation de l’Explorateur d’objets. {0}
it: Errore durante l'aggiornamento di Esplora oggetti. {0}
ja: オブジェクト エクスプローラーの更新中にエラーが発生しました。{0}
ko: 개체 탐색기를 새로 고치는 동안 오류가 발생했습니다. {0}
pt_br: Ocorreu um erro ao atualizar o explorador de objetos. {0}
ru: Произошла ошибка при обновлении обозревателя объектов. {0}
zh_hans: 刷新对象资源管理器时出错。{0}
zh_hant: 重新整理物件總管時發生錯誤。{0}

# objectManagement.renameObjectError
source: An error occurred while renaming {0} '{1}' to '{2}'. {3}
de: Beim Umbenennen von {0} "{1}" in "{2}" ist ein Fehler aufgetreten. {3}
es: Error al cambiar el nombre de {0} '{1}' a '{2}'. {3}
fr: Une erreur s'est produite lors du changement de nom de {0} '{1}' en '{2}'. {3}
it: Errore durante la ridenominazione di {0} '{1}' in '{2}'. {3}
ja: {0} '{1}' の名前を '{2}' に変更中にエラーが発生しました。 {3}
ko: {0} '{1}'의 이름을 '{2}'(으)로 바꾸는 동안 오류가 발생했습니다. {3}
pt_br: Ocorreu um erro ao renomear {0} '{1}' para '{2}'. {3}
ru: Произошла ошибка при переименовании {0} "{1}" на "{2}". {3}
zh_hans: 将 {0} "{1}" 重命名为 "{2}" 时出错。 {3}
zh_hant: 將 {0} '{1}' 重新命名為 '{2}' 時發生錯誤。{3}

# objectManagement.appendToExistingBackup
source: Append to the existing backup set
de: An vorhandenem Sicherungssatz anhängen
es: Añadir al conjunto de copia de seguridad existente
fr: Ajouter au jeu de sauvegarde existant
it: Accoda al set di backup esistente
ja: 既存のバックアップ セットに追加
ko: 기존 백업 세트에 추가
pt_br: Acrescentar ao conjunto de backup existente
ru: Добавить к существующему резервному набору данных
zh_hans: 追加到现有备份集
zh_hant: 附加至現有的備份組

# objectManagement.ApplicationRoleTypeDisplayNameInTitle
source: Application Role
de: Anwendungsrolle
es: Rol de aplicación
fr: Rôle d’application
it: Ruolo applicazione
ja: アプリケーション ロール
ko: 애플리케이션 역할
pt_br: Função de Aplicativo
ru: Роль приложения
zh_hans: 应用程序角色
zh_hant: 應用程式角色

# objectManagement.applyUpdatesLabel
source: Apply
de: Anwenden
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
ko: 적용
pt_br: Aplicar
ru: Применить
zh_hans: 应用
zh_hant: 套用

# objectManagement.dropObjectConfirmation
source: Are you sure you want to drop the {0}: {1}?
de: {0} löschen: {1}?
es: ¿Está seguro de que desea quitar el {0}: {1}?
fr: Voulez-vous vraiment supprimer le {0}: {1}?
it: Escludere {0}: {1}?
ja: {0} を削除しますか: {1}?
ko: {0} {1}을(를) 삭제하시겠습니까?
pt_br: Tem certeza de que deseja remover o {0}: {1}?
ru: Действительно удалить {0}: {1}?
zh_hans: 是否确实要删除 {0}: {1}?
zh_hant: 您確定要刪除 {0}: {1}嗎?

# objectManagement.databaseProperties.purgeQueryStoreDataMessage
source: Are you sure you want to purge the Query Store data from '{0}'?
de: Möchten Sie die Abfragespeicherdaten aus "{0}" löschen?
es: ¿Está seguro de que desea purgar los datos de Almacén de consultas de "{0}"?
fr: Voulez-vous vraiment vider le Magasin de données des requêtes de '{0}' ?
it: Rimuovere definitivamente i dati di Query Store da '{0}'?
ja: クエリ ストアデータを '{0}' から削除しますか?
ko: '{0}'에서 쿼리 저장소 데이터를 제거하시겠습니까?
pt_br: Tem certeza de que quer limpar os dados do Repositório de Consultas de '{0}'?
ru: Вы действительно хотите очистить данные из "{0}" в хранилище запросов?
zh_hans: 是否确实要从“{0}”中清除查询存储数据?
zh_hant: 您確定要清除 '{0}' 的查詢存放區資料嗎?

# objectManagement.associatedDatabaseFiles
source: Associated Database Files
de: Zugeordnete Datenbankdateien
es: Archivos de base de datos asociados
fr: Fichiers de base de données associés
it: File di database associati
ja: 関連付けられたデータベース ファイル
ko: 연결된 데이터베이스 파일
pt_br: Arquivos de Banco de Dados Associados
ru: Связанные файлы базы данных
zh_hans: 关联的数据库文件
zh_hant: 關聯的資料庫檔案

# objectManagement.backupAsymmetricKey
source: Asymmetric Key
de: Asymmetrischer Schlüssel
es: Clave asimétrica
fr: Clé asymétrique
it: Chiave asimmetrica
ja: 非対称キー
ko: 비대칭 키
pt_br: Chave Assimétrica
ru: Асимметричный ключ
zh_hans: 非对称密钥
zh_hant: 非對稱金鑰

# objectManagement.attachButtonLabel
source: Attach
de: Anfügen
es: Adjuntar
fr: Attacher
it: Collega
ja: アタッチ
ko: 첨부
pt_br: Anexar
ru: Подключить
zh_hans: 附加
zh_hant: 附加

# objectManagement.attachAsText
source: Attach As
de: Anfügen als
es: Adjuntar como
fr: Attacher en tant que
it: Collega come
ja: 名前を付けてアタッチ
ko: 다음 이름으로 연결:
pt_br: Anexar como
ru: Подключить как
zh_hans: 附加为
zh_hant: 附加為

# objectManagement.attachDatabaseDialogTitle
source: Attach Database (Preview)
de: Datenbank anfügen (Vorschau)
es: Adjuntar base de datos (versión preliminar)
fr: Attacher la base de données (préversion)
it: Collega database (anteprima)
ja: データベースのデタッチ (プレビュー)
ko: 데이터베이스 첨부(미리 보기)
pt_br: Anexar Banco de Dados (Versão Prévia)
ru: Подключение базы данных (предварительная версия)
zh_hans: 附加数据库(预览)
zh_hant: 附加資料庫 (預覽)

# objectManagement.attachDatabaseOperationName
source: Attach database
de: Datenbank anfügen
es: Adjuntar base de datos
fr: Attacher la base de données
it: Allega database
ja: データベースのアタッチ
ko: 데이터베이스 연결
pt_br: Anexar banco de dados
ru: Присоединение базы данных
zh_hans: 附加数据库
zh_hant: 附加資料庫

# objectManagement.user.aadAuth
source: Authenticate with Microsoft Entra
de: Mit Microsoft Entra authentifizieren
es: Autenticar con Microsoft Entra
fr: Authentifiez-vous avec Microsoft Entra
it: Esegui autenticazione con Microsoft Entra
ja: Microsoft Entra で認証する
ko: Microsoft Entra를 사용하여 인증
pt_br: Autenticar com o Microsoft Entra
ru: Проверка подлинности с помощью Microsoft Entra
zh_hans: 使用 Microsoft Entra 进行身份验证
zh_hant: 向 Microsoft Entra 驗證

# objectManagement.user.sqlAuth
source: Authenticate with password
de: Mit Kennwort authentifizieren
es: Autenticar con contraseña
fr: S’authentifier avec un mot de passe
it: Esegui autenticazione con password
ja: パスワードを使用して認証する
ko: 암호로 인증
pt_br: Autenticar com senha
ru: Проверка подлинности с помощью пароля
zh_hans: 使用密码进行身份验证
zh_hant: 使用密碼驗證

# objectManagement.login.authenticateType
source: Authentication
de: Authentifizierung
es: Autenticación
fr: Authentification
it: Autenticazione
ja: 認証
ko: 인증
pt_br: Autenticação
ru: Аутентификация
zh_hans: 身份验证
zh_hant: 驗證

# objectManagement.databaseProperties.autoCreateIncrementalStatisticsText
source: Auto Create Incremental Statistics
de: Automatisch erstellte inkrementelle Statistiken
es: Crear estadísticas incrementales automáticamente
fr: Création automatique des statistiques incrémentielles
it: Creazione automatica di statistiche incrementali
ja: 自動作成統計の増分
ko: 증분 통계 자동 작성
pt_br: Criação Automática de Estatísticas Incrementais
ru: Автоматическое создание статистики с добавлением
zh_hans: 自动创建增量统计信息
zh_hant: 自動建立累加統計資料

# objectManagement.databaseProperties.AutoCreateStatisticsText
source: Auto Create Statistics
de: Statistik automatisch erstellen
es: Creación automática de estadísticas
fr: Création automatique Statistics Bing
it: Creazione statistiche automatica
ja: 統計の自動作成
ko: 통계 자동 작성
pt_br: Criar Estatísticas Automaticamente
ru: Автоматическое создание статистики
zh_hans: 自动创建统计信息
zh_hant: 自動建立統計資料

# objectManagement.databaseProperties.autoShrinkText
source: Auto Shrink
de: Automatisches Verkleinern
es: Reducción automática
fr: Réduction automatique
it: Compattazione automatica
ja: 自動圧縮
ko: 자동 축소
pt_br: Redução Automática
ru: Автоматическое сжатие
zh_hans: 自动收缩
zh_hant: 自動壓縮

# objectManagement.databaseProperties.autoUpdateStatisticsText
source: Auto Update Statistics
de: Statistik automatisch aktualisieren
es: Actualizar estadísticas automáticamente
fr: Statistiques de mise à jour automatique
it: Aggiornamento statistiche automatico
ja: 統計の自動更新
ko: 통계 자동 업데이트
pt_br: Atualizar Estatísticas Automaticamente
ru: Автоматическое обновление статистики
zh_hans: 自动更新统计信息
zh_hant: 自動更新統計資料

# objectManagement.databaseProperties.autoUpdateStatisticsAsynchronouslyText
source: Auto Update Statistics Asynchronously
de: Statistik automatisch asynchron aktualisieren
es: Actualizar estadísticas automáticamente de forma asincrónica
fr: Mise à jour automatique des statistiques en mode asynchrone
it: Aggiornamento statistiche asincrono automatico
ja: 統計の非同期的自動更新
ko: 통계를 비동기적으로 자동 업데이트
pt_br: Atualizar estatísticas automat. de forma assíncrona
ru: Асинхронное автоматическое обновление статистики
zh_hans: 自动异步更新统计信息
zh_hant: 自動非同步更新統計資料

# objectManagement.databaseProperties.autogrowAllFilesText
source: Autogrow All Files
de: Automatische Vergrößerung aller Dateien
es: Crecimiento automático de todos los archivos
fr: Croissance automatique de tous les fichiers
it: Aumento automatico di tutti i file
ja: すべてのファイルを自動拡張
ko: 모든 파일 자동 증가
pt_br: Crescimento Automático de Todos os Arquivos
ru: Автоматическое увеличение всех файлов
zh_hans: 自动增长所有文件
zh_hant: 所有檔案自動成長

# objectManagement.databaseProperties.autogrowthMaxsizeText
source: Autogrowth / Maxsize
de: Automatische Vergrößerung/Maximale Größe
es: Crecimiento automático/tamaño máximo
fr: Croissance automatique / Taille maximale
it: Aumento automatico / Dimensioni max
ja: 自動拡張 / 最大サイズ
ko: 자동 증가/최대 크기
pt_br: Aumento Automático / Tamanho Máximo
ru: Автоматическое увеличение/максимальный размер
zh_hans: 自动增长/最大大小
zh_hant: 自動成長 / 大小上限

# objectManagement.databaseProperties.automaticSectionHeader
source: Automatic
de: Automatisch
es: Automático
fr: Automatique
it: Automatico
ja: 自動
ko: 자동
pt_br: Automático
ru: Автоматически
zh_hans: 自动
zh_hant: 自動

# objectManagement.autoSetProcessorAffinityIOMaskForAll
source: Automatically set I/O affinity mask for all processors
de: E/A-Affinitätsmaske für alle Prozessoren automatisch festlegen
es: Establecer automáticamente la máscara de afinidad de E/S para todos los procesadores
fr: Définir automatiquement le masque d'affinité d'E/S pour tous les processeurs
it: Imposta automaticamente maschera di affinità di I/O per tutti i processori
ja: すべてのプロセッサに対して自動的に I/O 関係マスクを設定する
ko: 모든 프로세서에 대해 자동으로 I/O 선호도 마스크 설정
pt_br: Definir automaticamente a máscara de afinidade de E/S para todos os processadores
ru: Автоматически устанавливать маску привязки ввода-вывода для всех процессоров.
zh_hans: 自动设置所有处理器的 I/O 关联掩码
zh_hant: 自動設定所有處理器的 I/O 親和性遮罩

# objectManagement.autoSetProcessorAffinityMaskForAll
source: Automatically set processor affinity mask for all processors
de: Prozessoraffinitätsmaske für alle Prozessoren automatisch festlegen
es: Establecer automáticamente la máscara de afinidad de procesador para todos los procesadores
fr: Définir automatiquement le masque d'affinité du processeur pour tous les processeurs
it: Imposta automaticamente maschera di affinità processori per tutti i processori
ja: すべてのプロセッサに対して自動的にプロセッサ関係マスクを設定する
ko: 모든 프로세서에 대해 자동으로 프로세서 선호도 마스크 설정
pt_br: Definir automaticamente a máscara de afinidade de processador de todos os processadores
ru: Автоматически устанавливать маску привязки процессоров для всех процессоров.
zh_hans: 自动设置所有处理器的处理器关联掩码
zh_hant: 自動設定所有處理器的處理器親和性遮罩

# objectManagement.azurePricingLink
source: Azure SQL Database pricing calculator
de: Preisrechner für Azure SQL-Datenbank
es: calculadora de precios de Azure SQL Database
fr: Calculatrice de la tarification Azure SQL Database
it: Calcolatore prezzi database SQL di Azure
ja: Azure SQL Database 料金計算ツール
ko: Azure SQL Database 가격 계산기
pt_br: Calculadora de preços do Banco de Dados SQL do Azure
ru: Калькулятор цен на базу данных SQL Azure
zh_hans: Azure SQL 数据库定价计算器
zh_hant: Azure SQL 資料庫價格計算機

# objectManagement.backButtonLabel
source: Back
de: Zurück
es: Atrás
fr: Retour
it: Indietro
ja: 戻る
ko: 뒤로
pt_br: Voltar
ru: Назад
zh_hans: 上一步
zh_hant: 上一步

# objectManagement.backupLogTail
source: Back up the tail of the log, and leave the database in the restoring state
de: Protokollfragment sichern und Wiederherstellungsstatus der Datenbank beibehalten
es: Realizar copia de seguridad del final del registro y dejar la base de datos en estado de restauración
fr: Sauvegardez la fin du journal et laisser la base de données dans l’état de restauration
it: Esegui backup della parte finale del log e lascia il database in stato di ripristino
ja: ログの末尾をバックアップし、データベースを復元中の状態にしておく
ko: 비상 로그를 백업하고 데이터베이스를 복원 상태로 두기
pt_br: Faça backup da parte final do log e deixe o banco de dados no estado de restauração
ru: Создать резервную копию заключительного фрагмента журнала и оставить базу данных в состоянии восстановления
zh_hans: 备份日志尾部，并使数据库保留在“正在还原”状态
zh_hant: 備份記錄的結尾，並讓資料庫保持在還原中狀態

# objectManagement.backupToLabel
source: Back up to
de: Sichern in
es: Copia de seguridad en
fr: Sauvegarde sur
it: Backup in:
ja: バックアップ先
ko: 백업할 위치
pt_br: Fazer backup para
ru: Создать резервную копию на:
zh_hans: 备份到
zh_hant: 備份至

# objectManagement.backupAndEraseExisting
source: Back up to a new media set, and erase all existing backup sets
de: In einem neuen Mediensatz sichern und alle vorhandenen Sicherungssätze löschen
es: Hacer copia de seguridad en un nuevo conjunto de medios y borrar todos los conjuntos de copia de seguridad existentes
fr: Sauvegardez sur un nouveau support de sauvegarde et effacez tous les jeux de sauvegarde existants
it: Esegui il backup in un nuovo set di supporti e cancella tutti i set di backup esistenti
ja: 新しいメディア セットにバックアップし、すべての既存のバックアップ セットを消去する
ko: 새 미디어 세트에 백업하고 기존 백업 세트 모두 지우기
pt_br: Faça backup em um novo conjunto de mídias e apague todos os conjuntos de backup existentes
ru: Создать резервную копию в новом наборе носителей и удалить все существующие резервные наборы данных
zh_hans: 备份到新媒体集并清除所有现有备份集
zh_hant: 備份至新的媒體集，並清除所有現有的備份組

# objectManagement.backupToExistingMedia
source: Back up to the existing media set
de: In einem vorhandenen Mediensatz sichern
es: Hacer copia de seguridad en el conjunto de medios existente
fr: Sauvegardez sur le support de sauvegarde existant
it: Eseguire il backup nel set di supporti esistente
ja: 既存のメディア セットにバックアップする
ko: 기존 미디어 세트에 백업
pt_br: Fazer backup no conjunto de mídias existente
ru: Создать резервную копию в существующем наборе носителей
zh_hans: 备份到现有媒体集
zh_hant: 備份至現有的媒體集

# objectManagement.databaseProperties.backupSectionHeader
source: Backup
de: Sicherung
es: Copia de seguridad
fr: Sauvegarder
ja: バックアップ
ko: 백업
ru: Резервное копирование
zh_hans: 备份
zh_hant: 備份

# objectManagement.backupLocationText
source: Backup
de: Sicherung
es: Copia de seguridad
fr: Sauvegarde Microsoft Azure
ja: バックアップ
ko: 백업
ru: Резервное копирование
zh_hans: 备份
zh_hant: 備份

# objectManagement.backupButtonLabel
source: Backup
de: Sicherung
es: Copia de seguridad
fr: Sauvegarde
ja: バックアップ
ko: 백업
ru: Резервное копирование
zh_hans: 备份
zh_hant: 備份

# objectManagement.backupDatabaseDialogTitle
source: Backup Database - {0} (Preview)
de: Sicherungsdatenbank – {0} (Vorschau)
es: Base de datos de copia de seguridad: {0} (versión preliminar)
fr: Sauvegarde de base de données – {0} (préversion)
it: Database di backup - {0} (anteprima)
ja: バックアップ データベース ‐ {0} (プレビュー)
ko: 백업 데이터베이스 - {0} (미리 보기)
pt_br: Banco de dados de backup - {0} (Versão Prévia)
ru: Резервная копия базы данных — {0} (предварительная версия)
zh_hans: 备份数据库 - {0}(预览版)
zh_hant: 備份資料庫 - {0} (預覽)

# objectManagement.backupFilesLabel
source: Backup Files
de: Sicherungsdateien
es: Archivos de copia de seguridad
fr: Fichiers de sauvegarde
it: File di backup
ja: バックアップ ファイル
ko: 백업 파일
pt_br: Arquivos de Backup
ru: Файлы резервной копии
zh_hans: 备份文件
zh_hant: 備份檔案

# objectManagement.backupRedundancyLabel
source: Backup Storage Redundancy
de: Redundanz für Sicherungsspeicher
es: Redundancia de almacenamiento de copia de seguridad
fr: Redondance du stockage de sauvegarde
it: Ridondanza dell'Archivio di Backup
ja: バックアップ ストレージの冗長性
ko: 백업 스토리지 중복
pt_br: Redundância de Armazenamento de Backup
ru: Избыточность хранилища резервных копий
zh_hans: 备份存储冗余
zh_hant: 備份儲存體備援

# objectManagement.backupToUrlLabel
source: Backup URL
de: Sicherungs-URL
es: URL de copia de seguridad
fr: URL de Sauvegarde Microsoft Azure
it: URL backup
ko: 백업 URL
pt_br: URL de Backup
ru: URL-адрес резервной копии
zh_hans: 备份 URL
zh_hant: 備份 URL

# objectManagement.backupAndRestoreText
source: Backup and Restore
de: Sichern und Wiederherstellen
es: Realizar copia de seguridad y restaurar
fr: Sauvegarde Microsoft Azure et restaurer
it: Backup e ripristino
ja: バックアップと復元
ko: 백업 및 복원
pt_br: Backup e Restauração
ru: Резервное копирование и восстановление
zh_hans: 备份和还原
zh_hant: 備份與還原

# objectManagement.backupChecksumText
source: Backup checksum
de: Sicherungsprüfsumme
es: Suma de comprobación de copia de seguridad
fr: Somme de contrôle Sauvegarde Microsoft Azure
it: Checksum di backup
ja: バックアップのチェックサム
ko: 백업 체크섬
pt_br: Soma de verificação de backup
ru: Контрольная сумма резервной копии
zh_hans: 备份校验和
zh_hant: 備份總和檢查碼

# objectManagement.backupDatabaseOperationName
source: Backup database '{0}'
de: Sicherungsdatenbank "{0}"
es: Base de datos de copia de seguridad "{0}"
fr: Sauvegardez une base de données « {0} »
it: Database di backup '{0}'
ja: データベースのバックアップ '{0}'
ko: 백업 데이터베이스 '{0}'
pt_br: Banco de dados de backup “{0}”
ru: Резервная копия базы данных "{0}"
zh_hans: 备份数据库“{0}”
zh_hant: 備份資料庫 '{0}'

# objectManagement.restoreDatabase.restoreFromBackupFileOptionText
source: Backup file
de: Sicherungsdatei
es: Archivo de copia de seguridad
fr: Fichier de Sauvegarde Microsoft Azure
it: File di backup
ja: バックアップ ファイル
ko: 백업 파일
pt_br: Arquivo de backup
ru: Файл резервной копии
zh_hans: 备份文件
zh_hant: 備份檔案
