Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# objectManagement.restoreDatabase.overwriteTheExistingDatabaseText
source: Overwrite the existing database (WITH REPLACE)
de: Vorhandene Datenbank überschreiben (WITH REPLACE)
es: Sobrescribir la base de datos existente (CON REPLACE)
fr: Remplacer la base de données existante (WITH REPLACE)
it: Sovrascrivi il database esistente (WITH REPLACE)
ja: 既存のデータベースを上書きする (WITH REPLACE)
ko: 기존 데이터베이스 덮어쓰기(WITH REPLACE)
pt_br: Substituir o banco de dados existente (WITH REPLACE)
ru: Перезаписать существующую базу данных (WITH REPLACE)
zh_hans: 覆盖现有数据库(WITH REPLACE)
zh_hant: 覆寫現有的資料庫 (WITH REPLACE)

# objectManagement.user.ownedSchemasLabel
source: Owned Schemas
de: Schemas im Besitz
es: Esquemas de propiedad
fr: Schémas détenus
it: Schemi di proprietà
ja: 所有するスキーマ
ko: 소유한 스키마
pt_br: Esquemas Proprietários
ru: Собственные схемы
zh_hans: 拥有的架构
zh_hant: 擁有的結構描述

# objectManagement.databaseProperties.owner
source: Owner
de: Besitzer
es: Propietario
fr: Propriétaire
it: Proprietario
ja: 所有者
ko: 소유자
pt_br: Proprietário
ru: Владелец
zh_hans: 所有者
zh_hant: 擁有者

# objectManagement.ownerText
source: Owner
de: Besitzer
es: Propietario
fr: Propriétaire
it: Proprietario
ja: 所有者
ko: 소유자
pt_br: Proprietário
ru: Владелец
zh_hans: 所有者
zh_hant: 擁有者

# objectManagement.databaseProperties.pageVerifyText
source: Page Verify
de: Seitenüberprüfung
es: Comprobación de página
fr: Page Vérification
it: Verifica pagina
ja: ページ確認
ko: 페이지 확인
pt_br: Verificação de Página
ru: Проверка страницы
zh_hans: 页验证
zh_hant: 頁面驗證

# objectManagement.passwordLabel
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# objectManagement.passwordCannotBeEmptyError
source: Password cannot be empty.
de: Das Kennwort darf nicht leer sein.
es: La contraseña no puede estar vacía.
fr: Le mot de passe ne peut pas être vide.
it: La password non può essere vuota.
ja: パスワードを空にすることはできません。
ko: 암호는 비워 둘 수 없습니다.
pt_br: A senha não pode ficar em branco.
ru: Пароль не может быть пустым.
zh_hans: 密码不能为空。
zh_hant: 密碼不可以是空的。

# objectManagement.invalidPasswordError
source: Password doesn't meet the complexity requirement. For more information: https://docs.microsoft.com/sql/relational-databases/security/password-policy
de: Das Kennwort entspricht nicht den Anforderungen an die Kennwortkomplexität. Weitere Informationen: https://docs.microsoft.com/sql/relational-databases/security/password-policy
es: La contraseña no cumple el requisito de complejidad. Para obtener más información: https://docs.microsoft.com/sql/relational-databases/security/password-policy
fr: Le mot de passe n'est pas conforme aux exigences en matière de complexité. Pour plus d'informations, voir : https://docs.microsoft.com/sql/relational-databases/security/password-policy
it: La password non è conforme al requisito di complessità. Per altre informazioni, vedere: https://docs.microsoft.com/sql/relational-databases/security/password-policy
ja: パスワードが複雑さの要件を満たしていません。詳細情報: https://docs.microsoft.com/sql/relational-databases/security/password-policy
ko: 암호가 복잡성 요구 사항을 충족하지 않습니다. 자세한 내용은 https://docs.microsoft.com/sql/relational-databases/security/password-policy를 참조하세요.
pt_br: A senha não atende ao requisito de complexidade. Para obter mais informações: https://docs.microsoft.com/sql/relational-databases/security/password-policy
ru: Пароль не соответствует требованиям сложности. Для получения дополнительных сведений: https://docs.microsoft.com/sql/relational-databases/security/password-policy.
zh_hans: 密码不符合复杂性要求。有关详细信息，请访问: https://docs.microsoft.com/sql/relational-databases/security/password-policy
zh_hant: 密碼不符合複雜度要求。如需詳細資訊，請前往: https://docs.microsoft.com/sql/relational-databases/security/password-policy

# objectManagement.passwordsNotMatchError
source: Password must match the confirm password.
de: Das Kennwort muss mit dem Bestätigungskennwort übereinstimmen.
es: La contraseña debe coincidir con la contraseña de confirmación.
fr: Le mot de passe doit correspondre au mot de passe de confirmation.
it: La password deve corrispondere alla password di conferma.
ja: パスワードは、確認パスワードと一致する必要があります。
ko: 암호는 확인 암호와 일치해야 합니다.
pt_br: A senha deve corresponder à confirmação da senha.
ru: Пароль должен совпадать с паролем подтверждения.
zh_hans: 密码必须与确认密码匹配。
zh_hant: 密碼必須與確認密碼相符。

# objectManagement.databaseProperties.pathText
source: Path
de: Pfad
es: Ruta
fr: Chemin
it: Percorso
ja: パス
ko: 경로
pt_br: Caminho
ru: Путь
zh_hans: 路径
zh_hant: 路徑

# objectManagement.databaseFilePath
source: Path
de: Pfad
es: Ruta
fr: Chemin
it: Percorso
ja: パス
ko: 경로
pt_br: Caminho
ru: Путь
zh_hans: 路径
zh_hant: 路徑

# objectManagement.backupPerformChecksum
source: Perform checksum before writing to media
de: Vor dem Schreiben auf Medium Prüfsumme berechnen
es: Realizar la suma de comprobación antes de escribir en los medios
fr: Effectuer la somme de contrôle avant d'écrire sur le support
it: Esegui il checksum prima della scrittura sui supporti
ja: メディアに書き込む前にチェックサムを行う
ko: 미디어에 쓰기 전에 체크섬 수행
pt_br: Executar soma de verificação antes de gravar na mídia
ru: Рассчитать контрольную сумму перед записью на носитель
zh_hans: 在写入到媒体前执行校验和
zh_hant: 在寫入媒體前執行檢查碼

# objectManagement.permissionColumnHeader
source: Permission
de: Berechtigung
es: Permiso
fr: Autorisation
it: Autorizzazione
ja: アクセス許可
ko: 사용 권한
pt_br: Permissão
ru: Разрешение
zh_hans: 权限
zh_hant: 權限

# objectManagement.login.permissionToConnectLabel
source: Permission to connect to database engine
de: Berechtigung zum Herstellen einer Verbindung mit der Datenbank-Engine
es: Permiso de conexión al motor de base de datos
fr: Autorisation de se connecter au moteur de base de données
it: Autorizzazione per la connessione al motore di database
ja: データベース エンジンに接続する権限
ko: 데이터베이스 엔진 연결 권한
pt_br: Permissão para conectar ao mecanismo de banco de dados
ru: Разрешение на подключение к ядру СУБД
zh_hans: 连接到数据库引擎的权限
zh_hant: 連線到資料庫引擎的權限

# objectManagement.platform
source: Platform
de: Plattform
es: Plataforma
fr: Plateforme
it: Piattaforma
ja: プラットフォーム
ko: 플랫폼
pt_br: Plataforma
ru: Платформа
zh_hans: 平台
zh_hant: 平台

# objectManagement.restoreDatabase.backupFolderPathTitle
source: Please enter one or more file paths separated by commas
de: Geben Sie einen oder mehrere Dateipfade (durch Kommas getrennt) ein.
es: Especifique una o más rutas de archivo separadas por comas
fr: Entrez un ou plusieurs chemins de fichier séparés par des virgules
it: Immettere uno o più percorsi di file separati da virgole
ja: １つまたは複数のファイル パスをコンマで区切って入力してください。
ko: 하나 이상의 파일 경로를 쉼표로 구분하여 입력하세요.
pt_br: Insira um ou mais caminhos de arquivo separados por vírgulas
ru: Пожалуйста, введите один или несколько путей файлов, разделенных запятыми
zh_hans: 请输入一个或多个用逗号分隔的文件路径
zh_hant: 請輸入一或多個用逗號分隔的檔案路徑

# objectManagement.restoreDatabase.restorePlan.positionText
source: Position
es: Posición
it: Posizione
ja: 位置
ko: 위치
pt_br: Posição
ru: Положение
zh_hans: 排名
zh_hant: 位置

# objectManagement.restoreDatabase.preserveReplicationSettingsText
source: Preserve the replication settings (WITH KEEP_REPLICATION)
de: Beibehalten der Replikationseinstellungen (WITH KEEP_REPLICATION)
es: Conservar la configuración de replicación (CON KEEP_REPLICATION)
fr: Conserver les paramètres de réplication (WITH KEEP_REPLICATION)
it: Mantieni le impostazioni di replica (WITH KEEP_REPLICATION)
ja: レプリケーションの設定を保存する (WITH KEEP_REPLICATION)
ko: 복제 설정 유지(WITH KEEP_REPLICATION)
pt_br: Preservar as configurações de replicação (WITH KEEP_REPLICATION)
ru: Сохранить параметры репликации (WITH KEEP_REPLICATION)
zh_hans: 保留复制设置(WITH KEEP_REPLICATION)
zh_hant: 保留複寫設定 (WITH KEEP_REPLICATION)

# objectManagement.processorColumn
source: Processor
de: Prozessor
es: Procesador
fr: Processeur
it: Processore
ja: プロセッサ
ko: 프로세서
pt_br: Processador
ru: Процессор
zh_hans: 处理器
zh_hant: 處理器

# objectManagement.processorAffinityColumn
source: Processor Affinity
de: Prozessoraffinität
es: Afinidad del procesador
fr: Affinité du processeur
it: Affinità processori
ja: プロセッサ アフィニティ
ko: 프로세서 선호도
pt_br: Afinidade do Processador
ru: Соответствие процессоров
zh_hans: 处理器关联
zh_hant: 處理器親和性

# objectManagement.processorLabel
source: Processor Affinity Table
de: Prozessoraffinitätstabelle
es: Tabla de afinidad de procesador
fr: Table d’affinités du processeur
it: Tabella affinità processori
ja: プロセッサ アフィニティ テーブル
ko: 프로세서 선호도 테이블
pt_br: Tabela de Afinidade do Processador
ru: Таблица соответствия процессоров
zh_hans: 处理器关联表
zh_hant: 處理器親和性表格

# objectManagement.processors
source: Processors
de: Prozessoren
es: Procesadores
fr: Processeurs
it: Processori
ja: プロセッサ
ko: 프로세서
pt_br: Processadores
ru: Процессоры
zh_hans: 处理器
zh_hant: 處理器

# objectManagement.product
source: Product
de: Produkt
es: Producto
fr: Produit
it: Prodotto
ja: 製品
ko: 제품
pt_br: Produto
ru: Продукт
zh_hans: 产品
zh_hant: 產品

# objectManagement.properties
source: Properties
de: Eigenschaften
es: Propiedades
fr: Propriétés
it: Proprietà
ja: プロパティ
ko: 속성
pt_br: Propriedades
ru: Свойства
zh_hans: 属性
zh_hant: 屬性

# objectManagement.pathAlreadyAddedError
source: Provided path has already been added to the files list.
de: Der angegebene Pfad wurde der Dateiliste bereits hinzugefügt.
es: La ruta de acceso proporcionada ya se ha agregado a la lista de archivos.
fr: Le chemin d’accès fourni a déjà été ajouté à la liste des fichiers.
it: Il percorso specificato è già stato aggiunto all'elenco dei file.
ja: 指定されたパスは既にファイルのリストに追加されています。
ko: 제공된 경로를 파일 목록에 이미 추가했습니다.
pt_br: O caminho fornecido já foi adicionado à lista de arquivos.
ru: Предоставленный путь уже добавлен в список файлов.
zh_hans: 提供的路径已添加到文件列表中。
zh_hant: 提供的路徑已新增至檔案清單。

# objectManagement.databaseProperties.purgeQueryDataButtonText
source: Purge Query Store Data
de: Abfragespeicherdaten bereinigen
es: Purgar datos del Almacén de consultas
fr: Vider le Magasin de données des requêtes
it: Rimuovere definitivamente i dati di Query Store
ja: クエリ ストア データの削除
ko: 쿼리 저장소 데이터 제거
pt_br: Limpar os Dados do Repositório de Consultas
ru: Очистить данные хранилища запросов
zh_hans: 清除查询存储数据
zh_hant: 清除查詢存放區資料

# objectManagement.databaseProperties.databaseProperties.queryStoreTabHeader
source: Query Store
de: Abfragespeicher
es: Almacén de consultas
fr: Magasin de données des requêtes
ja: クエリ ストア
ko: 쿼리 저장소
pt_br: Repositório de Consultas
ru: Хранилище запросов
zh_hans: 查询存储
zh_hant: 查詢存放區

# objectManagement.databaseProperties.queryStoreAvailableText
source: Query Store Available
de: Verfügbarer Abfragespeicher
es: Almacén de consultas disponible
fr: Magasin de données des requêtes disponible
it: Query Store disponibile
ja: 使用可能なクエリ ストア
ko: 사용 가능한 쿼리 저장소
pt_br: Repositório de Consultas Disponível
ru: Доступное хранилище запросов
zh_hans: 可用的查询存储
zh_hant: 可用的查詢存放區

# objectManagement.databaseProperties.queryStoreCaptureModeText
source: Query Store Capture Mode
de: Abfragespeicher-Erfassungsmodus
es: Modo de captura del almacén de consultas
fr: Mode de capture du magasin des requêtes
it: Modalità di acquisizione di Query Store
ja: クエリ ストア取り込みモード
ko: 쿼리 저장소 캡처 모드
pt_br: Modo de Captura do Repositório de Consultas
ru: Режим записи хранилища запросов
zh_hans: 查询存储捕获模式
zh_hant: 查詢存放區擷取模式

# objectManagement.databaseProperties.queryStoreCapturePolicySectionText
source: Query Store Capture Policy
de: Erfassungsrichtlinie für Abfragespeicher
es: Directiva de captura del almacén de consultas
fr: Stratégie de capture du magasin des requêtes
it: Criteri di acquisizione di Query Store
ja: クエリ ストア取り込みポリシー
ko: 쿼리 저장소 캡처 정책
pt_br: Política de Captura do Repositório de Consultas
ru: Политика записи хранилища запросов
zh_hans: 查询存储捕获策略
zh_hant: 查詢存放區擷取原則

# objectManagement.databaseProperties.queryStoreRetentionSectionText
source: Query Store Retention
de: Abfragespeicheraufbewahrung
es: Retención del almacén de consultas
fr: Rétention du magasin de données des requêtes
it: Memorizzazione archivio query
ja: クエリ ストアのリテンション期間
ko: 쿼리 저장소 보존
pt_br: Retenção do Repositório de Dados de Consulta
ru: Период удержания хранилища запросов
zh_hans: 查询存储保留
zh_hant: 查詢存放區保留

# objectManagement.databaseProperties.queryStoreUsedText
source: Query Store Used
de: Verwendeter Abfragespeicher
es: Almacén de consultas usado
fr: Magasin de données des requêtes utilisé
it: Query Store usato
ja: 使用中のクエリ ストア
ko: 사용된 쿼리 저장소
pt_br: Repositório de Consultas Usado
ru: Используемое хранилище запросов
zh_hans: 已使用的查询存储
zh_hant: 已使用的查詢存放區

# objectManagement.queryWaitLabel
source: Query Wait
de: Abfragewartezeit
es: Espera de consulta
fr: Attente de la requête
it: Attesa query
ja: クエリの待機
ko: 쿼리 대기
pt_br: Espera da Consulta
ru: Ожидание запроса
zh_hans: 查询等待
zh_hant: 查詢等候

# objectManagement.databaseProperties.rowsDataFileType
source: ROWS Data
de: ZEILEN (Daten)
es: Datos de FILAS
fr: Données LIGNES
it: Dati RIGHE
ja: ROWS データ
ko: 행 데이터
pt_br: Dados de LINHAS
ru: Данные СТРОК
zh_hans: 行数据
zh_hant: 資料列資料

# objectManagement.databaseProperties.readOnlyText
source: Read-Only
de: Schreibgeschützt
es: Solo lectura
fr: Lecture seule
it: Sola lettura
ja: 読み取り専用
ko: 읽기 전용
pt_br: Somente leitura
ru: Только для чтения
zh_hans: 只读
zh_hant: 唯讀

# objectManagement.databaseProperties.recoverySectionHeader
source: Recovery
de: Wiederherstellung
es: Recuperación
fr: Récupération
it: Ripristino
ja: 復元
ko: 복구
pt_br: Recuperação
ru: Восстановление
zh_hans: 恢复
zh_hant: 復原

# objectManagement.recoveryModelLabel
source: Recovery Model
de: Wiederherstellungsmodell
es: Modelo de recuperación
fr: Mode de récupération
it: Modello di recupero
ja: 復旧モデル
ko: 복구 모델
pt_br: Modo de Recuperação
ru: Модель восстановления
zh_hans: 恢复模式
zh_hant: 復原模式

# objectManagement.restoreDatabase.recoveryStateText
source: Recovery State
de: Wiederherstellungsstatus
es: Estado de recuperación
fr: État de récupération
it: Stato ripristino
ja: 復旧状態
ko: 복구 상태
pt_br: Estado de Recuperação
ru: Состояние восстановления
zh_hans: 恢复状态
zh_hant: 復原狀態

# objectManagement.backupRecoveryLabel
source: Recovery model
de: Wiederherstellungsmodell
es: Modelo de recuperación
fr: Mode de récupération
it: Modello di recupero
ja: 復旧モデル
ko: 복구 모델
pt_br: Modelo de recuperação
ru: Модель восстановления
zh_hans: 恢复模式
zh_hant: 復原模式

# objectManagement.regionLabel
source: Region
es: Región
fr: Région
it: Area geografica
ja: リージョン
ko: 지역
pt_br: Região
ru: Регион
zh_hans: 区域
zh_hant: 區域

# objectManagement.regionSpecificEndpointLabel
source: Region-specific endpoint
de: Regionsspezifischer Endpunkt
es: Punto de conexión específico de la región
fr: Point de terminaison spécifique à une région
it: Endpoint specifico dell’area
ja: 特定リージョンのエンドポイント
ko: 지역별 엔드포인트
pt_br: Ponto de extremidade específico da região
ru: Конечная точка для конкретного региона
zh_hans: 特定于区域的终结点
zh_hant: 區域特定端點

# objectManagement.backupReliability
source: Reliability
de: Zuverlässigkeit
es: Confiabilidad
fr: Fiabilité
it: Affidabilità
ja: 信頼性
ko: 안정성
pt_br: Confiabilidade
ru: Надежность
zh_hans: 可靠性
zh_hant: 可靠性

# objectManagement.restoreDatabase.relocateAllFilesText
source: Relocate All Files
de: Alle Dateien verschieben
es: Reubicar todos los archivos
fr: Déplacer tous les fichiers
it: Riloca tutti i file
ja: すべてのファイルの再配置
ko: 모든 파일 재배치
pt_br: Realocar Todos os Arquivos
ru: Переместить все файлы
zh_hans: 重新定位所有文件
zh_hant: 重新放置所有檔案

# objectManagement.databaseProperties.removeButton
source: Remove
de: Entfernen
es: Quitar
fr: Supprimer
it: Rimuovi
ja: 削除
ko: 제거
pt_br: Remover
ru: Удалить
zh_hans: 删除
zh_hant: 移除

# objectManagement.removeBackupFileText
source: Remove backup file
de: Sicherungsdatei entfernen
es: Quitar archivo de copia de seguridad
fr: Supprimez le fichier de sauvegarde
it: Rimuovi file di backup
ja: バックアップ ファイルの削除
ko: 백업 파일 제거
pt_br: Remover arquivo de backup
ru: Удалить файл резервной копии
zh_hans: 移除备份文件
zh_hant: 移除備份檔案

# objectManagement.removeFileText
source: Remove database file
de: Datenbankdatei entfernen
es: Quitar archivo de base de datos
fr: Supprimer le fichier de base de données
it: Rimuovi file di database
ja: データベース ファイルの削除
ko: 데이터베이스 파일 제거
pt_br: Remover arquivo de banco de dados
ru: Удалить файл базы данных
zh_hans: 删除数据库文件
zh_hant: 移除資料庫檔案

# objectManagement.removeMemberText
source: Remove selected member
de: Ausgewähltes Mitglied entfernen
es: Quitar el miembro seleccionado
fr: Supprimer le membre sélectionné
it: Rimuovi membro selezionato
ja: 選択したメンバーを削除する
ko: 선택한 구성원 제거
pt_br: Remover membro selecionado
ru: Удалить выбранный элемент
zh_hans: 删除所选成员
zh_hant: 移除選取的成員

# objectManagement.removeSecurablesText
source: Remove selected securable
de: Ausgewählte sicherungsfähige Elemente entfernen
es: Quitar elemento protegible seleccionado
fr: Supprimer l’élément sécurisable sélectionné
it: Rimuovi entità a protezione diretta selezionata
ja: 選択したセキュリティ保護可能なリソースの削除
ko: 선택한 보안 개체 제거
pt_br: Remover protegível selecionado
ru: Удалить выбранный защищаемый объект
zh_hans: 删除所选安全对象
zh_hant: 移除已選取的安全性實體

# objectManagement.renameObjectOperationName
source: Rename {0} '{1}' to '{2}'
de: {0} "{1}" in "{2}" umbenennen
es: Cambie el nombre de {0} '{1}' a '{2}'
fr: Renommer {0} '{1}' en '{2}'
it: Rinomina {0} '{1}' in '{2}'
ja: {0} '{1}' の名前を '{2}' に変更します
ko: {0} '{1}'의 이름을 '{2}'(으)로 변경
pt_br: Renomear {0} '{1}' para '{2}'
ru: Переименовать {0} "{1}" на "{2}"
zh_hans: 将 {0} "{1}" 重命名为 "{2}"
zh_hant: 將 {0} '{1}' 重新命名為 '{2}'

# objectManagement.reservedStorageSizeInMB
source: Reserved Storage Size (MB)
de: Größe des reservierten Speichers (MB)
es: Tamaño de almacenamiento reservado (MB)
fr: Taille de stockage réservée (Mo)
it: Dimensioni spazio di archiviazione riservato in (MB)
ja: 予約済みストレージのサイズ (MB)
ko: 예약된 스토리지 크기(MB)
pt_br: Tamanho do Armazenamento Reservado (MB)
ru: Зарезервированный размер хранилища (МБ)
zh_hans: 预留的存储大小 (MB)
zh_hant: 保留儲存空間大小 (MB)

# objectManagement.restoreDatabase.restorePlan.restoreText
source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
it: Ripristina
ja: 復元
ko: 복원
pt_br: Restaurar
ru: Восстановить
zh_hans: 还原
zh_hant: 還原

# objectManagement.restoreDatabase.restorePlan.restoreAsText
source: Restore As
de: Wiederherstellen als
es: Restaurar como
fr: Restaurer en tant que
it: Ripristina come
ja: 復元先
ko: 다음으로 복원
pt_br: Restaurar como
ru: Восстановить как
zh_hans: 还原为
zh_hant: 還原為

# objectManagement.restoreDatabaseDialogTitle
source: Restore Database (Preview)
de: Datenbank wiederherstellen (Vorschau)
es: Restaurar base de datos (versión preliminar)
fr: Restaurer la base de données (préversion)
it: Ripristina database (anteprima)
ja: データベースの復元 (プレビュー)
ko: 데이터베이스 복원(미리 보기)
pt_br: Restaurar o Banco de Dados (Versão Prévia)
ru: Восстановление базы данных (предварительная версия)
zh_hans: 还原数据库(预览版)
zh_hant: 還原資料庫 (預覽)

# objectManagement.restoreDatabase.restoreOptionsText
source: Restore Options
de: Wiederherstellungsoptionen
es: Opciones de restauración
fr: Options de restauration
it: Opzioni di ripristino
ja: 復元オプション
ko: 복원 옵션
pt_br: Restaurar Opções
ru: Параметры восстановления
zh_hans: 还原选项
zh_hant: 還原選項

# objectManagement.restoreDatabaseOperationName
source: Restore database '{0}'
de: Datenbank '{0}' wiederherstellen
es: Restaurar base de datos "{0}"
fr: Restaurer la base de données '{0}'
it: Ripristina database '{0}'
ja: データベース '{0}' を復元する
ko: 데이터베이스 '{0}' 복원
pt_br: Restaurar o banco de dados '{0}'
ru: Восстановление базы данных "{0}"
zh_hans: 还原数据库“{0}”
zh_hant: 還原資料庫 '{0}'

# objectManagement.restoreDatabase.restoreDatabaseFileDetailsText
source: Restore database file Details
de: Details zu Datenbankdateien wiederherstellen
es: Restaurar detalles del archivo de base de datos
fr: Restaurer les détails du fichier de base de données
it: Dettagli del file di ripristino del database
ja: データベース ファイルの詳細を復元する
ko: 데이터베이스 파일 복원 세부 정보
pt_br: Restaurar os detalhes do arquivo do banco de dados
ru: Восстановление сведений о файле базы данных
zh_hans: 还原数据库文件详细信息
zh_hant: 還原資料庫檔案詳細資訊

# objectManagement.restoreDatabase.restoreDatabaseFilesAsText
source: Restore database files as
de: Datenbankdateien wiederherstellen als
es: Restaurar archivos de base de datos como
fr: Restaurer les fichiers de base de données en tant que
it: Ripristina file di database come
ja: データベース ファイルを名前を付けて復元
ko: 데이터베이스 파일을 다음으로 복원
pt_br: Restaurar arquivos de banco de dados como
ru: Восстановить файлы базы данных как
zh_hans: 将数据库文件还原为
zh_hant: 將資料庫檔案還原為

# objectManagement.restoreDatabase.restoreFromText
source: Restore from
de: Wiederherstellen aus
es: Restaurar de
fr: Restaurer à partir de
it: Ripristina da
ja: 復元元
ko: 복원할 원본 위치
pt_br: Restaurar de
ru: Восстановить из
zh_hans: 还原自
zh_hant: 還原自

# objectManagement.restoreDatabase.RestorePlanSectionText
source: Restore plan
de: Plan wiederherstellen
es: Plan de restauración
fr: Plan de restauration
it: Piano di ripristino
ja: 復元計画
ko: 복원 계획
pt_br: Restaurar plano
ru: Восстановить план
zh_hans: 还原计划
zh_hant: 還原計劃

# objectManagement.restoreDatabase.restoreToText
source: Restore to
de: Wiederherstellen in
es: Restaurar a
fr: Restaurer sur
it: Ripristina fino a
ja: 復元先
ko: 복원 위치
pt_br: Restaurar para
ru: Восстановить в
zh_hans: 还原到
zh_hant: 還原至

# objectManagement.databaseProperties.restrictAccessText
source: Restrict Access
de: Zugriff einschränken
es: Restringir acceso
fr: Restreindre l'accès
it: Limitazione accesso
ja: アクセスの制限
ko: 액세스 제한
pt_br: Acesso Restrito
ru: Ограничение доступа
zh_hans: 限制访问
zh_hant: 限制存取

# objectManagement.restoreDatabase.restrictAccessToRestoredDBText
source: Restrict access to the restored database (WITH RESTRICTED_USER)
de: Einschränken des Zugriffs auf die wiederhergestellte Datenbank (WITH RESTRICTED_USER)
es: Restringir el acceso a la base de datos restaurada (CON RESTRICTED_USER)
fr: Restreindre l’accès à la base de données restaurée (WITH RESTRICTED_USER)
it: Limita accesso al database ripristinato (WITH RESTRICTED_USER)
ja: 復元するデータベースへのアクセスを制限する (WITH RESTRICTED_USER)
ko: 복원된 데이터베이스에 대한 액세스 제한(WITH RESTRICTED_USER)
pt_br: Restringir o acesso ao banco de dados restaurado (WITH RESTRICTED_USER)
ru: Ограничить доступ к восстанавливаемой базе данных (WITH RESTRICTED_USER)
zh_hans: 限制访问还原的数据库(WITH RESTRICTED_USER)
zh_hant: 限制對還原資料庫的存取 (WITH RESTRICTED_USER)

# objectManagement.rootDirectory
source: Root Directory
de: Stammverzeichnis
es: Directorio raíz
fr: Répertoire racine
it: Directory radice
ja: ルート ディレクトリ
ko: 루트 디렉터리
pt_br: Diretório Raiz
ru: Корневой каталог
zh_hans: 根目录
zh_hant: 根目錄

# objectManagement.databaseProperties.rowsFileGroupsSectionText
source: Rows
de: Zeilen
es: Filas
fr: Lignes
it: Righe
ja: 行
ko: 행
pt_br: Linhas
ru: Строки
zh_hans: 行
zh_hant: 資料列

# objectManagement.restoreDatabase.restoreFromS3UrlText
source: S3 URL
fr: URL S3
it: URL S3
pt_br: URL do S3
ru: URL-адрес S3

# objectManagement.login.sqlAuthenticationType
source: SQL Authentication
de: SQL-Authentifizierung
es: Autenticación de SQL
fr: Authentification SQL
it: Autenticazione SQL
ja: SQL 認証
ko: SQL 인증
pt_br: Autenticação do SQL
ru: Проверка подлинности SQL
zh_hans: SQL 身份验证
zh_hant: SQL 驗證

# objectManagement.login.sqlAuthSectionHeader
source: SQL Authentication
de: SQL-Authentifizierung
es: Autenticación de SQL
fr: Authentification SQL
it: Autenticazione SQL
ja: SQL 認証
ko: SQL 인증
pt_br: Autenticação do SQL
ru: Проверка подлинности SQL
zh_hans: SQL 身份验证
zh_hant: SQL 驗證

# objectManagement.sqlServerAndWindowsAuthText
source: SQL Server and Windows Authentication mode
de: SQL Server- und Windows-Authentifizierungsmodus
es: Modo de autenticación de Windows y SQL Server
fr: Mode d'authentification SQL Server et Windows
it: Autenticazione di SQL Server e di Windows
ja: SQL Serverと Windows 認証モード
ko: SQL Server 및 Windows 인증 모드
pt_br: Modo de Autenticação do SQL Server e do Windows
ru: Режим проверки подлинности Windows и SQL Server
zh_hans: SQL Server 和 Windows 身份验证模式
zh_hant: SQL Server 及 Windows 驗證模式
