Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.azcli.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# az.unsupportedArcDataVersion
source: Your downloaded version {1} of the Azure CLI extension 'arcdata' is not yet supported. The latest version is is {0}. Install the correct version using instructions from [here](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
de: Die heruntergeladene Version {1} der Azure CLI-Erweiterung „arcdata“ wird noch nicht unterstützt. Die neueste Version ist {0}. Installieren Sie die richtige Version mithilfe der Anweisungen von [hier](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
es: Su versión descargada de la extensión {1} de la CLI de Azure \"arcdata\" aún no es compatible. La última versión es {0}. Instale la versión correcta siguiendo las instrucciones de [aquí](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
fr: Votre version téléchargée {1} de l’extension Azure CLI « arcdata » n’est pas encore prise en charge. La dernière version est {0}. Installez la version correcte en suivant les instructions de [ici](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
it: La versione scaricata {1} dell'estensione 'arcdata' dell'interfaccia della riga di comando di Azure non è ancora supportata. La versione più recente è {0}. Installare la versione corretta seguendo le istruzioni riportate [qui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
ja: Azure CLI の拡張機能 'arcdata' のダウンロード済みバージョン {1} はまだサポートされていません。最新バージョンは {0} です。[こちら](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension) の手順に従って正しいバージョンをインストールしてください。
ko: Azure CLI 확장 'arcdata'의 다운로드한 버전 {1}은(는) 아직 지원되지 않습니다. 최신 버전은 {0}입니다. [여기](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension)의 지침을 사용하여 올바른 버전을 설치합니다.
pt_br: Ainda não há suporte para versão {1} baixada da extensão “arcdata” da CLI do Azure. A versão mais recente é {0}. Instale a versão correta usando as instruções encontradas [aqui](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
ru: Загруженная версия расширения arcdata для Azure CLI, {1}, пока не поддерживается. Последняя версия — {0}. Установите правильную версию, следуя инструкциям [здесь](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension).
zh_hans: 尚不支持下载版本为 {1} 的 Azure CLI 扩展 “arcdata”。最新版本为 {0}。请使用 [此处](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension)的说明安装正确的版本.
zh_hant: 尚不 支援您下載的 Azure CLI 延伸模組 'arcdata' 版本 {1}。最新版本是 {0}。使用[此處](https://docs.microsoft.com/azure/azure-arc/data/install-arcdata-extension) 中的指示安裝正確的版本。

# azcli.arc.category
source: Azure CLI
es: CLI de Azure
it: Interfaccia della riga di comando di Azure
pt_br: CLI do Azure

# command.category
source: Azure CLI
es: CLI de Azure
it: Interfaccia della riga di comando di Azure
pt_br: CLI do Azure

# azcli.arc.displayName
source: Azure CLI
es: CLI de Azure
it: Interfaccia della riga di comando di Azure
pt_br: CLI do Azure

# azcli.arc.config.title
source: Azure CLI Configuration
de: Azure CLI-Konfiguration
es: Configuración de la CLI de Azure
it: Configurazione dell'interfaccia della riga di comando di Azure
ja: Azure CLI の構成
ko: Azure CLI 구성
pt_br: Configuração da CLI do Azure
ru: Конфигурация Azure CLI
zh_hans: Azure CLI 配置
zh_hant: Azure CLI 設定

# azcli.arc.azArcdataInstallKey.description
source: Choose whether you will be prompted to download the Azure CLI arcdata extension.
de: Wählen Sie aus, ob Sie aufgefordert werden sollen, die Azure CLI arcdata-Erweiterung herunterzuladen.
es: Elija si se le pedirá que descargue la extensión arcdata de la CLI de Azure.
fr: Choisissez si vous serez invité à télécharger l’extension arcdata Azure CLI.
it: Scegliere se verrà richiesto di scaricare l'estensione arcdata dell'interfaccia della riga di comando di Azure.
ja: Azure CLI arcdata 拡張機能のダウンロードを促すメッセージを表示するかどうかを選択します。
ko: Azure CLI arcdata 확장을 다운로드하라는 메시지를 표시할지 여부를 선택합니다.
pt_br: Escolha se você será solicitado a baixar a extensão arcdata da CLI do Azure.
ru: Выберите, будет ли вам предложено скачать расширение arcdata для Azure CLI.
zh_hans: 选择是否由系统提示你下载 Azure CLI arcdata 扩展。
zh_hant: 選擇是否要提示您下載 Azure CLI arcdata 延伸模組。

# azcli.azCliInstallKey.description
source: Choose whether you will be prompted to install Azure CLI.
de: Wählen Sie aus, ob Sie aufgefordert werden sollen, Azure CLI zu installieren.
es: Elija si se le pedirá que instale la CLI de Azure.
fr: Choisissez si vous serez invité à installer Azure CLI.
it: Scegliere se verrà richiesto di installare l'interfaccia della riga di comando di Azure.
ja: Azure CLI のインストールを促すメッセージを表示するかどうかを選択します。
ko: Azure CLI를 설치하라는 메시지를 표시할지 여부를 선택합니다.
pt_br: Escolha se você será solicitado a instalar a CLI do Azure.
ru: Укажите, будет ли отображаться запрос на установку Azure CLI.
zh_hans: 选择是否由系统提示你安装 Azure CLI。
zh_hant: 選擇是否要提示您安裝 Azure CLI。

# azcli.arc.azArcdataUpdateKey.description
source: Choose whether you will be prompted when an update of the Azure CLI arcdata extension is available.
de: Entscheiden Sie, ob Sie zur Aktualisierung aufgefordert werden wollen, wenn ein Update für die Azure CLI arcdata-Erweiterung verfügbar ist.
es: Elija si se le solcita cuando esté disponible una actualización de la extensión arcdata de la CLI de Azure.
fr: Choisissez si vous serez averti lorsqu’une mise à jour de l’extension arcdata Azure CLI est disponible.
it: Scegliere se verrà visualizzata una richiesta quando è disponibile un aggiornamento dell'estensione dell’interfaccia della riga di comando di Azure.
ja: Azure CLI arcdata 拡張機能が更新可能になった場合にダイアログを表示するかどうかを選択します。
ko: Azure CLI arcdata 확장의 업데이트를 사용할 수 있을 때 메시지를 표시할지 여부를 선택합니다.
pt_br: Escolha se você será solicitado quando uma atualização da extensão de arcdata do CLI do Azure estiver disponível.
ru: Укажите, следует ли отображать запрос, когда станет доступно обновление для расширения arcdata для Azure CLI.
zh_hans: 选择当 Azure CLI arcdata 扩展可用时系统是否向你发出提示。
zh_hant: 選擇當 Azure CLI arcdata 延伸模組有更新時是否要提示您。

# azcli.arc.config.debug
source: Log debug info to the output channel for all executed az commands
de: Debuginformationen für alle ausgeführten az-Befehle im Ausgabekanal protokollieren
es: Registrar información de depuración en el canal de salida para todos los comandos az ejecutados
fr: Enregistrez les informations de débogage sur le canal de sortie pour toutes les commandes az exécutées
it: Registrare le informazioni di debug nel canale di output per tutti i comandi az eseguiti
ja: すべての実行済み az コマンドの出力チャネルにデバッグ情報を記録します
ko: 실행된 모든 az 명령에 대한 디버그 정보를 출력 채널에 기록합니다.
pt_br: Registrar informações de depuração no canal de saída para todos os comandos az executados
ru: Запись отладочной информации в канал вывода для всех выполненных команд az
zh_hans: 将所有已执行的 az 命令的调试信息记录到输出通道
zh_hant: 將偵錯資訊記錄到所有已執行 az 命令的輸出通道

# azcli.arc.description
source: Support for Azure CLI.
de: Unterstützung für Azure CLI.
es: Compatibilidad con la CLI de Azure.
fr: Prise en charge d’Azure CLI.
it: Supporto per l'interfaccia della riga di comando di Azure.
ja: Azure CLI 対応。
ko: Azure CLI 지원.
pt_br: Suporte à CLI do Azure.
ru: Поддержка Azure CLI
zh_hans: 支持 Azure CLI。
zh_hant: 支援 Azure CLI。

# azcli.arc.update.prompt.description
source: The user will be prompted for update of the Azure CLI arcdata extension
de: Der Benutzer wird aufgefordert, die Azure CLI arcdata-Erweiterung zu installieren
es: Se pedirá al usuario que actualice la extensión arcdata de la CLI de Azure
fr: L’utilisateur sera invité à mettre à jour l’extension arcdata Azure CLI
it: All'utente verrà richiesto di aggiornare l'estensione arcdata dell'interfaccia della riga di comando di Azure
ja: ユーザーに Azure CLI arcdata 拡張機能の更新を促すダイアログが表示されます
ko: 사용자에게 Azure CLI arcdata 확장을 업데이트하라는 메시지가 표시됩니다.
pt_br: O usuário será solicitado a atualizar a extensão de arcdata da CLI do Azure
ru: Пользователю будет выдаваться запрос на обновление расширения arcdata для Azure CLI
zh_hans: 系统将提示用户更新 Azure CLI arcdata 扩展
zh_hant: 系統將提示使用者更新 Azure CLI arcdata 延伸模組

# azcli.install.prompt.description
source: The user will be prompted to install the Azure CLI
de: Der Benutzer wird aufgefordert, die Azure CLI zu installieren
es: Se le pedirá al usuario que instale la CLI de Azure
fr: L’utilisateur sera invité à installer le Azure CLI
it: All'utente verrà richiesto di installare l'interfaccia della riga di comando di Azure
ja: ユーザーに Azure CLI のインストールを促すメッセージが表示されます
ko: 사용자에게 Azure CLI를 설치하라는 메시지가 표시됩니다.
pt_br: O usuário será solicitado a instalar o CLI do Azure
ru: Пользователю будет предложено установить Azure CLI
zh_hans: 系统将提示用户安装 Azure CLI
zh_hant: 系統會提示使用者安裝 Azure CLI

# azcli.arc.install.prompt.description
source: The user will be prompted to install the Azure CLI arcdata extension
de: Der Benutzer wird nicht aufgefordert, die Azure CLI arcdata-Erweiterung zu installieren
es: Se pedirá al usuario que instale la extensión arcdata de la CLI de Azure
fr: L’utilisateur sera invité à installer l’extension arcdata Azure CLI
it: All'utente verrà richiesto di installare l'estensione arcdata dell'interfaccia della riga di comando di Azure
ja: ユーザーに Azure CLI arcdata 拡張機能のインストールを促すダイアログが表示されます
ko: 사용자에게 Azure CLI arcdata 확장을 설치하라는 메시지가 표시됩니다.
pt_br: O usuário será solicitado a instalar a extensão de arcdata do CLI do Azure
ru: Пользователю будет предложено установить расширение arcdata для Azure CLI
zh_hans: 系统将提示用户安装 Azure CLI arcdata 扩展
zh_hant: 系統將提示使用者安裝 Azure CLI arcdata 延伸模組

# azcli.arc.update.dontPrompt.description
source: The user will not be prompted for update of the Azure CLI arcdata extension
de: Der Benutzer wird nicht aufgefordert, die Azure CLI arcdata-Erweiterung zu installieren
es: Al usuario no se le pedirá que actualice la extensión arcdata de la CLI de Azure
fr: L’utilisateur ne sera pas invité à mettre à jour l’extension arcdata Azure CLI
it: All'utente non verrà richiesto di aggiornare l'estensione arcdata dell'interfaccia della riga di comando di Azure
ja: ユーザーに Azure CLI arcdata 拡張機能の更新を促すダイアログは表示されません
ko: Azure CLI arcdata 확장을 업데이트하라는 메시지가 사용자에게 표시되지 않습니다.
pt_br: O usuário não será solicitado a atualizar a extensão arcdata da CLI do Azure
ru: Пользователю не будет выдаваться запрос на обновление расширения arcdata для Azure CLI
zh_hans: 系统将不提示用户更新 Azure CLI arcdata 扩展
zh_hant: 系統將不會提示使用者更新 Azure CLI arcdata 延伸模組

# azcli.install.dontPrompt.description
source: The user will not be prompted to install the Azure CLI
de: Der Benutzer wird nicht aufgefordert, die Azure CLI zu installieren
es: Al usuario no se le pedirá que instale la CLI de Azure
fr: L’utilisateur ne sera pas invité à installer Azure CLI
it: All'utente non verrà richiesto di installare l'interfaccia della riga di comando di Azure
ja: ユーザーに Azure CLI のインストールを促すメッセージは表示されません
ko: 사용자에게 Azure CLI를 설치하라는 메시지가 표시되지 않습니다.
pt_br: O usuário não será solicitado a instalar a CLI do Azure
ru: Пользователю не будет предложено установить Azure CLI
zh_hans: 系统将不会提示用户安装 Azure CLI
zh_hant: 系統將不會提示使用者安裝 Azure CLI

# azcli.arc.install.dontPrompt.description
source: The user will not be prompted to install the Azure CLI arcdata extension
de: Der Benutzer wird nicht aufgefordert, die Azure CLI arcdata-Erweiterung zu installieren.
es: El usuario no tendrá que instalar la extensión arcdata de la CLI de Azure
fr: L’utilisateur ne sera pas invité à installer l’extension Azure CLI arcdata
it: All'utente non verrà richiesto di installare l'estensione arcdata dell'interfaccia della riga di comando di Azure
ja: ユーザーに Azure CLI arcdata 拡張機能のインストールを促すダイアログは表示されません
ko: 사용자에게 Azure CLI arcdata 확장을 설치하라는 메시지가 표시되지 않습니다.
pt_br: O usuário não será solicitado a instalar a extensão de arcdata do CLI do Azure
ru: Пользователю не будет предложено установить расширение arcdata для Azure CLI
zh_hans: 系统将不会提示用户安装 Azure CLI arcdata 扩展
zh_hant: 系統不會提示使用者安裝 Azure CLI arcdata 延伸模組

# az.stderrOutput
source: stderr: {0}
ko: 표준 오류: {0}
