Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# sql.migration.details.serverobjects.cancelled.tables.label
source: Cancelled
de: Abgebrochen
es: Cancelado
fr: Annulé
ja: 取り消されました
ko: 취소됨
pt_br: Cancelada
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消

# sql.migration.invalid.owner.uri.error
source: Cannot connect to the database due to invalid OwnerUri (Parameter 'OwnerUri')
de: Aufgrund eines ungültigen OwnerUri-Werts kann keine Verbindung mit der Datenbank hergestellt werden (Parameter "OwnerUri").
es: No se puede conectar a la base de datos porque ownerUri no es válido (parámetro 'OwnerUri')
fr: Impossible de se connecter à la base de données en raison d'un OwnerUri non valide (Paramètre « OwnerUri »)
ja: OwnerUri が無効なため、データベースに接続できません (パラメーター 'OwnerUri')
ko: 잘못된 OwnerUri(매개 변수 'OwnerUri')로 인해 데이터베이스에 연결할 수 없습니다.
pt_br: Não é possível conectar-se ao banco de dados devido a OwnerUri inválido (Parâmetro 'OwnerUri')
ru: Невозможно подключиться к базе данных из-за недопустимого значения OwnerUri (параметр OwnerUri)
zh_hans: 由于 OwnerUri 无效，无法连接到数据库(参数 "OwnerUri")
zh_hant: 因為 OwnerUri 無效，所以無法連線到資料庫 (參數 'OwnerUri')

# sql.migration.invalid.savedInfo
source: Cannot retrieve saved session. Try again by selecting new session.
de: Die gespeicherte Sitzung kann nicht abgerufen werden. Versuchen Sie es erneut, indem Sie eine neue Sitzung auswählen.
es: No se pudo recuperar la sesión guardada. Vuelva a intentarlo seleccionando una nueva sesión.
fr: Impossible de récupérer la session enregistrée. Réessayez en sélectionnant une nouvelle session.
ja: 保存されたセッションを回復できません。新しいセッションを選択して、もう一度お試しください。
ko: 저장된 세션을 검색할 수 없습니다. 새 세션을 선택하여 다시 시도하세요.
pt_br: Não é possível recuperar a sessão salva. Tente novamente seleccionando uma nova sessão.
ru: Не удалось получить сохраненный сеанс. Повторите попытку, выбрав новый сеанс.
zh_hans: 无法检索已保存的会话。请通过选择新会话重试。
zh_hant: 無法擷取已儲存的工作階段。請選取新的工作階段，然後再試一次。

# sql.migration.tde.wizard.optionscaption
source: Certificate migration
de: Zertifikatmigration
es: Migración de certificados
fr: Migration de certificat
ja: 証明書の移行
ko: 인증서 마이그레이션
pt_br: Migração de certificado
ru: Миграция сертификатов
zh_hans: 证书迁移
zh_hant: 憑證移轉

# sql.migration.tde.validation.group.title
source: Certificate validations
de: Zertifikat Validierungen
es: Validaciones de certificados
fr: Validations de certificats
ja: 証明書の検証
ko: 인증서 유효성 검사
pt_br: Validações do certificado
ru: Проверки сертификатов
zh_hans: 证书验证
zh_hant: 憑證驗證

# sql.migration.validation.dialog.title
source: Certificates Migration
de: Zertifikatmigration
es: Migración de certificados
fr: Migration des certificats
ja: 証明書の移行
ko: 인증서 마이그레이션
pt_br: Migração de Certificados
ru: Миграция сертификатов
zh_hans: 证书迁移
zh_hant: 憑證移轉

# sql.migration.tde.migrate.success
source: Certificates migration completed successfully. Please click Next to proceed with the migration.
de: Die Zertifikatmigration wurde erfolgreich abgeschlossen. Klicken Sie auf Weiter, um mit der Migration fortzufahren.
es: La migración de certificados se completó correctamente. Haga clic en Siguiente para continuar con la migración.
fr: La migration des certificats s’est terminée avec succès. Veuillez cliquer sur Suivant pour poursuivre la migration.
ja: 証明書移行が正常に完了しました。移行を続行するには、[次へ] をクリックしてください。
ko: 인증서 마이그레이션을 완료했습니다. 마이그레이션을 계속하려면 [다음]을 클릭하세요.
pt_br: Migração de certificados concluída com êxito. Clique em Avançar para continuar com a migração.
ru: Миграция сертификатов выполнена. Щелкните "Далее", чтобы продолжить миграцию.
zh_hans: 证书迁移已成功完成。请单击“下一步”继续迁移。
zh_hant: 憑證移轉已成功完成。 請按 [下一步] 繼續移轉。

# sql.migration.tde.migrate.not.run
source: Certificates migration has not been run for the current configuration. Please run and complete the certificates migration to continue.
de: Die Zertifikatmigration wurde für die aktuelle Konfiguration nicht ausgeführt. Führen Sie die Zertifikatmigration aus, und schließen Sie sie ab, um den Vorgang fortzusetzen.
es: No se ha ejecutado la migración de los certificados para la configuración actual. Ejecute y complete la configuración de migración de certificados para continuar.
fr: La migration des certificats n’a pas été exécutée pour la configuration actuelle. Veuillez exécuter et terminer la migration des certificats pour continuer.
ja: 現在の構成では証明書移行がまだ実行されていません。続行するには、証明書移行を実行および完了してください。
ko: 인증서 마이그레이션이 현재 구성에 대해 실행되지 않았습니다. 계속하려면 인증서 마이그레이션을 실행하고 완료하세요.
pt_br: A migração de certificados não foi executada para a configuração atual. Execute e conclua a migração de certificados para continuar.
ru: Миграция сертификатов для текущей конфигурации не выполнялась. Необходимо запустить и полностью выполнить ее, чтобы продолжить.
zh_hans: 尚未为当前配置运行证书迁移。请运行并完成证书迁移以继续。
zh_hant: 尚未針對目前的設定執行憑證移轉。請執行並完成憑證移轉以繼續。

# sql.migration.tde.migrate.results.heading
source: Certificates migration progress details:
de: Details zum Zertifikatmigrationsstatus:
es: Detalles del progreso de la migración de certificados:
fr: Détails de la progression de la migration des certificats :
ja: 証明書の移行に関する進行状況の詳細:
ko: 인증서 마이그레이션 진행률 세부 정보:
pt_br: Detalhes do progresso da migração de certificados:
ru: Сведения о ходе выполнения миграции сертификатов:
zh_hans: 证书迁移进度详细信息:
zh_hant: 憑證移轉進度詳細資料:

# sql.migration.tde.migrate.results.heading.completed
source: Certificates migration results:
de: Zertifikatmigrationsergebnisse:
es: Resultados de la migración de certificados:
fr: Résultats de la migration des certificats :
ja: 証明書移行の結果:
ko: 인증서 마이그레이션 결과:
pt_br: Resultados da migração de certificados:
ru: Результаты миграции сертификатов:
zh_hans: 证书迁移结果:
zh_hant: 憑證移轉結果:

# sql.migration.tde.migrate.canceled
source: Certificates migration was canceled. Please run and complete the certificates migration to continue.
de: Die Zertifikatmigration wurde abgebrochen. Führen Sie die Zertifikatmigration aus, und schließen Sie sie ab, um den Vorgang fortzusetzen.
es: Se canceló la migración de certificados. Ejecute y complete la migración de certificados para continuar.
fr: La migration des certificats a été annulée. Veuillez exécuter et terminer la migration des certificats pour continuer.
ja: 証明書移行が取り消されました。続行するには、証明書移行を実行および完了してください。
ko: 인증서 마이그레이션을 취소했습니다. 계속하려면 인증서 마이그레이션을 실행하고 완료하세요.
pt_br: A migração de certificados foi cancelada. Execute e conclua a migração de certificados para continuar.
ru: Миграция сертификатов отменена. Необходимо запустить и полностью выполнить ее, чтобы продолжить.
zh_hans: 证书迁移已取消。请运行并完成证书迁移以继续。
zh_hant: 憑證移轉已取消。請執行並完成憑證移轉再繼續。

# sql.migration.tde.wizard.optionmanual.warning
source: Certificates must be migrated before proceeding with the database migration otherwise a failure will occur. {0} about manually migrating TDE certificates.
de: Zertifikate müssen migriert werden, bevor mit der Datenbankmigration fortgefahren wird. Andernfalls tritt ein Fehler auf. {0} zur manuellen Migration von TDE-Zertifikaten.
es: Los certificados deben migrarse antes de continuar con la migración de la base de datos; de lo contrario, se producirá un error. {0} sobre la migración manual de certificados TDE.
fr: Les certificats doivent être migrés avant de poursuivre la migration de la base de données, sinon un échec se produit. {0} sur la migration manuelle des certificats TDE.
ja: データベースの移行を進める前に証明書を移行する必要があり、移行しない場合にはエラーが発生します。TDE 証明書の手動移行については、{0}。
ko: 데이터베이스 마이그레이션을 계속하기 전에 인증서를 마이그레이션해야 합니다. 그렇지 않으면 오류가 발생하게 됩니다. TDE 인증서를 수동으로 마이그레이션하는 방법에 대해 {0}.
pt_br: Os certificados devem ser migrados antes de prosseguir com a migração do banco de dados, caso contrário, ocorrerá uma falha. {0} sobre a migração manual de certificados TDE.
ru: Перед продолжением миграции базы данных необходимо перенести сертификаты. В противном случае произойдет сбой. {0} о переносе сертификатов TDE вручную.
zh_hans: 必须先迁移证书，然后才能继续数据库迁移，否则将发生故障。{0} 有关手动迁移 TDE 证书的信息。
zh_hant: 憑證必須先移轉，才能繼續進行資料庫移轉，否則會發生失敗。{0} 手動移轉 TDE 憑證。

# sql.migration.sku.parameters.scale.factor.tooltip
source: Change scale factor if you want the Azure recommendation to be a percentage larger or smaller than you current workload.
de: Ändern Sie den Skalierungsfaktor, wenn die Azure-Empfehlung in Prozent größer oder kleiner als ihre aktuelle Workload sein soll.
es: Cambie el factor de escala si quiere que la recomendación de Azure sea un porcentaje mayor o menor que la carga de trabajo actual.
fr: Modifiez le facteur d’échelle si vous souhaitez que la recommandation Azure soit un pourcentage supérieur ou inférieur à votre charge de travail actuelle.
ja: Azure レコメンデーションを現在のワークロードよりも大きく、または小さくする場合は、倍率を変更します。
ko: Azure 권장 사항을 현재 워크로드보다 크거나 작은 비율로 설정하려면 배율을 변경합니다.
pt_br: Altere o fator de escala se desejar que a recomendação do Azure seja uma porcentagem maior ou menor do que sua carga de trabalho atual.
ru: Измените масштаб, если хотите, чтобы рекомендация Azure была в процентах относительно текущей рабочей нагрузки.
zh_hans: 如果希望 Azure 建议的百分比大于或小于当前工作负载，请更改比例因子。
zh_hant: 如果您希望 Azure 建議的百分比大於或小於您目前的工作負載，請變更縮放比例。

# sql.migration.wizard.sku.assessment.error.bypass
source: Check this option to skip assessment and continue the migration.
de: Aktivieren Sie diese Option, um die Bewertung zu überspringen und die Migration fortzusetzen.
es: Active esta opción para omitir la evaluación y continuar con la migración.
fr: Cochez cette option pour ignorer l’évaluation et continuer la migration.
ja: このオプションをチェックして評価をスキップし、移行を続行します。
ko: 평가를 건너뛰고 마이그레이션을 계속하려면 이 옵션을 선택합니다.
pt_br: Marque essa opção para ignorar a avaliação e continuar a migração.
ru: Установите этот флажок, чтобы пропустить оценку и продолжить миграцию.
zh_hans: 选中此选项可跳过评估并继续迁移。
zh_hant: 核取此選項以略過評定並繼續移轉。

# sql.migration.sku.azureRecommendation.data.collection.choose.path
source: Choose a path...
de: Pfad auswählen...
es: Elija una ruta de acceso...
fr: Choisissez un chemin...
ja: パスを選択...
ko: 경로 선택...
pt_br: Escolha um caminho...
ru: Выбрать путь...
zh_hans: 选择路径...
zh_hant: 選擇路徑...

# sql.migration.sku.azureRecommendation.chooseMethod.instructions
source: Choose how you want to provide performance data
de: Wählen Sie aus, wie Sie Leistungsdaten bereitstellen möchten
es: Elija cómo desea proporcionar los datos de rendimiento
fr: Choisissez la manière dont vous souhaitez fournir les données de performances
ja: パフォーマンス データを提供する方法を選択する
ko: 성능 데이터를 제공할 방법 선택
pt_br: Escolha como você deseja fornecer dados de desempenho
ru: Выберите способ предоставления данных производительности
zh_hans: 选择希望如何提供性能数据
zh_hant: 選擇您要如何提供效能資料

# sql.migration.import.assessment.header
source: Choose target platform and view assessment results.
de: Wählen Sie die Zielplattform aus, und zeigen Sie die Bewertungsergebnisse an.
es: Elija la plataforma de destino y vea los resultados de la evaluación.
fr: Choisissez la plateforme cible et affichez les résultats de l’évaluation.
ja: ターゲット プラットフォームを選択し、評価結果を表示します。
ko: 대상 플랫폼을 선택하고 평가 결과를 확인하세요..
pt_br: Escolha a plataforma de destino e exiba os resultados da avaliação.
ru: Выберите целевую платформу и просмотрите результаты оценки.
zh_hans: 选择目标平台并查看评估结果。
zh_hant: 選擇目標平台並檢視評定結果。

# sql.migration.assessment.results.header
source: Choose target platform, view assessment results and select database(s) for migration.
de: Wählen Sie die Zielplattform aus, zeigen Sie die Bewertungsergebnisse an, und wählen Sie Datenbanken für die Migration aus.
es: Elija la plataforma de destino, vea los resultados de la evaluación y seleccione las bases de datos para la migración.
fr: Choisissez la plate-forme cible, affichez les résultats de l'évaluation et sélectionnez la ou les bases de données à migrer.
ja: ターゲット プラットフォームを選択し、評価結果を表示し、移行するデータベースを選択します。
ko: 대상 플랫폼을 선택하고, 평가 결과를 보고, 마이그레이션할 데이터베이스를 선택합니다.
pt_br: Escolha a plataforma de destino, exiba os resultados da avaliação e selecione os bancos de dados para migração.
ru: Выберите целевую платформу, просмотрите результаты оценки и выберите базы данных для миграции.
zh_hans: 选择目标平台，查看评估结果并选择要迁移的数据库。
zh_hant: 選擇目標平台、檢視評定結果，並選取要移轉的資料庫。

# sql.migration.select.service.delete.label
source: Clear
de: Löschen
es: Borrar
fr: Effacer
ja: クリア
ko: 지우기
pt_br: Claro
ru: Очистить
zh_hans: 清除
zh_hant: 清除

# sql.migration.clear
source: Clear
de: Löschen
es: Borrar
fr: Effacer
ja: クリア
ko: 지우기
pt_br: Claro
ru: Очистить
zh_hans: 清除
zh_hant: 清除

# sql.migration.sku.azureRecommendation.status.manualRefreshTimer
source: Click on 'Refresh SKU' for updated recommendations.
de: Klicken Sie auf "SKU aktualisieren", um aktualisierte Empfehlungen anzuzeigen.
es: Haga clic en "Actualizar SKU" para obtener recomendaciones actualizadas.
fr: Cliquez sur « Actualiser le SKU » pour obtenir des recommandations mises à jour.
ja: 更新されたレコメンデーションについては、[SKU の更新] をクリックします。
ko: 업데이트된 권장 사항을 보려면 'SKU 새로 고침'을 클릭합니다.
pt_br: Clique em “Atualizar SKU” para recomendações atualizadas.
ru: Щелкните "Обновить SKU" для получения обновленных рекомендаций.
zh_hans: 单击“刷新 SKU”以获取更新的建议。
zh_hant: 按一下 [重新整理 SKU] 以取得更新的建議。

# sql.migration.select.prompt
source: Click on SQL Server instance or any of the databases on the left to view its details.
de: Klicken Sie auf SQL Server-Instanz oder eine der Datenbanken auf der linken Seite, um deren Details anzuzeigen.
es: Haga clic en instancia de SQL Server o en cualquiera de las bases de datos de la izquierda para ver los detalles.
fr: Cliquez sur l’instance SQL Server ou sur l’une des bases de données à gauche pour afficher ses détails.
ja: SQL Server インスタンス、または左側にあるいずれかのデータベースをクリックすると、その詳細が表示されます。
ko: SQL Server 인스턴스 또는 왼쪽에 있는 데이터베이스를 클릭하여 세부 정보를 봅니다.
pt_br: Clique em Instância do SQL Server ou qualquer um dos bancos de dados à esquerda para exibir seus detalhes.
ru: Щелкните экземпляр SQL Server или любую базу данных слева, чтобы просмотреть ее сведения.
zh_hans: 单击 SQL Server 实例或左侧的任意数据库以查看其详细信息。
zh_hant: 按一下 SQL Server 執行個體或左邊任何資料庫，以檢視其詳細資料。

# sql.migration.sku.azureRecommendation.tooltip.notStarted
source: Click the button below to import or collect database performance data.
de: Klicken Sie auf die Schaltfläche unten, um Datenbankleistungsdaten zu importieren oder zu erfassen.
es: Haga clic en el botón siguiente para importar o recopilar datos de rendimiento de la base de datos.
fr: Cliquez sur le bouton ci-dessous pour importer ou collecter les données de performances de la base de données.
ja: 下のボタンをクリックして、データベースのパフォーマンス データをインポートまたは収集します。
ko: 데이터베이스 성능 데이터를 가져오거나 수집하려면 아래 버튼을 클릭하세요.
pt_br: Clique no botão abaixo para importar ou coletar dados de desempenho do banco de dados.
ru: Нажмите кнопку ниже, чтобы импортировать или собрать данные производительности базы данных.
zh_hans: 单击下面的按钮以导入或收集数据库性能数据。
zh_hant: 按一下下方按鈕以匯入或收集資料庫效能資料。

# sql.migration.database.migration.context.menu.tool.tip
source: Click this column to activate the context command menu
de: Klicken Sie auf diese Spalte, um das Kontextbefehlsmenü zu aktivieren
es: Haga clic en esta columna para activar el menú contextual de comandos
fr: Cliquez sur cette colonne pour activer le menu contextuel des commandes
ja: この列をクリックすると、コンテキスト コマンド メニューが表示されます
ko: 상황에 맞는 명령 메뉴를 활성화하려면 이 열을 클릭하세요.
pt_br: Clique nesta coluna para ativar o menu de comando de contexto
ru: Щелкните этот столбец, чтобы активировать контекстное меню команд
zh_hans: 单击此列以激活上下文命令菜单
zh_hant: 按一下此資料行以啟用内容命令功能表

# sql.migration.error.aria.view.details
source: Click to view error details
de: Klicken Sie, um Details zum Fehler anzuzeigen
es: Haga clic para ver los detalles del error
fr: Cliquez pour voir les détails de l'erreur
ja: クリックするとエラー詳細が表示されます。
ko: 오류 세부 정보를 보려면 클릭하세요.
pt_br: Clique para exibir os detalhes do erro
ru: Щелкните, чтобы просмотреть сведения об ошибке.
zh_hans: 单击以查看错误详细信息
zh_hant: 按一下以檢視錯誤詳細資料

# sql.migration.service.details.button.label
source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# sql.migration.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# sql.migration.target.provisioning.close
source: Close
zh_hans: 关闭

# sql.migration.sku.azureRecommendation.collectData.method
source: Collect performance data now
de: Leistungsdaten jetzt sammeln
es: Recopilar datos de rendimiento ahora
fr: Collectez les données de performance maintenant
ja: パフォーマンス データを今すぐ収集する
ko: 지금 성능 데이터 수집
pt_br: Coletar dados de desempenho agora
ru: Собрать данные производительности
zh_hans: 立即收集性能数据
zh_hant: 立即收集效能資料

# sql.login.migration.collecting.target.logins.failed
source: Collecting target login failed with error code {0}
de: Fehler beim Erfassen der Zielanmeldung. Fehlercode: {0}
es: Error al recopilar el inicio de sesión de destino, con código de error {0}
fr: Échec de la collecte de la connexion cible avec le code d’erreur {0}
ja: ターゲット ログインの収集がエラー コード {0} で失敗しました
ko: 오류 코드로 대상 로그인을 수집하지 못했습니다. {0}
pt_br: Falha ao coletar o logon de destino com o código de erro {0}
ru: Сбой получения целевого входа с кодом ошибки {0}
zh_hans: 收集目标登录失败，错误代码为 {0}
zh_hant: 收集目標登入失敗，錯誤碼為 {0}

# sql.migration.status.collectioncompleted
source: Collection completed
de: Sammlung abgeschlossen
es: Recopilación de datos completada
fr: Collection terminée
ja: コレクションが完了しました
ko: 수집 완료됨
pt_br: Coleta concluída
ru: Сбор завершен
zh_hans: 收集已完成
zh_hant: 收集完成

# sql.migration.schema.collection.ended
source: Collection ended
de: Sammlung beendet
es: Recopilación finalizada
fr: Fin de la collecte
ja: コレクションが終了しました
ko: 수집 종료됨
pt_br: Coleção encerrada
ru: Сбор завершен
zh_hans: 收集已结束
zh_hant: 收集已結束

# sql.migration.schema.collection.started
source: Collection started
de: Die Sammlung wurde gestartet.
es: Se inició la colección.
fr: Collecte démarrée
ja: コレクションが開始されました。
ko: 수집 시작됨
pt_br: Coleta iniciada
ru: Сбор начался
zh_hans: 收集已启动
zh_hant: 收集已開始

# sql.migration.community.support.title
source: Community support
es: Soporte técnico de la comunidad
fr: Soutien communautaire
ja: コミュニティ サポート
ko: 커뮤니티 지원
pt_br: Suporte da Comunidade
ru: Поддержка сообщества
zh_hans: 社区支持
zh_hant: 社群支援

# sql.migration.data.uploaded.info
source: Comparison of the actual amount of data read from the source and the actual amount of data uploaded to the target.
de: Vergleich der tatsächlichen Menge der aus der Quelle gelesenen Daten und der tatsächlichen Datenmenge, die in das Ziel hochgeladen wurde.
es: Comparación de la cantidad real de datos leídos del origen y la cantidad real de datos cargados en el destino.
fr: Comparaison de la quantité réelle de données lues à partir de la source et de la quantité réelle de données chargées sur la cible.
ja: ソースから読み取られた実際のデータ量と、ターゲットにアップロードされた実際のデータ量の比較。
ko: 원본에서 읽은 실제 데이터 양과 대상에 업로드된 실제 데이터 양에 대한 비교입니다.
pt_br: Comparação da quantidade real de dados lidos da origem e da quantidade real de dados carregados para o destino.
ru: Сравнение фактического объема данных, считываемого из источника, и фактического объема данных, загруженного в целевой объект.
zh_hans: 比较从源读取的实际数据量和上传到目标的实际数据量。
zh_hant: 比較從來源讀取的實際資料量，以及上傳至目標的實際資料量。

# sql.migration.complete.cutover
source: Complete cutover
de: Cutover abschließen
es: Transición completa
fr: Terminer le basculement
ja: 一括移行を完了する
ko: 컷오버 완료
pt_br: Concluir substituição
ru: Выполнение прямой миграции
zh_hans: 完成直接转换
zh_hant: 完成完全移轉

# sql.migration.status.completed
source: Completed
de: Abgeschlossen
es: Completado
fr: Effectué
ja: 完了
ko: 완료
pt_br: Concluído
ru: Завершено
zh_hans: 已完成
zh_hant: 完成

# sql.migration.restore.status.completed
source: Completed
de: Abgeschlossen
es: Completado
fr: Terminé
ja: 完了済み
ko: 완료
pt_br: Concluído
ru: Выполнено
zh_hans: 已完成
zh_hant: 已完成

# sql.login.migration.complete
source: Completed migrating logins
de: Die Migration von Anmeldungen wurde abgeschlossen.
es: Se completó la migración de inicios de sesión
fr: Migration des connexions terminée
ja: ログインの移行が完了しました
ko: 로그인 마이그레이션 완료
pt_br: A migração de logon foi concluída
ru: Выполнена миграция учетных данных
zh_hans: 已完成迁移登录
zh_hant: 已完成登入移轉

# sql.login.migration.status.page.description.completed
source: Completed migrating {0} logins to {1} '{2}'
de: Die Migration von {0} Anmeldungen zu {1} „{2}“ wurde abgeschlossen.
es: Se completó la migración de inicios de sesión de {0} a {1} "{2}"
fr: Migration des connexions {0} vers {1} « {2} » terminée
ja: {0} 件のログインを {1} '{2}' への移行が完了しました
ko: {0} 로그인을 {1} '{2}'(으)로 마이그레이션 완료
pt_br: Concluída a migração de {0} logons para {1} '{2}'
ru: Выполнена миграция учетных данных ({0}) в {1} "{2}"
zh_hans: 已完成将 {0} 个登录迁移到 {1} "{2}"
zh_hant: 已完成將 {0} 登入移轉至 {1} '{2}'

# sql.migration.status.completedwitherrors
source: Completed with errors
de: Abgeschlossen mit Fehlern
es: Completado con errores
fr: Terminé avec des erreurs
ja: エラーありで完了しました
ko: 완료되었지만 오류 발생
pt_br: Concluído com erros
ru: Завершено с ошибками
zh_hans: 已完成，但出现错误
zh_hant: 完成但出現錯誤

# sql.migration.status.completing
source: Completing
de: Wird abgeschlossen
es: Completando
fr: Compléter
ja: 完了処理中
ko: 완료 중
pt_br: Concluindo
ru: Завершение работы
zh_hans: 正在完成
zh_hant: 即將完成

# sql.migration.completing.cutover.warning
source: Completing cutover without restoring all the backups may result in a data loss.
de: Ein Cutover ohne Wiederherstellung aller Sicherungen kann zu Datenverlusten führen.
es: Finalizar la transición sin restaurar todas las copias de seguridad puede provocar la pérdida de datos.
fr: L’exécution du basculement sans restaurer toutes les sauvegardes peut entraîner une perte de données.
ja: すべてのバックアップを復元せずに一括移行を完了すると、データが失われる可能性があります。
ko: 모든 백업을 복원하지 않고 컷오버를 완료하면 데이터가 손실될 수 있습니다.
pt_br: Concluir a substituição sem restaurar todos os backups pode resultar em perda de dados.
ru: Завершение прямой миграции без восстановления всех резервных копий может привести к потере данных.
zh_hans: 在不还原所有备份的情况下完成直接转换可能导致数据丢失。
zh_hant: 完成完全移轉而不還原所有備份可能會造成資料遺失。

# sql.migration.restore.status.completing.migration
source: Completing migration
de: Migration wird abgeschlossen
es: Completando la migración
fr: Exécution de la migration
ja: 移行を完了しています
ko: 마이그레이션 완료 중
pt_br: Concluindo a migração
ru: Завершение миграции
zh_hans: 正在完成迁移
zh_hant: 正在完成移轉

# sql.migration.save.close.popup
source: Configuration saved. Performance data collection will remain running in the background. You can stop the collection when you want to.
de: Konfiguration gespeichert. Die Leistungsdatensammlung wird weiterhin im Hintergrund ausgeführt. Sie können die Sammlung beenden, wenn Sie möchten.
es: Configuración guardada. La recopilación de datos de rendimiento seguirá ejecutándose en segundo plano. Puede detener la recopilación cuando desee.
fr: Configuration enregistrée. La collecte des données de performances continuera de s’exécuter en arrière-plan. Vous pouvez arrêter la collecte quand vous le souhaitez.
ja: 構成が保存されました。パフォーマンス データの収集はバックグラウンドで実行されたままになります。必要に応じて、コレクションを停止できます。
ko: 구성을 저장했습니다. 백그라운드에서 성능 데이터 수집을 계속 실행합니다. 원하는 경우 수집을 중지할 수 있습니다.
pt_br: Configuração salva. A coleta de dados de desempenho permanecerá em execução em segundo plano. Você pode parar a coleta quando quiser.
ru: Конфигурация сохранена. Сбор данных производительности будет выполняться в фоновом режиме. Вы можете остановить сбор, когда за хотите.
zh_hans: 已保存配置。性能数据收集将保持在后台运行。你可以在需要时停止收集。
zh_hant: 已儲存設定。效能資料收集仍會在背景執行。您可以在想要時停止集合。

# sql.migration.configure.ir
source: Configure Integration Runtime
zh_hans: 配置集成运行时

# sql.ir.configure.manually
source: Configure manually
zh_hans: 手动配置

# sql.ir.configure.powershellscript
source: Configure using PowerShell script
zh_hans: 使用 PowerShell 脚本进行配置

# sql.migration.connection.label
source: Connect
de: Verbinden
es: Conectar
fr: Connecter
ja: 接続
ko: 연결
pt_br: Conectar
ru: Подключиться
zh_hans: 连接
zh_hant: 連線
