Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.azurecore.*.xlf
Languages: de, ja, pt_br, ru, zh_hans, zh_hant

# accounts.clearTokenCache
source: Clear Azure Account Token Cache
de: Tokencache für Azure-Konto löschen
ja: Azure アカウント トークンのキャッシュをクリア
pt_br: Limpar o Cache de Token da Conta do Azure
ru: Очистить кэш токена учетной записи Azure
zh_hans: 清除 Azure 帐户令牌缓存
zh_hant: 清除 Azure 帳戶權杖快取

# config.providerSettings.endpoints.clientId
source: Client ID for Azure Data Studio
de: Client-ID für Azure Data Studio
ja: Azure Data Studio のクライアント ID
pt_br: ID do Cliente no Azure Data Studio
ru: Идентификатор клиента для Azure Data Studio
zh_hans: Azure Data Studio 的客户端 ID
zh_hant: Azure Data Studio 的用戶端識別碼

# config.providerSettingsMetadata
source: Cloud Display Name
de: Anzeigename der Cloud
ja: クラウドの表示名
pt_br: Nome de Exibição do Usuário
ru: Отображаемое имя облака
zh_hans: 云显示名称
zh_hant: 雲端顯示名稱

# config.providerSettingsId
source: Cloud ID
ja: クラウド ID
pt_br: ID da nuvem
ru: ИД облака
zh_hans: 云 ID
zh_hant: 雲端識別碼

# config.providerSettingsName
source: Cloud Name
ja: クラウド名
pt_br: Nome da Nuvem
ru: Имя облака
zh_hans: 云名称
zh_hant: 雲端名稱

# config.providerSettingsDescription
source: Cloud Settings
de: Cloudeinstellungen
ja: クラウドの設定
pt_br: Configurações de nuvem
ru: Настройки облака
zh_hans: 云设置
zh_hant: 雲端設定

# config.azureCodeGrantMethod
source: Code Grant Method
de: Gewährungsmethode über Code
ja: Code Grant 方法
pt_br: Método de Concessão de Código
ru: Метод предоставления кода
zh_hans: 代码授予方法
zh_hant: 代碼授與方法

# azure.resource.connectsqlserver.title
source: Connect
de: Verbinden
ja: 接続
pt_br: Conectar
ru: Подключить
zh_hans: 连接
zh_hant: 連線

# config.azureDeviceCodeMethod
source: Device Code Method
de: Gewährungsmethode über Gerät
ja: デバイス コード メソッド
pt_br: Método de Código do Dispositivo
ru: Метод кода устройства
zh_hans: 设备代码方法
zh_hant: 裝置代碼方法

# config.noSystemKeychain
source: Disable system keychain integration. Credentials will be stored in a flat file in the user's home directory.
de: Hiermit wird die Keychain-Systemintegration deaktiviert. Die Anmeldeinformationen werden in einer Flatfile im Basisverzeichnis des Benutzers gespeichert.
ja: システムのキーチェーン統合を無効にします。資格情報は、ユーザーのホーム ディレクトリ内のフラット ファイルに保存されます。
pt_br: Desabilite a integração do conjunto de chaves do sistema. As credenciais serão armazenadas em um arquivo simples no diretório base do usuário.
ru: Отключение интеграции с цепочкой ключей системы. Учетные данные будут храниться в неструктурированном файле в основном каталоге пользователя.
zh_hans: 禁用系统密钥链集成。凭据将存储在用户主目录的平面文件中。
zh_hant: 停用系統金鑰鏈整合。認證將會儲存於使用者主目錄的一般檔案中。

# config.providerSettings.endpoints.graphResource
source: Graph Resource Endpoint
de: Graph-Ressourcenendpunkt
ja: グラフ リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do Graph
ru: Конечная точка ресурса Graph
zh_hans: Graph 资源终结点
zh_hant: 圖表資源端點

# config.providerSettings.endpoints.host
source: Host Endpoint
de: Hostendpunkt
ja: ホスト エンドポイント
pt_br: Ponto de Extremidade do Host
ru: Конечная точка узла
zh_hans: 主机终结点
zh_hant: 主機端點

# config.providerSettings.endpoints.msGraphResource
source: Microsoft Graph Resource Endpoint
de: Microsoft Graph-Ressourcenendpunkt
ja: Microsoft Graph リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do Microsoft Graph
ru: Конечная точка ресурса Microsoft Graph
zh_hans: Microsoft Graph 资源终结点
zh_hant: Microsoft Graph 資源端點

# config.providerSettings.endpoints.microsoftResource
source: Microsoft Resource Endpoint
de: Microsoft-Ressourcenendpunkt
ja: Microsoft リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso da Microsoft
ru: Конечная точка ресурса Майкрософт
zh_hans: Microsoft 资源终结点
zh_hant: Microsoft 資源端點

# azure.openInAzurePortal.title
source: Open in Azure Portal
de: In Azure-Portal öffnen
ja: Azure Portal で開きます
pt_br: Abrir no Portal do Azure
ru: Открыть на портале Azure
zh_hans: 在 Azure 门户中打开
zh_hant: 在 Azure 入口網站中開啟

# config.providerSettings.endpoints.powerBiResource
source: Power BI Resource Endpoint
de: Power BI-Ressourcenendpunkt
ja: Power BI リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do Power BI
ru: Конечная точка ресурса Power BI
zh_hans: Power BI 资源终结点
zh_hant: Power BI 資源端點

# config.providerSettingsTitle
source: Provider Settings
de: Anbietereinstellungen
ja: プロバイダーの設定
pt_br: Configurações do Provedor
ru: Параметры поставщика
zh_hans: 提供程序设置
zh_hant: 提供者設定

# azure.resource.refresh.title
source: Refresh
de: Aktualisieren
ja: 更新
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# config.providerSettings.endpoints.sqlResource
source: SQL Resource Endpoint
de: SQL-Ressourcenendpunkt
ja: SQL リソース エンドポイント
pt_br: Ponto de Extremidade de Recurso do SQL
ru: Конечная точка ресурса SQL
zh_hans: SQL 资源终结点
zh_hant: SQL 資源端點

# config.providerSettings.endpoints.scopes
source: Scopes Endpoint
de: Bereichsendpunkt
ja: スコープ エンドポイント
pt_br: Ponto de Extremidade de Escopos
ru: Конечная точка областей
zh_hans: 作用域终结点
zh_hant: 範圍端點

# azure.resource.selectsubscriptions.title
source: Select Subscriptions
de: Abonnements auswählen
ja: サブスクリプションの選択
pt_br: Selecionar Assinaturas
ru: Выберите подписки
zh_hans: 选择订阅
zh_hant: 選取訂用帳戶

# azure.resource.selecttenants.title
source: Select Tenants
de: Mandanten auswählen
ja: テナントの選択
pt_br: Selecionar Locatários
ru: Выбрать клиенты
zh_hans: 选择租户
zh_hant: 選取租用戶

# config.customProviderSettings
source: Setting containing custom Azure authentication endpoints. Changes to this setting require a restart to take effect.
de: Einstellung, die benutzerdefinierte Azure-Authentifizierungsendpunkte enthält. Änderungen an dieser Einstellung erfordern einen Neustart, um wirksam zu werden.
ja: カスタム Azure 認証エンドポイントを含む設定。この設定を変更した場合、有効にするには再起動が必要です。
pt_br: Configuração que contém pontos de extremidade de autenticação personalizados do Azure. As alterações nesta configuração exigem uma reinicialização para entrar em vigor.
ru: Параметр, содержащий настраиваемые конечные точки проверки подлинности Azure. Чтобы изменения этого параметра вступили в силу, требуется перезапуск.
zh_hans: 包含自定义 Azure 身份验证终结点的设置。对此设置所做的更改需要重启才能生效。
zh_hant: 設定包含自訂 Azure 驗證端點。變更到此設定需要重新開機才會生效。

# config.enableChinaCloudDescription
source: Should Azure China integration be enabled
de: Hiermit wird festgelegt, ob die Azure China-Integration aktiviert werden soll.
ja: Azure China の統合を有効にするかどうか
pt_br: A integração com o Azure China deve estar habilitada?
ru: Нужно ли включить интеграцию Azure для Китая
zh_hans: 是否应启用 Azure 中国集成
zh_hant: 是否應啟用 Azure 中國整合

# config.enablePublicCloudDescription
source: Should Azure public cloud integration be enabled
de: Hiermit wird festgelegt, ob die Integration der öffentlichen Azure-Cloud aktiviert werden soll.
ja: Azure パブリック クラウド統合を有効にするかどうか
pt_br: A integração de nuvem pública do Azure deve estar habilitada?
ru: Следует ли включить интеграцию общедоступного облака Azure
zh_hans: 是否应启用 Azure 公有云集成
zh_hant: 是否應啟用 Azure 公用雲端整合

# config.piiLogging
source: Should Personally Identifiable Information (PII) be logged in the Azure Accounts output channel and the output channel log file.
de: Hiermit wird festgelegt, ob personenbezogene Informationen (PII) im Ausgangskanal und in der Protokolldatei des Ausgangskanals von Azure-Konten protokolliert werden sollen.
ja: 個人を特定できる情報 (PII) を Azure アカウントの出力チャネルと出力チャネルのログ ファイルにログ記録してしまった場合。
pt_br: As Informações de Identificação Pessoal (PII) devem ser registradas no canal de saída das Contas do Azure e no arquivo de log do canal de saída.
ru: Следует ли регистрировать идентифицирующие данные конечного пользователя (PII) в выходном канале учетных записей Azure и файле журнала выходного канала.
zh_hans: 是否应在 Azure 帐户输出通道和输出通道日志文件中记录个人身份信息 (PII)。
zh_hant: 是否要將個人識別資訊 (PII) 記錄在 Azure 帳戶輸出通道與輸出通道記錄檔中。

# config.enableUsGovCloudDescription
source: Should US Government Azure cloud (Fairfax) integration be enabled
de: Hiermit wird festgelegt, ob die Integration der Azure-Cloud für US-Behörden (Fairfax) aktiviert werden soll.
ja: 米国政府向け Azure クラウド (Fairfax) 統合を有効にするかどうか
pt_br: A integração de nuvem do US Government Azure (Fairfax) deve estar habilitada?
ru: Следует ли включить интеграцию облака Azure для государственных организаций США (Fairfax)
zh_hans: 是否应启用美国政府 Azure 云(Fairfax)集成
zh_hant: 是否應啟用 US Government Azure 雲端 (Fairfax) 整合

# azure.resource.startterminal.title
source: Start Cloud Shell
de: Cloud Shell starten
ja: Cloud Shell の開始
pt_br: Iniciar Cloud Shell
ru: Запуск Cloud Shell
zh_hans: 启动 Cloud Shell
zh_hant: 啟動 Cloud Shell

# config.loggingLevel
source: [Optional] The verbosity of logging for the Azure Accounts extension.
de: [Optional] Die Ausführlichkeitsprotokollierung für die Azure-Konten-Erweiterung.
ja: [オプション] Azure アカウント拡張機能のログ記録の詳細。
pt_br: [Opcional] O detalhamento do registro em log para a extensão de Contas do Azure.
ru: [Необязательно] Уровень детализации ведения журнала для расширения "Учетные записи Azure".
zh_hans: [可选] Azure 帐户扩展的日志记录详细程度。
zh_hant: [選用] Azure 帳戶延伸模組的記錄詳細程度。
