Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.data-workspace.*.xlf
Languages: de, fr, it, ja, ko, zh_hans

# projects.excludedProjectsDescription
source: List of projects in the workspace to exclude from the projects viewlet
de: Liste der Projekte im Arbeitsbereich, die aus dem Projekte-Viewlet ausgeschlossen werden sollen
fr: Liste des projets dans l’espace de travail à exclure des projets Viewlet
it: Elenco dei progetti nell'area di lavoro da escludere dal viewlet dei progetti
ja: プロジェクト ビューレットから除外するワークスペース内のプロジェクトの一覧
ko: 프로젝트 뷰렛에서 제외할 작업 영역의 프로젝트 목록
zh_hans: 要从项目 Viewlet 中排除的工作区中的项目列表

# manage-project-command
source: Manage
de: Verwalten
fr: Gérer
it: Gestire
ja: 管理
ko: 관리
zh_hans: 管理

# new-command
source: New
de: Neu
fr: Nouveau
it: Nuovo
ja: 新規
ko: 새로 만들기
zh_hans: 新建

# projects-view-no-project-content
source: No projects open in current workspace. [Create new](command:projects.new) [Open existing](command:projects.openExisting) To learn more about projects [read our docs](https://aka.ms/azuredatastudio-projects).
de: Im aktuellen Arbeitsbereich sind keine Projekte geöffnet. [Neues erstellen](command:projects.new) [Bestehendes öffnen](command:projects.openExisting) Weitere Informationen zu Projekten [unsere Dokumentation lesen](https://aka.ms/azuredatastudio-projects).
fr: Aucun projet n’est ouvert dans l’espace de travail actuel. [Créer](command:projects.new) [Ouvrir un existant](command:projects.openExisting) Pour en savoir plus sur les projets [lire nos documents](https://aka.ms/azuredatastudio-projects).
it: Nessun progetto aperto nell'area di lavoro corrente. [Crea nuovo](comando: projects.new) [Apri esistente](comando: projects.openExisting) Per altre informazioni sui progetti [vedere la documentazione](https://aka.ms/azuredatastudio-projects).
ja: 現在のワークスペースでプロジェクトが開かれていません。 [新規作成](command:projects.new) [既存のものを開く](command:projects.openExisting) プロジェクトの詳細情報については、[ドキュメントを読む](https://aka.ms/azuredatastudio-projects) をご覧ください。
ko: 현재 작업 영역에 열려 있는 프로젝트가 없습니다. [새로 만들기](command:projects.new) [기존 항목 열기](command:projects.openExisting) 프로젝트에 대해 자세히 알아보려면 [문서를 읽어보세요](https://aka.ms/azuredatastudio-projects).
zh_hans: 当前工作区中未打开任何项目。 [新建](command:projects.new) [打开现有](command:projects.openExisting) 要了解项目的详细信息，请 [阅读文档](https://aka.ms/azuredatastudio-projects)。

# open-existing-command
source: Open existing
de: Vorhandene öffnen
fr: Ouvrir des instances existantes
it: Apri esistente
ja: 既存のものを開く
ko: 기존 항목 열기
zh_hans: 打开现有

# refresh-workspace-command
source: Refresh
de: Aktualisieren
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
zh_hans: 刷新

# remove-project-command
source: Remove Project
de: Projekt entfernen
fr: Supprimer le projet
it: Rimuovi progetto
ja: プロジェクトの削除
ko: 프로젝트 제거
zh_hans: 删除项目
