Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.sql-migration.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# total.tables.selected.of.total
source: {0} of {1}
de: {0} von {1}
es: {0} de {1}
fr: {0} sur {1}
ja: {1}のうち {0}
pt_br: {0} de {1}
ru: {0} из {1}
zh_hans: {0} 个(共 {1} 个)

# sql.migration.table.selection.count
source: {0} of {1}
de: {0} von {1}
es: {0} de {1}
fr: {0} sur {1}
ja: {1}のうち {0}
pt_br: {0} de {1}
ru: {0} из {1}
zh_hans: {0} 个(共 {1} 个)

# sql.migration.tde.progress.update
source: {0} of {1} completed
de: {0} von {1} abgeschlossen
es: {0} de {1} completado
fr: {0} sur {1} terminé(s)
ja: {0} / {1} 完了
ko: {1}개 중 {0}개 완료
pt_br: {0} de {1} concluído(s)
ru: Выполнено {0} из {1}
zh_hans: {1} 的 {0} 已完成
zh_hant: 已完成 {0}/{1}

# total.databases.selected
source: {0} of {1} databases selected
de: {0} von {1} Datenbanken ausgewählt
es: {0} de {1} bases de datos seleccionadas
fr: {0} de bases de données {1} sélectionnées
ja: {1} 個中の {0} 個のデータベースが選択されています
ko: 데이터베이스 {0}/{1}개가 선택됨
pt_br: {0} de {1} bancos de dados selecionados
ru: Выбрано баз данных: {0} из {1}
zh_hans: 已选择 {0} 个数据库(共 {1} 个)。
zh_hant: 已選取 {0} 個資料庫 (共 {1} 個)

# sql.migration.table.selected.count
source: {0} of {1} tables selected
de: {0} von {1} Tabellen ausgewählt
es: {0} de {1} tablas seleccionadas
fr: {0} de {1} tables sélectionnées
ja: {1} テーブルの{0} が選択されています
ko: {0}/{1} 선택합
pt_br: {0} de {1} tabelas selecionadas
ru: Выбраны таблицы: {0} из {1}
zh_hans: 已选择 {0} 个表(共 {1} 个)
zh_hant: 已選取 {0} 個資料表 (共 {1} 個資料表)

# sql.migration.table.selection.count.to.target
source: {0} of {1} tables selected for migration
de: Für Migration ausgewählte {0} von {1} Tabellen
es: {0} de {1} tablas seleccionadas para la migración
fr: {0} de {1} tables sélectionnées pour la migration
ja: 移行用に選択された{1} テーブルの {0}
ko: 마이그레이션을 위해 테이블 {1}개 중 {0}개 선택됨
pt_br: {0} de {1} tabelas selecionadas para migração
ru: Выбрано таблиц для миграции: {0} из {1}
zh_hans: 已选择 {0} 个表进行迁移，共 {1} 个
zh_hant: 已選取要移轉的 {0} 個資料表 (共 {1} 個)

# sql.migration.tde.wizard.databases.selected
source: {0} out of {1} selected database(s) is using transparent data encryption.
de: {0} von {1} ausgewählte(n) Datenbank(en) verwendet die transparente Datenverschlüsselung.
es: {0} de {1} bases de datos seleccionadas usan cifrado de datos transparente.
fr: {0} de {1} base(s) de données sélectionnée(s) utilise le chiffrement transparent des données.
ja: 選択したデータベース {1} つのうち {0} つで、Transparent Data Encryption が使用されています。
ko: 선택한 데이터베이스 {1}개 중 {0}개가 투명한 데이터 암호화를 사용하고 있습니다.
pt_br: {0} de {1} bancos de dados selecionados está usando criptografia de dados transparente.
ru: Выбранные базы данных, использующие прозрачное шифрование: {0} из {1}.
zh_hans: {1} 中所选 {0} 数据库正在使用透明数据加密。
zh_hant: {0} 個 (共 {1} 個資料庫) 選取的資料庫正在使用透明資料加密。

# sql.migration.sku.available.recommendations.one
source: {0} recommendation available
de: {0} Empfehlung verfügbar
es: {0} recomendación disponible
fr: {0} recommandation disponible
ja: {0}件のレコメンデーションがあります
ko: {0} 권장 사항 사용 가능
pt_br: {0} recomendação disponível
ru: Доступна {0} рекомендация
zh_hans: {0} 个建议可用
zh_hant: {0} 個可用的建議

# sql.migration.sku.available.recommendations.many
source: {0} recommendations available
de: {0} Empfehlungen verfügbar
es: {0} recomendaciones disponibles
fr: {0} recommandations disponibles
ja: {0} 件の利用可能なレコメンデーション
ko: {0} 권장 사항 사용 가능
pt_br: {0} recomendações disponíveis
ru: Доступны рекомендации: {0}
zh_hans: {0} 个建议可用
zh_hant: {0} 個可用的建議

# sql.migration.sec
source: {0} sec
de: {0} s
es: {0} s
fr: {0} s
ja: {0} 秒
ko: {0}초
pt_br: {0} seg
ru: {0} сек
zh_hans: {0} 秒
zh_hant: {0} 秒

# sql.migration.sku.azureConfiguration.disk
source: {0} {1}GB ({2} IOPS, {3} MB/s)
fr: {0} {1}Go ({2} IOPS, {3} Mo/s)
ja: {0} {1}GB ({2} IOPS、 {3} MB/秒)
ko: {0} {1}GB({2}IOPS, {3}MB/초)
ru: {0} {1} ГБ ({2} операций ввода-вывода в секунду, {3} МБ/с)
zh_hans: {0}{1}GB ({2} IOPS、{3} MB/秒)

# sql.migration.can.be.migrated
source: {0}/{1} databases can be migrated without issues
de: {0}/{1} Datenbanken können ohne Probleme migriert werden.
es: {0}/{1} bases de datos se pueden migrar sin problemas
fr: {0}/{1} bases de données peuvent être migrées sans problème
ja: {0}/{1} 個のデータベースはイシューなく移行可能
ko: {0}/{1} 데이터베이스는 문제 없이 마이그레이션할 수 있습니다.
pt_br: {0}/{1} bancos de dados podem ser migrados sem problemas
ru: Можно перенести базы данных без проблем: {0} из {1}
zh_hans: 可迁移 {0} 个数据库(共 {1} 个)，而不会出现问题
zh_hant: {0}/{1} 個資料庫可以移轉而無問題

# sql.migration.databases.selected
source: {0}/{1} databases selected
de: {0}/{1} Datenbanken ausgewählt
es: Bases de datos seleccionadas: {0}/{1}
fr: {0}/{1} bases de données sélectionnées
ja: {0}/{1} のデータベースが選択されています
ko: {0}/{1}개 데이터베이스 선택함
pt_br: {0}/{1} bancos de dados selecionados
ru: Выбрано баз данных: {0}/{1}
zh_hans: 已选择 {0} 个数据库(共 {1} 个)
zh_hant: 選取了 {0} 個資料庫 (共 {1} 個)

# sql.login.migrations.selected
source: {0}/{1} logins selected
de: {0}/{1} Anmeldungen ausgewählt
es: {0}/{1} inicios de sesión seleccionados
fr: {0}/{1} connexions sélectionnées
ja: {0}/{1} 件のログインが選択されました
ko: {0}/{1} 로그인 선택됨
pt_br: {0}/{1} logons selecionados
ru: Выбрано учетных данных: {0}/{1}
zh_hans: 已选择 {0}/{1} 个登录
zh_hant: 已選取 {0}/{1} 個登入

# sql.migration.number.logins.migrating
source: {0}/{1} migrating logins displayed
de: {0}/{1} migrierende Anmeldungen werden angezeigt
es: {0}/{1} se muestran los inicios de sesión de migración
fr: {0}/{1} migration de connexions affichée
ja: {0}/{1} 件の表示されているログインの移行
ko: {0}/{1} 마이그레이션 로그인이 표시됨
pt_br: {0}/{1} logons de migração exibidos
ru: Отображаются переносимые учетные данные: {0}/{1}
zh_hans: 显示了 {0}/{1} 个迁移登录
zh_hant: 顯示 {0}/{1} 個移轉登入

# sql.migration.sku.percentile
source: {0}th percentile
de: {0}. Perzentil
es: Percentil {0}
fr: {0}e centile
ja: {0} パーセンタイル
ko: {0}번째 백분위수
pt_br: {0}° percentil
ru: {0}-процентиль
zh_hans: 第 {0} 个百分位数
zh_hant: 第 {0} 個百分位數

# sql.migration.starting.migration.error
source: An error occurred while starting the migration: '{0}'
de: Fehler beim Starten der Migration: "{0}"
es: Error al iniciar la migración: '{0}'
fr: Une erreur s'est produite lors du démarrage de la migration : « {0} »
ja: 移行の開始中にエラーが発生しました: '{0}'
ko: 마이그레이션을 시작하는 동안 오류 발생: '{0}'
pt_br: Erro ao iniciar a migração: '{0}'
ru: Произошла ошибка при запуске миграции: "{0}"
zh_hans: 开始迁移时出现错误:“{0}”
zh_hant: 啟動移轉時發生錯誤: '{0}'

# sql.migration.starting.migration.message
source: Starting migration for database {0} to {1} - {2}
de: Die Migration für die Datenbank "{0}" zu "{1}" bis "{2}" wird gestartet.
es: Iniciando la migración de la base de datos {0} a {1} - {2}
fr: Démarrage de la migration de la base de données {0} vers {1} - {2}
ja: データベース {0} から {1} - {2} に移行を開始する
ko: 데이터베이스 {0}에서 {1}-{2}(으)로 마이그레이션을 시작하는 중
pt_br: Iniciando a migração do banco de {0} para {1} - {2}
ru: Запуск миграции для {0} базы данных в {1} — {2}
zh_hans: 正在开始将数据库 {0} 迁移到 {1} - {2}
zh_hant: 正在開始將資料庫 {0} 移轉到 {1} - {2}

# downloadingServiceComplete
source: Done downloading {0}
de: Das Herunterladen von {0} wurde abgeschlossen
es: Descarga de {0} finalizada
fr: Téléchargement de {0} terminé
ja: {0} のダウンロードが完了しました
ko: {0} 다운로드 완료
pt_br: Download de concluído {0}
ru: Скачивание службы {0} завершено
zh_hans: {0}下载完毕
zh_hant: 已完成下載 {0}

# downloadingServiceStatus
source: Downloading {0}
de: {0} wird heruntergeladen
es: Descargando {0}
fr: Téléchargement de {0}
ja: {0} をダウンロードしています
ko: {0} 다운로드 중
pt_br: Baixando {0}
ru: Скачивание службы {0}
zh_hans: 正在下载{0}
zh_hant: 正在下載 {0}

# downloadingService
source: Downloading {0}
de: {0} wird heruntergeladen
es: Descargando {0}
fr: Téléchargement de {0}
ja: {0} をダウンロードしています
ko: {0} 다운로드 중
pt_br: Baixando {0}
ru: Скачивание службы {0}
zh_hans: 正在下载{0}
zh_hant: 正在下載 {0}

# entryExtractedChannelMsg
source: Extracted {0} ({1}/{2})
de: {0} extrahiert ({1}/{2})
es: Elementos extraídos {0} ({1} de {2})
fr: {0} extrait ({1}/{2})
ja: {0} を抽出しました ({1}/{2})
ko: 추출된 {0}({1}/{2})
pt_br: {0} extraído ({1}/{2})
ru: Извлечено {0} ({1}/{2})
zh_hans: 已提取 {0} ({1}/{2})
zh_hant: 已擷取 {0} ({1}/{2})

# downloadingServiceFailed
source: Failed to download binaries for {0}. Use the following link to troubleshoot: {1}
de: Fehler beim Herunterladen von Binärdateien für {0}. Verwenden Sie den folgenden Link zur Problembehandlung: {1}
es: No se pudieron descargar los archivos binarios para {0}. Use el siguiente vínculo para solucionar problemas: {1}
fr: Échec du téléchargement des fichiers binaires pour {0}. Utilisez le lien suivant pour résoudre le problème : {1}.
ja: {0} のバイナリをダウンロードできませんでした。トラブルシューティングを行うには、次のリンクを使用します: {1}
ko: {0}에 대한 이진 파일을 다운로드하지 못했습니다. 다음 링크를 사용하여 문제를 해결하세요. {1}
pt_br: Falha ao baixar binários para {0}. Use o link a seguir para solucionar problemas: {1}
ru: Не удалось скачать двоичные файлы для {0}. Используйте следующую ссылку для устранения неполадок: {1}
zh_hans: 无法下载{0}的二进制文件。使用以下链接以排除故障: {1}
zh_hant: 無法下載 {0} 的二進位檔。請使用以下連結以進行疑難排解: {1}

# downloadingServiceFailedWithLinkMarkup
source: Failed to download binaries for {0}. Use this [link to troubleshoot]({1}).
de: Fehler beim Herunterladen von Binärdateien für {0}. Verwenden Sie diesen [Link zur Problembehandlung]({1}).
es: No se pudieron descargar los archivos binarios para {0}. Use este [vínculo para solucionar problemas]({1}).
fr: Échec du téléchargement des fichiers binaires pour {0}. Utilisez ce [link to troubleshoot]({1}).
ja: {0} のバイナリをダウンロードできませんでした。この [トラブルシューティングへのリンク]({1}) を使用します。
ko: {0}에 대한 이진 파일을 다운로드하지 못했습니다. 이 [링크를 사용하여 문제를 해결]({1})하세요.
pt_br: Falha ao baixar binários para {0}. Use este [link para solucionar problemas]({1}).
ru: Не удалось скачать двоичные файлы для {0}. Используйте [link to troubleshoot]({1}).
zh_hans: 无法下载{0}的二进制文件。使用此[链接以排除故障]({1})。
zh_hant: 無法下載 {0} 的二進位檔。請使用此[疑難排解連結]({1})。

# flatFileImport.serviceStartFailed
source: Failed to start {0}: {1}
de: Fehler beim Starten von {0}: {1}
es: No se pudo iniciar {0}: {1}
fr: Échec du démarrage de {0} : {1}
ja: {0}を開始できませんでした: {1}
ko: {0}:{1}을(를) 시작하지 못함
pt_br: Falha ao iniciar {0}: {1}
ru: Не удалось запустить {0}: {1}
zh_hans: 未能启动 {0}: {1}
zh_hant: 無法啟動 {0}: {1}

# serviceInstalled
source: Installed {0}
de: {0} wurde installiert.
es: {0} instalado
fr: {0} installé
ja: {0} がインストールされました
ko: {0}을(를) 설치함
pt_br: Instalado {0}
ru: Служба {0} установлена
zh_hans: 已安装{0}
zh_hant: 已安裝 {0}

# installingService
source: Installing {0} Service
de: Der Dienst {0} wird installiert
es: Instalando servicio {0}
fr: Installation du service {0}
ja: {0} サービスをインストールしています
ko: {0} 서비스를 설치하는 중
pt_br: Instalando {0} Serviço
ru: Установка службы {0}
zh_hans: 正在安装{0}服务
zh_hant: 正在安裝 {0} 服務

# installingServiceDetailed
source: Installing {0} to {1}
de: "{0}" wird in "{1}" installiert.
es: Instalando {0} en {1}
fr: Installation de {0} sur {1}
ja: {0} を {1} にインストールしています
ko: {1}에 {0} 설치 중
pt_br: Instalando {0} para {1}
ru: Установка {0} в {1}
zh_hans: 正在将 {0} 安装到 {1}
zh_hant: 正在將 {0} 安裝到 {1}

# serviceStarting
source: Starting {0}
de: {0} wird gestartet.
es: Iniciando {0}
fr: Démarrage de {0}
ja: {0} を開始しています
ko: {0}을(를) 시작하는 중
pt_br: Iniciando {0}
ru: Запуск службы {0}
zh_hans: 正在启动{0}
zh_hant: 正在啟動 {0}

# serviceStarted
source: {0} Started
de: {0} wurde gestartet
es: {0} Iniciado
fr: {0} démarré
ja: {0} が開始されました
ko: {0}을(를) 시작함
pt_br: {0} Iniciado
ru: Служба {0} запущена
zh_hans: 已启动{0}
zh_hant: 已啟動 {0}

# migration-command-category
source: Azure SQL Migration
es: Migración de Azure SQL
fr: Migration Azure SQL
ja: Azure SQL の移行
ko: Azure SQL 마이그레이션
pt_br: Migração do SQL do Azure
ru: Миграция SQL Azure
zh_hans: Azure SQL 迁移
zh_hant: Azure SQL 移轉

# migration-dashboard-title
source: Azure SQL Migration
es: Migración de Azure SQL
fr: Migration Azure SQL
ja: Azure SQL の移行
ko: Azure SQL 마이그레이션
pt_br: Migração do SQL do Azure
ru: Миграция SQL Azure
zh_hans: Azure SQL 迁移
zh_hant: Azure SQL 移轉

# displayName
source: Azure SQL Migration
es: Migración de Azure SQL
fr: Migration Azure SQL
ja: Azure SQL の移行
ko: Azure SQL 마이그레이션
pt_br: Migração do SQL do Azure
ru: Миграция SQL Azure
zh_hans: Azure SQL 迁移
zh_hant: Azure SQL 移轉

# view-target-menu
source: Azure SQL Target details
de: Azure SQL-Zieldetails
es: Detalles de destino de Azure SQL
fr: Détails de la cible Azure SQL
ja: Azure SQL ターゲットの名前
ko: Azure SQL 대상 세부 정보
pt_br: Detalhes do Destino do SQL do Azure
ru: Сведения о цели Azure SQL
zh_hans: Azure SQL 目标详细信息
zh_hant: Azure SQL 目標詳細資料

# description
source: Azure SQL migration description
de: Beschreibung der Azure SQL-Migration
es: Descripción de la migración de Azure SQL
fr: Description de la migration Azure SQL
ja: Azure SQL の移行の説明
ko: Azure SQL 마이그레이션 설명
pt_br: Descrição da migração do SQL do Azure
ru: Описание миграции Azure SQL
zh_hans: Azure SQL 迁移说明
zh_hant: Azure SQL 移轉描述

# cancel-migration-menu
source: Cancel migration
de: Migration abbrechen
es: Cancelar migración
fr: Annuler la migration
ja: 移行のキャンセル
ko: 마이그레이션 취소
pt_br: Cancelar migração
ru: Отменить миграцию
zh_hans: 取消迁移
zh_hant: 取消移轉

# complete-cutover-menu
source: Complete cutover
de: Cutover abschließen
es: Transición completa
fr: Terminer le basculement
ja: 一括移行を完了する
ko: 컷오버 완료
pt_br: Concluir substituição
ru: Выполнение прямой миграции
zh_hans: 完成直接转换
zh_hant: 完成完全移轉

# copy-migration-menu
source: Copy migration details
de: Migrationsdetails kopieren
es: Copiar detalles de la migración
fr: Copier les détails de la migration
ja: 移行の詳細をコピー
ko: 마이그레이션 세부 정보 복사
pt_br: Copiar detalhes da migração
ru: Копировать сведения о миграции
zh_hans: 复制迁移详细信息
zh_hant: 複製移轉詳細資料

# view-service-menu
source: Database Migration Service details
de: Details zum Azure Database Migration Service
es: Detalles de Database Migration Service
fr: Détails Database Migration Service :
ja: Database Migration Service の詳細
ko: Database Migration Service 세부 정보
pt_br: Detalhes do Serviço de Migração de Banco de Dados
ru: Сведения Database Migration Service
zh_hans: 数据库迁移服务详细信息
zh_hant: 資料庫移轉服務詳細資料

# database-details-menu
source: Database details
de: Datenbankdetails
es: Detalles de la base de datos
fr: Détails de la base de données
ja: データベースの詳細
ko: 데이터베이스 정보
pt_br: Detalhes do banco de dados
ru: Сведения о базе данных
zh_hans: 数据库详细信息
zh_hant: 資料庫詳細資料

# data-collection-path-description
source: Default path to store collected performance data for SKU recommendations.
de: Standardpfad zum Speichern der gesammelten Leistungsdaten für SKU-Empfehlungen.
es: Ruta de acceso predeterminada para almacenar los datos de rendimiento recopilados para las recomendaciones de SKU.
fr: Chemin d’accès par défaut pour stocker les données de performance collectées pour les recommandations de référence SKU.
ja: SKU のレコメンデーションに対して収集されたパフォーマンス データを格納するための既定のパス。
ko: SKU 권장 사항을 위해 수집된 성능 데이터를 저장할 기본 경로입니다.
pt_br: Caminho padrão para armazenar dados de desempenho coletados para recomendações de SKU.
ru: Путь по умолчанию для хранения собранных данных производительности для рекомендаций по SKU.
zh_hans: 用于存储收集的性能数据以提供 SKU 建议的默认路径。
zh_hant: 儲存用於 SKU 建議所收集效能資料的預設路徑。

# delete-migration-menu
source: Delete migration
de: Migration löschen
es: Eliminar migración
fr: Supprimer une migration
ja: 移行の削除
ko: 마이그레이션 삭제
pt_br: Excluir migração
ru: Удалить миграцию
zh_hans: 删除迁移
zh_hant: 刪除移轉

# send-feedback-command
source: Feedback
es: Comentarios
fr: Commentaires
ja: フィードバック
ko: 피드백
pt_br: Comentários
ru: Отзывы
zh_hans: 反馈
zh_hant: 意見反應

# start-migration-command
source: Migrate to Azure SQL
de: Zu Azure SQL migrieren
es: Migrar a Azure SQL
fr: Migrer vers Azure SQL
ja: Azure SQLへの移行
ko: Azure SQL로 마이그레이션
pt_br: Migrar para SQL do Azure
ru: Миграция в Azure SQL
zh_hans: 迁移到 Azure SQL
zh_hant: 移轉到 Azure SQL

# migration-context-menu-category
source: Migration Context Menu
de: Migrationskontextmenü
es: Menú contextual de migración
fr: Menu contextuel de migration
ja: 移行コンテキスト メニュー
ko: 마이그레이션 상황에 맞는 메뉴
pt_br: Menu de Contexto de Migração
ru: Контекстное меню миграции
zh_hans: 迁移上下文菜单
zh_hant: 移轉操作功能表

# migration-dashboard-tasks
source: Migration Tasks
de: Migrationsaufgaben
es: Tareas de migración
fr: Tâches de migration
ja: 移行タスク
ko: 마이그레이션 작업
pt_br: Tarefas de Migração
ru: Задачи миграции
zh_hans: 迁移任务
zh_hant: 移轉工作

# new-support-request-command
source: New support request
de: Neue Supportanfrage
es: Nueva solicitud de soporte técnico
fr: Nouvelle demande de support
ja: 新規のサポート要求
ko: 새 지원 요청
pt_br: Nova solicitação de suporte
ru: Новый запрос на поддержку
zh_hans: 新建支持请求
zh_hant: 新增支援要求

# migration-notebook-command-title
source: Open Azure SQL migration notebooks
de: Azure SQL-Migrationsnotizbücher öffnen
es: Abrir blocs de notas de migración de Azure SQL
fr: Ouvrir les blocs-notes de migration Azure SQL
ja: Azure SQL 移行ノートブックを開く
ko: Azure SQL 마이그레이션 Notebook 열기
pt_br: Abrir blocos de anotações de migração do SQL do Azure
ru: Открыть записные книжки миграции Azure SQL
zh_hans: 打开 Azure SQL 迁移笔记本
zh_hant: 開啟 Azure SQL 移轉筆記本

# refresh-migrations-command
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# retry-migration-menu
source: Retry migration
de: Migration wiederholen
es: Reintentar migración
fr: Réessayer la migration
ja: 移行の再試行
ko: 마이그레이션 다시 시도
pt_br: Repetir a migração
ru: Повторить миграцию
zh_hans: 重试迁移
zh_hant: 重試移轉

# sql.migration.database.assessment.xevents.title
source: Assess extended event sessions
de: Erweiterte Ereignissitzungen bewerten
es: Evaluar sesiones de eventos extendidos
fr: Évaluer les sessions d’événements étendues
ja: 拡張イベント セッションの評価
ko: 확장 이벤트 세션 평가
pt_br: Avaliar sessões de eventos estendidos
ru: Оценка расширенных сеансов событий
zh_hant: 評估擴充事件工作階段

# sql.migration.schema.msdtctransactsql
source: BEGIN DISTRIBUTED TRANSACTION
de: VERTEILTE TRANSAKTION BEGINNEN
es: INICIAR TRANSACCIÓN DISTRIBUIDA
fr: COMMENCER LA TRANSACTION DISTRIBUÉE
ja: 分散トランザクション開始
pt_br: INICIAR TRANSAÇÃO DISTRIBUÍDA
ru: НАЧАТЬ РАСПРЕДЕЛЕННУЮ ТРАНЗАКЦИЮ
zh_hant: 開始分散式交易

# sql.migration.schema.rule.compute
source: COMPUTE
es: PROCESO
fr: CALCUL
ja: コンピューティング
pt_br: COMPUTAÇÃO
ru: ВЫЧИСЛЕНИЯ
zh_hant: 計算

# sql.migration.schema.rule.crossdatabasereferences
source: CROSS DATABASE REFERENCE
de: DATENBANKÜBERGREIFENDER VERWEIS
es: REFERENCIA ENTRE BASES DE DATOS
fr: RÉFÉRENCE SUR LES BASES DE DONNÉES CROISÉES
ja: クロス データベースリファレンス
pt_br: REFERÊNCIA DE BANCO DE DADOS CRUZADA
ru: ПЕРЕКРЕСТНАЯ ССЫЛКА НА БАЗУ ДАННЫХ
zh_hant: 跨資料庫參考

# sql.migration.schema.cryptographicprovider
source: CRYPTOGRAPHIC PROVIDER
de: KRYPTOGRAFIEANBIETER
es: PROVEEDOR CRIPTOGRÁFICO
fr: FOURNISSEUR DE SERVICES DE CHIFFREMENT
ja: 暗号化プロバイダー
pt_br: FORNECEDOR CRIPTOGRÁFICO
ru: ПОСТАВЩИК УСЛУГ ШИФРОВАНИЯ
zh_hant: 密碼編譯提供者

# sql.migration.schema.filestream
source: FILESTREAM
es: SECUENCIA DE ARCHIVOS
fr: FLUX DE FICHIER
ru: ФАЙЛОВЫЙ ПОТОК

# sql.migration.database.assessment.xevents.description
source: For the selected databases, optionally provide extended event session files to assess ad-hoc or dynamic SQL queries or any DML statements initiated through the application data layer. {0}
de: Stellen Sie für die ausgewählten Datenbanken optional Sitzungsdateien für erweiterte Ereignisse bereit, um Ad-hoc- oder dynamische SQL-Abfragen oder DML-Anweisungen zu bewerten, die über die Anwendungsdatenschicht initiiert wurden. {0}
es: Para las bases de datos seleccionadas, puede proporcionar archivos de sesión de eventos extendidos para evaluar consultas SQL ad hoc o dinámicas, o cualquier instrucción DML iniciada a través de la capa de datos de la aplicación. {0}
fr: Pour les bases de données sélectionnées, fournissez éventuellement des fichiers de session d’événements étendus pour évaluer les requêtes SQL ad hoc ou dynamiques, ou les instructions DML lancées via la couche données de l’application. {0}
ja: 選択したデータベースに対して、必要に応じて拡張イベント セッション ファイルを提供して、アドホックまたは動的 SQL クエリ、またはアプリケーション データ レイヤーを介して開始された DML ステートメントを評価します。{0}
ko: 선택한 데이터베이스에 대해 확장 이벤트 세션 파일을 선택적으로 제공하여 임시 또는 동적 SQL 쿼리 또는 응용 프로그램 데이터 계층을 통해 시작된 모든 DML 문을 평가합니다. {0}
pt_br: Para os bancos de dados selecionados, opcionalmente, forneça arquivos de sessão de evento estendido para avaliar consultas ad hoc ou SQL dinâmicas ou quaisquer instruções DML iniciadas pela camada de dados do aplicativo. {0}
ru: Для выбранных баз данных при необходимости предоставьте файлы расширенных сеансов событий для оценки специализированных или динамических SQL-запросов или любых инструкций DML, инициированных с помощью уровня данных приложения. {0}
zh_hant: 對於選取的資料庫，請選擇性地提供擴充事件工作階段檔案來評估臨機操作或動態 SQL 查詢，或透過應用程式資料圖層起始的任何 DML 陳述式。{0}

# sql.migration.sku.azureConfiguration.gen5
source: Gen5
ja: 第 5 世代
ru: 5-е поколение

# sql.migration.schema.openrowset.nonazureblob
source: OPENROWSET WITH NON-AZURE BLOB
de: OPENROWSET MIT NICHT-AZURE-BLOB
es: OPENROWSET CON BLOB QUE NO ES DE AZURE
fr: OPENROWSET AVEC UN OBJET BLOB NON AZURE
ja: AZURE 以外の BLOB を含む OPENROWSET
pt_br: OPENROWSET COM BLOB NÃO AZURE
ru: OPENROWSET С BLOB-ОБЪЕКТОМ, НЕ ОТНОСЯЩИМСЯ К AZURE
zh_hant: OPENROWSET 與非 AZURE BLOB

# sql.migration.schema.openrowset.provider
source: OPENROWSET WITH PROVIDER
de: OPENROWSET MIT ANBIETER
es: OPENROWSET CON PROVEEDOR
fr: OPENROWSET AVEC FOURNISSEUR
ja: プロバイダーを使用した OPENROWSET
pt_br: OPENROWSET COM PROVEDOR
ru: OPENROWSET С ПОСТАВЩИКОМ
zh_hant: OPENROWSET 與提供者

# sql.migration.storage.account
source: Storage account
de: Speicherkonto
es: Cuenta de almacenamiento
fr: Compte de stockage
ja: ストレージ アカウント
ko: 스토리지 계정
pt_br: Conta de armazenamento
ru: Учетная запись хранения
zh_hant: 儲存體帳戶

# sql.migration.sku.azureConfiguration.vm
source: {0} ({1} vCPU)
fr: {0} ({1} processeur virtuel)
ru: {0} ({1} виртуальных ЦП)

# sql.migration.sku.azureConfiguration.mi
source: {0} - {1} - {2} vCore
de: {0} – {1} – {2} virtueller Kern
es: {0} - {1} - {2} núcleo virtual
ja: {0} - {1} - {2} 仮想コア
ru: {0} - {1} - {2} виртуальное ядро
zh_hant: {0} - {1} - {2} V 核心

# sql.migration.sku.azureConfiguration.miPreview
source: {0} - {1} - {2} vCore - {3} GB
de: {0} – {1} – {2} virtueller Kern – {3} GB
es: {0} - {1} - núcleo virtual {2} - {3} GB
fr: {0} – {1} – {2} vCore – {3} Go
ja: {0} - {1} - {2} 仮想コア - {3} GB
ru: {0} - {1} - {2} виртуальное ядро - {3} ГБ
zh_hant: {0} - {1} - {2} V 核心 - {3} GB

# sql.migration.sku.azureConfiguration.sqldbPreview
source: {0} - {1} - {2} vCore - {3} GB
de: {0} – {1} – {2} virtueller Kern – {3} GB
es: {0} - {1} - núcleo virtual {2} - {3} GB
fr: {0} – {1} – {2} vCore – {3} Go
ja: {0} - {1} - {2} 仮想コア - {3} GB
ru: {0} - {1} - {2} виртуальное ядро - {3} ГБ
zh_hant: {0} - {1} - {2} V 核心 - {3} GB

# sql.migration.sku.azureConfiguration.sqldb
source: {0} - {1} vCore
de: {0} – {1} virtueller Kern
es: {0} - {1} núcleo virtual
ja: {0} - {1} 仮想コア
ru: {0} - {1} виртуальное ядро
zh_hant: {0} - {1} V 核心

# sql.migration.size.gb
source: {0} GB
fr: {0} Go
ru: {0} ГБ

# sql.migration.sku.gb
source: {0} GB
fr: {0} Go
ru: {0} ГБ

# sql.migration.sku.storageGB
source: {0} GB
fr: {0} Go
ru: {0} ГБ

# sql.migration.sku.iops
source: {0} IOPS
es: {0} E/S por segundo
ru: {0} операций ввода-вывода в секунду

# sql.migration.size.mb
source: {0} MB
fr: {0} MO
ru: {0} МБ

# sql.migration.size.tb
source: {0} TB
fr: {0}TO
ru: {0} ТБ

# downloadingServiceSize
source: ({0} KB)
fr: ({0} Ko)
ru: ({0} КБ)

# sql.migration.schema.bulkinsert
source: BULK INSERT
es: INSERCIÓN MASIVA
ja: 一括挿入
