Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/Microsoft.mssql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# mssql.enableSqlAuthenticationProvider
source: Enables use of the Sql Authentication Provider for 'Active Directory Interactive' authentication mode when user selects 'AzureMFA' authentication. This enables Server-side resource endpoint integration when fetching access tokens. This option is only supported for 'MSAL' Azure Authentication Library. Azure Data Studio is required to be relaunched when the value is changed.
de: Ermöglicht die Verwendung des Sql-Authentifizierungsanbieters für den Authentifizierungsmodus „Active Directory Interactive“, wenn der Benutzer die Authentifizierung „AzureMFA“ auswählt. Dies ermöglicht die serverseitige Ressourcenendpunktintegration beim Abrufen von Zugriffstokens. Diese Option wird nur für die „MSAL“ Azure Authentication Library unterstützt. Azure Data Studio muss neu gestartet werden, wenn der Wert geändert wird.
es: Habilita el uso del proveedor de autenticación de SQL para el modo de autenticación "Active Directory interactivo" cuando el usuario selecciona la autenticación "AzureMFA". Esto habilita la integración del punto de conexión de recursos del lado servidor al capturar tokens de acceso. Esta opción solo se admite para la biblioteca de autenticación de Azure "MSAL". Es necesario volver a iniciar Azure Data Studio cuando se cambia el valor.
fr: Active l’utilisation du fournisseur d’authentification Sql pour le mode d’authentification ’Active Directory Domain Services Interactive’ lorsque l’utilisateur sélectionne l’authentification ’AzureMFA’. Cela permet l’intégration du point de terminaison des ressources côté serveur lors de la récupération des jetons d’accès. Cette option est uniquement prise en charge pour la bibliothèque d’authentification Azure ’MSAL’. Azure Data Studio doit être relancé lorsque la valeur est modifiée.
it: Abilita l'uso del provider di autenticazione SQL per la modalità di autenticazione 'Active Directory Interactive' quando l'utente seleziona l'autenticazione 'AzureMFA'. Abilita l'integrazione dell'endpoint risorse lato server durante il recupero dei token di accesso. Questa opzione è supportata solo per la libreria di autenticazione di Azure 'MSAL'. ll riavvio di Azure Data Studio è obbligatorio quando il valore viene modificato.
ja: ユーザーが 'AzureMFA' 認証を選択したときに、'Active Directory Interactive' 認証モードで Sql 認証プロバイダーを使用できるようにします。これにより、アクセス トークンをフェッチするときにサーバー側のリソース エンドポイントの統合が有効になります。このオプションは、'MSAL' Azure 認証ライブラリでのみサポートされています。Azure Data Studio は、値が変更されたときに再起動する必要があります。
ko: 사용자가 'AzureMFA' 인증을 선택할 때 'Active Directory Interactive' 인증 모드에서 SQL 인증 공급자를 사용하도록 설정합니다. 이를 통해 액세스 토큰을 가져올 때 서버 쪽 리소스 엔드포인트 통합을 사용할 수 있습니다. 이 옵션은 'MSAL' Azure 인증 라이브러리에 대해서만 지원됩니다. 값을 변경하면 Azure Data Studio를 다시 시작해야 합니다.
pt_br: Habilita o uso do Provedor de Autenticação Sql para o modo de autenticação 'Active Directory Interactive' quando o usuário seleciona a autenticação 'AzureMFA'. Isso permite a integração de ponto de extremidade de recurso do lado do servidor ao buscar tokens de acesso. Esta opção só tem suporte para a Biblioteca de Autenticação do Azure 'MSAL'. O Azure Data Studio precisa ser reiniciado quando o valor é alterado.
ru: Разрешает использование поставщика проверки подлинности SQL для режима проверки подлинности "Active Directory Interactive", когда пользователь выбирает проверку подлинности "AzureMFA". Это разрешает интеграцию конечной точки ресурсов на стороне сервера при получении маркеров доступа. Этот параметр поддерживается только для библиотеки проверки подлинности Azure "MSAL". При изменении значения требуется перезапуск Azure Data Studio.
zh_hans: 当用户选择“AzureMFA”身份验证时，允许将 SQL 身份验证提供程序用于“Active Directory 交互式”身份验证模式。这将在获取访问令牌时启用服务器端资源终结点集成。仅“MSAL”Azure 身份验证库支持此选项。更改此值后，需要重新启动 Azure Data Studio。
zh_hant: 當使用者選取 'AzureMFA' 驗證，則針對 'Active Directory Interactive' 驗證模式啟用使用 SQL 驗證提供者。這會在擷取存取權杖時啟用伺服器端資源端點整合。此選項僅支援 'MSAL' Azure 驗證程式庫。值變更時，需要重新啟動 Azure Data Studio。

# mssql.connectionOptions.encrypt.displayName
source: Encrypt
de: Verschlüsseln
es: Cifrar
fr: Crypter
it: Crittografa
ja: 暗号化
ko: 암호화
pt_br: Criptografar
ru: Шифровать
zh_hans: 加密
zh_hant: 加密

# mssql.executionPlan.expensiveOperationMetric.off
source: Expensive operation highlighting will be turned off for execution plans.
de: Die Hervorhebung aufwendiger Vorgänge wird für Ausführungspläne deaktiviert.
es: El resaltado de operaciones costosas se desactivará para los planes de ejecución.
fr: La mise en surbrillance des opérations coûteuses sera désactivée pour les plans d’exécution.
it: L'evidenziazione delle operazioni dispendiose verrà disattivata per i piani di esecuzione.
ja: 実行プランでは、負荷の高い操作の強調表示がオフになります。
ko: 실행 계획에 대해 비용이 많이 드는 작업 강조 표시가 꺼집니다.
pt_br: O realce de operações caras será desativado para planos de execução.
ru: Выделение ресурсоемких операций будет отключено для планов выполнения.
zh_hans: 将会为执行计划关闭突出显示的高开销操作。
zh_hant: 將會針對執行計畫關閉高成本的作業醒目提示。

# mssql.exportNotebookToSql
source: Export Notebook as SQL
de: Notebook als SQL exportieren
es: Exportar cuaderno como SQL
fr: Exporter le notebook au format SQL
it: Esporta notebook come SQL
ja: ノートブックを SQL としてエクスポート
ko: Notebook을 SQL로 내보내기
pt_br: Exportar o Notebook como SQL
ru: Экспорт записной книжки в виде SQL
zh_hans: 将笔记本导出为 SQL
zh_hant: 將筆記本匯出為 SQL

# mssql.exportSqlAsNotebook
source: Export SQL as Notebook
de: SQL als Notebook exportieren
es: Exportar SQL como cuaderno
fr: Exporter SQL au format Notebook
it: Esporta SQL come notebook
ja: SQL をノートブックとしてエクスポート
ko: SQL을 Notebook으로 내보내기
pt_br: Exportar o SQL como Notebook
ru: Экспорт SQL в виде записной книжки
zh_hans: 将 SQL 导出为笔记本
zh_hant: 將 SQL 匯出為筆記本

# mssql.connectionOptions.failoverPartner.displayName
source: Failover partner
es: Socio de conmutación por error
fr: Partenaire de basculement
it: Partner di failover
ja: フェールオーバー パートナー
ko: 장애 조치(failover) 파트너
pt_br: Parceiro de failover
ru: Партнер по обеспечению отработки отказа
zh_hans: 故障转移伙伴
zh_hant: 容錯移轉夥伴

# mssql.executionPlan.expensiveOperationMetric.actualElapsedTime
source: Highlights the execution plan operation that took the most time.
de: Hebt den Ausführungsplanvorgang hervor, der am längsten gedauert hat.
es: Resalta la operación del plan de ejecución que tardó más tiempo.
fr: Met en évidence l’opération de plan d’exécution qui a pris le plus de temps.
it: Evidenzia l'operazione del piano di esecuzione che ha richiesto più tempo.
ja: 最も時間がかかった実行プランの操作を強調表示します。
ko: 가장 많은 시간이 걸린 실행 계획 작업을 강조 표시합니다.
pt_br: Realça a operação do plano de execução que levou mais tempo.
ru: Выделяет операцию плана выполнения, занявшую больше всего времени.
zh_hans: 突出显示花费时间最多的执行计划操作。
zh_hant: 醒目提示花費最多時間的執行計畫作業。

# mssql.executionPlan.expensiveOperationMetric.actualElapsedCpuTime
source: Highlights the execution plan operation that used the most CPU time.
de: Hebt den Ausführungsplanvorgang hervor, der die meiste CPU-Zeit beansprucht hat.
es: Resalta la operación del plan de ejecución que usó más tiempo de CPU.
fr: Met en surbrillance l’opération de plan d’exécution qui a utilisé le plus de temps processeur.
it: Evidenzia l'operazione del piano di esecuzione che ha usato la maggior parte del tempo della CPU.
ja: CPU 時間が最も多く使用された実行プラン操作を強調表示します。
ko: CPU 시간을 가장 많이 사용한 실행 계획 작업을 강조 표시합니다.
pt_br: Realça a operação do plano de execução que usou mais tempo de CPU.
ru: Выделяет операцию плана выполнения, использовавшую больше всего процессорного времени.
zh_hans: 突出显示使用 CPU 时间最多的执行计划操作。
zh_hant: 醒目提示使用最多 CPU 時間的執行計畫作業。

# mssql.executionPlan.actualNumberOfRowsForAllExecutions
source: Highlights the execution plan operation with the greatest actual number of rows for all executions.
de: Hebt den Ausführungsplanvorgang mit der größten tatsächlichen Anzahl von Zeilen für alle Ausführungen hervor.
es: Resalta la operación del plan de ejecución con el mayor número real de filas para todas las ejecuciones.
fr: Met en évidence l’opération de plan d’exécution avec le plus grand nombre réel de lignes pour toutes les exécutions.
it: Evidenzia l'operazione del piano di esecuzione con il maggior numero effettivo di righe per tutte le esecuzioni.
ja: すべての実行の実際の行数が最も多い実行プランの操作を強調表示します。
ko: 모든 실행에 대한 실제 행 수가 가장 많은 실행 계획 작업을 강조 표시합니다.
pt_br: Realça a operação do plano de execução com o maior número real de linhas para todas as execuções.
ru: Выделяет операцию плана выполнения с наибольшим фактическим числом строк для всех выполнений.
zh_hans: 突出显示所有执行中实际行数最大的执行计划操作。
zh_hant: 使用所有執行的最大實際資料列數來醒目提示執行計畫作業。

# mssql.executionPlan.numberOfRowsRead
source: Highlights the execution plan operation with the greatest number of rows read.
de: Hebt den Ausführungsplanvorgang mit der größten Anzahl gelesener Zeilen hervor.
es: Resalta la operación del plan de ejecución con el mayor número de filas leídas.
fr: Met en surbrillance l’opération de plan d’exécution avec le plus grand nombre de lignes lues.
it: Evidenzia l'operazione del piano di esecuzione con il maggior numero di righe lette.
ja: 読み取られた行数が最も多い実行プラン操作を強調表示します。
ko: 읽은 행 수가 가장 많은 실행 계획 작업을 강조 표시합니다.
pt_br: Realça a operação do plano de execução com o maior número de linhas lidas.
ru: Выделяет операцию плана выполнения с наибольшим количеством прочитанных строк.
zh_hans: 突出显示读取行数最多的执行计划操作。
zh_hant: 以讀取的資料列數目上限醒目提示執行計畫作業。

# mssql.executionPlan.cost
source: Highlights the execution plan operation with the highest cost.
de: Hebt den Ausführungsplanvorgang mit den höchsten Kosten hervor.
es: Resalta la operación del plan de ejecución con el costo más alto.
fr: Met en surbrillance l’opération de plan d’exécution avec le coût le plus élevé.
it: Evidenzia l'operazione del piano di esecuzione con il costo più elevato.
ja: コストが最も高い実行プラン操作を強調表示します。
ko: 가장 높은 비용으로 실행 계획 작업을 강조 표시합니다.
pt_br: Realça a operação do plano de execução com o custo mais alto.
ru: Выделяет операцию плана выполнения с наибольшей ресурсоемкостью.
zh_hans: 突出显示成本最高的执行计划操作。
zh_hant: 以最高成本醒目提示執行計畫作業。

# mssql.executionPlan.subtreeCost
source: Highlights the execution plan operation with the highest subtree cost.
de: Hebt den Ausführungsplanvorgang mit den höchsten Unterstrukturkosten hervor.
es: Resalta la operación del plan de ejecución con el costo de subárbol más alto.
fr: Met en surbrillance l’opération de plan d’exécution avec le coût de sous-arborescence le plus élevé.
it: Evidenzia l'operazione del piano di esecuzione con il costo del sottoalbero più elevato.
ja: サブツリー コストが最も高い実行プラン操作を強調表示します。
ko: 하위 트리 비용이 가장 높은 실행 계획 작업을 강조 표시합니다.
pt_br: Realça a operação do plano de execução com o custo de subárvore mais alto.
ru: Выделяет операцию плана выполнения с наибольшей ресурсоемкостью поддерева.
zh_hans: 突出显示子树成本最高的执行计划操作。
zh_hant: 以最高樹狀子目錄成本醒目提示執行計畫作業。

# mssql.connectionOptions.enclaveAttestationProtocol.categoryValues.HGS
source: Host Guardian Service
de: Host-Überwachungsdienst
es: Servicio de protección de host
fr: Service de tuteur d'hôte
it: Servizio Sorveglianza host
ja: ホスト ガーディアン サービス
ko: 호스트 보호 서비스
pt_br: Serviço Guardião de Host
ru: Служба защиты узла
zh_hans: 主机保护者服务
zh_hant: 主機守護者服務

# mssql.connectionOptions.hostNameInCertificate.displayName
source: Host name in certificate
de: Hostname im Zertifikat
es: Nombre de host en el certificado:
fr: Nom d’hôte dans le certificat
it: Nome host nel certificato
ja: 証明書内のホスト名
ko: 인증서의 호스트 이름
pt_br: Nome do host no certificado
ru: Имя узла в сертификате
zh_hans: 证书中的主机名
zh_hant: 憑證中的主機名稱

# mssql.connectionOptions.hostNameInCertificate.description
source: Indicates the host name specified in TLS certificate that will be used by SQL Server to validate server certificate. When not specified, the server name is used by default for certificate validation.
de: Gibt den im TLS-Zertifikat angegebenen Hostnamen an, der von SQL Server zum Überprüfen des Serverzertifikats verwendet wird. Wenn keine Angabe erfolgt, wird der Servername standardmäßig für die Zertifikatüberprüfung verwendet.
es: Indica el nombre de host especificado en el certificado TLS que usará SQL Server para validar el certificado de servidor. Cuando no se especifica, el nombre del servidor se usa de forma predeterminada para la validación de certificados.
fr: Indique le nom d’hôte spécifié dans le certificat TLS qui sera utilisé par SQL Server pour valider le certificat du serveur. S’il n’est pas spécifié, le nom du serveur est utilisé par défaut pour la validation du certificat.
it: Indica il nome host specificato nel certificato TLS che verrà utilizzato da SQL Server per convalidare il certificato del server. Se non specificato, il nome del server viene utilizzato per impostazione predefinita per la convalida del certificato.
ja: SQL Server で使用されるサーバー証明書検証用の TLS 証明書内に指定されたホスト名を示します。指定されていない場合、既定ではサーバー名が証明書の検証に使用されます。
ko: SQL Server 서버 인증서에서 유효성을 검사하는 데 사용할 TLS 인증서에 지정된 호스트 이름을 나타냅니다. 지정하지 않으면 서버 이름이 인증서 유효성 검사에 기본적으로 사용됩니다.
pt_br: Indica o nome do host especificado no certificado TLS que será usado pelo SQL Server para validar o certificado do servidor. Quando não especificado, o nome do servidor é usado por padrão para validação do certificado.
ru: Задает имя узла, указанное в сертификате TLS, которое будет использоваться SQL Server для проверки сертификата сервера. Если оно не указано, то по умолчанию для проверки сертификата используется имя сервера.
zh_hans: 指示 TLS 证书中指定的主机名，SQL Server 将使用该主机名来验证服务器证书。如果未指定，则默认使用服务器名称进行证书验证。
zh_hant: 指出 SQL Server 會用來驗證伺服器憑證之 TLS 憑證中指定的主機名稱。未指定時，預設會使用伺服器名稱進行憑證驗證。

# mssql.connectionOptions.password.description
source: Indicates the password to be used when connecting to the data source
de: Gibt das Kennwort an, das beim Herstellen einer Verbindung mit der Datenquelle verwendet werden soll.
es: Indica la contraseña que se utilizará al conectarse al origen de datos
fr: Indique le mot de passe à utiliser pour la connexion à la source de données
it: Indica la password da usare per la connessione all'origine dati
ja: データ ソースへの接続時に使用するパスワードを示します
ko: 데이터 원본에 연결할 때 사용할 암호를 나타냅니다.
pt_br: Indica a senha a ser usada ao conectar-se à fonte de dados
ru: Указывает пароль, который необходимо использовать для подключения к источнику данных
zh_hans: 指示连接到数据源时使用的密码
zh_hant: 代表要在連線至資料來源時使用的密碼

# mssql.connectionOptions.userName.description
source: Indicates the user ID to be used when connecting to the data source
de: Gibt die Benutzer-ID an, die beim Herstellen einer Verbindung mit der Datenquelle verwendet werden soll.
es: Indica el identificador de usuario que se va a usar al conectar con el origen de datos
fr: Indique l'identifiant utilisateur à utiliser pour la connexion à la source de données
it: Indica l'ID utente da usare per la connessione all'origine dati
ja: データ ソースへの接続時に使用するユーザー ID を示します
ko: 데이터 원본에 연결할 때 사용할 사용자 ID를 나타냅니다.
pt_br: Indica a ID de usuário a ser usada ao conectar-se à fonte de dados
ru: Указывает идентификатор пользователя, который необходимо использовать для подключения к источнику данных
zh_hans: 指示连接到数据源时使用的用户 ID
zh_hant: 代表要在連線至資料來源時使用的使用者識別碼

# mssql.connectionOptions.typeSystemVersion.description
source: Indicates which server type system the provider will expose through the DataReader
de: Gibt an, welches Servertypsystem der Anbieter über den DataReader offenlegt.
es: Indica qué sistema de tipo de servidor el proveedor expondrá por medio de DataReader.
fr: Indique le système de type serveur que le fournisseur doit exposer par le biais de DataReader
it: Indica quale sistema di tipi di server il provider esporrà mediante il DataReader
ja: プロバイダーがデータ リーダー経由で公開するサーバーの種類のシステムを示します。
ko: 공급자가 DataReader를 통해 공개할 서버 유형 시스템을 나타냄
pt_br: Indica qual sistema do tipo de servidor o provedor vai expor por meio do DataReader
ru: Указывает серверную систему, доступ к которой поставщик будет предоставлять через DataReader
zh_hans: 指示提供程序将通过 DataReader 公开的服务器类型系统
zh_hant: 表示提供者透過 DataReader 所公開的伺服器類型系統

# mssql.connectionOptions.groupName.initialization
source: Initialization
de: Initialisierung
es: Inicialización
fr: Initialisation
it: Inizializzazione
ja: 初期化
ko: 초기화
pt_br: Inicialização
ru: Инициализация
zh_hans: 初始化
zh_hant: 初始化

# onprem.databaseProperties.lastBackupDate
source: Last Database Backup
de: Letzte Datenbanksicherung
es: Última copia de seguridad de la base de datos
fr: Dernière sauvegarde de base de données
it: Ultimo backup del database
ja: 最終データベース バックアップ
ko: 마지막 데이터베이스 백업
pt_br: Último Backup de Banco de Dados
ru: Последнее резервное копирование базы данных
zh_hans: 上次数据库备份
zh_hant: 上次資料庫備份

# onprem.databaseProperties.lastLogBackupDate
source: Last Log Backup
de: Letzte Protokollsicherung
es: Última copia de seguridad de registros
fr: Dernière sauvegarde de journal
it: Ultimo backup del log
ja: 最終ログ バックアップ
ko: 마지막 로그 백업
pt_br: Último Backup de Log
ru: Последняя резервная копия журнала
zh_hans: 上次日志备份
zh_hant: 上次記錄備份

# databasesListProperties.lastBackup
source: Last backup
de: Letzte Sicherung
es: Última copia de seguridad
fr: Dernière sauvegarde
it: Ultimo backup
ja: 前回のバックアップ
ko: 마지막 백업
pt_br: Último backup
ru: Последняя архивация
zh_hans: 上次备份
zh_hant: 上次備份

# mssql.connectionOptions.loadBalanceTimeout.displayName
source: Load balance timeout
de: Timeout für Lastenausgleich
es: Tiempo de espera del equilibrio de carga
fr: Délai d'expiration de l'équilibrage de charge
it: Timeout durante il bilanciamento del carico
ja: 負荷分散タイムアウト
ko: 부하 분산 시간 제한
pt_br: Tempo limite de balanceamento de carga
ru: Истекло время ожидания при балансировке нагрузки
zh_hans: 负载均衡超时
zh_hant: 負載平衡逾時

# mssql.configuration.title
source: MSSQL configuration
de: MSSQL-Konfiguration
es: Configuración de MSSQL
fr: Configuration MSSQL
it: Configurazione di MSSQL
ja: MSSQL 構成
ko: MSSQL 구성
pt_br: Configuração do MSSQL
ru: Конфигурация MSSQL
zh_hans: MSSQL 配置
zh_hant: MSSQL 設定

# mssql.connectionOptions.encrypt.categoryValues.true
source: Mandatory
de: Obligatorisch
es: Obligatorio
fr: Obligatoire
it: Obbligatorio
ja: 必須
ko: 필수
pt_br: Obrigatório
ru: Обязательно
zh_hans: 强制
zh_hant: 強制

# mssql.connectionOptions.maxPoolSize.displayName
source: Max pool size
de: Maximale Poolgröße
es: Tamaño máximo del grupo
fr: Taille maximale du pool
it: Dimensioni massime del pool
ja: 最大プール サイズ
ko: 최대 풀 크기
pt_br: Tamanho máximo do pool
ru: Максимальный размер пула
zh_hans: 最大池大小
zh_hant: 集區大小上限

# mssql.query.maxXmlCharsToStore
source: Maximum number of characters to store for each value in XML columns after running a query. Default value: 2,097,152. Valid value range: 1 to 2,147,483,647.
de: Die maximale Anzahl von Zeichen, die nach dem Ausführen einer Abfrage für jeden Wert in XML-Spalten gespeichert werden sollen. Standardwert: 2.097.152. Gültiger Wertebereich: 1 bis 2.147.483.647.
es: Número máximo de caracteres que se almacenarán para cada valor en columnas XML después de ejecutar una consulta. Valor predeterminado: 2 097 152. Intervalo de valores válido: de 1 a 2 147 483 647.
fr: Nombre maximal de caractères à stocker pour chaque valeur dans les colonnes XML après l’exécution d’une requête. Valeur par défaut : 2 097 152. Plage de valeurs valide : 1 à 2 147 483 647.
it: Numero massimo di caratteri da archiviare per ogni valore nelle colonne XML dopo l'esecuzione di una query. Valore predefinito: 2.097.152. Intervallo di valori valido: da 1 a 2.147.483.647.
ja: クエリの実行後に XML 列の各値に格納する最大文字数。既定値: 2,097,152。有効な値の範囲: 1 から 2,147,483,647。
ko: 쿼리를 실행한 후 XML 열의 각 값에 대해 저장할 최대 문자 수입니다. 기본값: 2,097,152. 유효한 값 범위: 1 ~ 2,147,483,647.
pt_br: Máximo de caracteres a serem armazenados em cada valor nas colunas XML depois de executar uma consulta. Valor padrão: 2.097.152. Intervalo de valor válido: 1 a 2.147.483.647.
ru: Максимальное сохраняемое количество символов для каждого значения в столбцах XML после выполнения запроса. Значение по умолчанию: 2 097 152. Допустимый диапазон значений: от 1 до 2 147 483 647.
zh_hans: 运行查询后，XML 列中每个值可存储的最大字符数。默认值: 2,097,152。有效值范围: 1 到 2,147,483,647。
zh_hant: 執行查詢後，XML 資料行中每個值儲存的最大字元數。預設值: 2，097，152。有效值範圍: 1 到 2，147，483，647。

# mssql.query.maxCharsToStore
source: Maximum number of characters/bytes to store for each value in character/binary columns after running a query. Default value: 65,535. Valid value range: 1 to 2,147,483,647.
de: Die maximale Anzahl von Zeichen/Bytes, die nach dem Ausführen einer Abfrage für jeden Wert in Zeichenspalten/binären Spalten gespeichert werden sollen. Standardwert: 65.535. Gültiger Wertebereich: 1 bis 2.147.483.647.
es: Número máximo de caracteres/bytes que se almacenarán para cada valor en columnas de caracteres o binarios después de ejecutar una consulta. Valor predeterminado: 65 535. Intervalo de valores válido: de 1 a 2 147 483 647.
fr: Nombre maximal de caractères/octets à stocker pour chaque valeur dans les colonnes de caractères/binaires après l’exécution d’une requête. Valeur par défaut : 65 535. Plage de valeurs valides : 1 à 2 147 483 647.
it: Numero massimo di caratteri/byte da archiviare per ogni valore in colonne di tipo carattere/binario dopo l'esecuzione di una query. Valore predefinito: 65.535. Intervallo di valori valido: da 1 a 2.147.483.647.
ja: クエリの実行後に、文字/バイナリ列の各値に格納する最大文字数/バイト数。既定値: 65,535。有効な値の範囲: 1 から 2,147,483,647。
ko: 쿼리를 실행한 후 문자/이진 열의 각 값에 대해 저장할 최대 문자/바이트 수입니다. 기본값: 65,535. 유효한 값 범위: 1 ~ 2,147,483,647.
pt_br: Máximo de caracteres/bytes a serem armazenados em cada valor nas colunas caracter/binário depois de executar uma consulta. Valor padrão: 65.535. Intervalo de valor válido: 1 a 2.147.483.647.
ru: Максимальное сохраняемое количество символов/байт для каждого значения в символьных/двоичных столбцах после выполнения запроса. Значение по умолчанию: 65 535. Допустимый диапазон значений: от 1 до 2 147 483 647.
zh_hans: 运行查询后，字符/二进制列中每个值可存储的最大字符/字节数。默认值: 65,535。有效值范围: 1 到 2,147,483,647。
zh_hant: 執行查詢之後，字元/二進位資料行中每個值儲存的字元/位元組數目上限。預設值: 65，535。有效值範圍: 1 到 2，147，483，647。

# mssql.logFilesRemovalLimit
source: Maximum number of old files to remove upon startup that have expired mssql.logRetentionMinutes. Files that do not get cleaned up due to this limitation get cleaned up next time Azure Data Studio starts up.
de: Die maximale Anzahl alter Dateien, die beim Start entfernt werden sollen, bei denen der mssql.logRetentionMinutes-Wert abgelaufen ist. Dateien, die aufgrund dieser Einschränkung nicht bereinigt werden, werden beim nächsten Start von Azure Data Studio bereinigt.
es: Número máximo de archivos antiguos para quitarse en el inicio que tienen expirado el valor mssql.logRetentionMinutes. Los archivos que no se limpien debido a esta limitación se limpiarán la próxima vez que se inicie Azure Data Studio.
fr: Nombre maximal d'anciens fichiers ayant dépassé mssql.logRetentionMinutes à supprimer au démarrage. Les fichiers qui ne sont pas nettoyés du fait de cette limitation le sont au prochain démarrage d'Azure Data Studio.
it: Numero massimo di file meno recenti da rimuovere all'avvio per cui è scaduto il tempo impostato con mssql.logRetentionMinutes. I file che non vengono rimossi a causa di questa limitazione verranno rimossi al successivo avvio di Azure Data Studio.
ja: mssql.logRetentionMinutes の有効期限が切れた、起動時に削除する古いファイルの最大数。この制限のためにクリーンアップされないファイルは、Azure Data Studio の次回の起動時にクリーンアップされます。
ko: 시작 시 제거하려고 하며 mssql.logRetentionMinutes가 만료된 이전 파일의 최대 수입니다. 이 제한으로 인해 정리되지 않은 파일은 다음에 Azure Data Studio를 시작할 때 정리됩니다.
pt_br: Número máximo de arquivos antigos a serem removidos na inicialização com mssql.logRetentionMinutes expirado. Os arquivos que não forem limpos devido a essa limitação serão limpos na próxima vez em que o Azure Data Studio for iniciado.
ru: Максимальное число старых файлов, удаляемых при запуске, с истекшим сроком mssql.logRetentionMinutes. Файлы, которые не были очищены из-за этого ограничения, очищаются при следующем запуске Azure Data Studio.
zh_hans: 启动时要删除的已超过 mssql.logRetentionMinutes 的旧文件的最大数量。将在下次启动 Azure Data Studio 时清理由于此限制而未清理的文件。
zh_hant: 具有到期的 logRetentionMinutes，且要於啟動時移除的舊檔案數上限。因為此限制而未清除的檔案，將於下次 Azure Data Studio 啟動時受到清除。
