Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/notebook.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# newBook
source: New Jupyter Book (Preview)
de: Neue Jupyter Book-Instanz (Vorschau)
es: Nuevo libro de Jupyter (versión preliminar)
fr: Nouveau livre de jupyter (Preview)
it: Nuovo libro Jupyter (anteprima)
ja: 新しい Jupyter ブック (プレビュー)
ko: 새 Jupyter Book(미리 보기)
pt_br: Novo Livro Jupyter (Visualização)
ru: Новая книга Jupyter (предварительный просмотр)
zh_hans: 新 Jupyter 书籍(预览)
zh_hant: 新 Jupyter Book (預覽)

# newMarkdown
source: New Markdown (Preview)
de: Neuer Markdown (Vorschau)
es: Nuevo Markdown (versión preliminar)
fr: Nouvel Aperçu Markdown (Aperçu)
it: Nuovo markdown (anteprima)
ja: 新しいマークダウン (プレビュー)
ko: 새 Markdown(미리 보기)
pt_br: Nova Marcação (Visualização)
ru: Новый файл Markdown (предварительный просмотр)
zh_hans: 新建 Markdown (预览)
zh_hant: 新增 Markdown (預覽)

# newNotebook
source: New Notebook (Preview)
de: Neues Notebook (Vorschau)
es: Nuevo bloc de notas (versión preliminar)
fr: Nouveau bloc-notes (Aperçu)
it: Nuovo blocco appunti (anteprima)
ja: 新しいノートブック (プレビュー)
ko: 새 Notebook(미리 보기)
pt_br: Novo Bloco de Anotações (Visualização)
ru: Новая записная книжка (предварительный просмотр)
zh_hans: 新笔记本(预览)
zh_hant: 新筆記本 (預覽)

# newSection
source: New Section (Preview)
es: Nueva sección (versión preliminar)
fr: Nouvelle section (Aperçu)
ja: 新しいセクション (プレビュー)
ko: 새 섹션(미리 보기)
pt_br: Nova Seção (Pré-visualização)
ru: Новый раздел (предварительная версия)
zh_hant: 新增區段 (預覽)

# noBDCConnectionError
source: Spark kernels require a connection to a SQL Server Big Data Cluster master instance.
de: Für Spark-Kernel ist eine Verbindung mit einer Masterinstanz eines SQL Server-Big Data-Clusters erforderlich.
es: Los kernels de Spark requieren una conexión a una instancia maestra del clúster de macrodatos de SQL Server.
fr: Les noyaux Spark nécessitent une connexion a une instance maître de cluster Big Data SQL Server.
it: Con i kernel Spark è richiesta una connessione a un'istanza master del cluster Big Data di SQL Server.
ja: Spark カーネルは、SQL Server ビッグ データ クラスターのマスター インスタンスへの接続を必要とします。
ko: Spark 커널을 SQL Server 빅 데이터 클러스터 마스터 인스턴스에 연결해야 합니다.
pt_br: Os kernels do Spark exigem uma conexão com uma instância mestra do cluster de Big Data do SQL Server.
ru: Ядрам Spark требуется подключение к главному экземпляру кластера больших данных SQL Server.
zh_hans: Spark 内核需要连接到 SQL Server 大数据群集主实例。
zh_hant: Spark 核心需要對 SQL Server 巨量資料叢集主要執行個體的連線。

# noBooksSelected
source: No Jupyter Books are currently selected in the viewlet.
de: Im Viewlet sind zurzeit keine Jupyter Books ausgewählt.
es: Actualmente no hay ningún libro de Jupyter seleccionado en viewlet.
fr: Aucun Jupyter Book n'est actuellement sélectionné dans la viewlet.
it: Nessun Book è attualmente selezionato nel viewlet.
ja: ビューレットに現在選択されている Jupyter ブックがありません。
ko: 뷰렛에 현재 선택된 Jupyter Book이 없습니다.
pt_br: Nenhum Livro Jupyter está selecionado no momento no viewlet.
ru: В данный момент во viewlet не выбраны книги Jupyter.
zh_hans: 当前，Viewlet 中未选中任何 Jupyter Book。
zh_hant: 目前未在 Viewlet 中選取任何 Jupyter 書籍。

# onsharedFile
source: Shared File
de: Freigegebene Datei
es: Archivo compartido
fr: Fichier partagé
it: File condiviso
ja: 共有ファイル
ko: 공유 파일
pt_br: Arquivo Compartilhado
ru: Общий файл
zh_hans: 共享文件
zh_hant: 共用的檔案

# openBookError
source: Open Jupyter Book {0} failed: {1}
de: Fehler beim Öffnen von Jupyter Book "{0}": {1}
es: No se pudo abrir {0} el libro de Jupyter: {1}
fr: Échec de l’ouverture du Jupyter Book {0} : {1}
it: Apertura Jupyter Book {0} non riuscita: {1}
ja: Jupyter ブック {0} を開くことができませんでした: {1}
ko: Jupyter Book {0} 열기 실패: {1}
pt_br: Falha ao abrir o Livro Jupyter {0}: {1}
ru: Не удалось открыть книгу Jupyter {0}: {1}
zh_hans: 打开 Jupyter Book {0} 失败: {1}
zh_hant: 開啟 Jupyter 書籍 {0} 失敗: {1}

# openExternalLinkCommand
source: Open External Link
de: Externen Link öffnen
es: Abrir vínculo externo
fr: Ouvrir le lien externe
it: Apri collegamento esterno
ja: 外部リンクを開く
ko: 외부 링크 열기
pt_br: Abrir Link Externo
ru: Открыть внешнюю ссылку
zh_hans: 打开外部链接
zh_hant: 開啟外部連結

# openExternalLinkError
source: Open link {0} failed: {1}
de: Fehler beim Öffnen von Link {0}: {1}
es: Error al abrir el vínculo {0}: {1}
fr: L'ouverture du lien {0} a échoué : {1}
it: L'apertura del collegamento {0} non è riuscita: {1}
ja: リンク {0} を開けませんでした。{1}
ko: 링크 {0} 열기 실패: {1}
pt_br: Falha ao abrir o link {0}: {1}
ru: Не удалось открыть ссылку {0}: {1}
zh_hans: 打开链接 {0} 失败: {1}
zh_hant: 開啟連結 {0} 失敗: {1}

# openMarkdownCommand
source: Open Markdown
de: Markdown öffnen
es: Abrir Markdown
fr: Ouvrir le fichier Markdown
it: Apri Markdown
ja: マークダウンを開く
ko: Markdown 열기
pt_br: Abrir Markdown
ru: Открыть разметку Markdown
zh_hans: 打开 Markdown
zh_hant: 開啟 Markdown

# openMarkdownError
source: Open markdown {0} failed: {1}
de: Fehler beim Öffnen von Markdown "{0}": {1}
es: Error en la apertura de Markdown {0}: {1}
fr: L'ouverture du fichier Markdown {0} a échoué : {1}
it: L'apertura del markdown {0} non è riuscita: {1}
ja: マークダウン {0} を開けませんでした: {1}
ko: {0} Markdown을 열지 못함: {1}
pt_br: Falha ao abrir o markdown {0}: {1}
ru: Не удалось открыть файл Markdown {0}: {1}
zh_hans: 打开 markdown {0} 失败: {1}
zh_hant: 開啟 Markdown {0} 失敗: {1}

# openNotebookCommand
source: Open Notebook
de: Notebook öffnen
es: Abrir cuaderno
fr: Ouvrir le notebook
it: Apri notebook
ja: ノートブックを開く
ko: Notebook 열기
pt_br: Abrir Notebook
ru: Открыть записную книжку
zh_hans: 打开笔记本
zh_hant: 開啟 Notebook

# openNotebookError
source: Open notebook {0} failed: {1}
de: Fehler beim Öffnen des Notebooks "{0}": {1}
es: Error al abrir el cuaderno {0}: {1}
fr: L'ouverture du notebook {0} a échoué : {1}
it: L'apertura del notebook {0} non è riuscita: {1}
ja: ノートブック {0} を開けませんでした: {1}
ko: {0} Notebook을 열지 못함: {1}
pt_br: Falha ao abrir o notebook {0}: {1}
ru: Не удалось открыть записную книжку {0}: {1}
zh_hans: 打开笔记本 {0} 失败: {1}
zh_hant: 無法開啟筆記本 {0}: {1}

# openUntitledNotebookError
source: Open untitled notebook {0} as untitled failed: {1}
de: Fehler beim Öffnen des Notebooks "{0}" ohne Titel: {1}
es: Error al abrir el cuaderno sin título {0} como sin título: {1}
fr: Ouvrez un notebook {0} sans titre, car le {1} sans titre a échoué
it: L'apertura del notebook senza titolo {0} come senza titolo non è riuscita: {1}
ja: 無題のノートブック {0} を無題として開けませんでした: {1}
ko: 제목 없는 Notebook {0}을(를) 제목 없음으로 열지 못함: {1}
pt_br: Abrir o notebook sem título {0} porque o sem título falhou: {1}
ru: Не удалось открыть безымянную записную книжку {0} как безымянную: {1}
zh_hans: 以无标题形式打开无标题笔记本 {0} 失败: {1}
zh_hant: 無法將未命名的書籍 {0} 以未命名開啟: {1}

# providerNotValidError
source: Non-MSSQL providers are not supported for spark kernels.
de: Für Spark-Kernel werden nur MSSQL-Anbieter unterstützt.
es: No se admiten proveedores que no sean MSSQL para los kernels de Spark.
fr: Les fournisseurs non-MSSQL ne sont pas pris en charge pour les noyaux Spark.
it: I provider non MSSQL non sono supportati per i kernel Spark.
ja: MSSQL 以外のプロバイダーは、Spark カーネルでサポートされていません。
ko: 비 MSSQL 공급자는 Spark 커널에서 지원되지 않습니다.
pt_br: Não há suporte para provedores não MSSQL em kernels do Spark.
ru: Поставщики, не являющиеся поставщиками MSSQL, не поддерживаются для ядер Spark.
zh_hans: Spark 内核不支持非 MSSQL 提供程序。
zh_hant: Spark 核心不支援非 MSSQL 提供者。

# readBookError
source: Failed to read Jupyter Book {0}: {1}
de: Fehler beim Lesen von Jupyter Book "{0}": {1}
es: No se pudo leer el libro de {0}: {1}
fr: Échec de la lecture du Jupyter Book {0} : {1}
it: Non è possibile leggere Jupyter Book {0}: {1}
ja: Jupyter ブック {0} を読み取ることができませんでした: {1}
ko: Jupyter Book {0}을(를) 읽지 못했습니다. {1}
pt_br: Falha ao ler o Livro Jupyter {0}: {1}
ru: Не удалось прочитать книгу Jupyter {0}: {1}
zh_hans: 无法读取 Jupyter Book {0}: {1}
zh_hant: 無法讀取 Jupyter 書籍 {0}: {1}

source: Releases
es: Versiones
fr: Mises en production
it: Versioni
ja: リリース
ko: 릴리스
pt_br: Versões
ru: Выпуски
zh_hans: 版本
zh_hant: 版本

# repoUrl
source: Repository URL
es: Dirección URL del repositorio
fr: URL du dépôt
it: URL del repository
ja: リポジトリ URL
ko: 리포지토리 URL
pt_br: URL do repositório
ru: URL-адрес репозитория
zh_hans: 存储库 URL
zh_hant: 存放庫 URL

source: Save location
de: Speicherort
es: Guardar ubicación
fr: Emplacement d'enregistrement
it: Salva posizione
ja: 保存場所
ko: 저장 위치
pt_br: Salvar localização
ru: Расположение сохранения
zh_hans: 保存位置
zh_hant: 儲存位置

source: Search
de: Suchen
es: Buscar
fr: Recherche
it: Cerca
ja: 検索
ko: 검색
pt_br: Pesquisar
ru: Поиск
zh_hans: 搜索
zh_hant: 搜尋

# sectionNotFound
source: Failed to find section {0} in {1}.
de: Der Abschnitt "{0}" wurde in "{1}" nicht gefunden.
es: No se pudo encontrar la sección {0} en {1}.
fr: Échec de la recherche des sections {0} dans {1}.
it: Non è stato possibile trovare {0} in {1}.
ja: {1} にセクション {0} が見つかりませんでした。
ko: {1}에서 {0} 섹션을 찾지 못했습니다.
pt_br: Falha ao localizar a seção {0} em {1}.
ru: Не найден раздел {0} в {1}.
zh_hans: 找不到 {1} 中的 {0} 部分。
zh_hant: 在 {1} 中找不到區段 {0}。

# selectBookError
source: Error while selecting a Jupyter Book or a section to edit: {0}
de: Fehler beim Auswählen eines Jupyter Books oder eines Abschnitts zur Bearbeitung: {0}
es: Error al seleccionar un libro de Jupyter o una sección para editarlo: {0}.
fr: Erreur pendant la sélection d'un Jupyter Book ou d'une section à modifier : {0}
it: Si è verificato un errore durante la selezione di un Jupyter Book o di una sezione da modificare: {0}
ja: 編集する Jupyter ブックまたはセクションの選択中にエラーが発生しました: {0}
ko: Jupyter Book 또는 편집할 섹션을 선택하는 동안 오류 발생: {0}
pt_br: Erro ao selecionar um Livro Jupyter ou uma seção para editar: {0}
ru: Ошибка при выборе книги Jupyter или раздела для изменения: {0}
zh_hans: 选择要编辑的 Jupyter Book 或部分时出错: {0}
zh_hant: 選取要編輯的 Jupyter 書籍或章節時發生錯誤: {0}

source: Title
de: Titel
es: Título
fr: Titre
it: Titolo
ja: タイトル
ko: 제목
pt_br: Título
ru: Название
zh_hans: 标题
zh_hant: 標題

source: URL
es: Dirección URL
ru: URL-адрес

# urlGithubError
source: The url provided is not a Github release url
de: Die angegebene URL ist keine GitHub-Release-URL.
es: La dirección URL proporcionada no es la URL de una versión de GitHub.
fr: L'URL fournie n'est pas une URL de mise en production GitHub
it: L'URL specificato non è un URL di una versione di GitHub
ja: 指定された URL は Github リリース URL ではありません
ko: 제공된 URL은 GitHub 릴리스 URL이 아닙니다.
pt_br: A URL fornecida não é uma URL de versão do Github
ru: Указанный URL-адрес не является URL-адресом выпуска GitHub
zh_hans: 提供的 URL 不是 Github 发布 URL
zh_hant: 提供的 URL 並非 Github 版本 URL

source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本

# noNotebookVisible
source: No notebook editor is active
de: Es ist kein Notebook-Editor aktiv.
es: Ningún editor de cuadernos está activo
fr: Aucun éditeur de notebook actif
it: Non ci sono editor di notebook attivi
ja: アクティブなノートブック エディターがありません
ko: Notebook 편집기가 활성 상태가 아님
pt_br: Não há nenhum editor de notebook ativo
ru: Нет активного редактора записных книжек
zh_hans: 没有笔记本编辑器处于活动状态
zh_hant: 沒有任何正在使用的筆記本編輯器

# notebookFiles
source: Notebooks
es: Cuadernos
it: Notebook
ja: ノートブック
ko: Notebook
ru: Записные книжки
zh_hans: 笔记本

# ensureDirOutputMsg
source: ... Ensuring {0} exists
de: ... Es wird sichergestellt, dass "{0}" vorhanden ist.
es: ... Se está comprobando que {0} existe.
fr: ...Vérification de l'existence de {0}
it: ...Verifica dell'esistenza di {0}
ja: ... {0} が存在することを確認しています
ko: ... {0}이(가) 있는지 확인
pt_br: ... Verificando se {0} existe
ru: … Проверка наличия {0}
zh_hans: ...确保 {0} 存在
zh_hant: ...正在確認 {0} 存在

# executeCommandProcessExited
source: Process exited with error code: {0}. StdErr Output: {1}
de: Der Prozess wurde beendet. Fehlercode: {0}. StdErr-Ausgabe: {1}
es: El proceso se ha cerrado con el código de error {0}. Salida de StdErr: {1}.
fr: Le processus s'est terminé avec le code d'erreur : {0}, sortie StdErr : {1}
it: Il processo è stato chiuso con codice errore: {0}. Output di StdErr: {1}
ja: プロセスがエラー コード {0} で終了しました。StdErr 出力: {1}
ko: 프로세스가 종료되었습니다(오류 코드: {0}). StdErr 출력: {1}
pt_br: O processo foi encerrado com o código de erro: {0}. Saída de StdErr: {1}
ru: Процесс завершил работу с кодом ошибки: {0}, выходные данные StdErr: {1}
zh_hans: 进程已退出，错误代码为: {0}。StdErr 输出: {1}
zh_hant: 處理序已結束。錯誤碼: {0}。StdErr 輸出: {1}

# configurePython.browseButtonText
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
pt_br: Procurar
ru: Обзор
zh_hans: 浏览
zh_hant: 瀏覽

# configurePython.descriptionWithKernel
source: The '{0}' kernel requires a Python runtime to be configured and dependencies to be installed.
es: El kernel de "{0}" requiere que se configure un entorno de ejecución de Python y que se instalen dependencias.
fr: Le noyau ’{0}’ nécessite la configuration d'un runtime Python et l'installation de dépendances.
ja: '{0}' カーネルにって、Python ランタイムを構成し、依存関係をインストールする必要があります。
ko: ‘{0}’ 커널을 사용하려면 Python 런타임을 구성하고 종속성을 설치해야 합니다.
pt_br: O kernel '{0}' exige que um runtime do Python seja configurado e as dependências sejam instaladas.
ru: Для ядра "{0}" требуется настроить среду выполнения Python и установить зависимости.

# configurePython.descriptionWithoutKernel
source: Notebook kernels require a Python runtime to be configured and dependencies to be installed.
de: Für Notebook-Kernel ist die Konfiguration einer Python-Runtime und die Installation von Abhängigkeiten erforderlich.
es: Los kernel del cuaderno requieren que se configure un entorno de ejecución de Python y que se instalen dependencias.
fr: Les noyaux de notebook nécessitent la configuration d'un runtime Python et l'installation de dépendances.
it: I kernel dei notebook richiedono la configurazione di un runtime Python e l'installazione delle dipendenze.
ja: Notebook カーネルには、Python ランタイムが構成され、依存関係がインストールされている必要があります。
ko: Notebook 커널에서는 Python 런타임을 구성하고 종속성을 설치해야 합니다.
pt_br: Os kernels do Notebook exigem que o runtime do Python seja configurado e as dependências sejam instaladas.
ru: Для ядер записных книжек требуется настроить среду выполнения Python и установить зависимости.
zh_hans: 笔记本内核要求配置 Python 运行时并安装依赖项。
zh_hant: Notebook 核心需要設定 Python 執行階段並安裝相依性。

# configurePython.existingInstall
source: Use existing Python installation
de: Vorhandene Python-Installation verwenden
es: Usar la instalación de Python existente
fr: Utiliser l'installation existante de Python
it: Usa l'installazione esistente di Python
ja: 既存の Python インストールを使用する
ko: 기존 Python 설치 사용
pt_br: Usar a instalação existente do Python
ru: Использовать существующую установку Python
zh_hans: 使用现有 Python 安装
zh_hant: 使用現有的 Python 安裝

# configurePython.installationType
source: Installation Type
de: Installationstyp
es: Tipo de instalación
fr: Type d'installation
it: Tipo di installazione
ja: インストールの種類
ko: 설치 유형
pt_br: Tipo de Instalação
ru: Тип установки
zh_hans: 安装类型
zh_hant: 安裝類型

# configurePython.locationTextBoxText
source: Python Install Location
de: Python-Installationsspeicherort
es: Ubicación de la instalación de Python
fr: Emplacement d'installation de Python
it: Percorso di installazione di Python
ja: Python のインストール場所
ko: Python 설치 위치
pt_br: Localização da Instalação do Python
ru: Расположение установки Python
zh_hans: Python 安装位置
zh_hant: Python 安裝位置

# configurePython.newInstall
source: New Python installation
de: Neue Python-Installation
es: Nueva instalación de Python
fr: Nouvelle installation de Python
it: Nuova installazione di Python
ja: 新しい Python インストール
ko: 새 Python 설치
pt_br: Nova instalação do Python
ru: Новая установка Python
zh_hans: 新 Python 安装
zh_hant: 新增 Python 安裝

# configurePython.pythonConfigured
source: Python runtime configured!
de: Python-Runtime konfiguriert!
es: El entorno de ejecución de Python se ha configurado.
fr: Runtime python configuré !
it: Il runtime Python è stato configurato.
ja: Python ランタイムが構成されました!
ko: Python 런타임이 구성되었습니다.
pt_br: Runtime do Python configurado.
ru: Среда выполнения Python настроена.
zh_hans: Python 运行时已配置!
zh_hant: 已設定 Python 執行階段!

# configurePython.selectFileLabel
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

# configurePythyon.customPathLabel
source: {0} (Custom)
de: {0} (Benutzerdefiniert)
es: {0} (personalizada)
fr: {0} (Personnalisé)
it: {0} (Personalizzato)
ja: {0} (カスタム)
ko: {0}(사용자 지정)
pt_br: {0} (Personalizado)
ru: {0} (пользовательский)
zh_hans: {0} (自定义)
zh_hant: {0} (自訂)

# configurePythyon.defaultPathLabel
source: {0} (Default)
de: {0} (Standard)
es: {0} (predeterminada)
fr: {0} (Par défaut)
it: {0} (Predefinito)
ja: {0} (既定値)
ko: {0}(기본값)
pt_br: {0} (Padrão)
ru: {0} (по умолчанию)
zh_hans: {0} (默认)
zh_hant: {0} (預設)

# configurePythyon.noVersionsFound
source: No supported Python versions found.
de: Keine unterstützten Python-Versionen gefunden.
es: No se ha encontrado ninguna versión de Python compatible.
fr: Aucune version de Python prise en charge.
it: Non sono state trovate versioni Python supportate.
ja: サポートされている Python バージョンが見つかりません。
ko: 지원되는 Python 버전을 찾을 수 없습니다.
pt_br: Não foram encontradas versões do Python com suporte.
ru: Поддерживаемые версии Python не найдены.
zh_hans: 找不到支持的 Python 版本。
zh_hant: 找不到支援的 Python 版本。

# configurePython.invalidLocationMsg
source: The specified install location is invalid.
de: Der angegebene Installationsspeicherort ist ungültig.
es: La ubicación de instalación especificada no es válida.
fr: L'emplacement d'installation spécifié n'est pas valide.
it: Il percorso di installazione specificato non è valido.
ja: 指定されたインストール場所が無効です。
ko: 지정된 설치 위치가 잘못되었습니다.
pt_br: O local de instalação especificado é inválido.
ru: Указано недопустимое расположение установки.
zh_hans: 指定的安装位置无效。
zh_hant: 指定的安裝位置無效。

# configurePython.okButtonText
source: Install
de: Installieren
es: Instalar
fr: Installer
it: Installa
ja: インストール
ko: 설치
pt_br: Instalar
ru: Установить
zh_hans: 安装
zh_hant: 安裝

# configurePython.page0Name
source: Configure Python Runtime
de: Python-Runtime konfigurieren
es: Configurar entorno de ejecución de Python
fr: Configurer le runtime Python
it: Configura runtime Python
ja: Python ランタイムの構成
ko: Python 런타임 구성
pt_br: Configurar Runtime do Python
ru: Настройка среды выполнения Python
zh_hans: 配置 Python 运行时
zh_hant: 設定 Python 執行階段

# configurePython.page1Name
source: Install Dependencies
de: Abhängigkeiten installieren
es: Instalar dependencias
fr: Installer les dépendances
it: Installa dipendenze
ja: 依存関係のインストール
ko: 종속성 설치
pt_br: Instalar Dependências
ru: Установка зависимостей
zh_hans: 安装依赖项
zh_hant: 安裝相依性

# configurePython.pythonInstallDeclined
source: Python installation was declined.
de: Die Python-Installation wurde abgelehnt.
es: La instalación de Python se rechazó.
fr: L'installation de Python a été refusée.
it: L'installazione di Python è stata rifiutata.
ja: Python のインストールが拒否されました。
ko: Python 설치가 거부되었습니다.
pt_br: A instalação do Python foi recusada.
ru: Установка Python была отклонена.
zh_hans: Python 安装被拒绝。
zh_hant: Python 安裝已遭拒。

# configurePython.pythonNotFoundMsg
source: No Python installation was found at the specified location.
de: Am angegebenen Speicherort wurde keine Python-Installation gefunden.
es: No se encuentra ninguna instalación de Python en la ubicación especificada.
fr: Aucune installation de Python à l'emplacement spécifié.
it: Non è stata trovata alcuna installazione di Python nel percorso specificato.
ja: 指定された場所に Python インストールが見つかりませんでした。
ko: 지정된 위치에서 Python 설치를 찾을 수 없습니다.
pt_br: Não foi encontrada nenhuma instalação do Python na localização especificada.
ru: Установка Python не найдена в указанном расположении.
zh_hans: 在指定位置找不到 Python 安装。
zh_hant: 在指定的位置找不到任何 Python 安裝。

# configurePython.wizardNameWithKernel
source: Configure Python to run {0} kernel
de: Python für die Ausführung von {0}-Kernel konfigurieren
es: Configurar Python para ejecutar {0} kernel
fr: Configurer Python pour exécuter le noyau {0}
it: Configura Python per l'esecuzione del kernel {0}
ja: {0} カーネルを実行するように Python を構成する
ko: {0} 커널을 실행하도록 Python 구성
pt_br: Configurar o Python para executar o kernel {0}
ru: Настройка Python для запуска ядра {0}
zh_hans: 配置 Python 以运行 {0} 内核
zh_hant: 將 Python 設定為執行 {0} 核心

# configurePython.wizardNameWithoutKernel
source: Configure Python to run kernels
de: Python für die Ausführung von Kerneln konfigurieren
es: Configurar Python para ejecutar kernels
fr: Configurer Python pour exécuter les noyaux
it: Configura Python per l'esecuzione dei kernel
ja: カーネルを実行するように Python を構成する
ko: 커널을 실행하도록 Python 구성
pt_br: Configurar o Python para executar kernels
ru: Настройка Python для запуска ядер
zh_hans: 配置 Python 以运行内核
zh_hant: 將 Python 設定為執行核心

# configurePython.existingVersionColumn
source: Existing Version
de: Vorhandene Version
es: Versión existente
fr: Version existante
it: Versione esistente
ja: 既存のバージョン
ko: 기존 버전
pt_br: Versão Existente
ru: Существующая версия
zh_hans: 现有版本
zh_hant: 現有的版本

# configurePython.kernelLabel
source: Kernel
fr: Noyau
ja: カーネル
ko: 커널
ru: Ядро
zh_hans: 内核
zh_hant: 核心

# configurePython.pkgNameColumn
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# configurePython.requiredDependencies
source: Install required kernel dependencies
de: Erforderliche Kernelabhängigkeiten installieren
es: Instalar dependencias de kernel necesarias
fr: Installer les dépendances de noyau nécessaires
it: Installa dipendenze del kernel richieste
ja: 必要なカーネルの依存関係のインストール
ko: 필요한 커널 종속성 설치
pt_br: Instalar dependências do kernel obrigatórias
ru: Установка необходимых зависимостей ядра
zh_hans: 安装所需的内核依赖项
zh_hant: 安裝必要的核心相依性

# configurePython.requiredVersionColumn
source: Required Version
de: Erforderliche Version
es: Versión necesaria
fr: Version obligatoire
it: Versione richiesta
ja: 必要なバージョン
ko: 필요한 버전
pt_br: Versão Obrigatória
ru: Требуемая версия
zh_hans: 所需版本
zh_hant: 所需版本

# msgNoRequirementsForKernel
source: No packages are required by default for the kernel '{0}'
es: No se requiere ningún paquete de forma predeterminada para el kernel "{0}".
fr: Aucun package n’est requis par défaut pour le noyau « {0} ».
ja: 既定では、カーネル '{0}' にはパッケージは必要ありません
ko: '{0}' 커널에는 기본적으로 패키지가 필요하지 않습니다.
pt_br: Nenhum pacote é exigido por padrão para o kernel '{0}'
ru: По умолчанию пакеты не требуются для ядра "{0}".

# managePackages.addNewTabTitle
source: Add new
de: Neu hinzufügen
es: Añadir nuevos
fr: Ajouter un nouveau
it: Aggiungi nuovo
ja: 新規追加
ko: 새로 추가
pt_br: Adicionar novo
ru: Добавить новый
zh_hans: 新增
zh_hant: 新增

# managePackages.backgroundInstallComplete
source: Completed install for {0} {1}
de: Die Installation für {0} {1} wurde abgeschlossen.
es: Instalación completada para {0} {1}
fr: Installation de {0} {1} effectuée
it: Installazione completata per {0} {1}
ja: {0} のインストールが完了しました {1}
ko: {0} {1} 설치 완료
pt_br: Instalação concluída para {0} {1}
ru: Завершена установка для {0} {1}
zh_hans: {0} 已安装完毕
zh_hant: 已完成 {0} {1} 的安裝

# managePackages.backgroundInstallFailed
source: Failed to install {0} {1}. Error: {2}
de: Fehler beim Installieren von {0} {1}. Fehler: {2}
es: No se pudo instalar {0} {1}. Error: {2}
fr: L'installation de {0} {1} a échoué. Erreur : {2}
it: Non è stato possibile installare {0} {1}. Errore: {2}
ja: {0} のインストールに失敗しました {1} エラー: {2}
ko: {0} {1}을(를) 설치하지 못했습니다. 오류: {2}
pt_br: Falha ao instalar {0} {1}. Erro: {2}
ru: Не удалось установить {0} {1}. Ошибка: {2}
zh_hans: 未能安装 {0} {1}。错误: {2}
zh_hant: 無法安裝 {0} {1}。錯誤: {2}

# managePackages.backgroundInstallStarted
source: Installing {0} {1}
de: {0} {1} wird installiert.
es: Instalando {0} {1}
fr: Installation de {0} {1}
it: Installazione di {0} {1}
ja: {0} をインストールしています {1}
ko: {0} {1} 설치 중
pt_br: Instalando {0} {1}
ru: Идет установка {0} {1}
zh_hans: 正在安装 {0} {1}
zh_hant: 正在安裝 {0} {1}

# managePackages.installButtonText
source: Install
de: Installieren
es: Instalar
fr: Installer
it: Installa
ja: インストール
ko: 설치
pt_br: Instalar
ru: Установить
zh_hans: 安装
zh_hant: 安裝
