Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/notebook.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# managePackages.invalidTextPlaceholder
source: N/A
de: N/V
es: N/D
it: N/D
ja: 該当なし
ko: 해당 없음
pt_br: N/D
ru: Н/Д
zh_hans: 不适用

# managePackages.noVersionsFound
source: Could not find any valid versions for the specified package
de: Für das angegebene Paket wurden keine gültigen Versionen gefunden.
es: No se pudo encontrar ninguna versión válida para el paquete especificado
fr: Les versions valides du package spécifié sont introuvables
it: Non è stato possibile trovare alcuna versione valida per il pacchetto specificato
ja: 指定されたパッケージの有効なバージョンが見つかりませんでした
ko: 지정된 패키지의 유효한 버전을 찾을 수 없습니다.
pt_br: Não foi possível localizar nenhuma versão válida para o pacote especificado
ru: Не удалось найти допустимые версии для указанного пакета
zh_hans: 未找到指定包的任何有效版本
zh_hant: 無法為指定的套件找到任何有效版本

# managePackages.packageNameTitle
source: Package Name
de: Paketname
es: Nombre del paquete
fr: Nom du package
it: Nome del pacchetto
ja: パッケージ名
ko: 패키지 이름
pt_br: Nome do Pacote
ru: Имя пакета
zh_hans: 包名称
zh_hant: 套件名稱

# managePackages.packageSummaryTitle
source: Package Summary
de: Paketzusammenfassung
es: Resumen del paquete
fr: Récapitulatif du package
it: Riepilogo del pacchetto
ja: パッケージの概要
ko: 패키지 요약
pt_br: Resumo do Pacote
ru: Сводка пакета
zh_hans: 包摘要
zh_hant: 套件摘要

# managePackages.packageVersionTitle
source: Package Version
de: Paketversion
es: Versión de paquete
fr: Version du package
it: Versione del pacchetto
ja: パッケージ バージョン
ko: 패키지 버전
pt_br: Versão do Pacote
ru: Версия пакета
zh_hans: 包版本
zh_hant: 套件版本

# managePackages.searchBarPlaceholder
source: Search {0} packages
de: {0} Pakete durchsuchen
es: Buscar {0} paquetes
fr: Rechercher dans les packages {0}
it: Cerca nei pacchetti di {0}
ja: {0} パッケージを検索します
ko: {0} 패키지 검색
pt_br: Pesquisar pacotes {0}
ru: Поиск пакетов: {0}
zh_hans: 搜索 {0} 包
zh_hant: 搜尋 {0} 個套件

# managePackages.searchButtonLabel
source: Search
de: Suchen
es: Buscar
fr: Recherche
it: Cerca
ja: 検索
ko: 검색
pt_br: Pesquisar
ru: Поиск
zh_hans: 搜索
zh_hant: 搜尋

# managePackages.backgroundUninstallComplete
source: Completed uninstall for {0}
de: Die Deinstallation für "{0}" wurde abgeschlossen.
es: Desinstalación completada para {0}
fr: Désinstallation effectuée pour {0}
it: Disinstallazione completata per {0}
ja: {0} のアンインストールが完了しました
ko: {0}의 제거를 완료했습니다.
pt_br: Desinstalação concluída para {0}
ru: Завершено удаление для {0}
zh_hans: {0} 已卸载完毕
zh_hant: 已解除安裝 {0}

# managePackages.backgroundUninstallFailed
source: Failed to uninstall {0}. Error: {1}
de: Fehler beim Deinstallieren von "{0}". Fehler: {1}
es: No se ha podido desinstalar {0}. Error: {1}
fr: La désinstallation de {0} a échoué. Erreur : {1}
it: Non è stato possibile disinstallare {0}. Errore: {1}.
ja: {0} をアンインストールできませんでした。エラー: {1}
ko: {0}을(를) 제거하지 못했습니다. 오류: {1}
pt_br: Falha ao desinstalar {0}. Erro: {1}
ru: Не удалось удалить {0}. Ошибка: {1}
zh_hans: 未能卸载 {0}。错误: {1}
zh_hant: 無法將 {0} 解除安裝。錯誤: {1}

# managePackages.backgroundUninstallStarted
source: Uninstalling {0}
de: "{0}" wird deinstalliert.
es: Desinstalando {0}
fr: Désinstallation de {0}
it: Disinstallazione di {0}
ja: {0} をアンインストールしています
ko: {0} 제거 중
pt_br: Desinstalando {0}
ru: Идет удаление {0}
zh_hans: 正在卸载 {0}
zh_hant: 正在將 {0} 解除安裝

# managePackages.confirmUninstall
source: Are you sure you want to uninstall the specified packages?
de: Möchten Sie die angegebenen Pakete deinstallieren?
es: ¿Está seguro de que desea desinstalar los paquetes especificados?
fr: Voulez-vous vraiment désinstaller les packages spécifiés ?
it: Disinstallare i pacchetti specificati?
ja: 指定したパッケージをアンインストールしますか?
ko: 지정된 패키지를 제거하시겠습니까?
pt_br: Tem certeza de que deseja desinstalar os pacotes especificados?
ru: Вы действительно хотите удалить указанные пакеты?
zh_hans: 确定要卸载指定的包吗?
zh_hant: 確定要將指定的套件解除安裝嗎?

# managePackages.deleteColumn
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# managePackages.installedTabTitle
source: Installed
de: Installiert
es: Instalado
fr: Installé
it: Installato
ja: インストール済み
ko: 설치됨
pt_br: Instalado
ru: Установлен
zh_hans: 已安装
zh_hant: 已安裝

# managePackages.location
source: Location
de: Speicherort
es: Ubicación
fr: Emplacement
it: Posizione
ja: 場所
ko: 위치
pt_br: Localização
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# managePackages.newPkgVersionColumn
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本

# managePackages.packageCount
source: {0} {1} packages found
de: {0} {1}-Pakete gefunden
es: Se han encontrado {0} {1} paquetes
fr: {0} {1} packages
it: {0} {1} pacchetti trovati
ja: {0} {1} パッケージが見つかりました
ko: {0} {1}개의 패키지 찾음
pt_br: {0} {1} pacotes encontrados
ru: Найдены пакеты: {0} {1}
zh_hans: 找到 {0} 个 {1} 包
zh_hant: 已找到 {0} 個 {1} 套件

# managePackages.packageType
source: Package Type
de: Pakettyp
es: Tipo de paquete
fr: Type de package
it: Tipo di pacchetto
ja: パッケージの種類
ko: 패키지 유형
pt_br: Tipo de Pacote
ru: Тип пакета
zh_hans: 包类型
zh_hant: 套件類型

# managePackages.pkgNameColumn
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# managePackages.uninstallButtonText
source: Uninstall selected packages
de: Ausgewählte Pakete deinstallieren
es: Desinstalar los paquetes seleccionados
fr: Désinstaller les packages sélectionnés
it: Disinstalla i pacchetti selezionati
ja: 選択したパッケージをアンインストールします
ko: 선택한 패키지 제거
pt_br: Desinstalar os pacotes selecionados
ru: Удалить выбранные пакеты
zh_hans: 卸载选定的包
zh_hant: 將選取的套件解除安裝

# managePackages.cancelButtonText
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# managePackages.dialogName
source: Manage Packages
de: Pakete verwalten
es: Administrar paquetes
fr: Gérer les packages
it: Gestisci pacchetti
ja: パッケージの管理
ko: 패키지 관리
pt_br: Gerenciar Pacotes
ru: Управление пакетами
zh_hans: 管理包
zh_hant: 管理套件

# codeCellName
source: Code
es: Código
it: Codice
ja: コード
ko: 코드
pt_br: Código
ru: Код
zh_hans: 代码
zh_hant: 程式碼

# selectCellType
source: What type of cell do you want to add?
de: Welche Art von Zelle möchten Sie hinzufügen?
es: ¿Qué tipo de celda desea agregar?
fr: Quel type de cellule voulez-vous ajouter ?
it: Indicare il tipo di cella da aggiungere:
ja: 追加するセルの種類を指定してください
ko: 어떤 유형의 셀을 추가하시겠습니까?
pt_br: Que tipo de célula você deseja adicionar?
ru: Какой тип ячейки требуется добавить?
zh_hans: 要添加哪种类型的单元格?
zh_hant: 您要新增什麼類型的資料格?

# textCellName
source: Text
es: Texto
fr: Texte
it: Testo
ja: テキスト
ko: 텍스트
pt_br: Texto
ru: Текст
zh_hans: 文本
zh_hant: 文字

# confirmReinstall
source: Are you sure you want to reinstall?
de: Möchten Sie eine Neuinstallation durchführen?
es: ¿Está seguro de que desea volver a instalar?
fr: Voulez-vous vraiment le réinstaller ?
it: Reinstallare?
ja: 再インストールしますか?
ko: 다시 설치하시겠습니까?
pt_br: Tem certeza de que deseja reinstalar?
ru: Вы действительно хотите выполнить переустановку?
zh_hans: 确定要重新安装吗?
zh_hant: 確定要重新安裝嗎?

# notebookFileType
source: Notebooks
ja: ノートブック
ko: Notebook
ru: Записные книжки
zh_hans: 笔记本

# unsupportedFileType
source: Only .ipynb Notebooks are supported
de: Es werden nur IPYNB-Notebooks unterstützt.
es: Solo se admiten los Notebooks de tipo .ipynb
fr: Seuls les notebooks .ipynb sont pris en charge
it: Sono supportati solo notebook con estensione ipynb
ja: .ipynb ノートブックのみがサポートされています
ko: .ipynb Notebook만 지원됩니다.
pt_br: Somente os Notebooks .ipynb são compatíveis
ru: Поддерживаются только записные книжки IPYNB
zh_hans: 仅支持 .ipynb 笔记本
zh_hant: 僅支援 .ipynb Notebooks

# errNotebookUriMissing
source: A notebook path is required
de: Ein Notebook-Pfad ist erforderlich.
es: Se requiere una ruta de acceso del cuaderno
fr: Le chemin du notebook est obligatoire
it: È necessario specificare un percorso di notebook
ja: ノートブック パスが必須です
ko: Notebook 경로는 필수입니다.
pt_br: É necessário um caminho de notebook
ru: Требуется путь к записной книжке
zh_hans: 需要笔记本路径
zh_hant: 筆記本路徑為必要項

source: Don't Ask Again
de: Nicht mehr fragen
es: No volver a preguntar
fr: Ne plus me poser la question
it: Non chiedere più
ja: 今後このメッセージを表示しない
ko: 다시 묻지 않음
pt_br: Não perguntar novamente
ru: Больше не спрашивать
zh_hans: 不再询问
zh_hant: 不要再詢問

# msgDependenciesInstallationFailed
source: Installing Notebook dependencies failed with error: {0}
de: Fehler beim Installieren von Notebook-Abhängigkeiten: {0}
es: Error al instalar las dependencias de Notebook: {0}
fr: L'installation des dépendances de notebook a échoué avec l'erreur : {0}
it: L'installazione delle dipendenze di Notebook non è riuscita. Errore: {0}
ja: Notebook 依存関係のインストールに失敗しました。エラー: {0}
ko: 오류: {0}(을) 나타내며 Notebook 종속성 설치에 실패했습니다.
pt_br: Falha na instalação das dependências do Notebook com o erro: {0}
ru: Установка зависимостей Notebook завершилась с ошибкой: {0}
zh_hans: 安装笔记本依赖项失败，错误: {0}
zh_hant: 安裝 Notebook 相依性失敗。錯誤: {0}

# msgDownloadPython
source: Downloading local python for platform: {0} to {1}
de: Lokales Python für die Plattform "{0}" wird nach "{1}" heruntergeladen.
es: Descargando Python local para la plataforma: {0} a {1}
fr: Téléchargement de la version locale de Python pour la plateforme : {0} dans {1}
it: Download della versione locale di Python per la piattaforma {0} in {1}
ja: {0} から {1} にプラットフォーム用のローカル Python をダウンロードしています
ko: {0} 플랫폼용 로컬 python을 {1}(으)로 다운로드하는 중
pt_br: Baixando o Python local para a plataforma: {0} a {1}
ru: Скачивание локального Python для платформы: {0} в {1}
zh_hans: 正在将平台 {0} 的本地 python 下载到 {1}
zh_hant: 正在將平台的本機 python: {0} 下載至 {1}

# msgGetPythonUserDirFailed
source: Encountered an error when getting Python user path: {0}
de: Fehler beim Abrufen des Python-Benutzerpfads: {0}
es: Se ha encontrado un error al obtener la ruta de acceso del usuario de Python: {0}
fr: Erreur pendant l'obtention du chemin de l'utilisateur Python : {0}
it: Si è verificato un errore durante il recupero del percorso utente di Python: {0}
ja: Python ユーザー パスの取得時にエラーが発生しました: {0}
ko: Python 사용자 경로를 가져올 때 오류가 발생했습니다. {0}
pt_br: Foi encontrado um erro ao obter o caminho do usuário do Python: {0}
ru: Обнаружена ошибка при получении пути пользователя Python: {0}
zh_hans: 获取 Python 用户路径时遇到错误: {0}
zh_hant: 取得 Python 使用者路徑時發生錯誤: {0}

# msgInstallPkgFinish
source: Notebook dependencies installation is complete
de: Die Installation von Notebook-Abhängigkeiten ist abgeschlossen.
es: La instalación de las dependencias de Notebook se ha completado
fr: L'installation des dépendances de notebook est terminée
it: L'installazione delle dipendenze di Notebook è stata completata
ja: Notebook 依存関係のインストールが完了しました
ko: Notebook 종속성 설치를 완료했습니다.
pt_br: A instalação das dependências do Notebook está concluída
ru: Установка зависимостей Notebook завершена
zh_hans: 笔记本依赖项安装完毕
zh_hant: Notebook 相依性安裝完成

# msgInstallPkgProgress
source: Notebook dependencies installation is in progress
de: Notebook-Abhängigkeiten werden installiert.
es: La instalación de dependencias de Notebook está en curso
fr: L'installation des dépendances de notebook est en cours
it: L'installazione delle dipendenze di Notebook è in corso
ja: Notebook 依存関係のインストールが進行中です
ko: Notebook 종속성 설치가 진행 중입니다.
pt_br: A instalação de dependências do Notebook está em andamento
ru: Выполняется установка зависимостей Notebook
zh_hans: 正在安装笔记本依赖项
zh_hant: 正在安裝 Notebook 相依性

# msgInstallPkgStart
source: Installing Notebook dependencies, see Tasks view for more information
de: Notebook-Abhängigkeiten werden installiert. Weitere Informationen finden Sie in der Aufgabenansicht.
es: Instalando dependencias de Notebook, consulte la vista Tareas para obtener más información
fr: Installation des dépendances de notebook, consultez la vue Tâches pour plus d'informations
it: Installazione delle dipendenze di Notebook. Per altre informazioni, vedere la visualizzazione attività
ja: Notebook 依存関係のインストールについて詳しくは、[タスク ビュー] を参照してください
ko: Notebook 종속성을 설치하는 중입니다. 자세한 내용은 작업 보기를 참조하세요.
pt_br: Instalando as dependências do Notebook. Confira a exibição Tarefas para obter mais informações
ru: Идет установка зависимостей Notebook, дополнительные сведения см. в представлении задач
zh_hans: 正在安装笔记本依赖项；有关详细信息，请参阅“任务”视图
zh_hant: 正在安裝 Notebook 相依性，請參閱 [工作] 檢視以取得詳細資訊

# msgPackageRetrievalFailed
source: Encountered an error when trying to retrieve list of installed packages: {0}
de: Fehler beim Abrufen der Liste installierter Pakete: {0}
es: Se ha encontrado un error al intentar recuperar la lista de paquetes instalados: {0}
fr: Erreur pendant la tentative de récupération de la liste des packages installés : {0}
it: Si è verificato un errore durante il tentativo di recuperare l'elenco dei pacchetti installati: {0}
ja: インストールされているパッケージの一覧を取得しようとしてエラーが発生しました: {0}
ko: 설치된 패키지 목록을 검색하는 동안 오류가 발생했습니다. {0}
pt_br: Foi encontrado um erro ao tentar recuperar a lista de pacotes instalados: {0}
ru: Произошла ошибка при попытке получить список установленных пакетов: {0}
zh_hans: 尝试检索已安装的包列表时遇到错误: {0}
zh_hant: 嘗試擷取已安裝套件的清單時發生錯誤: {0}

# msgPythonDirectoryError
source: Error while creating python installation directory
de: Fehler beim Erstellen des Python-Installationsverzeichnisses.
es: Error al crear el directorio de instalación de Python
fr: Erreur de création du répertoire d'installation de Python
it: Si è verificato un errore durante la creazione della directory di installazione di Python
ja: Python インストール ディレクトリの作成中にエラーが発生しました
ko: Python 설치 디렉터리를 만드는 동안 오류가 발생했습니다.
pt_br: Erro ao criar o diretório de instalação do Python
ru: Ошибка при создании каталога установки Python
zh_hans: 创建 python 安装目录时出错
zh_hant: 建立 python 安裝目錄時發生錯誤

# msgPythonDownloadComplete
source: Python download is complete
de: Der Python-Download ist abgeschlossen.
es: La descarga de Python está completa
fr: Le téléchargement de Python est terminé
it: Il download di Python è stato completato
ja: Python のダウンロードが完了しました
ko: Python 다운로드가 완료되었습니다.
pt_br: O download do Python está concluído
ru: Скачивание Python завершено
zh_hans: Python 下载完毕
zh_hant: Python 下載完成

# msgPythonDownloadError
source: Error while downloading python setup
de: Fehler beim Herunterladen des Python-Setups.
es: Error al descargar la configuración de Python
fr: Erreur de téléchargement du programme d'installation de Python
it: Si è verificato un errore durante il download della configurazione di Python
ja: Python セットアップのダウンロード中にエラーが発生しました
ko: Python 설정을 다운로드하는 동안 오류가 발생했습니다.
pt_br: Erro ao baixar a configuração do Python
ru: Ошибка при скачивании программы установки Python
zh_hans: 下载 python 安装程序时出错
zh_hant: 下載 python 設定時發生錯誤

# msgPythonDownloadPending
source: Downloading python package
de: Das Python-Paket wird heruntergeladen.
es: Descargando paquete de Python
fr: Téléchargement du package Python
it: Download del pacchetto Python
ja: Python パッケージをダウンロードしています
ko: Python 패키지 다운로드 중
pt_br: Baixando o pacote Python
ru: Идет скачивание пакета Python
zh_hans: 正在下载 python 包
zh_hant: 正在下載 python 套件

# msgPythonRunningError
source: Cannot overwrite an existing Python installation while python is running. Please close any active notebooks before proceeding.
de: Eine vorhandene Python-Installation kann nicht überschrieben werden, während Python ausgeführt wird. Schließen Sie alle aktiven Notebooks, bevor Sie fortfahren.
es: No se puede sobrescribir una instalación de Python existente mientras Python se está ejecutando. Cierre los cuadernos activos antes de continuar.
fr: Impossible de remplacer une installation Python existante quand Python est en cours d'exécution. Fermez tous les notebooks actifs avant de continuer.
it: Non è possibile sovrascrivere un'installazione esistente di Python mentre Python è in esecuzione. Chiudere gli eventuali notebook attivi prima di procedere.
ja: Python の実行中は、既存の Python インストールを上書きできません。続行する前に、アクティブなノートブックを閉じてください。
ko: Python이 실행되는 동안 기존 Python 설치를 덮어쓸 수 없습니다. 계속하기 전에 활성 Notebook을 닫으세요.
pt_br: Não é possível substituir uma instalação do Python existente enquanto o Python está em execução. Feche todos os notebooks ativos antes de prosseguir.
ru: Не удается перезаписать существующую установку Python во время работы Python. Прежде чем продолжить, закройте все активные записные книжки.
zh_hans: 在 Python 运行时无法覆盖现有 Python 安装。请关闭所有活动笔记本，再继续操作。
zh_hant: 當 Python 正在執行時，無法覆寫現有的 Python 安裝。請先關閉所有使用中的筆記本再繼續。

# msgPythonUnpackError
source: Error while unpacking python bundle
de: Fehler beim Entpacken des Python-Pakets.
es: Error al desempaquetar el paquete de Python
fr: Erreur de décompression du bundle Python
it: Si è verificato un errore durante la decompressione del bundle di Python
ja: Python バンドルのアンパック中にエラーが発生しました
ko: Python 번들 압축을 푸는 동안 오류가 발생했습니다.
pt_br: Erro ao descompactar o pacote Python
ru: Ошибка при распаковке пакета Python
zh_hans: 解压 Python 捆绑包时出错
zh_hant: 將 python 套件組合解壓縮時發生錯誤

# msgPythonUnpackPending
source: Unpacking python package
de: Python-Paket entpacken
es: Desempaquetando paquete de Python
fr: Décompression du package Python
it: Decompressione del pacchetto Python
ja: Python パッケージをアンパックしています
ko: Python 패키지 압축을 푸는 중
pt_br: Descompactando o pacote Python
ru: Распаковка пакета Python
zh_hans: 正在解压 python 包
zh_hant: 正在解壓縮 python 套件

# msgPythonVersionUpdatePrompt
source: Python {0} is now available in Azure Data Studio. The current Python version (3.6.6) will be out of support in December 2021. Would you like to update to Python {0} now?
de: Python {0} ist jetzt in Azure Data Studio verfügbar. Die aktuelle Python-Version (3.6.6) wird ab Dezember 2021 nicht mehr unterstützt. Möchten Sie jetzt auf Python {0} aktualisieren?
es: Python {0} ya está disponible en Azure Data Studio. La versión actual de Python (3.6.6) dejará de recibir soporte en diciembre de 2021. ¿Le gustaría actualizar a Python {0} ahora?
fr: Python {0} est désormais disponible dans Azure Data Studio. La version actuelle de Python (3.6.6) n’est plus prise en charge en décembre 2021. Voulez-vous effectuer une mise à jour vers python {0} maintenant ?
it: Python {0} è ora disponibile in Azure Data Studio. La versione corrente di Python (3.6.6) non sarà supportata da dicembre 2021. Eseguire ora l'aggiornamento a Python {0} ?
ja: Python {0} が Azure Data Studio で利用できるようになりました。現在の Python バージョン (3.6.6) は、2021 年 12 月にサポートされなくなります。今すぐ Python {0} に更新しますか?
ko: 이제 python {0}에서 Azure Data Studio를 사용할 수 있습니다. 현재 Python 버전(3.6.6)은 2021년 12월에 지원되지 않습니다. 지금 Python {0}을(를) 업데이트하시겠습니까?
pt_br: O Python {0} agora está disponível no Azure Data Studio. A versão atual do Python (3.6.6) estará sem suporte em dezembro de 2021. Deseja atualizar para o Python {0} agora?
ru: {0} Python доступна в Azure Data Studio. Текущая версия Python (3.6.6) не поддерживается в декабре 2021. Вы хотите обновить {0} Python сейчас?
zh_hans: Python {0} 现已在 Azure Data Studio 中提供。当前 Python 版本 (3.6.6) 将于 2021 年 12 月不再受支持。是否要立即更新到 Python {0}?
zh_hant: Azure Data Studio 現已提供 Python {0}。目前的 Python 版本 (3.6.6) 將在 2021 年 12 月時取消支援。您要立即更新為 Python {0} 嗎?

# msgPythonVersionUpdateWarning
source: Python {0} will be installed and will replace Python 3.6.6. Some packages may no longer be compatible with the new version or may need to be reinstalled. A notebook will be created to help you reinstall all pip packages. Would you like to continue with the update now?
de: Python {0} wird installiert und ersetzt Python 3.6.6. Einige Pakete sind möglicherweise nicht mehr mit der neuen Version kompatibel oder müssen neu installiert werden. Ein Notizbuch wird erstellt, damit Sie alle PIP-Pakete neu installieren können. Möchten Sie das Update jetzt fortsetzen?
es: Se instalará Python {0} y reemplazará a Python 3.6.6. Es posible que algunos paquetes ya no sean compatibles con la nueva versión o que sea necesario volver a instalarlos. Se creará un cuaderno para ayudarle a reinstalar todos los paquetes de PIP. ¿Desea continuar con la actualización ahora?
fr: Python {0} sera installé et va remplacer python 3.6.6. Certains packages ne sont peut-être plus compatibles avec la nouvelle version ou doivent peut-être être réinstallés. Un bloc-notes va être créé pour vous aider à réinstaller tous les packages PIP. Voulez-vous continuer la mise à jour maintenant ?
it: Python {0} verrà installato e sostituirà Python 3.6.6. Alcuni pacchetti potrebbero non essere più compatibili con la nuova versione o potrebbero dover essere reinstallati. Verrà creato un notebook che consente di reinstallare tutti i pacchetti pip. Continuare con l'aggiornamento ora?
ja: Python {0} がインストールされ、Python 3.6.6 が置換されます。一部のパッケージは、新しいバージョンとの互換性がなくなったか、再インストールが必要になる可能性があります。すべての pip パッケージの再インストールを支援するためにノートブックが作成されます。今すぐ更新を続行しますか?
ko: Python {0}이(가) 설치되고 Python 3.6.6을 대체합니다. 일부 패키지는 더 이상 새 버전과 호환되지 않거나 다시 설치해야 할 수 있습니다. 모든 pip 패키지를 다시 설치하는 데 도움이 되는 전자 필기장이 만들어집니다. 지금 업데이트를 계속하시겠습니까?
pt_br: O Python {0} será instalado e substituirá o Python 3.6.6. Alguns pacotes podem não ser mais compatíveis com a nova versão ou talvez precisem ser reinstalados. Um bloco de anotações será criado para ajudá-lo a reinstalar todos os pacotes pip. Deseja continuar com a atualização agora?
ru: Будет установлен {0} Python, который заменит 3.6.6 Python. Некоторые пакеты могут быть несовместимы с новой версией или требуют переустановки. Будет создана Записная книжка, которая поможет вам переустановить все пакеты PIP. Вы хотите продолжить обновление сейчас?
zh_hans: 将安装 Python {0} ，并将替换 Python 3.6.6。某些包可能不再与新版本兼容，或者可能需要重新安装。将创建一个笔记本来帮助你重新安装所有 pip 包。是否要立即继续更新?
zh_hant: 將安裝 Python {0} 並取代 Python 3.6.6。某些套件可能不再與新版本相容，或可能需要重新安裝。將建立筆記本以協助您重新安裝所有 pip 套件。您要立即繼續更新嗎?

# msgShutdownNotebookSessions
source: Active Python notebook sessions will be shutdown in order to update. Would you like to proceed now?
de: Aktive Python-Notebooksitzungen werden heruntergefahren, um sie zu aktualisieren. Möchten Sie jetzt fortfahren?
es: Las sesiones del cuaderno de Python activas se cerrarán para poder actualizarse. ¿Desea continuar ahora?
fr: Les sessions de bloc-notes python actives seront arrêtées pour permettre la mise à jour. Voulez-vous continuer maintenant ?
it: Le sessioni del notebook di Python attive verranno arrestate per l'aggiornamento. Procedere ora?
ja: 更新のために、アクティブな Python ノートブック セッションがシャットダウンされます。今すぐ続行しますか?
ko: 업데이트를 하기 위해 활성 Python Notebook 세션이 종료됩니다. 지금 계속하시겠습니까?
pt_br: As sessões ativas do bloco de anotações do Python serão encerradas para serem atualizadas. Deseja continuar agora?
ru: Сеансы активных записных книжек Python будут завершены, чтобы обновить их. Хотите продолжить?
zh_hans: 将关闭活动 Python 笔记本会话以进行更新。是否要立即继续?
zh_hant: 為了進行更新，將關閉使用中的 Python 筆記本工作階段。您要立即繼續嗎?

# msgTaskName
source: Installing Notebook dependencies
de: Notebook-Abhängigkeiten werden installiert.
es: Instalando dependencias de Notebook
fr: Installation des dépendances de notebook
it: Installazione delle dipendenze di Notebook
ja: Notebook 依存関係のインストール
ko: Notebook 종속성 설치 중
pt_br: Instalando as dependências do Notebook
ru: Идет установка зависимостей Notebook
zh_hans: 正在安装笔记本依赖项
zh_hant: 正在安裝 Notebook 相依性

# msgWaitingForInstall
source: Another Python installation is currently in progress. Waiting for it to complete.
de: Aktuell wird eine weitere Python-Installation ausgeführt. Es wird auf den Abschluss des Vorgangs gewartet.
es: Otra instalación de Python está actualmente en curso. Esperando a que se complete.
fr: Une autre installation de Python est actuellement en cours. En attente de la fin de l'installation.
it: È già in corso un'altra installazione di Python. Attendere che venga completata.
ja: 別の Python のインストールが現在進行中です。完了するのを待っています。
ko: 현재 다른 Python 설치를 진행 중입니다. 완료될 때까지 기다립니다.
pt_br: Outra instalação do Python está em andamento no momento. Esperando a conclusão.
ru: Сейчас выполняется другая установка Python. Дождитесь ее завершения.
zh_hans: 另一个 Python 安装正在进行中。请等待它完成。
zh_hant: 目前在進行另一個 Python 安裝。請等它完成。

source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是
