Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/notebook.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# shutdownError
source: Shutdown of Notebook server failed: {0}
de: Fehler beim Herunterfahren des Notebook-Servers: {0}
es: Error en el apagado del servidor de Notebook: {0}
fr: L'arrêt du serveur de notebook a échoué : {0}
it: L'arresto del server di Notebook non è riuscito: {0}
ja: Notebook サーバーをシャットダウンできませんでした: {0}
ko: Notebook 서버 종료 실패: {0}
pt_br: Falha no desligamento do servidor do Notebook: {0}
ru: Сбой при завершении работы сервера Notebook: {0}
zh_hans: 关闭笔记本服务器失败: {0}
zh_hant: 無法關閉 Notebook 伺服器: {0}

# bdcConnectError
source: Error: {0}.
de: Fehler: {0}.
fr: Erreur : {0}.
it: Errore: {0}.
ja: エラー: {0}。
ko: 오류: {0}.
pt_br: Erro: {0}.
ru: Ошибка: {0}.
zh_hans: 错误: {0}。
zh_hant: 錯誤: {0}。

# clusterControllerConnectionRequired
source: A connection to the cluster controller is required to run Spark jobs
de: Zum Ausführen von Spark-Aufträgen ist eine Verbindung mit dem Clustercontroller erforderlich.
es: Se necesita una conexión al controlador del clúster para ejecutar trabajos de Spark.
fr: Une connexion au contrôleur de cluster est nécessaire pour exécuter les travaux Spark
it: Per eseguire processi Spark è necessaria una connessione al controller del cluster
ja: Spark ジョブを実行するには、クラスター コントローラーへの接続が必要です
ko: Spark 작업을 실행하려면 클러스터 컨트롤러에 대한 연결이 필요합니다.
pt_br: Uma conexão com o controlador de cluster é necessária para executar trabalhos do Spark
ru: Для выполнения заданий Spark требуется подключение к контроллеру кластера
zh_hans: 需要与群集控制器建立连接才能运行 Spark 作业
zh_hant: 必須連線至叢集控制器，才能執行 Spark 作業

# errorStartBeforeReady
source: Cannot start a session, the manager is not yet initialized
de: Eine Sitzung kann nicht gestartet werden, der Manager wurde noch nicht initialisiert.
es: No se puede iniciar una sesión, el administrador aún no está inicializado
fr: Impossible de démarrer une session, le gestionnaire n'est pas encore initialisé
it: Non è possibile avviare una sessione. Il gestore non è ancora inizializzato
ja: セッションを開始できません。マネージャーがまだ初期化されていません
ko: 세션을 시작할 수 없습니다. 관리자가 아직 초기화되지 않았습니다.
pt_br: Não é possível iniciar uma sessão. O gerente ainda não foi inicializado
ru: Не удается запустить сеанс, диспетчер еще не инициализирован
zh_hans: 无法启动会话，管理器尚未初始化
zh_hant: 無法啟動工作階段，管理員尚未初始化

# notebook.couldNotFindKnoxGateway
source: Could not find Knox gateway endpoint
de: KNOX-Gatewayendpunkt wurde nicht gefunden.
es: No se encuentra el punto de conexión de la puerta de enlace de Knox.
fr: Point de terminaison de passerelle Knox introuvable
it: Non è stato possibile trovare l'endpoint del gateway Knox
ja: Knox ゲートウェイ エンドポイントが見つかりませんでした
ko: Knox 게이트웨이 엔드포인트를 찾을 수 없음
pt_br: Não foi possível localizar o ponto de extremidade do gateway do Knox
ru: Не удалось найти конечную точку шлюза Knox
zh_hans: 找不到 KNOX 网关终结点
zh_hant: 找不到 Knox 閘道端點

# promptBDCPassword
source: Please provide the password to connect to the BDC Controller
de: Geben Sie das Kennwort zum Herstellen einer Verbindung mit dem BDC-Controller an.
es: Proporcione la contraseña para conectarse al controlador de BDC.
fr: Fournissez le mot de passe pour se connecter au contrôleur BDC
it: Specificare la password per la connessione al controller BDC
ja: BDC コントローラーに接続するためのパスワードを指定してください
ko: BDC 컨트롤러에 연결하려면 암호를 제공하세요.
pt_br: Forneça a senha para se conectar ao Controlador do BDC
ru: Укажите пароль для подключения к контроллеру BDC
zh_hans: 请提供密码以连接到 BDC 控制器
zh_hant: 請提供密碼以連線至 BDC 控制器

# promptBDCUsername
source: {0}Please provide the username to connect to the BDC Controller:
de: {0}Geben Sie den Benutzernamen zum Herstellen einer Verbindung mit dem BDC-Controller an:
es: {0}Especifique el nombre de usuario para conectarse al controlador de BDC:
fr: {0}Fournissez le nom d'utilisateur pour se connecter au contrôleur BDC :
it: {0}Specificare il nome utente per la connessione al controller BDC:
ja: {0}BDC コントローラーに接続するためのユーザー名を指定してください:
ko: {0}BDC 컨트롤러에 연결하려면 사용자 이름을 제공하세요.
pt_br: {0}Forneça o nome de usuário para se conectar ao Controlador do BDC:
ru: {0}Укажите имя пользователя для подключения к контроллеру BDC:
zh_hans: {0}请提供用户名以连接到 BDC 控制器:
zh_hant: {0}請提供使用者名稱以連線至 BDC 控制器:

# managePackages.packageRequestError
source: Package info request failed with error: {0} {1}
de: Fehler beim Anfordern von Paketinformationen: {0} {1}
es: Error en la solicitud de información del paquete: {0} {1}
fr: La demande d'informations de package a échoué avec l'erreur : {0} {1}
it: La richiesta di informazioni sul pacchetto non è riuscita. Errore: {0} {1}
ja: パッケージ情報要求がエラーで失敗しました: {0} {1}
ko: {0} {1} 오류를 나타내며 패키지 정보 요청 실패
pt_br: Falha na solicitação de informações do pacote com o erro: {0} {1}
ru: Запрос сведений о пакете завершился с ошибкой: {0} {1}
zh_hans: 包信息请求失败，出现错误: {0} {1}
zh_hant: 套件資訊要求失敗。錯誤: {0} {1}

# jupyterError
source: Error sent from Jupyter: {0}
de: Von Jupyter gesendeter Fehler: {0}
es: Error enviado desde Jupyter: {0}
fr: Erreur envoyée par Jupyter : {0}
it: Errore restituito da Jupyter: {0}
ja: Jupyter からの送信でエラーが発生しました: {0}
ko: Jupyter에서 보낸 오류: {0}
pt_br: Erro enviado do Jupyter: {0}
ru: Ошибка, отправленная из Jupyter: {0}
zh_hans: 从 Jupyter 发送时出错: {0}
zh_hant: 從 Jupyter 傳送的錯誤: {0}

# jupyterOutputMsgStart
source: ... Starting Notebook server
de: ... Der Notebook-Server wird gestartet.
es: ... Iniciando el servidor de Notebook
fr: ...Démarrage du serveur de notebook
it: ... Avvio del server di Notebook
ja: ... Notebook サーバーを起動しています
ko: ... Notebook 서버 시작 중
pt_br: ... Iniciando o servidor do Notebook
ru: … Выполняется запуск сервера Notebook
zh_hans: …正在启动笔记本服务器
zh_hant: ... 正在啟動 Notebook 伺服器

# jupyterOutputMsgStartSuccessful
source: ... Jupyter is running at {0}
de: ... Jupyter wird in "{0}" ausgeführt.
es: ... Jupyter se está ejecutando en {0}
fr: ...Jupyter est en cours d'exécution sur {0}
it: ... Jupyter è in esecuzione alla posizione {0}
ja: ... Jupyter は {0} で実行中です
ko: ... Jupyter가 {0}에서 실행되고 있습니다.
pt_br: ... O Jupyter está sendo executado em {0}
ru: … Jupyter выполняется в {0}
zh_hans: …Jupyter 正运行到 {0}
zh_hant: ... Jupyter 正在 {0} 中執行

# notebookStartProcessExitPremature
source: Notebook process exited prematurely with error code: {0}. StdErr Output: {1}
de: Der Notebook-Prozess wurde vorzeitig beendet. Fehlercode: {0}, StdErr-Ausgabe: {1}
es: El proceso del cuaderno se ha cerrado prematuramente con el error {0}. Salida de StdErr: {1}.
fr: Le processus du notebook a quitté prématurément avec le code d'erreur : {0}, sortie StdErr : {1}
it: Il processo del notebook è stato chiuso prematuramente con codice errore: {0}. Output di StdErr: {1}
ja: Notebook プロセスが途中で終了しました。エラー コード: {0}。StdErr 出力: {1}
ko: Notebook 프로세스가 조기에 종료되었습니다(오류 코드: {0}). StdErr 출력: {1}
pt_br: O processo do Notebook foi encerrado prematuramente com o código de erro: {0}. Saída de StdErr: {1}
ru: Процесс записной книжки преждевременно завершил работу с ошибкой: {0}, выходные данные StdErr: {1}
zh_hans: 笔记本进程过早退出，错误代码为: {0}。StdErr 输出: {1}
zh_hant: Notebook 處理序提前結束。錯誤碼: {0}。StdErr 輸出: {1}

# serverStopError
source: Error stopping Notebook Server: {0}
de: Fehler beim Beenden des Notebook-Servers: {0}
es: Error al detener el servidor de Notebook: {0}
fr: Erreur d'arrêt du serveur de notebook : {0}
it: Si è verificato un errore durante l'arresto del server di Notebook: {0}
ja: Notebook サーバーの停止でエラーが発生しました: {0}
ko: Notebook 서버 중지 오류: {0}
pt_br: Erro ao parar o Servidor do Notebook: {0}
ru: Ошибка при остановке сервера Notebook: {0}
zh_hans: 停止笔记本服务器时出错: {0}
zh_hant: 停止 Notebook 伺服器時發生錯誤: {0}

# notebook.confirmOpen
source: Download and open '{0}'?
de: "{0}" herunterladen und öffnen?
es: ¿Descargar y abrir "{0}"?
fr: Télécharger et ouvrir '{0}' ?
it: Scaricare e aprire '{0}'?
ja: '{0}' をダウンロードして開きますか?
ko: '{0}'을(를) 다운로드하고 여시겠습니까?
pt_br: Baixar e abrir '{0}'?
ru: Скачать и открыть "{0}"?
zh_hans: 是否下载并打开“{0}”?
zh_hant: 要下載並開啟 '{0}' 嗎?

# notebook.fileDownloadError
source: File open request failed with error: {0} {1}
de: Fehler bei der Anforderung zum Öffnen der Datei: {0} {1}
es: Error en la solicitud de apertura de archivo: {0} {1}
fr: La demande d'ouverture de fichier a échoué avec l'erreur : {0} {1}
it: La richiesta di apertura file non è riuscita. Errore: {0} {1}
ja: ファイルを開く要求に失敗しました。エラー: {0} {1}
ko: {0} {1} 오류를 나타내며 파일 열기 요청 실패
pt_br: Falha na solicitação de abertura de arquivo com o erro: {0} {1}
ru: Запрос на открытие файла завершился с ошибкой: {0} {1}
zh_hans: 文件打开请求失败，出现错误: {0} {1}
zh_hant: 檔案開啟要求失敗。錯誤: {0} {1}

# notebook.fileNotFound
source: Could not find the specified file
de: Die angegebene Datei wurde nicht gefunden.
es: No se pudo encontrar el archivo especificado
fr: Fichier spécifié introuvable
it: Non è stato possibile trovare il file specificato
ja: 指定されたファイルが見つかりませんでした
ko: 지정한 파일을 찾을 수 없습니다.
pt_br: Não foi possível localizar o arquivo especificado
ru: Не удалось найти указанный файл
zh_hans: 未找到指定的文件
zh_hant: 無法尋找指定的檔案

# notebook.unsupportedAction
source: Action {0} is not supported for this handler
de: Die Aktion "{0}" wird für diesen Handler nicht unterstützt.
es: No se admite la acción {0} para este controlador
fr: L'action {0} n'est pas prise en charge pour ce gestionnaire
it: L'azione {0} non è supportata per questo gestore
ja: このハンドラーではアクション {0} はサポートされていません
ko: 이 처리기에는 {0} 작업이 지원되지 않습니다.
pt_br: Não há suporte para a ação {0} para esse manipulador
ru: Действие {0} не поддерживается для этого обработчика
zh_hans: 此处理程序不支持操作 {0}
zh_hant: 這個處理常式不支援動作 {0}

# unsupportedScheme
source: Cannot open link {0} as only HTTP, HTTPS, and File links are supported
de: Der Link "{0}" kann nicht geöffnet werden, weil nur HTTP-, HTTPS und Dateilinks unterstützt werden.
es: No se puede abrir el vínculo {0} porque solo se admiten vínculos HTTP, HTTPS y File.
fr: Impossible d'ouvrir le lien {0}, car seuls les liens HTTP, HTTPS et Fichier sont pris en charge
it: Non è possibile aprire il collegamento {0} perché sono supportati solo i collegamenti HTTP, HTTPS e file
ja: HTTP、HTTPS、およびファイル リンクのみがサポートされているため、リンク {0} を開けません
ko: HTTP, HTTPS 및 파일 링크만 지원되므로 링크 {0}을(를) 열 수 없음
pt_br: Não é possível abrir o link {0} porque somente os links HTTP, HTTPS e de arquivos são compatíveis
ru: Не удается открыть ссылку {0}, так как поддерживаются только ссылки HTTP, HTTPS и ссылки на файлы
zh_hans: 无法打开链接 {0} 因为仅支持 HTTP、HTTPS、文件链接
zh_hant: 由於僅支援 HTTP、HTTPS 和檔案連結，所以無法開啟連結 {0}

# books-preview-category
source: Jupyter Books
fr: Notebooks Jupyter
it: Book di Jupyter
ja: Jupyter ブック
ko: Jupyter Book
ru: Книги Jupyter
zh_hans: Jupyter 书籍
zh_hant: Jupyter 書籍

# config.jupyter.extraKernelsDescription
source: IDs of the extra kernels to enable
de: IDs der zusätzlich zu aktivierenden Kernel
es: Id. de los kernels adicionales para habilitar
fr: ID des noyaux supplémentaires à activer
it: ID dei kernel aggiuntivi da abilitare
ja: 有効にするその他のカーネルの ID
ko: 사용하도록 설정할 추가 커널의 ID
pt_br: IDs dos kernels extras a serem habilitados
ru: Идентификаторы дополнительных включаемых ядер
zh_hans: 要启用的额外内核的 ID
zh_hant: 要啟用之額外核心的識別碼

# config.jupyter.extraKernelsTitle
source: Extra kernels
de: Zusätzliche Kernel
es: Kernels adicionales
fr: Noyaux supplémentaires
it: Kernel aggiuntivi
ja: その他のカーネル
ko: 추가 커널
pt_br: Kernels extra
ru: Дополнительные ядра
zh_hans: 额外内核
zh_hant: 額外核心

# config.jupyter.kernelConfigValuesDescription
source: Configuration options for Jupyter kernels. This is automatically managed and not recommended to be manually edited.
de: Konfigurationsoptionen für Jupyter-Kernel. Diese werden automatisch verwaltet und sollten nicht manuell bearbeitet werden.
es: Opciones de configuración para kernels de Jupyter. Se administra automáticamente y no se recomienda la edición manual.
fr: Options de configuration des noyaux Jupyter. Ces options sont gérées automatiquement et leur modification manuelle n'est pas recommandée.
it: Opzioni di configurazione per i kernel Jupyter. Sono gestite automaticamente ed è consigliabile non modificarle manualmente.
ja: Jupyter カーネルの構成オプション。これは自動的に管理され、手動で編集することは推奨されていません。
ko: Jupyter 커널의 구성 옵션입니다. 이 옵션은 자동으로 관리되며 수동으로 편집하지 않는 것이 좋습니다.
pt_br: Opções de configuração dos kernels do Jupyter. Isso é gerenciado automaticamente e não deve ser editado manualmente.
ru: Параметры конфигурации для ядер Jupyter. Этот параметр управляется автоматически, и изменять его вручную не рекомендуется.
zh_hans: Jupyter 内核的配置选项。这是自动管理的，建议不要手动编辑。
zh_hant: Jupyter 核心的設定選項。此為自動受控項目，且不建議手動編輯。

# description
source: Defines the Data-procotol based Notebook contribution and many Notebook commands and contributions.
de: Definiert den datenprokotollbasierten Notebook-Beitrag und viele Notebook-Befehle und -Beiträge.
es: Define la contribución de Notebook basada en el protocolo de datos y muchos comandos y contribuciones de Notebook.
fr: Définit la contribution de notebook basée sur un protocole de données, et plusieurs commandes et contributions de notebook.
it: Consente di definire il contributo di Notebook basato sul protocollo dati e numerosi comandi e contributi di Notebook.
ja: データ プロトコル ベースの Notebook コントリビューションと、多くの Notebook コマンドおよびコントリビューションを定義します。
ko: 데이터 프로토콜 기반 Notebook 기여와 많은 Notebook 명령 및 기여를 정의합니다.
pt_br: Define a contribuição do Notebook baseada em protocolo de Dados e muitos comandos e contribuições do Notebook.
ru: Определяет протокол данных на основе вклада Notebook, а также многие команды и вклады Notebook.
zh_hans: 定义基于数据协议的笔记本贡献以及多个笔记本命令和贡献。
zh_hant: 定義以資料通訊協定為基礎的 Notebook 貢獻，以及許多 Notebook 命令和貢獻。

# displayName
source: Notebook Core Extensions
de: Notebook-Kernerweiterungen
es: Extensiones principales de Notebook
fr: Extensions principales de notebook
it: Estensioni principali di Notebook
ja: Notebook のコア拡張機能
ko: Notebook 코어 확장
pt_br: Extensões Principais do Notebook
ru: Основные расширения Notebook
zh_hans: 笔记本核心扩展
zh_hant: Notebook 核心延伸模組

# notebook.allowRoot.description
source: Allow Jupyter server to run as root user
de: Ausführung des Jupyter-Servers als Stammbenutzer zulassen
es: Permitir que el servidor de Jupyter se ejecute como usuario raíz
fr: Autoriser le serveur Jupyter à s’exécuter en tant qu’utilisateur racine
ja: Jupyter サーバーをルート ユーザーとして実行することを許可します
ko: Jupyter 서버를 루트 사용자로 실행하도록 허용
pt_br: Permitir que o servidor Jupyter seja executado como usuário raiz
ru: Разрешить запуск сервера Jupyter от имени привилегированного пользователя
zh_hant: 允許 Jupyter 伺服器以根使用者身分執行

# notebook.analyzeJupyterNotebook
source: Analyze in Notebook
de: In Notebook analysieren
es: Analizar en Notebook
fr: Analyser dans le notebook
it: Analizza in Notebook
ja: ノートブックで分析
ko: Notebook에서 분석
pt_br: Analisar no Notebook
ru: Анализировать в Notebook
zh_hans: 在笔记本中分析
zh_hant: 在 Notebook 中分析

# notebook.collapseBookItems.description
source: Collapse Book items at root level in the Notebooks Viewlet
de: Buchelemente auf Stammebene im Notebook-Viewlet reduzieren
es: Contraer elementos del libro en el nivel de raíz del viewlet de Notebooks
fr: Réduire les éléments Book au niveau racine dans la viewlet Notebooks
it: Comprime gli elementi del libro al livello radice nel viewlet Notebook
ja: Notebooks ビューレットのルート レベルでブック項目を折りたたみます
ko: Notebook 뷰렛에서 루트 수준의 Book 항목 축소
pt_br: Recolher itens do Livro no nível raiz no Viewlet dos Notebooks
ru: Сворачивание элементов книги на корневом уровне во вьюлете записных книжек
zh_hans: 在笔记本 Viewlet 的根级别折叠工作簿项
zh_hant: 在 Notebooks Viewlet 中的根層級摺疊書籍項目

# notebook.command.addcell
source: Add Cell
de: Zelle hinzufügen
es: Agregar celda
fr: Ajouter une cellule
it: Aggiungi cella
ja: セルの追加
ko: 셀 추가
pt_br: Adicionar Célula
ru: Добавить ячейку
zh_hans: 添加单元格
zh_hant: 新增資料格

# notebook.command.addcode
source: Add Code Cell
de: Codezelle hinzufügen
es: Agregar celda de código
fr: Ajouter une cellule de code
it: Aggiungi cella di codice
ja: コード セルの追加
ko: 코드 셀 추가
pt_br: Adicionar Célula de Código
ru: Добавить ячейку кода
zh_hans: 添加代码单元格
zh_hant: 新增程式碼資料格

# notebook.command.addtext
source: Add Text Cell
de: Textzelle hinzufügen
es: Agregar celda de texto
fr: Ajouter une cellule de texte
it: Aggiungi cella di testo
ja: テキスト セルの追加
ko: 텍스트 셀 추가
pt_br: Adicionar Célula de Texto
ru: Добавить текстовую ячейку
zh_hans: 添加文本单元格
zh_hant: 新增文字資料格

# notebook.command.boldText
source: Bold Markdown Text
es: Texto de Markdown en negrita
fr: Mettre en gras le texte Markdown
ja: Markdown テキストを太字にする
ko: 굵은 마크다운 텍스트
pt_br: Texto Negrito de Markdown
ru: Полужирный текст Markdown
zh_hant: 將 Markdown 文字變為粗體

# notebook.command.clearactivecellresult
source: Clear Cell Result
de: Zellergebnis löschen
es: Borrar resultado de la celda
fr: Effacer le résultat de la cellule
it: Cancella risultato della cella
ja: セル結果をクリアする
ko: 셀 결과 지우기
pt_br: Limpar o Resultado da Célula
ru: Очистить результат ячейки
zh_hans: 清除单元格结果
zh_hant: 清除資料格結果

# notebook.command.codeBlock
source: Add Code Block
es: Agregar bloque de código
fr: Ajouter un bloc de code
ja: コード ブロックを追加する
ko: 코드 블록 추가
pt_br: Adicionar bloco de código
ru: Добавить блок кода
zh_hant: 新增程式碼區塊

# notebook.command.highlightText
source: Highlight Markdown Text
ru: Выделить текст Markdown

# notebook.command.italicizeText
source: Italicize Markdown Text
es: Poner en cursiva el texto de Markdown
fr: Mettre en italique le texte de la démarque
ja: Markdown テキストを斜体にする
ko: Markdown 텍스트 기울임꼴
pt_br: Italicize Markdown Texto
ru: Курсивный текст Markdown
zh_hant: 將 Markdown 文字變為斜體

# notebook.command.new
source: New Notebook
de: Neues Notebook
es: Nuevo Notebook
fr: Nouveau notebook
it: Nuovo notebook
ja: 新しいノートブック
ko: 새 Notebook
pt_br: Novo Notebook
ru: Создать записную книжку
zh_hans: 新建笔记本
zh_hant: 新增 Notebook

# notebook.command.open
source: Open Notebook
de: Notebook öffnen
es: Abrir Notebook
fr: Ouvrir le notebook
it: Apri notebook
ja: ノートブックを開く
ko: Notebook 열기
pt_br: Abrir o Notebook
ru: Открыть записную книжку
zh_hans: 打开笔记本
zh_hant: 開啟 Notebook

# notebook.command.runactivecell
source: Run Cell
de: Zelle ausführen
es: Ejecutar celda
fr: Exécuter la cellule
it: Esegui cella
ja: セルの実行
ko: 셀 실행
pt_br: Executar Célula
ru: Выполнить ячейку
zh_hans: 运行单元格
zh_hant: 執行資料格

# notebook.command.runallcells
source: Run Cells
de: Zellen ausführen
es: Ejecutar celdas
fr: Exécuter les cellules
it: Esegui celle
ja: セルの実行
ko: 셀 실행
pt_br: Executar Células
ru: Выполнить ячейки
zh_hans: 运行单元格
zh_hant: 執行資料格

# notebook.command.underlineText
source: Underline Markdown Text
es: Subrayado del texto de Markdown
fr: Texte de démarque
ja: Markdown テキストに下線を付ける
ko: Markdown 텍스트에 밑줄 긋기
pt_br: Sublinhar Texto Markdown
ru: Подчеркнутый текст Markdown
zh_hant: 為 Markdown 文字加上底線

# notebook.configuration.title
source: Notebook configuration
de: Notebook-Konfiguration
es: Configuración de Notebook
fr: Configuration de notebook
it: Configurazione di Notebook
ja: Notebook 構成
ko: Notebook 구성
pt_br: Configuração do Notebook
ru: Конфигурация Notebook
zh_hans: 笔记本配置
zh_hant: Notebook 組態

# notebook.dontPromptPythonUpdate.description
source: Do not show prompt to update Python.
de: Zeigen Sie keine Aufforderungen zum Aktualisieren von Python an.
es: No mostrar el mensaje para actualizar Python.
fr: Ne pas afficher d’invite pour mettre à jour Python.
it: Non visualizzare la richiesta di aggiornamento di Python.
ja: Python の更新を確認するメッセージを表示しません。
ko: Python을 업데이트하라는 메시지가 표시되지 않습니다.
pt_br: Não mostrar aviso para atualizar Python.
ru: Не показывать предложение обновить Python.
zh_hans: 不显示更新 Python 的提示。
zh_hant: 不要顯示更新 Python 的提示。

# notebook.jupyterServerShutdownTimeout.description
source: The amount of time (in minutes) to wait before shutting down a server after all notebooks are closed. (Enter 0 to not shutdown)
de: Die Zeit ( in Minuten), die abgewartet werden soll, bevor ein Server heruntergefahren wird, nachdem alle Notizbücher geschlossen wurden. (Geben Sie 0 ein, um nicht herunterzufahren)
es: La cantidad de tiempo (en minutos) que se debe esperar antes de apagar un servidor después de cerrar todos los cuadernos. (Escriba 0 para no apagar)
fr: Durée d’attente (en minutes) avant l’arrêt d’un serveur une fois tous les blocs-notes fermés. (Entrez 0 pour ne pas arrêter)
it: Tempo di attesa (in minuti) prima dell'arresto di un server dopo la chiusura di tutti i notebook. (Immettere 0 per non arrestare)
ja: すべてのノートブックが閉じられた後、サーバーをシャットダウンするまでの待機時間 (分)。(シャットダウンしない場合は ”0” を入力してください)
ko: 모든 전자 필기장이 닫힌 후 서버를 종료하기 전에 대기해야 할 시간(분)입니다(종료하지 않으려면 0을 입력하세요).
pt_br: A quantidade de tempo (em minutos) de espera antes de desligar um servidor depois de fechar todos os blocos de anotações. (Digite 0 para não desligar)
ru: Интервал времени (в минутах), по истечении которого производится завершение работы сервера после закрытия всех записных книжек. (Введите 0, чтобы не завершать работу)
zh_hans: 在关闭所有笔记本后关闭服务器之前等待的时间 (以分钟为单位)。(输入 0 则不关闭)
zh_hant: 在所有筆記本關閉後關閉伺服器前須等候的時間 (分鐘)。(若不要關閉，請輸入 0)

# notebook.maxBookSearchDepth.description
source: Maximum depth of subdirectories to search for Books (Enter 0 for infinite)
de: Maximale Tiefe von Unterverzeichnissen für die Suche nach Books (0 entspricht unendlich)
es: Profundidad máxima de subdirectorios para buscar Books (especifique 0 para infinito)
fr: Profondeur maximale des sous-répertoires où rechercher les notebooks (Entrer 0 pour l'infini)
it: Profondità massima delle sottodirectory per la ricerca di book (immettere 0 per la profondità infinita)
ja: ブックを検索するサブディレクトリの最大深度 (無限にするには 0 を入力します)
ko: 책을 검색할 하위 디렉터리의 최대 깊이(무한의 경우 0 입력)
pt_br: Profundidade máxima de subdiretórios para pesquisar Books (insira 0 para infinita)
ru: Максимальная глубина подкаталогов для поиска книг (введите 0 для бесконечной глубины)
zh_hans: 要搜索书籍的子目录的最大深度(输入 0 表示“无限”)
zh_hant: 用來搜尋書籍的子目錄最大深度 (輸入 0 表示無限)

# notebook.maxTableRows.description
source: Maximum number of rows returned per table in the Notebook editor
de: Maximale Anzahl von Zeilen, die pro Tabelle im Notebook-Editor zurückgegeben werden
es: Número máximo de filas devueltas por tabla en el editor de Notebook
fr: Nombre maximal de lignes retournées par table dans l'éditeur de notebook
it: Numero massimo di righe restituite per tabella nell'editor di Notebook
ja: Notebook エディターでテーブルごとに返される行の最大数
ko: Notebook 편집기에서 테이블당 반환된 최대 행 수
pt_br: Número máximo de linhas retornadas por tabela no editor do Notebook
ru: Максимальное число строк, возвращаемых на таблицу, в редакторе Notebook
zh_hans: 笔记本编辑器中每个表返回的最大行数
zh_hant: Notebook 編輯器中每一資料表傳回的資料列數上限

# notebook.overrideEditorTheming.description
source: Override editor default settings in the Notebook editor. Settings include background color, current line color and border
de: Hiermit setzen Sie die Editor-Standardeinstellungen im Notebook-Editor außer Kraft. Zu den Einstellungen gehören Hintergrundfarbe, Farbe der aktuellen Zeile und Rahmen.
es: Invalide la configuración predeterminada del editor en el editor de Notebook. Los ajustes incluyen el color de fondo, el color de la línea actual y el borde
fr: Remplacez les paramètres d'éditeur par défaut dans l'éditeur de notebook. Les paramètres comprennent la couleur d'arrière-plan, la couleur de la ligne actuelle et la bordure
it: Esegue l'override delle impostazioni predefinite dell'editor di Notebook. Le impostazioni includono il colore di sfondo, il colore della riga corrente e il bordo
ja: Notebook エディターの既定の設定をオーバーライドします。設定には、背景色、現在の線の色、境界線が含まれます
ko: Notebook 편집기에서 편집기 기본 설정을 재정의합니다. 설정에는 배경색, 현재 선 색 및 테두리가 포함됩니다.
pt_br: Substitua as configurações padrão do editor no editor de Notebook. As configurações incluem a cor da tela de fundo, a cor e a borda da linha atual
ru: Переопределите параметры редактора по умолчанию в редакторе Notebook. Параметры включают в себя цвет фона, цвет текущей строки и границу
zh_hans: 覆盖笔记本编辑器中的编辑器默认设置。设置包括背景色、当前线条颜色和边框
zh_hant: 覆寫 Notebook 編輯器中的預設設定。設定包含背景色彩、目前的線條色彩和框線
