Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/notebook.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# managePackages.packageNotFound
source: Could not find the specified package
de: Das angegebene Paket wurde nicht gefunden.
es: No se pudo encontrar el paquete especificado
fr: Package spécifié introuvable
it: Non è stato possibile trovare il pacchetto specificato
ja: 指定されたパッケージが見つかりませんでした
ko: 지정된 패키지를 찾을 수 없습니다.
pt_br: Não foi possível localizar o pacote especificado
ru: Не удалось найти указанный пакет
zh_hans: 未找到指定的包
zh_hant: 找不到指定的套件

# Invalid toc.yml
source: Error: {0} has an incorrect toc.yml file
de: Fehler: "{0}" weist eine falsche Datei "toc.yml" auf.
es: Error: {0} tiene un archivo toc.yml incorrecto
fr: Erreur : {0} a un fichier toc.yml incorrect
it: Errore: {0} include un file toc.yml non corretto
ja: エラー: {0} に正しくない toc.yml ファイルがあります
ko: 오류: {0}에 잘못된 toc.yml 파일이 있음
pt_br: Erro: {0} tem um arquivo toc.yml incorreto
ru: Ошибка: в {0} имеется неправильный файл toc.yml
zh_hans: 错误: {0} 包含不正确的 toc.yml 文件
zh_hant: 錯誤: {0} 有不正確的 toc.yml 檔案

# InvalidError.tocFile
source: Invalid toc file
de: Ungültige Inhaltsverzeichnisdatei.
es: Archivo de TDC no válido
fr: Fichier TOC non valide
it: File toc non valido
ja: 無効な toc ファイル
ko: 잘못된 toc 파일
pt_br: Arquivo de sumário inválido
ru: Недопустимый файл оглавления
zh_hans: toc 文件无效
zh_hant: TOC 檔案無效

source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter
it: Aggiungi
ja: 追加
ko: 추가
pt_br: Adicionar
ru: Добавить
zh_hans: 添加
zh_hant: 新增

# addRemoteBook
source: Add Remote Jupyter Book
de: Jupyter-Remotebuch hinzufügen
es: Adición de libro de Jupyter remoto
fr: Ajouter un book Jupyter distant
it: Aggiungi libro remoto Jupyter
ja: リモート Jupyter ブックの追加
ko: 원격 Jupyter Book 추가
pt_br: Adicionar Livro do Jupyter Remoto
ru: Добавить удаленную книгу Jupyter
zh_hans: 添加远程 Jupyter Book
zh_hant: 新增遠端 Jupyter 書籍

source: All Files
de: Alle Dateien
es: Todos los archivos
fr: Tous les fichiers
it: Tutti i file
ja: すべてのファイル
ko: 모든 파일
pt_br: Todos os Arquivos
ru: Все файлы
zh_hans: 所有文件
zh_hant: 所有檔案

# book
source: Jupyter Book
ja: Jupyter ブック
pt_br: Livro Jupyter
ru: Книга Jupyter
zh_hant: Jupyter 書籍

# bookDescription
source: Jupyter Books are used to organize Notebooks.
de: Jupyter Book-Instanzen werden zum Organisieren von Notebooks verwendet.
es: Los libros Jupyter se utilizan para organizar los bloc de notas.
fr: Les livres de la bibliothèque sont utilisés pour organiser les blocs-notes.
it: I libri Jupyter vengono usati per organizzare i blocchi appunti.
ja: Jupyter ブックは、ノートブックを整理するために使用されます。
ko: Jupyter Book은 Notebook을 구성하는 데 사용됩니다.
pt_br: Os Livros Jupyter são usados para organizar Blocos de Anotações.
ru: Для упорядочения записных книжек используется Jupyter Books.
zh_hans: Jupyter 书籍用于整理笔记本。
zh_hant: Jupyter Books 可用來整理筆記本。

# bookInitializeFailed
source: Failed to find a Table of Contents file in the specified Jupyter Book.
de: Bei der Suche im angegebenen Jupyter Book wurde keine Inhaltsverzeichnisdatei gefunden.
es: No se pudo encontrar un archivo de tabla de contenido en el libro de Jupyter especificado.
fr: Aucun fichier de table des matières dans le Jupyter Book spécifié.
it: Non è stato possibile trovare un file del sommario nel Book specificato.
ja: 指定された Jupyter ブックに目次ファイルが見つかりませんでした。
ko: 지정된 Jupyter Book에서 목차 파일을 찾지 못했습니다.
pt_br: Falha ao encontrar um arquivo de Índice no Livro Jupyter especificado.
ru: Не удалось найти файл содержания в указанной книге Jupyter.
zh_hans: 在指定 Jupyter Book 中找不到目录文件。
zh_hant: 指定 Jupyter 書籍中找不到的目錄檔案。

# booksNotFound
source: No Jupyter Books are currently available on the provided link
de: Unter dem angegebenen Link sind zurzeit keine Jupyter Books verfügbar.
es: Actualmente no hay ningún libro de Juypyter disponible en el vínculo proporcionado
fr: Aucun Jupyter Book n'est disponible actuellement sur le lien fourni
it: Non sono attualmente disponibili Book nel collegamento fornito
ja: 指定されたリンクで現在利用可能な Jupyter ブックがありません
ko: 제공된 링크에 현재 사용 가능한 Jupyter Book이 없습니다.
pt_br: Nenhum Livro Jupyter está disponível no momento no link fornecido
ru: По указанной ссылке отсутствуют доступные книги Jupyter
zh_hans: 当前，提供的链接中无可用 Jupyter Book
zh_hant: 提供的連結目前沒有任何 Jupyter 書籍可供使用

source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
pt_br: Procurar
ru: Обзор
zh_hans: 浏览
zh_hant: 瀏覽

source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# closeBookError
source: Close Jupyter Book {0} failed: {1}
de: Fehler beim Schließen von Jupyter Book "{0}": {1}
es: No se pudo cerrar {0} el libro de Jupyter: {1}
fr: Échec de la fermerture de Jupyter Book {0} : {1}
it: Chiusura Jupyter Book {0} non riuscita: {1}
ja: Jupyter ブック {0} を閉じることができませんでした: {1}
ko: Jupyter Book {0} 닫기 실패: {1}
pt_br: Falha ao Fechar Livro Jupyter {0}: {1}
ru: Не удалось закрыть книгу Jupyter {0}: {1}
zh_hans: 关闭 Jupyter Book {0} 失败: {1}
zh_hant: 關閉 Jupyter 書籍 {0} 失敗: {1}

# configFileError
source: Configuration file missing
de: Konfigurationsdatei fehlt.
es: Falta el archivo de configuración.
fr: Fichier de configuration manquant
it: File di configurazione mancante
ja: 構成ファイルが見つかりません
ko: 구성 파일 없음
pt_br: Arquivo de configuração ausente
ru: Отсутствует файл конфигурации
zh_hans: 缺少配置文件
zh_hant: 缺少組態檔

# confirmOverwrite
source: File already exists. Are you sure you want to overwrite this file?
de: Die Datei ist bereits vorhanden. Möchten Sie diese Datei überschreiben?
es: El archivo ya existe. ¿Está seguro de que desea sobrescribirlo?
fr: Le fichier existe déjà. Voulez-vous vraiment remplacer ce fichier?
it: Il file esiste già. Si vuole davvero sovrascrivere il file?
ja: ファイルは既に存在します。このファイルを上書きしますか?
ko: 파일이 이미 있습니다. 이 파일을 덮어쓰시겠습니까?
pt_br: O arquivo já existe. Tem certeza de que deseja substituir este arquivo?
ru: Файл уже существует. Перезаписать его?
zh_hans: 文件已存在。是否确实要覆盖此文件?
zh_hant: 檔案已存在。確定要覆寫此檔案嗎 ?

# confirmReplace
source: Folder already exists. Are you sure you want to delete and replace this folder?
de: Der Ordner ist bereits vorhanden. Möchten Sie diesen Ordner löschen und ersetzen?
es: La carpeta ya existe. ¿Seguro que desea eliminar y reemplazar esta carpeta?
fr: Le dossier existe déjà. Voulez-vous vraiment supprimer et remplacer ce dossier ?
it: La cartella esiste già. Eliminarla e sostituirla?
ja: フォルダーは既に存在します。このフォルダーを削除して置き換えますか?
ko: 폴더가 이미 있습니다. 이 폴더를 삭제하고 바꾸시겠습니까?
pt_br: A pasta já existe. Tem certeza de que deseja excluir e substituir essa pasta?
ru: Папка уже существует. Вы уверены, что хотите удалить и заменить эту папку?
zh_hans: 文件夹已存在。确定要删除并替换此文件夹吗?
zh_hant: 已有資料夾。確定要刪除並取代此資料夾嗎?

source: Content folder
de: Inhaltsordner
es: Carpeta de contenido
fr: Dossier de contenu
it: Cartella del contenuto
ja: コンテンツ フォルダー
ko: 콘텐츠 폴더
pt_br: Pasta de conteúdo
ru: Папка содержимого
zh_hans: 内容文件夹
zh_hant: 內容資料夾

source: Content folder (Optional)
de: Inhaltsordner (optional)
es: Carpeta de contenido (opcional)
fr: Dossier de contenu (facultatif)
it: Cartella del contenuto (facoltativo)
ja: コンテンツ フォルダー (省略可能)
ko: 콘텐츠 폴더(선택 사항)
pt_br: Pasta de conteúdo (Opcional)
ru: Папка содержимого (необязательно)
zh_hans: 内容文件夹(可选)
zh_hant: 內容資料夾 (選擇性)

source: Create
de: Erstellen
es: Crear
fr: Créer
it: Crea
ja: 作成
ko: 만들기
pt_br: Criar
ru: Создать
zh_hans: 创建
zh_hant: 建立

# duplicateFileError
source: File {0} already exists in the destination folder {1} The file has been renamed to {2} to prevent data loss.
de: Die Datei "{0}" ist bereits im Zielordner "{1}" vorhanden. Die Datei wurde in "{2}" umbenannt, um Datenverlust zu verhindern.
it: Il file {0} esiste già nella cartella di destinazione {1} Il file è stato rinominato in {2} per evitare la perdita di dati.
ja: ファイル {0} は、ターゲット フォルダー {1} に既に存在しています データの損失を防ぐために、ファイルの名前が {2} に変更されました。
ko: 대상 폴더 {1}에 {0} 파일이 이미 있습니다. 데이터 손실을 방지하기 위해 파일 이름이 {2}(으)로 바뀌었습니다.
pt_br: O arquivo {0} já existe na pasta de destino {1} O arquivo foi renomeado para {2} para impedir a perda de dados.
ru: Файл {0} уже существует в конечной папке {1}. Имя файла было изменено на {2} для предотвращения потери данных.
zh_hans: 文件 {0} 已在目标文件夹 {1} 中 此文件已重命名为 {2}，以防数据丢失。
zh_hant: 檔案 {0} 已存在於目的地資料夾 {1} 中 檔案已重新命名為 {2}，以避免資料遺失。

# editBookError
source: Error while editing Jupyter Book {0}: {1}
de: Fehler beim Bearbeiten von Jupyter Book "{0}": {1}
es: Error al editar el libro de Jupyter {0}: {1}
fr: Erreur pendant la modification du Jupyter Book {0} : {1}
it: Errore durante la modifica del Book {0}: {1}
ja: Jupyter ブック {0} の編集中にエラーが発生しました: {1}
ko: Jupyter Book {0}을(를) 편집하는 동안 오류 발생: {1}
pt_br: Erro ao editar o Livro Jupyter {0}: {1}
ru: Ошибка при редактировании книги Jupyter {0}: {1}
zh_hans: 编辑 Jupyter Book {0} 时出错: {1}
zh_hant: 編輯 Jupyter 書籍 {0} 時發生錯誤: {1}

source: File Extension
de: Dateierweiterung
es: Extensión de archivo
fr: Extension de fichier
it: Estensione file
ja: ファイル拡張子
ko: 파일 확장명
pt_br: Extensão de Arquivo
ru: Расширение файла
zh_hans: 文件扩展名
zh_hant: 副檔名

source: File Name
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier
it: Nome file
ja: ファイル名
ko: 파일 이름
pt_br: Nome do Arquivo
ru: Имя файла
zh_hans: 文件名
zh_hant: 檔案名稱

# httpRequestError
source: Http Request failed with error: {0} {1}
de: Fehler bei der HTTP-Anforderung: {0} {1}
es: Error de la solicitud HTTP: {0} {1}
fr: La requête HTTP a échoué avec l'erreur : {0} {1}
it: La richiesta HTTP non è riuscita con errore: {0} {1}
ja: HTTP 要求が失敗しました。エラー: {0} {1}
ko: 오류로 인해 Http 요청 실패: {0} {1}
pt_br: Houve uma falha na solicitação HTTP com o erro: {0} {1}
ru: Сбой HTTP-запроса с ошибкой: {0} {1}
zh_hans: HTTP 请求失败，出现错误: {0} {1}
zh_hant: Http 要求失敗。錯誤: {0} {1}

# labelAddToLevel
source: Add to this level
de: Dieser Ebene hinzufügen
es: Agregar a este nivel
fr: Ajouter à ce niveau
it: Aggiungi a questo livello
ja: このレベルに追加する
ko: 이 수준에 추가
pt_br: Adicionar a este nível
ru: Добавить на этот уровень
zh_hans: 添加到此级别
zh_hant: 新增至此層級

# labelBookFolder
source: Select Jupyter Book
de: Jupyter Book auswählen
es: Seleccionar libro de Jupyter
fr: Sélectionnez un Jupyter Book
it: Seleziona Jupyter Book
ja: Jupyter ブックの選択
ko: Jupyter Book 선택
pt_br: Selecionar Livro Jupyter
ru: Выберите книгу Jupyter
zh_hans: 选择 Jupyter Book
zh_hant: 選取 Jupyter 書籍

# labelBookSection
source: Select Jupyter Book Section
de: Jupyter Book-Abschnitt auswählen
es: Seleccionar sección del libro de Jupyter
fr: Sélectionnez la section Jupyter Book
it: Seleziona la sezione Jupyter Book
ja: Jupyter ブックのセクションを選択
ko: Jupyter Book 섹션 선택
pt_br: Selecione a Seção do Livro Jupyter
ru: Выберите раздел книги Jupyter
zh_hans: 选择 Jupyter Book 部分
zh_hant: 選取 Jupyter 書籍章節

# labelSelectFolder
source: Select Folder
de: Ordner auswählen
es: Seleccionar carpeta
fr: Sélectionner un dossier
it: Seleziona cartella
ja: フォルダーの選択
ko: 폴더 선택
pt_br: Selecionar Pasta
ru: Выбрать папку
zh_hans: 选择文件夹
zh_hant: 選取資料夾

source: Language
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ja: 言語
ko: 언어
pt_br: Linguagem
ru: Язык
zh_hans: 语言
zh_hant: 語言

source: Learn more.
de: Weitere Informationen.
es: Más información.
fr: En savoir plus.
it: Altre informazioni.
ja: 詳細情報。
ko: 자세히 알아보세요.
pt_br: Saiba mais.
ru: Подробнее.
zh_hans: 了解详细信息。
zh_hant: 深入了解。

source: Location
de: Speicherort
es: Ubicación
fr: Emplacement
it: Posizione
ja: 場所
ko: 위치
pt_br: Localização
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# missingFileError
source: Missing file : {0} from {1}
de: Fehlende Datei: "{0}" aus "{1}"
es: Falta el archivo {0} de {1}.
fr: Fichier manquant : {0} dans {1}
it: File mancante: {0} da {1}
ja: ファイル {0} が {1} から見つかりません
ko: 누락된 파일: {1}의 {0}
pt_br: Arquivo ausente: {0} de {1}
ru: Отсутствует файл: {0} из {1}
zh_hans: 缺少文件: {1} 中的 {0}
zh_hant: 缺少檔案: {1} 的 {0}

# msgBookAlreadyTrusted
source: Jupyter Book is already trusted in this workspace.
de: Dieses Jupyter Book gilt in diesem Arbeitsbereich bereits als vertrauenswürdig.
es: El libro Jupyter ya está marcado como de confianza en esta área de trabajo.
fr: Jupyter Book est déjà approuvé dans cet espace de travail.
it: Il Book è già considerato attendibile in questa area di lavoro.
ja: Jupyter ブックはこのワークスペースで既に信頼されています。
ko: Jupyter Book은 이미 이 작업 영역에서 신뢰할 수 있습니다.
pt_br: O Livro Jupyter já é confiável neste espaço de trabalho.
ru: Книга Jupyter уже является доверенной в этой рабочей области.
zh_hans: 此工作区已信任 Jupyter Book。
zh_hant: Jupyter 書籍在此工作區已受信任。

# msgBookAlreadyUntrusted
source: Jupyter Book is already untrusted in this workspace.
de: Das Jupyter Book gilt in diesem Arbeitsbereich bereits als nicht vertrauenswürdig.
es: El libro de Jupyter ya se ha marcado como que no es de confianza en esta área de trabajo.
fr: Jupyter Book est déjà non approuvé dans cet espace de travail.
it: Il Book è già considerato non attendibile in questa area di lavoro.
ja: Jupyter ブックは既にこのワークスペースで信頼されていません。
ko: Jupyter Book은 이미 이 작업 영역에서 신뢰할 수 없습니다.
pt_br: O Livro Jupyter já não é confiável neste espaço de trabalho.
ru: Книга Jupyter уже является недоверенной в этой рабочей области.
zh_hans: 此工作区已不信任 Jupyter Book。
zh_hant: Jupyter 書籍在此工作區未受信任。

# msgBookNotFound
source: Jupyter Books not Found
de: Jupyter Books nicht gefunden.
es: No se ha encontrado ningún libro de Jupyter
fr: Jupyter Books introuvables
it: Jupyter Book non trovati
ja: Jupyter ブックが見つかりません
ko: Jupyter Book을 찾을 수 없음
pt_br: Livros Jupyter não encontrados
ru: Книги Jupyter не найдены
zh_hans: 找不到 Jupyter Book
zh_hant: 找不到 Jupyter 書籍

# msgBookPinned
source: Jupyter Book {0} is now pinned in the workspace.
de: Das Jupyter Book "{0}" ist jetzt im Arbeitsbereich angeheftet.
es: El libro de Jupyter {0} está ahora anclado en el área de trabajo.
fr: Jupyter Book {0} est maintenant épinglé dans l'espace de travail.
it: Il Book {0} è stato aggiunto nell'area di lavoro.
ja: Jupyter ブック {0} はワークスペースにピン留めされました。
ko: Jupyter Book {0}는 이제 작업 영역에 고정됩니다.
pt_br: O Livro Jupyter {0} agora está fixado no espaço de trabalho.
ru: Книга Jupyter {0} сейчас закреплена в рабочей области.
zh_hans: 现在，Jupyter Book {0} 固定在此工作区。
zh_hant: Jupyter 書籍 {0} 現已釘選在工作區中。

# msgBookTrusted
source: Jupyter Book is now trusted in the workspace.
de: Das Jupyter Book gilt jetzt im Arbeitsbereich als vertrauenswürdig.
es: El libro de Jupyter ahora es de confianza en el área de trabajo.
fr: Jupyter Book est maintenant approuvé dans l'espace de travail.
it: Jupyter Book è ora considerato attendibile nell'area di lavoro.
ja: Jupyter ブックはワークスペースで信頼されるようになりました。
ko: 이제 Jupyter Book은 작업 영역에서 신뢰할 수 있습니다.
pt_br: O Livro Jupyter agora é confiável no espaço de trabalho.
ru: Книга Jupyter сейчас является доверенной в рабочей области.
zh_hans: 现在，此工作区信任 Jupyter Book。
zh_hant: Jupyter 書籍在此工作區現已受信任。

# msgBookUnpinned
source: Jupyter Book {0} is no longer pinned in this workspace
de: Das Jupyter Book "{0}" ist in diesem Arbeitsbereich nicht mehr angeheftet.
es: El libro de Jupyter {0} ya no está anclado en esta área de trabajo.
fr: Jupyter Book {0} n'est plus épinglé dans cet espace de travail
it: Il Book {0} è stato rimosso da questa area di lavoro
ja: Jupyter ブック {0} はもうこのワークスペースにピン留めされていません
ko: Jupyter Book {0}은(는) 더 이상 이 작업 영역에 고정되지 않습니다.
pt_br: O Livro Jupyter {0} agora não está mais fixado neste espaço de trabalho
ru: Книга Jupyter {0} больше не закреплена в этой рабочей области
zh_hans: Jupyter Book {0} 不再固定在此工作区
zh_hant: Jupyter 書籍 {0} 已不再釘選於此工作區中

# msgBookUntrusted
source: Jupyter Book is no longer trusted in this workspace
de: Das Jupyter Book gilt in diesem Arbeitsbereich nicht mehr als vertrauenswürdig.
es: El libro de Jupyter ya no es de confianza en esta área de trabajo
fr: Jupyter Book n'est plus approuvé dans cet espace de travail
it: Il Book non è più considerato attendibile in questa area di lavoro
ja: Jupyter ブックはこのワークスペースで信頼されなくなりました
ko: Jupyter Book은 더 이상 이 작업 영역에서 신뢰할 수 없습니다.
pt_br: O Livro Jupyter não é mais confiável neste espaço de trabalho
ru: Книга Jupyter больше не является доверенной в этой рабочей области.
zh_hans: 此工作区不再信任 Jupyter Book
zh_hant: Jupyter 書籍在此工作區已不再受信任

# msgContentFolderError
source: Content folder path does not exist
de: Der Pfad für den Inhaltsordner ist nicht vorhanden.
es: La ruta de acceso a la carpeta de contenido no existe.
fr: Le chemin du dossier de contenu n'existe pas
it: Il percorso della cartella del contenuto non esiste
ja: コンテンツ フォルダーのパスが存在しません
ko: 콘텐츠 폴더 경로가 없습니다.
pt_br: O caminho da pasta de conteúdo não existe
ru: Путь к папке содержимого не существует
zh_hans: 内容文件夹路径不存在
zh_hant: 內容資料夾路徑不存在

# msgCreateBookWarningMsg
source: Error while trying to access: {0}
de: Fehler beim Zugriff auf: {0}
es: Error al intentar obtener acceso a: {0}
fr: Erreur lors de la tentative d’accès : {0}
it: Errore durante il tentativo di accesso: {0}
ja: アクセスしようとしているときにエラーが発生しました: {0}
ko: {0}에 액세스하는 동안 오류가 발생했습니다.
pt_br: Erro ao tentar acessar: {0}
ru: Ошибка при попытке доступа: {0}
zh_hans: 尝试访问时出错: {0}
zh_hant: 嘗試存取時發生錯誤: {0}

# msgDownloadLocation
source: Downloading to {0}
de: Download in "{0}"
es: Descarga en {0} en curso
fr: Téléchargement dans {0}
it: Download di {0}
ja: {0} にダウンロードしています
ko: {0}에 다운로드
pt_br: Baixando para {0}
ru: Выполняется скачивание в {0}
zh_hans: 正在下载到 {0}
zh_hant: 正在下載至 {0}

# msgDuplicateFileName
source: File {0} already exists in the destination folder
es: El archivo {0} ya existe en la carpeta de destino
fr: Un fichier nommé {0} existe déjà dans le dossier de destination
ja: 移動先のフォルダーにファイル {0} が既に存在します
ko: {0} 파일이 대상 폴더에 이미 있습니다.
pt_br: Arquivo {0} já existe na pasta de destino
ru: Файл {0} уже существует в папке назначения
zh_hant: 檔案 {0} 已存在於目的地資料夾中

# msgInvalidSaveFolder
source: Save location path is not valid.
de: Der Pfad zum Speicherort ist ungültig.
es: La ruta de acceso a la ubicación no es válida.
fr: Le chemin d’accès de l’emplacement d’enregistrer n’est pas valide.
it: Il percorso di salvataggio non è valido.
ja: 保存場所のパスが無効です。
ko: 저장 위치 경로가 유효하지 않습니다.
pt_br: O caminho do local salvo não é válido.
ru: Недопустимый путь к расположению сохранения.
zh_hans: 保存位置路径无效。
zh_hant: 儲存位置路徑無效。

# msgNo
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# msgReleaseNotFound
source: Releases not Found
de: Releases nicht gefunden.
es: Versiones no encontradas
fr: Versions introuvables
it: Versioni non trovate
ja: リリースが見つかりません
ko: 릴리스를 찾을 수 없음
pt_br: Versões Não Encontradas
ru: Выпуски не найдены
zh_hans: 找不到版本
zh_hant: 找不到版本

# msgRemoteBookDirectoryError
source: Error while creating remote Jupyter Book directory
de: Fehler beim Erstellen des Jupyter Book-Remoteverzeichnisses.
es: Error al crear el directorio de libros de Jupyter remotos
fr: Erreur pendant la création du répertoire du Jupyter Book distant
it: Si è verificato un errore durante la creazione della directory del Book remoto
ja: リモート Jupyter ブック ディレクトリの作成中にエラーが発生しました
ko: 원격 Jupyter Book 디렉터리를 만드는 동안 오류 발생
pt_br: Erro ao criar diretório remoto do Livro Jupyter
ru: Ошибка при создании каталога удаленной книги Jupyter
zh_hans: 创建远程 Jupyter Book 目录时出错
zh_hant: 建立遠端 Jupyter 書籍目錄時發生錯誤

# msgRemoteBookDownloadComplete
source: Remote Jupyter Book download is complete
de: Remoteinstanz von Jupyter Book wurde vollständig heruntergeladen.
es: La descarga del libro remoto de Jupyter se ha completado
fr: Jupyter Book distant est téléchargé
it: Download remoto del Jupyter Book completato
ja: リモート Jupyter ブックのダウンロードが完了しました
ko: 원격 Jupyter Book 다운로드가 완료되었습니다.
pt_br: O download do Livro Jupyter Remoto está concluído
ru: Скачивание удаленной книги Jupyter завершено
zh_hans: 已下载远程 Jupyter Book
zh_hant: 遠端 Jupyter 書籍下載已完成

# msgRemoteBookDownloadError
source: Error while downloading remote Jupyter Book
de: Fehler beim Herunterladen der Remoteinstanz von Jupyter Book.
es: Error al descargar el libro de Jupyter remoto
fr: Erreur lors du téléchargement du Jupyter Book distant
it: Errore durante il download remoto di Jupyter Book
ja: リモート Jupyter ブックのダウンロード中にエラーが発生しました
ko: 원격 Jupyter Book을 다운로드하는 동안 오류 발생
pt_br: Erro ao baixar o Livro Jupyter remoto
ru: Произошла ошибка во время скачивания удаленной книги Jupyter
zh_hans: 下载远程 Jupyter Book 时出错
zh_hant: 下載遠端 Jupyter 書籍時發生錯誤

# msgRemoteBookDownloadProgress
source: Remote Jupyter Book download is in progress
de: Remoteinstanz von Jupyter Book wird heruntergeladen.
es: La descarga del libro remoto de Jupyter está en progreso
fr: Le téléchargement du Jupyter Book distant est en cours
it: È in corso il download remoto del Jupyter Book
ja: リモート Jupyter ブックのダウンロードが進行中です
ko: 원격 Jupyter Book 다운로드가 진행 중입니다.
pt_br: O download do Livro Jupyter Remoto está em andamento
ru: Сейчас выполняется скачивание удаленной книги Jupyter
zh_hans: 正在下载远程 Jupyter Book
zh_hant: 遠端 Jupyter 書籍下載進行中

# msgRemoteBookUnpackingError
source: Error while decompressing remote Jupyter Book
de: Fehler beim Dekomprimieren der Jupyter Book-Remoteinstanz.
es: Error al descomprimir el libro de Jupyter remoto
fr: Erreur de décompression du Jupyter Book distant
it: Errore durante la decompressione del Jupyter Book remoto
ja: リモート Jupyter ブックの圧縮解除中にエラーが発生しました
ko: 원격 Jupyter Book의 압축을 푸는 동안 오류 발생
pt_br: Erro ao descompactar o Livro Jupyter remoto
ru: Ошибка при распаковке удаленной книги Jupyter
zh_hans: 解压缩远程 Jupyter Book 时出错
zh_hant: 解壓縮遠端 Jupyter 書籍時發生錯誤

# msgResourceNotFound
source: Resource not Found
de: Die Ressource wurde nicht gefunden.
es: No se encuentra el recurso.
fr: Ressource introuvable
it: Risorsa non trovata
ja: リソースが見つかりません。
ko: 리소스를 찾을 수 없음
pt_br: Recurso Não Encontrado
ru: Ресурс не найден
zh_hans: 找不到资源
zh_hant: 找不到資源

# msgSampleCodeDataFrame
source: This sample code loads the file into a data frame and shows the first 10 results.
de: Dieser Beispielcode lädt die Datei in einen Datenrahmen und zeigt die ersten 10 Ergebnisse an.
es: Este código de ejemplo carga el archivo en un marco de datos y muestra los primeros 10 resultados.
fr: Cet exemple de code charge le fichier dans un cadre de données et affiche les 10 premiers résultats.
it: Questo codice di esempio consente di caricare il file in un frame di dati e visualizzare i primi 10 risultati.
ja: このサンプル コードは、ファイルをデータ フレームに読み込み、最初の 10 件の結果を示します。
ko: 이 샘플 코드는 파일을 데이터 프레임에 로드하고 처음 10개의 결과를 표시합니다.
pt_br: Este código de exemplo carrega o arquivo em um quadro de dados e mostra os 10 primeiros resultados.
ru: Этот пример кода загружает файл в кадр данных и отображает первые 10 результатов.
zh_hans: 此示例代码将文件加载到数据帧中，并显示前 10 个结果。
zh_hant: 這個範例程式碼會將檔案載入資料框架，並顯示前 10 個結果。

# msgSaveFolderError
source: Save location path does not exist.
de: Der Speicherortpfad ist nicht vorhanden.
es: La ruta de acceso a la ubicación no existe.
fr: Le chemin de l'emplacement d'enregistrement n'existe pas.
it: Il percorso di salvataggio non esiste.
ja: 保存場所のパスが存在しません。
ko: 저장 위치 경로가 없습니다.
pt_br: O caminho de localização para salvar não existe.
ru: Путь к расположению сохранения не существует.
zh_hans: 保存位置路径不存在。
zh_hant: 儲存位置路徑不存在。

# msgTaskName
source: Downloading Remote Jupyter Book
de: Remoteinstanz von Jupyter Book wird heruntergeladen.
es: Descargar libro de Jupyter remoto
fr: Téléchargement du Jupyter Book distant
it: Download del Jupyter Book remoto
ja: リモート Jupyter ブックのダウンロード
ko: 원격 Jupyter Book 다운로드
pt_br: Baixando o Livro Jupyter Remoto
ru: Выполняется скачивание удаленной книги Jupyter
zh_hans: 下载远程 Jupyter Book
zh_hant: 正在下載遠端 Jupyter 書籍

# msgUndefinedAssetError
source: The selected Jupyter Book is not valid
de: Das ausgewählte Jupyter Book ist ungültig.
es: El libro de Jupyter seleccionado no es válido
fr: Le Jupyter Book sélectionné n'est pas valide
it: Il Book selezionato non è valido
ja: 選択した Jupyter ブックは無効です
ko: 선택한 Jupyter Book이 유효하지 않습니다.
pt_br: O Livro Jupyter selecionado não é válido
ru: Выбранная книга Jupyter является недопустимой
zh_hans: 选中的 Jupyter Book 无效
zh_hant: 選取的 Jupyter 書籍無效

# msgYes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱
