Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/notebook.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# notebook.pinnedNotebooks.description
source: Notebooks that are pinned by the user for the current workspace
de: Notebooks, die vom Benutzer für den aktuellen Arbeitsbereich angeheftet wurden
es: Cuadernos anclados por el usuario para el área de trabajo actual
fr: Notebooks épinglés par l'utilisateur pour l'espace de travail actuel
it: Notebook aggiunti dall'utente per l'area di lavoro corrente
ja: ユーザーによって現在のワークスペースにピン留めされているノートブック
ko: 사용자가 현재 작업 영역에 고정한 Notebook
pt_br: Os Notebooks que são fixados pelo usuário para o workspace atual
ru: Записные книжки, закрепленные пользователем для текущей рабочей области
zh_hans: 用户为当前工作区固定的笔记本
zh_hant: 目前工作區之使用者所釘選的筆記本

# notebook.pythonPath.description
source: Local path to python installation used by Notebooks.
de: Lokaler Pfad zur Python-Installation, die von Notebooks verwendet wird.
es: Ruta de acceso local a la instalación de Python utilizada por Notebooks.
fr: Chemin local de l'installation Python utilisé par Notebooks.
it: Percorso locale dell'installazione di Python usata da Notebooks.
ja: ノートブックで使用される Python インストールへのローカル パス。
ko: Notebook에서 사용하는 python 설치의 로컬 경로입니다.
pt_br: Caminho local para a instalação do Python usada por Notebooks.
ru: Локальный путь к установке Python, используемой Записными книжками.
zh_hans: 笔记本使用的 python 安装的本地路径。
zh_hant: Notebooks 所使用之 python 安裝的本機路徑。

# notebook.remoteBookDownloadTimeout.description
source: Download timeout in milliseconds for GitHub books
de: Zeitlimit für Download von GitHub-Büchern in Millisekunden
es: Tiempo de espera en milisegundos para la descarga de libros de GitHub
fr: Délai d'expiration en millisecondes du téléchargement des books GitHub
it: Timeout di download in millisecondi per i libri GitHub
ja: GitHub ブックのダウンロードのタイムアウト (ミリ秒)
ko: GitHub 문서의 다운로드 시간 제한(밀리초)
pt_br: Baixar o tempo limite em milissegundos para os livros do GitHub
ru: Время ожидания скачивания для книг GitHub (в мс)
zh_hans: GitHub 工作簿下载超时时间(毫秒)
zh_hant: GitHub 書籍的下載逾時 (毫秒)

# notebook.trustedBooks.description
source: Notebooks contained in these books will automatically be trusted.
de: In diesen Büchern enthaltene Notebooks werden automatisch als vertrauenswürdig eingestuft.
es: Los cuadernos incluidos en estos libros serán de confianza automáticamente.
fr: Les notebooks contenus dans ces books sont automatiquement approuvés.
it: I notebook contenuti in questi libri verranno considerati automaticamente attendibili.
ja: これらのブックに含まれるノートブックは、自動的に信頼されます。
ko: 이 Book에 포함된 Notebook은 자동으로 신뢰할 수 있습니다.
pt_br: Os Notebooks contidos nesses livros serão automaticamente confiáveis.
ru: Записные книжки, содержащиеся в этих книгах, будут автоматически считаться доверенными.
zh_hans: 包含在这些工作簿中的笔记本将自动受信任。
zh_hant: 將會自動信任包含在這些書籍中的筆記本。

# notebook.useExistingPython.description
source: Local path to a preexisting python installation used by Notebooks.
de: Lokaler Pfad zu einer bereits vorhandenen Python-Installation, die von Notebooks verwendet wird.
es: Ruta de acceso local a una instalación de Python preexistente utilizada por Notebooks.
fr: Chemin local d'une installation précédente de Python utilisée par Notebooks.
it: Percorso locale di un'installazione preesistente di Python usata da Notebooks.
ja: ノートブックで使用される、以前から存在する Python インストールのローカル パス。
ko: Notebook에서 사용하는 기존 python 설치의 로컬 경로입니다.
pt_br: Caminho local para uma instalação do Python preexistente usada por Notebooks.
ru: Локальный путь к существующей установке Python, используемой Записными книжками.
zh_hans: 笔记本使用的预先存在的 python 安装的本地路径。
zh_hant: Notebooks 所使用之現有 python 安裝的本機路徑。

# title.PinnedBooks
source: Pinned notebooks
de: Angeheftete Notebooks
es: Cuadernos anclados
fr: Notebooks épinglés
it: Notebook aggiunti
ja: ピン留めされたノートブック
ko: 고정된 Notebook
pt_br: Notebooks fixados
ru: Закрепленные записные книжки
zh_hans: 固定的笔记本
zh_hant: 已釘選的筆記本

# title.PreviewLocalizedBook
source: Get localized SQL Server 2019 guide
de: Lokalisierten SQL Server 2019-Leitfaden abrufen
es: Obtención de la guía de SQL Server 2019 traducida
fr: Localiser le Guide SQL Server 2019
it: Ottieni la Guida localizzata di SQL Server 2019
ja: ローカライズ版 SQL Server 2019 ガイドの入手
ko: 지역화된 SQL Server 2019 가이드 가져오기
pt_br: Obtenha o guia do SQL Server 2019 localizado
ru: Скачать локализованное руководство по SQL Server 2019
zh_hans: 获取本地化 SQL Server 2019 指南
zh_hant: 取得當地語系化 SQL Server 2019 指南

# title.ProvidedBooks
source: Provided Jupyter Books
de: Bereitgestellte Jupyter Books
es: Libros de Jupyter proporcionados
fr: Jupyter Books fournis
it: Jupyter Book disponibili
ja: 提供されている Jupyter ブック
ko: Jupyter Book 제공
pt_br: Livros Jupyter fornecidos
ru: Указанные книги Jupyter
zh_hans: 提供的 Jupyter Book
zh_hant: 提供的 Jupyter 書籍

# title.SQL19PreviewBook
source: SQL Server 2019 Guide
de: Leitfaden zu SQL Server 2019
es: Guía de SQL Server 2019
fr: Guide SQL Server 2019
it: Guida di SQL Server 2019
ja: SQL Server 2019 ガイド
ko: SQL Server 2019 가이드
pt_br: Guia do SQL Server 2019
ru: Руководство по SQL Server 2019
zh_hans: SQL Server 2019 指南
zh_hant: SQL Server 2019 指南

# title.SavedBooks
source: Notebooks
es: Cuadernos
it: Notebook
ja: ノートブック
ko: Notebook
ru: Записные книжки
zh_hans: 笔记本

# title.addMarkdown
source: Add Markdown File
de: Markdowndatei hinzufügen
es: Agregar un archivo de Markdown
fr: Ajouter un fichier de marques
it: Aggiungi file markdown
ja: マークダウン ファイルの追加
ko: Markdown 파일 추가
pt_br: Adicionar Arquivo de Marcação
ru: Добавить файл Markdown
zh_hans: 添加 Markdown 文件
zh_hant: 新增 Markdown 檔案

# title.addNotebook
source: Add Notebook
de: Notebook hinzufügen
es: Agregar el Bloc de notas
fr: Ajouter un bloc-notes
it: Aggiungere blocco appunti
ja: ノートブックの追加
ko: Notebook 추가
pt_br: Adicionar Bloco de Anotações
ru: Добавить записную книжку
zh_hans: 添加笔记本
zh_hant: 新增筆記本

# title.addSection
source: Add Section
es: Agregar sección
fr: Ajouter une section
ja: セクションの追加
ko: 섹션 추가
pt_br: Adicionar Seção
ru: Добавить раздел
zh_hant: 新增區段

# title.analyzeJupyterNotebook
source: Analyze in Notebook
de: In Notebook analysieren
es: Analizar en Notebook
fr: Analyser dans le notebook
it: Analizza in Notebook
ja: ノートブックで分析
ko: Notebook에서 분석
pt_br: Analisar no Notebook
ru: Анализировать в Notebook
zh_hans: 在笔记本中分析
zh_hant: 在 Notebook 中分析

# title.closeJupyterBook
source: Close Jupyter Book
de: Jupyter-Buch schließen
es: Cierre del libro de Jupyter
fr: Fermer Jupyter Book
it: Chiudi libro Jupyter
ja: Jupyter ブックを閉じる
ko: Jupyter Book 닫기
pt_br: Fechar o Livro do Jupyter
ru: Закрыть книгу Jupyter
zh_hans: 关闭 Jupyter Book
zh_hant: 關閉 Jupyter 書籍

# title.closeNotebook
source: Close Notebook
de: Notebook schließen
es: Cerrar bloc de notas
fr: Fermeture du bloc-notes
it: Chiudere blocco appunti
ja: ノートブックを閉じる
ko: Notebook 닫기
pt_br: Fechar Bloco de Anotações
ru: Закрыть записную книжку
zh_hans: 关闭笔记本
zh_hant: 關閉筆記本

# title.configurePython
source: Configure Python for Notebooks
de: Python für Notebooks konfigurieren
es: Configurar Python para Notebooks
fr: Configurer Python pour Notebooks
it: Configura Python per Notebooks
ja: ノートブック用 Python の構成
ko: Notebook용 Python 구성
pt_br: Configurar o Python para Notebooks
ru: Настройка Python для Записных книжек
zh_hans: 为笔记本配置 Python
zh_hant: 為 Notebooks 設定 Python

# title.createJupyterBook
source: Create Jupyter Book
de: Jupyter Book erstellen
es: Crear el libro de Jupyter
fr: Créer un Jupyter Book
it: Crea Jupyter Book
ja: Jupyter ブックの作成
ko: Jupyter Book 만들기
pt_br: Criar Livro Jupyter
ru: Создать книгу Jupyter
zh_hans: 创建 Jupyter Book
zh_hant: 建立 Jupyter 書籍

# title.jupyter.setContext
source: Set context for Notebook
de: Kontext für Notebook festlegen
es: Establecer contexto para Notebook
fr: Définir le contexte du notebook
it: Imposta contesto per Notebook
ja: ノートブックのコンテキストを設定します
ko: Notebook의 컨텍스트 설정
pt_br: Definir o contexto do Notebook
ru: Задать контекст для Notebook
zh_hans: 为笔记本设置上下文
zh_hant: 設定 Notebook 的內容

# title.jupyter.setKernel
source: Set kernel for Notebook
de: Kernel für Notebook festlegen
es: Establecer kernel para Notebook
fr: Définir le noyau du notebook
it: Imposta kernel per Notebook
ja: ノートブック用カーネルの設定
ko: Notebook용 커널 설정
pt_br: Definir o kernel do Notebook
ru: Задать ядро для Notebook
zh_hans: 为笔记本设置内核
zh_hant: 設定 Notebook 的核心

# title.managePackages
source: Manage Packages
de: Pakete verwalten
es: Administrar paquetes
fr: Gérer les packages
it: Gestisci pacchetti
ja: パッケージの管理
ko: 패키지 관리
pt_br: Gerenciar Pacotes
ru: Управление пакетами
zh_hans: 管理包
zh_hant: 管理套件

# title.moveTo
source: Move to ...
de: Verschieben nach...
es: Mover a...
fr: Déplacer vers...
it: Sposta in...
ja: 移動先...
ko: 이동 대상...
pt_br: Mover para...
ru: Переместить в…
zh_hans: 移到...
zh_hant: 移至...

# title.newJupyterNotebook
source: New Notebook
de: Neues Notebook
es: Nuevo Notebook
fr: Nouveau notebook
it: Nuovo notebook
ja: 新しいノートブック
ko: 새 Notebook
pt_br: Novo Notebook
ru: Создать записную книжку
zh_hans: 新建笔记本
zh_hant: 新增 Notebook

# title.openJupyterBook
source: Open Jupyter Book
de: Jupyter-Buch öffnen
es: Apertura de libros de Jupyter
fr: Ouvrir Jupyter Book
it: Apri libro Jupyter
ja: Jupyter ブックを開く
ko: Jupyter Book 열기
pt_br: Abrir Livro do Jupyter
ru: Открыть книгу Jupyter
zh_hans: 打开 Jupyter Book
zh_hant: 開啟 Jupyter 書籍

# title.openJupyterNotebook
source: Open Notebook
de: Notebook öffnen
es: Abrir Notebook
fr: Ouvrir le notebook
it: Apri notebook
ja: ノートブックを開く
ko: Notebook 열기
pt_br: Abrir o Notebook
ru: Открыть записную книжку
zh_hans: 打开笔记本
zh_hant: 開啟 Notebook

# title.openNotebookFolder
source: Open Notebooks in Folder
de: Notebooks in Ordner öffnen
es: Apertura de cuadernos en la carpeta
fr: Ouvrir les notebooks dans le dossier
it: Apri notebook nella cartella
ja: フォルダー内のノートブックを開く
ko: 폴더에서 Notebook 열기
pt_br: Abrir Notebooks na Pasta
ru: Открыть записные книжки в папке
zh_hans: 在文件夹中打开笔记本
zh_hant: 在資料夾中開啟 Notebooks

# title.openRemoteJupyterBook
source: Add Remote Jupyter Book
de: Jupyter-Remotebuch hinzufügen
es: Adición de libro de Jupyter remoto
fr: Ajouter un book Jupyter distant
it: Aggiungi libro remoto Jupyter
ja: リモート Jupyter ブックの追加
ko: 원격 Jupyter Book 추가
pt_br: Adicionar Livro do Jupyter Remoto
ru: Добавить удаленную книгу Jupyter
zh_hans: 添加远程 Jupyter Book
zh_hant: 新增遠端 Jupyter 書籍

# title.pinNotebook
source: Pin Notebook
de: Notebook anheften
es: Anclado de cuadernos
fr: Épingler le notebook
it: Aggiungi notebook
ja: ノートブックのピン留め
ko: Notebook 고정
pt_br: Fixar Notebook
ru: Закрепить записную книжку
zh_hans: 固定笔记本
zh_hant: 釘選筆記本

# title.reinstallNotebookDependencies
source: Reinstall Notebook dependencies
de: Notebook-Abhängigkeiten neu installieren
es: Reinstalar dependencias de Notebook
fr: Réinstaller les dépendances de notebook
it: Reinstalla dipendenze di Notebook
ja: ノートブック依存関係を再インストール
ko: Notebook 종속성 다시 설치
pt_br: Reinstalar as dependências do Notebook
ru: Переустановка зависимостей Notebook
zh_hans: 重新安装笔记本依赖项
zh_hant: 重新安裝 Notebook 相依性

# title.removeNotebook
source: Remove Notebook
de: Notebook entfernen
es: Quitar el bloc de notas
fr: Voulez-vous supprimer le bloc-notes
it: Rimuovere il blocco appunti
ja: ノートブックの削除
ko: Notebook 제거
pt_br: Remover Bloco de Anotações
ru: Удалить записную книжку
zh_hans: 移除笔记本
zh_hant: 移除筆記本

# title.revealInBooksViewlet
source: Reveal in Books
de: In Büchern offenlegen
es: Visualización en libros
fr: Afficher dans Books
it: Visualizza nei libri
ja: ブックで公開する
ko: Book에 표시
pt_br: Revelar nos Livros
ru: Показать в книгах
zh_hans: 在工作簿中展示
zh_hant: 在書籍中顯示

# title.saveJupyterBook
source: Save Jupyter Book
de: Jupyter Book speichern
es: Guardar el libro de Jupyter
fr: Enregistrer Jupyter Book
it: Salva il Jupyter Book
ja: Jupyter ブックの保存
ko: Jupyter Book 저장
pt_br: Salvar Livro Jupyter
ru: Сохранить книгу Jupyter
zh_hans: 保存 Jupyter Book
zh_hant: 開啟 Jupyter 書籍

# title.searchJupyterBook
source: Search Jupyter Book
de: Jupyter Book durchsuchen
es: Buscar libro de Jupyter
fr: Rechercher dans Jupyter Book
it: Cerca nel Jupyter Book
ja: Jupyter ブックの検索
ko: Jupyter Book 검색
pt_br: Pesquisar no Livro Jupyter
ru: Искать книгу Jupyter
zh_hans: 搜索 Jupyter Book
zh_hant: 搜尋 Jupyter 書籍

# title.trustBook
source: Trust Jupyter Book
de: Jupyter Book als vertrauenswürdig einstufen
es: Confiar en el libro de Jupyter
fr: Jupyter Book de confiance
it: Jupyter Book attendibile
ja: Jupyter ブックの信頼
ko: Jupyter Book 신뢰
pt_br: Confiar Livro Jupyter
ru: Доверенные книги Jupyter
zh_hans: 信任 Jupyter Book
zh_hant: 信任 Jupyter 書籍

# title.unpinNotebook
source: Unpin Notebook
de: Notebook lösen
es: Desanclado de cuadernos
fr: Détacher le notebook
it: Rimuovi notebook
ja: ノートブックのピン留めを外す
ko: Notebook 고정 해제
pt_br: Desafixar Notebook
ru: Открепить записную книжку
zh_hans: 取消固定笔记本
zh_hant: 取消釘選筆記本

# duplicateFileError
source: File {0} already exists in the destination folder {1} The file has been renamed to {2} to prevent data loss.
es: El archivo {0} ya existe en la carpeta de destino {1}. Se ha cambiado el nombre del archivo a {2} para evitar la pérdida de datos.
fr: Le fichier {0} existe déjà dans le dossier de destination {1} Le fichier a été renommé en {2} pour éviter toute perte de données.

# configurePythyon.dropdownPathLabel
source: {0} (Python {1})
es: {0} ({1} de Python)

# msgDuplicadFileName
source: File {0} already exists in the destination folder
de: Die Datei "{0}" ist im Zielordner bereits vorhanden.
it: Il file {0} esiste già nella cartella di destinazione
zh_hans: 目标文件夹中已存在文件 {0}

# configurePython.descriptionWithKernel
source: The {0} kernel requires a Python runtime to be configured and dependencies to be installed.
de: Für den {0}-Kernel ist die Konfiguration einer Python-Runtime und die Installation von Abhängigkeiten erforderlich.
it: Il kernel {0} richiede la configurazione di un runtime Python e l'installazione delle dipendenze.
zh_hans: {0} 内核要求配置 Python 运行时并安装依赖项。

# msgUnsupportedKernel
source: Could not retrieve packages for kernel {0}
de: Für Kernel "{0}" konnten keine Pakete abgerufen werden.
it: Non è stato possibile recuperare i pacchetti per il kernel {0}
zh_hans: 无法检索内核 {0} 的包
