Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/profiler.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# createSessionDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отменить
zh_hans: 取消
zh_hant: 取消

# createSessionDialog.create
source: Start
de: Starten
es: Inicio
fr: Démarrer
ja: 開始
ko: 시작
pt_br: Iniciar
ru: Запустить
zh_hans: 开始
zh_hant: 開始

# createSessionDialog.createSessionFailed
source: Failed to create a session
de: Fehler beim Erstellen einer Sitzung.
es: No se pudo crear una sesión
fr: La création de session a échoué
ja: セッションを作成できませんでした
ko: 세션을 만들지 못함
pt_br: Falha ao criar uma sessão
ru: Не удалось создать сеанс
zh_hans: 未能创建会话
zh_hant: 無法建立工作階段

# createSessionDialog.dialogOwnerInvalid
source: Invalid dialog owner, cannot open dialog
de: Ungültiger Besitzer für Dialogfeld. Das Dialogfeld kann nicht geöffnet werden.
es: Propietario de cuadro de diálogo no válido, no se puede abrir el cuadro de diálogo
fr: Propriétaire de boîte de dialogue non valide, impossible d'ouvrir la boîte de dialogue
ja: ダイアログ所有者が無効です。ダイアログを開くことができません
ko: 대화 상자 소유자가 잘못되었습니다. 대화 상자를 열 수 없습니다.
pt_br: Proprietário de caixa de diálogo inválido. Não é possível abrir a caixa de diálogo
ru: Недопустимый владелец диалогового окна, не удается открыть диалоговое окно
zh_hans: 对话所有者无效，无法打开对话
zh_hant: 對話方塊擁有者無效，無法開啟對話方塊

# createSessionDialog.enterSessionName
source: Enter session name:
de: Sitzungsnamen eingeben:
es: Escriba el nombre de la sesión:
fr: Entrez le nom de la session :
ja: セッション名を入力する:
ko: 세션 이름 입력:
pt_br: Digite o nome da sessão:
ru: Введите имя сеанса:
zh_hans: 输入会话名称:
zh_hant: 輸入工作階段名稱:

# createSessionDialog.invalidProviderType
source: Invalid provider type, cannot open dialog
de: Ungültiger Anbietertyp. Das Dialogfeld kann nicht geöffnet werden.
es: Tipo de proveedor no válido, no se puede abrir el cuadro de diálogo
fr: Type de fournisseur non valide, impossible d'ouvrir la boîte de dialogue
ja: 無効なプロバイダーの種類です。ダイアログを開くことができません
ko: 공급자 유형이 잘못되었습니다. 대화 상자를 열 수 없습니다.
pt_br: Tipo de provedor inválido. Não é possível abrir a caixa de diálogo
ru: Недопустимый тип поставщика, не удается открыть диалоговое окно
zh_hans: 提供程序类型无效，无法打开对话
zh_hant: 提供者類型無效，無法開啟對話方塊

# createSessionDialog.selectTemplates
source: Select session template:
de: Sitzungsvorlage auswählen:
es: Seleccione plantilla de sesión:
fr: Sélectionnez un modèle de session :
ja: セッション テンプレートの選択:
ko: 세션 템플릿 선택:
pt_br: Selecione o modelo de sessão:
ru: Выберите шаблон сеанса:
zh_hans: 选择会话模板:
zh_hant: 選取工作階段範本:

# createSessionDialog.templatesInvalid
source: Invalid templates list, cannot open dialog
de: Ungültige Vorlagenliste. Das Dialogfeld kann nicht geöffnet werden.
es: Lista de plantillas no válida, no se puede abrir el cuadro de diálogo
fr: Liste de modèles non valide, impossible d'ouvrir la boîte de dialogue
ja: テンプレート リストが無効です。ダイアログを開くことができません
ko: 템플릿 목록이 잘못되었습니다. 대화 상자를 열 수 없습니다.
pt_br: Lista de modelos inválidas. Não é possível abrir a caixa de diálogo
ru: Недопустимый список шаблонов, не удается открыть диалоговое окно
zh_hans: 模板列表无效，无法打开对话
zh_hant: 範本清單無效，無法開啟對話方塊

# createSessionDialog.title
source: Start New Profiler Session
de: Neue Profilersitzung starten
es: Iniciar nueva sesión de Profiler
fr: Démarrer une nouvelle session Profiler
ja: 新しいプロファイラー セッションの開始
ko: 새 Profiler 세션 시작
pt_br: Iniciar Nova Sessão do Profiler
ru: Запустить новый сеанс профилировщика
zh_hans: 启动新的探查器会话
zh_hant: 開始新的分析工具工作階段

# description
source: SQL Server Profiler for Azure Data Studio
de: SQL Server Profiler für Azure Data Studio
fr: SQL Server Profiler pour Azure Data Studio
ko: Azure Data Studio에 대한 SQL Server Profiler
pt_br: SQL Server Profiler para Azure Data Studio
ru: Приложение SQL Server Profiler для Azure Data Studio
zh_hant: Azure Data Studio 的 SQL Server Profiler

# displayName
source: SQL Server Profiler
ru: Приложение SQL Server Profiler

# profiler.category
source: Profiler
fr: Profileur
ja: プロファイラー
ko: 프로파일러
ru: Профилировщик
zh_hans: 探查器
zh_hant: 分析工具

# profiler.contributes.title.newProfler
source: Launch Profiler
de: Profiler starten
es: Iniciar Profiler
fr: Lancer Profiler
ja: Profiler を起動
ko: Profiler 시작
pt_br: Iniciar Profiler
ru: Запустить профилировщик
zh_hans: 启动探查器
zh_hant: 啟動分析工具

# profiler.contributes.title.openCreateSessionDialog
source: Create Profiler Season
de: Profiler-Staffel erstellen
fr: Créer une saison de profileur
ko: 프로파일러 시즌 만들기
pt_br: Criar Temporada do Profiler
ru: Создание сезона профилировщика
zh_hant: 建立分析工具季節

# profiler.contributes.title.start
source: Start
de: Starten
es: Inicio
fr: Démarrer
ja: 開始
ko: 시작
pt_br: Iniciar
ru: Запустить
zh_hans: 开始
zh_hant: 開始

# profiler.contributes.title.stop
source: Stop
de: Beenden
es: Detener
fr: Arrêter
ja: 停止
ko: 중지
pt_br: Parar
ru: Остановить
zh_hans: 停止
zh_hant: 停止
