Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# sqlVMDeploymentWizard.PasswordLengthError
source: Password must be between 12 and 123 characters long.
de: Das Kennwort muss zwischen 12 und 123 Zeichen umfassen.
es: La contraseña debe tener una longitud de entre 12 y 123 caracteres.
fr: Le mot de passe doit avoir entre 12 et 123 caractères.
it: La lunghezza della password deve essere compresa tra 12 e 123 caratteri.
ja: パスワードは 12 から 123 文字までの長さにする必要があります
ko: 암호는 12~123자여야 합니다.
pt_br: A senha precisa ter entre 12 e 123 caracteres.
ru: Пароль должен содержать от 12 до 123 символов.
zh_hans: 密码长度必须介于 12 到 123 个字符之间。
zh_hant: 密碼的長度必須介於 12 到 123 個字元之間。

# sqlVMDeploymentWizard.PasswordSpecialCharRequirementError
source: Password must have 3 of the following: 1 lower case character, 1 upper case character, 1 number, and 1 special character.
de: Kennwörter müssen 3 der folgenden Zeichen enthalten: einen Kleinbuchstaben, einen Großbuchstaben, eine Ziffer und ein Sonderzeichen.
es: La contraseña debe tener 3 de los siguientes caracteres: 1 letra minúscula, 1 letra mayúscula, 1 número y 1 carácter especial.
fr: Le mot de passe doit comporter trois des éléments suivants : une minuscule, une majuscule, un chiffre et un caractère spécial.
it: La password deve contenere tre dei caratteri seguenti: un carattere minuscolo, un carattere maiuscolo, un numero e un carattere speciale.
ja: パスワードには、次のうちの 3 つを含める必要があります: 1 つの小文字、1 つの大文字、1 つの数字、および 1 つの特殊文字。
ko: 암호는 소문자 1자, 대문자 1자, 숫자 1자 및 특수 문자 1자 중 3가지를 포함해야 합니다.
pt_br: A senha deve ter 3 dos seguintes itens: 1 caractere minúsculo, 1 caractere maiúsculo, 1 número e 1 caractere especial.
ru: Пароль должен содержать символы трех видов из следующих: строчных букв, прописных букв, цифр и специальных символов.
zh_hans: 密码必须包含以下3部分：1个小写字符、1 个大写字符、1 个数字和 1 个特殊字符。
zh_hant: 密碼必須要有下列項目中的 3 項: 1 個小寫字元、1 個大寫字元、1 個數字與 1 個特殊字元。

# deployAzureSQLVM.VnameLengthError
source: Virtual machine name must be between 1 and 15 characters long.
de: Der VM-Name muss zwischen 1 und 15 Zeichen umfassen.
es: El nombre de la máquina virtual debe tener una longitud de entre 1 y 15 caracteres.
fr: Le nom de machine virtuelle doit avoir entre 1 et 15 caractères.
it: La lunghezza del nome della macchina virtuale deve essere compresa tra 1 e 15 caratteri.
ja: 仮想マシン名は 1 から 15 文字までの長さにする必要があります。
ko: 가상 머신 이름은 1~15자여야 합니다.
pt_br: O nome da máquina virtual precisa ter entre 1 e 15 caracteres.
ru: Длина имени виртуальной машины должна составлять от 1 до 15 символов.
zh_hans: 虚拟机名称长度必须介于 1 到 15 个字符之间。
zh_hant: 虛擬機器名稱的長度必須介於 1 到 15 個字元之間。

# deployAzureSQLVM.VNameOnlyNumericNameError
source: Virtual machine name cannot contain only numbers.
de: Der Name des virtuellen Computers darf nicht nur Ziffern enthalten.
es: El nombre de máquina virtual no puede contener solo números.
fr: Le nom de la machine virtuelle ne peut pas contenir uniquement des chiffres.
it: Il nome macchina virtuale non può contenere solo numeri.
ja: 仮想マシン名を数字だけにすることはできません。
ko: 가상 머신 이름을 숫자로만 설정할 수는 없습니다.
pt_br: O nome da máquina virtual não pode conter somente números.
ru: Имя виртуальной машины не может состоять только из цифр.
zh_hans: 虚拟机名称不能仅包含数字。
zh_hant: 虛擬機器名稱不可只包含數字。

# deployAzureSQLVM.VNamePrefixSuffixError
source: Virtual machine name Can't start with underscore. Can't end with period or hyphen
de: Der VM-Name darf nicht mit einem Unterstrich beginnen und nicht auf einen Punkt oder Bindestrich enden.
es: El nombre de la máquina virtual no puede empezar por un guion bajo, ni tampoco terminar con un punto o un guion.
fr: Le nom de machine virtuelle ne peut pas commencer par un trait de soulignement, et ne peut pas se terminer par un point ou un trait d'union
it: Il nome della macchina virtuale non può iniziare con un carattere di sottolineatura e non può terminare con un punto o un trattino
ja: 仮想マシン名をアンダースコアで始めることはできません。末尾にピリオドまたはハイフンを使用することはできません
ko: 가상 머신 이름은 밑줄로 시작할 수 없습니다. 마침표 또는 하이픈으로 끝날 수 없습니다.
pt_br: O nome da máquina virtual não pode começar com sublinhado e não pode terminar com ponto ou hífen
ru: Имя виртуальной машины не может начинаться с символа подчеркивания и не может заканчиваться точкой или дефисом
zh_hans: 虚拟机名称不得以下划线开头。不得以句点或连字符结尾
zh_hant: 虛擬機器名稱的開頭不能為底線。結尾不能為句號或連字號

# deployAzureSQLVM.VNameSpecialCharError
source: Virtual machine name cannot contain special characters \/""[]:|<>+=;,?*@&, .
de: Der VM-Name darf keines der folgenden Sonderzeichen enthalten: \/""[]:|<>+=;,?*@&
es: El nombre de la máquina virtual no puede contener los caracteres especiales \/""[]:|<>+=;,?*@&,.
fr: Le nom de machine virtuelle ne peut pas contenir les caractères spéciaux \/""[]:|<>+=;,?*@&, .
it: Il nome della macchina virtuale non può contenere i caratteri speciali seguenti: \/""[]:|<>+=;,?*@&, .
ja: 仮想マシン名に特殊文字 \/""[]:|<>+=;,?*@&, を含めることはできません。
ko: 가상 머신 이름에는 특수 문자 \/""[]:|<>+=;,?*@&,가 포함될 수 없습니다.
pt_br: O nome da máquina virtual não pode conter os caracteres especiais \/""[]:|<>+=;,?*@&, .
ru: Имя виртуальной машины не может содержать специальные символы \/""[]:|<>+=;,?*@&,.
zh_hans: 虚拟机名称不得包含特殊字符 \/""[]:|<>+=;,?*@&, .
zh_hant: 虛擬機器名稱不能包含特殊字元 \/""[]:|<>+=;,?*@&,。

# deployAzureSQLVM.VNameExistsError
source: Virtual machine name must be unique in the current resource group.
de: Der Name des virtuellen Computers muss in der aktuellen Ressourcengruppe eindeutig sein.
es: El nombre de la máquina virtual debe ser único en el grupo de recursos actual.
fr: Le nom de la machine virtuelle doit être unique dans le groupe de ressources actuel.
it: Il nome della macchina virtuale deve essere univoco nel gruppo di risorse corrente.
ja: 仮想マシンの名前は、現在のリソース グループ内で一意である必要があります。
ko: 가상 머신 이름은 현재 리소스 그룹에서 고유해야 합니다.
pt_br: O nome da máquina virtual deve ser exclusivo no grupo de recursos atual.
ru: Имя виртуальной машины должно быть уникальным в текущей группе ресурсов.
zh_hans: 虚拟机名称在当前资源组中必须唯一。
zh_hant: 虛擬機器名稱在目前的資源群組中必須是唯一的。

# deployAzureSQLVM.VMUsernameLengthError
source: Username must be between 1 and 20 characters long.
de: Der Benutzername muss zwischen 1 und 20 Zeichen umfassen.
es: El nombre de usuario debe tener una longitud de entre 1 y 20 caracteres.
fr: Le nom d'utilisateur doit avoir entre 1 et 20 caractères.
it: La lunghezza del nome utente deve essere compresa tra 1 e 20 caratteri.
ja: ユーザー名は 1 から 20 文字までの長さにする必要があります。
ko: 사용자 이름은 1~20자여야 합니다.
pt_br: O nome de usuário precisa ter entre 1 e 20 caracteres.
ru: Длина имени пользователя должна составлять от 1 до 20 символов.
zh_hans: 用户名长度必须介于 1 到 20 个字符之间。
zh_hant: 使用者名稱的長度必須介於 1 到 20 個字元之間。

# deployAzureSQLVM.VMUsernameSuffixError
source: Username cannot end with period
de: Der Benutzername darf nicht auf einen Punkt enden.
es: El nombre de usuario no puede terminar con punto.
fr: Le nom d'utilisateur ne peut pas se terminer par un point
it: Il nome utente non può terminare con un punto
ja: ユーザー名の末尾をピリオドにすることはできません
ko: 사용자 이름은 마침표로 끝날 수 없습니다.
pt_br: O nome de usuário não pode terminar com um ponto
ru: Имя пользователя не может заканчиваться точкой
zh_hans: 用户名不能以句点结尾
zh_hant: 使用者名稱的結尾不能為句號

# deployAzureSQLVM.VMUsernameSpecialCharError
source: Username cannot contain special characters \/""[]:|<>+=;,?*@& .
de: Der Benutzername darf keines der folgenden Sonderzeichen enthalten: \/""[]:|<>+=;,?*@&
es: El nombre de usuario no puede contener los caracteres especiales \/""[]:|<>+=;,?*@&.
fr: Le nom d'utilisateur ne peut pas contenir les caractères spéciaux \/""[]:|<>+=;,?*@& .
it: Il nome utente non può contenere i caratteri speciali seguenti: \/""[]:|<>+=;,?*@& .
ja: ユーザー名に特殊文字 \/""[]:|<>+=;,?*@& を含めることはできません。
ko: 사용자 이름에는 특수 문자 \/""[]:|<>+=;,?*@&를 사용할 수 없습니다.
pt_br: O nome de usuário não pode conter caracteres especiais \/""[]:|<>+=;,?*@& .
ru: Имя пользователя не может содержать специальные символы \/""[]:|<>+=;,?*@&.
zh_hans: 用户名不得包含特殊字符 \/""[]:|<>+=;,?*@& .
zh_hant: 使用者名稱不能包含特殊字元 \/""[]:|<>+=;,?*@& 。

# deployAzureSQLVM.VMUsernameReservedWordsError
source: Username must not include reserved words.
de: Der Benutzername darf keine reservierten Wörter enthalten.
es: El nombre de usuario no debe incluir palabras reservadas.
fr: Les noms d'utilisateur ne doivent pas comprendre de mots réservés.
it: Il nome utente non deve includere parole riservate.
ja: ユーザー名には予約語を含めないでください。
ko: 사용자 이름은 예약어를 포함하지 않아야 합니다.
pt_br: O nome de usuário não pode incluir palavras reservadas.
ru: Имя пользователя не должно содержать зарезервированные слова.
zh_hans: 用户名不得包含保留字。
zh_hant: 使用者名稱不得包含保留字。

# deployAzureSQLVM.VMConfirmPasswordError
source: Password and confirm password must match.
de: Das Kennwort und die Kennwortbestätigung müssen übereinstimmen.
es: La contraseña y la confirmación de la contraseña deben coincidir.
fr: Les champs de mot de passe et de confirmation du mot de passe doivent correspondre.
it: La password e la password di conferma devono corrispondere.
ja: パスワードとパスワードの確認が一致しなければなりません。
ko: 암호와 확인 암호가 일치해야 합니다.
pt_br: A Senha e a Confirmação de senha devem corresponder.
ru: Пароль и его подтверждение должны совпадать.
zh_hans: 密码和确认密码必须匹配。
zh_hant: [密碼] 和 [確認密碼] 必須相符。

# deployAzureSQLVM.vmDropdownSizeError
source: Select a valid virtual machine size.
de: Wählen Sie eine gültige VM-Größe aus.
es: Seleccione un tamaño de máquina virtual válido.
fr: Sélectionnez une taille de machine virtuelle valide.
it: Selezionare dimensioni di macchina virtuale valide.
ja: 有効な仮想マシンのサイズを選択してください。
ko: 유효한 가상 머신 크기를 선택합니다.
pt_br: Selecione um tamanho de máquina virtual válido.
ru: Выберите допустимый размер виртуальной машины.
zh_hans: 选择有效的虚拟机大小。
zh_hant: 請選取有效的虛擬機器大小。

# deployAzureSQLVM.NewVnetPlaceholder
source: Enter name for new virtual network
de: Geben Sie einen Namen für das neue virtuelle Netzwerk ein.
es: Escriba un nombre para la nueva red virtual.
fr: Entrer un nom pour le nouveau réseau virtuel
it: Immettere il nome per la nuova rete virtuale
ja: 新しい仮想ネットワークの名前を入力してください
ko: 새 가상 네트워크의 이름 입력
pt_br: Inserir o nome da nova rede virtual
ru: Введите имя новой виртуальной сети
zh_hans: 输入新虚拟网络的名称
zh_hant: 為新的虛擬網路輸入名稱

# deployAzureSQLVM.NewSubnetPlaceholder
source: Enter name for new subnet
de: Geben Sie einen Namen für das neue Subnetz ein.
es: Escriba un nombre para la nueva subred.
fr: Entrer un nom pour le nouveau sous-réseau
it: Immettere il nome per la nuova subnet
ja: 新しいサブネットの名前を入力してください
ko: 새 서브넷의 이름 입력
pt_br: Inserir o nome da nova sub-rede
ru: Введите имя новой подсети
zh_hans: 输入新子网的名称
zh_hant: 為新的子網路輸入名稱

# deployAzureSQLVM.NewPipPlaceholder
source: Enter name for new public IP
de: Geben Sie einen Namen für die neue öffentliche IP-Adresse ein.
es: Escriba un nombre para la nueva dirección IP pública.
fr: Entrer un nom pour la nouvelle IP publique
it: Immettere il nome per il nuovo indirizzo IP pubblico
ja: 新しいパブリック IP の名前を入力してください
ko: 새 공용 IP의 이름 입력
pt_br: Inserir o nome do novo IP
ru: Введите имя нового общедоступного IP-адреса
zh_hans: 输入新公共 IP 的名称
zh_hant: 為新的公用 IP 輸入名稱

# deployAzureSQLVM.VnetNameLengthError
source: Virtual Network name must be between 2 and 64 characters long
de: Der VNet-Name muss zwischen 2 und 64 Zeichen umfassen.
es: El nombre de la red virtual debe tener una longitud de entre 2 y 64 caracteres.
fr: Le nom de réseau virtuel doit avoir entre 2 et 64 caractères
it: La lunghezza del nome della rete virtuale deve essere compresa tra 2 e 64 caratteri
ja: 仮想ネットワーク名は 2 から 64 文字までの長さにする必要があります
ko: Virtual Network 이름은 2~64자여야 합니다.
pt_br: O nome da Rede Virtual precisa ter entre 2 e 64 caracteres
ru: Длина имени виртуальной сети должна составлять от 2 до 64 символов.
zh_hans: 虚拟网络名称长度必须介于 2 到 64 个字符之间
zh_hant: 虛擬網路名稱的長度必須介於 2 到 64 個字元之間

# deployAzureSQLVM.NewVnetError
source: Create a new virtual network
de: Neues virtuelles Netzwerk erstellen
es: Crear una red virtual
fr: Créer un réseau virtuel
it: Crea una nuova rete virtuale
ja: 新しい仮想ネットワークの作成
ko: 새 가상 네트워크 만들기
pt_br: Criar uma rede virtual
ru: Создать виртуальную сеть
zh_hans: 新建虚拟网络
zh_hant: 建立新的虛擬網路

# deployAzureSQLVM.SubnetNameLengthError
source: Subnet name must be between 1 and 80 characters long
de: Der Subnetzname muss zwischen 1 und 80 Zeichen umfassen.
es: El nombre de la red debe tener una longitud de entre 1 y 80 caracteres.
fr: Le nom de sous-réseau doit avoir entre 1 et 80 caractères
it: La lunghezza del nome della subnet deve essere compresa tra 1 e 80 caratteri
ja: サブネット名は 1 から 80 文字までの長さにする必要があります
ko: 서브넷 이름은 1~80자여야 합니다.
pt_br: O nome da sub-rede precisa ter entre 1 e 80 caracteres
ru: Длина имени подсети должна составлять от 1 до 80 символов
zh_hans: 子网名称长度必须介于 1 到 80 个字符之间
zh_hant: 子網路名稱的長度必須介於 1 到 80 個字元之間

# deployAzureSQLVM.NewSubnetError
source: Create a new sub network
de: Neues Subnetzwerk erstellen
es: Crear una nueva subred
fr: Créer un sous-réseau
it: Crea una nuova subnet
ja: 新しいサブ ネットワークの作成
ko: 새 하위 네트워크 만들기
pt_br: Criar uma sub-rede
ru: Создать подсеть
zh_hans: 创建新的子网网络
zh_hant: 建立新的子網路

# deployAzureSQLVM.PipNameError
source: Public IP name must be between 1 and 80 characters long
de: Der Name der öffentlichen IP-Adresse muss zwischen 1 und 80 Zeichen umfassen.
es: El nombre de la IP pública debe tener una longitud de entre 1 y 80 caracteres.
fr: Le nom d'IP publique doit avoir entre 1 et 80 caractères
it: La lunghezza del nome dell'indirizzo IP pubblico deve essere compresa tra 1 e 80 caratteri
ja: パブリック IP 名は 1 から 80 文字までの長さにする必要があります
ko: 공용 IP 이름은 1~80자여야 합니다.
pt_br: O nome do IP precisa ter entre 1 e 80 caracteres
ru: Длина имени общедоступного IP-адреса должна составлять от 1 до 80 символов
zh_hans: 公共 IP 名称长度必须介于 1 到 80 个字符之间
zh_hant: 公用 IP 名稱的長度必須介於 1 到 80 個字元之間

# deployAzureSQLVM.NewPipError
source: Create a new new public Ip
de: Neue öffentliche IP-Adresse erstellen
es: Crear una nueva IP pública
fr: Créer une IP publique
it: Crea un nuovo indirizzo IP pubblico
ja: 新しいパブリック IP の作成
ko: 새 공용 IP 만들기
pt_br: Criar um IP
ru: Создать общедоступный IP-адрес
zh_hans: 创建新的公共 IP
zh_hant: 建立新的公用 IP

# deployAzureSQLVM.PrivateConnectivityDropdownOptionDefault
source: Private (within Virtual Network)
de: Privat (innerhalb des virtuellen Netzwerks)
es: Privada (dentro de Virtual Network)
fr: Privé (dans un réseau virtuel)
it: Privata (solo all'interno della rete virtuale)
ja: プライベート (Virtual Network 内)
ko: 프라이빗(가상 네트워크 내)
pt_br: Privado (dentro da Rede Virtual)
ru: Частное (в виртуальной сети)
zh_hans: 专用(虚拟网络中)
zh_hant: 私人 (在虛擬網路中)

# deployAzureSQLVM.LocalConnectivityDropdownOption
source: Local (inside VM only)
de: Lokal (nur innerhalb der VM)
es: Local (solo dentro de la máquina virtual)
fr: Local (sur la machine virtuelle uniquement)
it: Locale (solo all'interno della macchina virtuale)
ja: ローカル (VM 内のみ)
ko: 로컬(VM 내부 전용)
pt_br: Local (somente dentro da VM)
ru: Локальное (только в виртуальной машине)
zh_hans: 本地(仅在 VM 中)
zh_hant: 本機 (只在 VM 中)

# deployAzureSQLVM.PublicConnectivityDropdownOption
source: Public (Internet)
de: Öffentlich (Internet)
es: Pública (Internet)
it: Pubblica (Internet)
ja: 公開 (インターネット)
ko: 퍼블릭(인터넷)
pt_br: Público (Internet)
ru: Общедоступный (Интернет)
zh_hans: 公共(Internet)
zh_hant: 公用 (網際網路)

# deployAzureSQLVM.SqlUsernameLengthError
source: Username must be between 2 and 128 characters long.
de: Der Benutzername muss zwischen 2 und 128 Zeichen umfassen.
es: El nombre de usuario debe tener una longitud de entre 2 y 128 caracteres.
fr: Le nom d'utilisateur doit avoir entre 2 et 128 caractères.
it: La lunghezza del nome utente deve essere compresa tra 2 e 128 caratteri.
ja: ユーザー名は 2 から 128 文字までの長さにする必要があります。
ko: 암호는 2~128자여야 합니다.
pt_br: O nome de usuário precisa ter entre 2 e 128 caracteres.
ru: Длина имени пользователя должна составлять от 2 до 128 символов.
zh_hans: 用户名长度必须介于 2 到 128 个字符之间。
zh_hant: 使用者名稱的長度必須介於 2 到 128 個字元之間。

# deployAzureSQLVM.SqlUsernameSpecialCharError
source: Username cannot contain special characters \/""[]:|<>+=;,?* .
de: Der Benutzername darf keine dieser Sonderzeichen enthalten: \/""[]:|<>+=;,?*.
es: El nombre de usuario no puede contener los caracteres especiales \/""[]:|<>+=;,?* .
fr: Le nom d'utilisateur ne peut pas contenir les caractères spéciaux \/""[]:|<>+=;,?* .
it: Il nome utente non può contenere i caratteri speciali \/""[]:|<>+=;,?* .
ja: ユーザー名に特殊文字 \/"":|<>+ =;? * を含めることはできません。
ko: 사용자 이름에는 특수 문자(\/""[]:|<>+=;,?*)를 사용할 수 없습니다.
pt_br: O nome de usuário não pode conter caracteres especiais \/""[]:|<>+=;,?* .
ru: Имя пользователя не может содержать следующие специальные символы: \/""[]:|<>+=;,?*.
zh_hans: 用户名不可包含特殊字符 \/""[]:|<>+=;,?*。
zh_hant: 使用者名稱不得包含特殊字元 \/""[]:|<>+=;,?*。

# deployAzureSQLVM.SqlConfirmPasswordError
source: Password and confirm password must match.
de: Das Kennwort und die Kennwortbestätigung müssen übereinstimmen.
es: La contraseña y la confirmación de la contraseña deben coincidir.
fr: Les champs de mot de passe et de confirmation du mot de passe doivent correspondre.
it: La password e la password di conferma devono corrispondere.
ja: パスワードとパスワードの確認が一致しなければなりません。
ko: 암호와 확인 암호가 일치해야 합니다.
pt_br: A Senha e a Confirmação de senha devem corresponder.
ru: Пароль и его подтверждение должны совпадать.
zh_hans: 密码和确认密码必须匹配。
zh_hant: [密碼] 和 [確認密碼] 必須相符。

# notebookWizard.autoSummaryPageTitle
source: Review your configuration
de: Konfiguration überprüfen
es: Revisión de la configuración
fr: Vérifier votre configuration
it: Verificare la configurazione
ja: 構成の確認
ko: 구성 검토
pt_br: Examine a sua configuração
ru: Проверьте конфигурацию
zh_hans: 查看配置
zh_hant: 檢閱您的組態

# deployAzureSQLDB.DBMinIpInvalidError
source: Min Ip address is invalid
de: Die niedrigste IP-Adresse ist ungültig.
es: La dirección IP mínima no es válida.
fr: L'adresse IP min. n'est pas valide
it: L'indirizzo IP minimo non è valido
ja: 最小 IP アドレスが無効です
ko: 최소 IP 주소가 잘못되었습니다.
pt_br: O endereço IP mínimo é inválido
ru: Минимальный IP-адрес является недопустимым
zh_hans: 最小 IP 地址无效
zh_hant: 最小 IP 位址無效

# deployAzureSQLDB.DBMaxIpInvalidError
source: Max Ip address is invalid
de: Die höchste IP-Adresse ist ungültig.
es: La dirección IP máxima no es válida.
fr: L'adresse IP max. n'est pas valide
it: L'indirizzo IP massimo non è valido
ja: 最大 IP アドレスが無効です
ko: 최대 IP 주소가 잘못되었습니다.
pt_br: O endereço IP máximo é inválido
ru: Максимальный IP-адрес является недопустимым
zh_hans: 最大 IP 地址无效
zh_hant: 最大 IP 位址無效

# deployAzureSQLDB.DBFirewallOnlyNumericNameError
source: Firewall name cannot contain only numbers.
de: Der Firewallname darf nicht nur Ziffern enthalten.
es: El nombre del firewall no puede contener solo números.
fr: Le nom de pare-feu ne peut pas contenir seulement des nombres.
it: Il nome del firewall non può contenere solo numeri.
ja: ファイアウォール名を数字のみにすることはできません。
ko: 방화벽 이름에 숫자만 사용할 수는 없습니다.
pt_br: O nome do firewall não pode conter somente números.
ru: Имя брандмауэра не может содержать только цифры.
zh_hans: 防火墙名称不能只包含数字。
zh_hant: 防火牆名稱不能只包含數字。

# deployAzureSQLDB.DBFirewallLengthError
source: Firewall name must be between 1 and 100 characters long.
de: Der Firewallname muss zwischen 1 und 100 Zeichen umfassen.
es: El nombre del firewall debe tener una longitud de entre 1 y 100 caracteres.
fr: Le nom de pare-feu doit avoir entre 1 et 100 caractères.
it: La lunghezza del nome del firewall deve essere compresa tra 1 e 100 caratteri.
ja: ファイアウォール名は 1 から 100 文字までの長さにする必要があります。
ko: 방화벽 이름은 1~100자여야 합니다.
pt_br: O nome do firewall precisa ter entre 1 e 100 caracteres.
ru: Длина имени брандмауэра должна составлять от 1 до 100 символов.
zh_hans: 防火墙名称长度必须介于 1 到 100 个字符之间。
zh_hant: 防火牆名稱的長度必須介於 1 到 100 個字元之間。

# deployAzureSQLDB.DBFirewallSpecialCharError
source: Firewall name cannot contain special characters \/""[]:|<>+=;,?*@&, .
de: Der Firewallname darf keines der folgenden Sonderzeichen enthalten: \/""[]:|<>+=;,?*@&
es: El nombre del firewall no puede contener los caracteres especiales \/""[]:|<>+=;,?*@&,.
fr: Le nom de pare-feu ne peut pas contenir les caractères spéciaux \/""[]:|<>+=;,?*@&, .
it: Il nome del firewall non può contenere i caratteri speciali seguenti: \/""[]:|<>+=;,?*@&, .
ja: ファイアウォール名に特殊文字 \/""[]:|<>+=;,?*@&, を含めることはできません。
ko: 방화벽 이름에는 특수 문자 \/""[]:|<>+=;,?*@&,를 사용할 수 없습니다.
pt_br: O nome do firewall não pode conter caracteres especiais \/""[]:|<>+=;,?*@&, .
ru: Имя брандмауэра не может содержать специальные символы \/""[]:|<>+=;,?*@&,.
zh_hans: 防火墙名称不得包含特殊字符 \/""[]:|<>+=;,?*@&, .
zh_hant: 防火牆名稱不能包含特殊字元 \/""[]:|<>+=;,?*@&,。

# deployAzureSQLDB.DBFirewallUpperCaseError
source: Upper case letters are not allowed for firewall name
de: Großbuchstaben sind für den Firewallnamen nicht zulässig.
es: No se permiten letras mayúsculas para el nombre del firewall.
fr: Les lettres majuscules ne sont pas autorisées dans le nom de pare-feu
it: Le lettere maiuscole non consentite per il nome del firewall
ja: ファイアウォール名に大文字は使用できません
ko: 방화벽 이름에는 대문자를 사용할 수 없습니다.
pt_br: Letras maiúsculas não são permitidas no nome do firewall
ru: В имени брандмауэра не могут использоваться только прописные буквы
zh_hans: 防火墙名称不允许使用大写字母
zh_hant: 防火牆名稱不允許使用大寫字母

# deployAzureSQLDB.DBNameOnlyNumericNameError
source: Database name cannot contain only numbers.
de: Der Datenbankname darf nicht nur Ziffern enthalten.
es: El nombre de la base de datos no puede contener solo números.
fr: Le nom de base de données ne peut pas contenir seulement des nombres.
it: Il nome del database non può contenere solo numeri.
ja: データベース名を数字のみにすることはできません。
ko: 데이터베이스 이름은 숫자만 포함할 수 없습니다.
pt_br: O nome do banco de dados não pode conter somente números.
ru: Имя базы данных не может содержать только цифры.
zh_hans: 数据库名称不能只包含数字。
zh_hant: 資料庫名稱不能只包含數字。

# deployAzureSQLDB.DBNameLengthError
source: Database name must be between 1 and 100 characters long.
de: Der Datenbankname muss zwischen 1 und 100 Zeichen umfassen.
es: El nombre de la base de datos debe tener una longitud de entre 1 y 100 caracteres.
fr: Le nom de base de données doit avoir entre 1 et 100 caractères.
it: La lunghezza del nome del database deve essere compresa tra 1 e 100 caratteri.
ja: データベース名は 1 から 100 文字までの長さにする必要があります。
ko: 데이터베이스 이름은 1~100자여야 합니다.
pt_br: O nome do banco de dados precisa ter entre 1 e 100 caracteres.
ru: Длина имени базы данных должна составлять от 1 до 100 символов.
zh_hans: 数据库名称长度必须介于 1 到 100 个字符之间。
zh_hant: 資料庫名稱的長度必須介於 1 到 100 個字元之間。

# deployAzureSQLDB.DBNameSpecialCharError
source: Database name cannot contain special characters \/""[]:|<>+=;,?*@&, .
de: Der Datenbankname darf keines der folgenden Sonderzeichen enthalten: \/""[]:|<>+=;,?*@&
es: El nombre de la base de datos no puede contener los caracteres especiales \/""[]:|<>+=;,?*@&,.
fr: Le nom de base de données ne peut pas contenir les caractères spéciaux \/""[]:|<>+=;,?*@&, .
it: Il nome del database non può contenere i caratteri speciali seguenti: \/""[]:|<>+=;,?*@&, .
ja: データベース名に特殊文字 \/""[]:|<>+=;,?*@&, を含めることはできません。
ko: 데이터베이스 이름에는 특수 문자 \/""[]:|<>+=;,?*@&,를 사용할 수 없습니다.
pt_br: O nome do banco de dados não pode conter caracteres especiais \/""[]:|<>+=;,?*@&, .
ru: Имя базы данных не может содержать специальные символы \/""[]:|<>+=;,?*@&,.
zh_hans: 数据库名称不得包含特殊字符 \/""[]:|<>+=;,?*@&, .
zh_hant: 資料庫名稱不能包含特殊字元 \/""[]:|<>+=;,?*@&,。

# deployAzureSQLDB.DBNameExistsError
source: Database name must be unique in the current server.
de: Der Datenbankname muss auf dem aktuellen Server eindeutig sein.
es: El nombre de la base de datos debe ser único en el servidor actual.
fr: Le nom de base de données doit être unique dans le serveur actuel.
it: Il nome del database deve essere univoco nel server corrente.
ja: データベース名は、現在のサーバー内で一意である必要があります。
ko: 데이터베이스 이름은 현재 서버에서 고유해야 합니다.
pt_br: O nome do banco de dados precisa ser exclusivo no servidor atual.
ru: Имя базы данных должно быть уникальным на текущем сервере.
zh_hans: 数据库名称在当前服务器中必须是唯一的。
zh_hant: 資料庫名稱在目前的伺服器中必須是唯一的。
