Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# deployAzureSQLDB.DBCollationOnlyNumericNameError
source: Collation name cannot contain only numbers.
de: Der Sortierungsname darf nicht nur Ziffern enthalten.
es: El nombre de la intercalación no puede contener solo números.
fr: Le nom de classement ne peut pas contenir seulement des nombres.
it: Il nome delle regole di confronto non può contenere solo numeri.
ja: 照合順序名を数字だけにすることはできません
ko: 데이터 정렬 이름은 숫자만 포함할 수 없습니다.
pt_br: O nome da ordenação não pode conter somente números.
ru: Имя параметров сортировки не может содержать только цифры.
zh_hans: 排序规则名称不能只包含数字。
zh_hant: 定序名稱不能只包含數字。

# deployAzureSQLDB.DBCollationLengthError
source: Collation name must be between 1 and 100 characters long.
de: Der Sortierungsname muss zwischen 1 und 100 Zeichen umfassen.
es: El nombre de la intercalación debe tener una longitud de entre 1 y 100 caracteres.
fr: Le nom de classement doit avoir entre 1 et 100 caractères.
it: La lunghezza del nome delle regole di confronto deve essere compresa tra 1 e 100 caratteri.
ja: 照合順序名は 1 から 100 文字までの長さにする必要があります。
ko: 데이터 정렬 이름은 1~100자여야 합니다.
pt_br: O nome da ordenação precisa ter entre 1 e 100 caracteres.
ru: Длина имени параметров сортировки должна составлять от 1 до 100 символов.
zh_hans: 排序规则名称长度必须介于 1 到 100 个字符之间。
zh_hant: 定序名稱的長度必須介於 1 到 100 個字元之間。

# deployAzureSQLDB.DBCollationSpecialCharError
source: Collation name cannot contain special characters \/""[]:|<>+=;,?*@&, .
de: Der Sortierungsname darf keines der folgenden Sonderzeichen enthalten: \/""[]:|<>+=;,?*@&
es: El nombre de la intercalación no puede contener los caracteres especiales \/""[]:|<>+=;,?*@&,.
fr: Le nom de classement ne peut pas contenir les caractères spéciaux \/""[]:|<>+=;,?*@&, .
it: Il nome delle regole di confronto non può contenere i caratteri speciali seguenti: \/""[]:|<>+=;,?*@&, .
ja: 照合順序名に特殊文字 \/""[]:|<>+=;,?*@&, を含めることはできません。
ko: 데이터 정렬 이름에는 특수 문자 \/""[]:|<>+=;,?*@&,를 사용할 수 없습니다.
pt_br: O nome da ordenação não pode conter caracteres especiais \/""[]:|<>+=;,?*@&, .
ru: Имя параметров сортировки не может содержать специальные символы \/""[]:|<>+=;,?*@&,.
zh_hans: 排序规则名称不得包含特殊字符 \/""[]:|<>+=;,?*@&, .
zh_hant: 定序名稱不能包含特殊字元 \/""[]:|<>+=;,?*@&,。

# deployAzureSQLDB.azureSignInError
source: Sign in to an Azure account first
de: Melden Sie sich zuerst bei einem Azure-Konto an.
es: Primero, inicie sesión en una cuenta de Azure.
fr: Se connecter d'abord à un compte Azure
it: Accedere prima a un account Azure
ja: 最初に Azure アカウントにサインインします
ko: 먼저 Azure 계정에 로그인
pt_br: Entrar em uma conta do Azure primeiro
ru: Сначала войдите в учетную запись Azure
zh_hans: 先登录 Azure 帐户
zh_hant: 請先登入 Azure 帳戶

# deployAzureSQLDB.NoServerLabel
source: No servers found
de: Es wurden keine Server gefunden.
es: No se encuentra ningún servidor.
fr: Aucun serveur
it: Nessun server trovato
ja: サーバーが見つかりませんでした
ko: 서버를 찾을 수 없음
pt_br: Não foram encontrados servidores
ru: Серверы не найдены
zh_hans: 找不到服务器
zh_hant: 找不到任何伺服器

# deployAzureSQLDB.NoServerError
source: No servers found in current subscription. Select a different subscription containing at least one server
de: Im aktuellen Abonnement wurden keine Server gefunden. Wählen Sie ein anderes Abonnement mit mindestens einem Server aus.
es: No se ha encontrado ningún servidor en la suscripción actual. Seleccione otra suscripción que contenga al menos un servidor.
fr: Aucun serveur dans l'abonnement actuel. Sélectionnez un autre abonnement contenant au moins un serveur
it: Non sono stati trovati server nella sottoscrizione corrente. Selezionare una sottoscrizione diversa contenente almeno un server
ja: 現在のサブスクリプションにサーバーが見つかりません。 少なくとも 1 台のサーバーを含む別のサブスクリプションを選択してください
ko: 현재 구독에서 서버를 찾을 수 없습니다. 하나 이상의 서버를 포함하는 다른 구독을 선택합니다.
pt_br: Nenhum servidor encontrado na assinatura atual. Selecione uma assinatura diferente contendo pelo menos um servidor
ru: Серверы в текущей подписке не найдены. Выберите другую подписку, содержащую хотя бы один сервер
zh_hans: 在当前订阅中找不到服务器。 请选择至少包含一个服务器的其他订阅
zh_hant: 在目前的訂閱中找不到任何伺服器。 請選取其他至少包含一部伺服器的訂閱

# notebookWizard.toolsAndEulaPageTitle
source: Deployment pre-requisites
de: Voraussetzungen für die Bereitstellung
es: Requisitos previos de la implementación
fr: Prérequis de déploiement
it: Prerequisiti di distribuzione
ja: デプロイの前提条件
ko: 배포 필수 구성 요소
pt_br: Pré-requisitos da implantação
ru: Предварительные требования к развертыванию
zh_hans: 部署先决条件
zh_hant: 部署必要條件

# deploymentDialog.FailedToolsInstallation
source: Some tools were still not discovered. Please make sure that they are installed, running and discoverable
de: Einige Tools wurden noch nicht ermittelt. Stellen Sie sicher, dass sie installiert wurden, ausgeführt werden und ermittelbar sind.
es: Hay algunas herramientas que no se han detectado. Asegúrese de que estén instaladas, se estén ejecutando y se puedan detectar.
fr: Certains outils n'ont toujours pas été découverts. Vérifiez qu'ils sont installés, en cours d'exécution et découvrables
it: Alcuni strumenti non sono stati ancora individuati. Assicurarsi che siano installati, in esecuzione e individuabili
ja: 一部のツールがまだ検出されていません。それらがインストールされており、実行中で検出可能であることを確認してください
ko: 일부 도구가 아직 검색되지 않았습니다. 해당 도구가 설치되고, 실행 중이며, 검색 가능한지 확인하세요.
pt_br: Algumas ferramentas ainda não foram descobertas. Verifique se eles estão instaladas, em execução e são detectáveis
ru: Некоторые инструменты еще не обнаружены. Убедитесь, что они установлены, запущены и могут быть обнаружены
zh_hans: 仍未发现某些工具。请确保它们已安装，正在运行且可发现
zh_hant: 仍未探索到某些工具。請確認這些工具已安裝、正在執行並可供探索

# deploymentDialog.FailedEulaValidation
source: To proceed, you must accept the terms of the End User License Agreement(EULA)
de: Um fortzufahren, müssen Sie die Lizenzbedingungen akzeptieren.
es: Para continuar, debe aceptar los términos del Contrato de licencia para el usuario final (CLUF).
fr: Pour continuer, vous devez accepter les conditions du contrat de licence utilisateur final (CLUF).
it: Per procedere è necessario accettare le condizioni del contratto di licenza
ja: 進めるには、エンド ユーザー使用許諾契約 (EULA) の条件に同意する必要があります。
ko: 계속 진행하려면 EULA(최종 사용자 사용권 계약) 약관에 동의해야 합니다.
pt_br: Para continuar, você precisa aceitar os Termos de Licença
ru: Чтобы продолжить, необходимо принять условия лицензионного соглашения (EULA)
zh_hans: 若要继续，必须接受最终用户许可协议(EULA)条款
zh_hant: 若要繼續，您必須接受授權條款

# deploymentDialog.loadingRequiredToolsCompleted
source: Loading required tools information completed
de: Informationen zu erforderlichen Tools wurden vollständig geladen.
es: La carga de la información de las herramientas necesarias se ha completado.
fr: Les informations d'outils nécessaires ont été téléchargées
it: Caricamento delle informazioni sugli strumenti necessari completato
ja: 必要なツール情報の読み込みが完了しました
ko: 필요한 도구 정보 로드 완료
pt_br: O carregamento das informações das ferramentas necessárias foi concluído
ru: Загрузка сведений о необходимых инструментах завершена
zh_hans: 所需工具信息加载已完成
zh_hant: 已完成載入必要工具的資訊

# deploymentDialog.loadingRequiredTools
source: Loading required tools information
de: Informationen zu erforderlichen Tools werden geladen.
es: Carga de la información de las herramientas necesarias en curso
fr: Chargement des informations d'outils nécessaires
it: Caricamento delle informazioni sugli strumenti necessari
ja: 必要なツール情報を読み込んでいます
ko: 필요한 도구 정보 로드
pt_br: Carregando informações de ferramentas necessárias
ru: Загрузка сведений о необходимых инструментах
zh_hans: 正在加载所需的工具信息
zh_hant: 正在載入必要工具的資訊

# resourceDeployment.AgreementTitle
source: Accept terms of use
de: Nutzungsbedingungen akzeptieren
es: Aceptación de las condiciones de uso
fr: Accepter les conditions d'utilisation
it: Accettare le condizioni per l'utilizzo
ja: 利用規約に同意する
ko: 사용 약관에 동의
pt_br: Aceitar os termos de uso
ru: Принятие условий использования
zh_hans: 接受使用条款
zh_hant: 接受使用條款

# deploymentDialog.ToolDoesNotMeetVersionRequirement
source: '{0}' [ {1} ] does not meet the minimum version requirement, please uninstall it and restart Azure Data Studio.
de: "{0}" [ {1} ] erfüllt nicht die Mindestanforderungen an die Version. Deinstallieren Sie das Tool, und starten Sie Azure Data Studio neu.
es: "{0}" [ {1} ] no cumple los requisitos mínimos de versión. Desinstálelo y reinicie Azure Data Studio.
fr: « {0} » [ {1} ] ne respecte pas la version minimale requise, désinstallez-le et redémarrez Azure Data Studio.
it: '{0}' [ {1} ] non soddisfa il requisito di versione minima. Disinstallarlo e riavviare Azure Data Studio.
ja: '{0}' [{1}] は最小バージョン要件を満たしていません。アンインストールして、Azure Data Studio を再起動してください。
ko: '{0}'[{1}]이(가) 최소 버전 요구 사항을 충족하지 않습니다. 해당 도구를 제거하고 Azure Data Studio를 다시 시작하세요.
pt_br: O '{0}' [ {1} ] não atende ao requisito mínimo de versão. Desinstale-o e reinicie o Azure Data Studio.
ru: Инструмент "{0}" [{1}] не соответствует минимальным требованиям к версии, удалите его и перезапустите Azure Data Studio.
zh_hans: “{0}”[ {1} ]不符合最低版本要求，请将其卸载并重启 Azure Data Studio。
zh_hant: '{0}' [ {1} ] 不符合最低版本需求，請予以解除安裝並重新啟動 Azure Data Studio。

# deploymentDialog.InstalledTools
source: All required tools are installed now.
de: Alle erforderlichen Tools sind jetzt installiert.
es: Todas las herramientas necesarias ya están instaladas.
fr: Tous les outils nécessaires sont maintenant installés.
it: Tutti gli strumenti necessari sono ora installati.
ja: 必要なすべてのツールがインストールされました。
ko: 이제 모든 필수 도구가 설치되었습니다.
pt_br: Todas as ferramentas necessárias estão instaladas agora.
ru: Теперь все необходимые инструменты установлены.
zh_hans: 现在已经安装了所有必需的工具。
zh_hant: 已安裝所有必要工具。

# deploymentDialog.PendingInstallation
source: Following tools: {0} were still not discovered. Please make sure that they are installed, running and discoverable
de: Folgende Tools wurden noch nicht ermittelt: {0}. Stellen Sie sicher, dass sie installiert wurden, ausgeführt werden und ermittelbar sind.
es: Hay herramientas ({0}) que no se han detectado. Asegúrese de que estén instaladas, se estén ejecutando y se puedan detectar.
fr: Les outils suivants {0} n'ont toujours pas été découverts. Vérifiez qu'ils sont installés, en cours d'exécution et découvrables
it: Gli strumenti seguenti: {0} non sono ancora stati individuati. Assicurarsi che siano installati, in esecuzione e individuabili
ja: 次のツール: {0} はまだ検出されていません。それらがインストールされており、実行中で検出可能であることを確認してください
ko: {0} 도구가 아직 검색되지 않았습니다. 해당 도구가 설치되고, 실행 중이며, 검색 가능한지 확인하세요.
pt_br: As ferramentas {0} ainda não foram descobertas. Verifique se elas estão instaladas, em execução e são detectáveis
ru: Следующие инструменты еще не обнаружены: {0}. Убедитесь, что они установлены, запущены и могут быть обнаружены
zh_hans: 仍未发现以下工具: {0}。请确保它们已安装、正在运行且可发现
zh_hant: 仍未探索到下列工具: {0}。請確認這些工具已安裝、正在執行並可供探索

# deploymentDialog.ToolInformation
source: '{0}' was not discovered and automated installation is not currently supported. Install '{0}' manually or ensure it is started and discoverable. Once done please restart Azure Data Studio. See [{1}] .
de: "{0}" wurde nicht erkannt, und die automatisierte Installation wird derzeit nicht unterstützt. Installieren Sie "{0}" manuell, oder stellen Sie sicher, dass das Tool gestartet wurde und ermittelt werden kann. Starten Sie anschließend Azure Data Studio neu. Informationen hierzu finden Sie unter [{1}].
es: "{0}" no se ha detectado, y la instalación automatizada no se admite en estos momentos. Instale "{0}" manualmente, o asegúrese de que se haya iniciado y se pueda detectar. A continuación, reinicie Azure Data Studio. Consulte [{1}].
fr: « {0} » n'a pas été découvert et l'installation automatique n'est pas prise en charge actuellement. Installez manuellement « {0} », ou vérifiez qu'il est démarré et découvrable. Ensuite, redémarrez Azure Data Studio. Consultez [{1}].
it: '{0}' non è stato individuato e l'installazione automatica non è attualmente supportata. Installare '{0}' manualmente o assicurarsi che sia avviato ed individuabile. Al termine, riavviare Azure Data Studio. Vedere [{1}].
ja: '{0}' が検出されませんでした。自動インストールは現在サポートされていません。'{0}' を手動でインストールするか、それが起動して検出可能であることを確認してください。完了したら、Azure Data Studio を再起動してください。[{1}] を参照してください。
ko: '{0}'이(가) 검색되지 않았고 현재 자동화된 설치가 지원되지 않습니다. '{0}'을(를) 수동으로 설치하거나 해당 항목이 시작되고 검색 가능한지 확인합니다. 완료되면 Azure Data Studio를 다시 시작하세요. [{1}] 항목을 참조하세요.
pt_br: O '{0}' não foi descoberto e a instalação automática não tem suporte atualmente. Instale o '{0}' manualmente ou verifique se ele foi iniciado e é detectável. Depois de fazer isso, reinicie o Azure Data Studio. Confira [{1}].
ru: Инструмент "{0}" не был обнаружен, и автоматическая установка сейчас не поддерживается. Установите инструмент "{0}" вручную или убедитесь, что он запущен и доступен для обнаружения. Сделав это, перезапустите Azure Data Studio. См. раздел [{1}].
zh_hans: 未发现“{0}”，当前不支持自动安装。请手动安装“{0}”，或确保它已启动且可被检测到。完成后，请重启 Azure Data Studio。请参阅 [{1}]。
zh_hant: 未探索到 '{0}'，目前不支援自動安裝。請手動安裝 '{0}'，或確認其已啟動並可供探索。完成後，請重新啟動 Azure Data Studio。請參閱 [{1}]。

# deploymentDialog.VersionInformationDebugHint
source: You will need to restart Azure Data Studio if the tools are installed manually to pick up the change. You may find additional details in 'Deployments' and 'Azure Data CLI' output channels
de: Wenn die Tools manuell installiert wurden, müssen Sie Azure Data Studio neu starten, um die Änderung zu übernehmen. Weitere Details finden Sie in den Ausgabekanälen "Bereitstellungen" und "Azure Data CLI".
es: Si las herramientas se instalan manualmente, tendrá que reiniciar Azure Data Studio para aplicar el cambio. Puede encontrar detalles adicionales en los canales de salida "Implementaciones" y "CLI de datos Azure".
fr: Si les outils sont installés manuellement, vous devez redémarrer Azure Data Studio pour appliquer le changement. Des détails supplémentaires sont disponibles dans les canaux de sortie « Déploiements » et « Azure Data CLI »
it: È necessario riavviare Azure Data Studio se gli strumenti vengono installati manualmente per rilevare la modifica. È possibile trovare ulteriori dettagli nei canali di output 'Distribuzioni' e 'Interfaccia della riga di comando di Azure Data'
ja: 変更を取得するためにツールが手動でインストールされている場合は、Azure Data Studio を再起動する必要があります。詳細については、'デプロイ' と 'Azure Data CLI' の出力チャネルを参照してください
ko: 변경 내용을 선택하기 위해 도구를 수동으로 설치한 경우에는 Azure Data Studio를 다시 시작해야 합니다. '배포' 및 'Azure Data CLI' 출력 채널에서 추가적인 세부 정보를 찾을 수 있습니다.
pt_br: Você precisará reiniciar o Azure Data Studio se as ferramentas forem instaladas manualmente para escolher a alteração. Você pode encontrar mais detalhes nos canais de saída 'Implantações' e 'CLI de Dados do Azure'
ru: Если средства были установлены вручную, то для применения изменений необходимо перезапустить Azure Data Studio. Дополнительные сведения см. в выходных каналах "Развертывания" и "Azure Data CLI"
zh_hans: 如果手动安装工具以选择更改，则需要重启 Azure Data Studio。你可以在“部署”和“Azure 数据 CLI”输出通道中找到更多详细信息
zh_hant: 如果您手動安裝工具，就必須重新啟動 Azure Data Studio，以更新變更。您可以在 [部署] 與 [Azure Data CLI] 輸出通道中找到其他詳細資料

# deploymentDialog.InstallToolsHintOne
source: Tool: {0} is not installed, you can click the "{1}" button to install it.
de: Folgendes Tool ist nicht installiert: {0}. Klicken Sie auf die Schaltfläche "{1}", um es zu installieren.
es: La herramienta {0} no está instalada. Puede hacer clic en el botón "{1}" para instalarla.
fr: L'outil {0} n'est pas installé, vous pouvez cliquer sur le bouton « {1} » pour l'installer.
it: Lo strumento: {0} non è installato. È possibile fare clic sul pulsante "{1}" per installarlo.
ja: ツール: {0} がインストールされていません。"{1}" ボタンをクリックしてインストールできます。
ko: {0} 도구가 설치되지 않았습니다. "{1}" 단추를 클릭하여 설치할 수 있습니다.
pt_br: Ferramenta: o {0} não está instalado, você pode clicar no botão "{1}" para instalá-lo.
ru: Инструмент {0} не установлен; вы можете нажать кнопку "{1}" для его установки.
zh_hans: 未安装工具 {0}，可单击“{1}”按钮进行安装。
zh_hant: 尚未安裝工具 {0}，您可以按一下 "{1}" 按鈕加以安裝。

# deploymentDialog.InstallToolsHintMany
source: Tools: {0} are not installed, you can click the "{1}" button to install them.
de: Folgende Tools sind nicht installiert: {0}. Klicken Sie auf die Schaltfläche "{1}", um sie zu installieren.
es: Las herramientas {0} no están instaladas. Puede hacer clic en el botón "{1}" para instalarlas.
fr: Les outils {0} ne sont pas installés, vous pouvez cliquer sur le bouton « {1} » pour les installer.
it: Gli strumenti: {0} non sono installati. È possibile fare clic sul pulsante "{1}" per installarli.
ja: ツール: {0} がインストールされていません。"{1}" ボタンをクリックしてインストールできます。
ko: {0} 도구가 설치되지 않았습니다. "{1}" 단추를 클릭하여 설치할 수 있습니다.
pt_br: Ferramentas: os {0} não estão instalados, você pode clicar no botão "{1}" para instalá-los.
ru: Инструменты {0} не установлены; вы можете нажать кнопку "{1}" для их установки.
zh_hans: 未安装工具 {0}，可单击“{1}”按钮进行安装。
zh_hant: 尚未安裝工具 {0}，您可以按一下 "{1}" 按鈕加以安裝。

# deploymentDialog.NoRequiredTool
source: No tools required
de: Keine Tools erforderlich
es: No se necesita ninguna herramienta.
fr: Aucun outil nécessaire
it: Non sono richiesti strumenti
ja: ツールは不要です
ko: 도구가 필요하지 않음
pt_br: Nenhuma ferramenta é necessária
ru: Инструменты не требуются
zh_hans: 无需工具
zh_hant: 沒有任何必要工具

# resourceDeployment.DownloadAndLaunchTaskName
source: Download and launch installer, URL: {0}
de: Installer herunterladen und starten, URL: {0}
es: Descargar e iniciar el instalador, URL: {0}
fr: Télécharger et lancer le programme d'installation, URL : {0}
it: Scarica e avvia il programma di installazione. URL: {0}
ja: インストーラーのダウンロードと起動、URL: {0}
ko: 설치 관리자 다운로드 및 시작, URL: {0}
pt_br: Baixe e inicie o instalador, URL: {0}
ru: Скачайте и запустите установщик, URL-адрес: {0}
zh_hans: 下载并启动安装程序，URL: {0}
zh_hant: 下載並啟動安裝程式，URL: {0}

# resourceDeployment.DownloadingText
source: Downloading from: {0}
de: Herunterladen von: {0}
es: Descarga de {0} en curso
fr: Téléchargement à partir de : {0}
it: Download da {0}
ja: ダウンロード元: {0}
ko: {0}에서 다운로드
pt_br: Baixando de: {0}
ru: Выполняется скачивание из: {0}
zh_hans: 正在从 {0} 下载
zh_hant: 正在從 {0} 下載

# resourceDeployment.DownloadCompleteText
source: Successfully downloaded: {0}
de: Erfolgreich heruntergeladen: {0}
es: {0} se ha descargado correctamente.
fr: {0} a été téléchargé
it: Download di {0} completato
ja: 正常にダウンロードされました: {0}
ko: 다운로드함: {0}
pt_br: Baixado com êxito: {0}
ru: Скачивание выполнено: {0}
zh_hans: 已成功下载: {0}
zh_hant: 已成功下載: {0}

# resourceDeployment.LaunchingProgramText
source: Launching: {0}
de: Wird gestartet: {0}
es: Inicio de {0} en curso
fr: Lancement de {0}
it: Avvio di {0}
ja: 起動中: {0}
ko: {0} 시작 중
pt_br: Iniciando: {0}
ru: Запуск: {0}
zh_hans: 正在启动: {0}
zh_hant: 正在啟動: {0}

# resourceDeployment.ProgramLaunchedText
source: Successfully launched: {0}
de: Erfolgreich gestartet: {0}
es: {0} se ha iniciado correctamente.
fr: {0} a été lancé
it: Avvio di {0} completato
ja: 正常に起動されました: {0}
ko: 시작함: {0}
pt_br: Iniciado com êxito: {0}
ru: Запуск выполнен: {0}
zh_hans: 已成功启动: {0}
zh_hant: 已成功啟動: {0}

# resourceDeployment.DockerDescription
source: Packages and runs applications in isolated containers
de: Erstellt Pakete und führt Anwendungen in isolierten Containern aus.
es: Empaqueta y ejecuta aplicaciones en contenedores aislados.
fr: Insère dans un package et exécute des applications dans des conteneurs isolés
it: Crea i pacchetti delle applicazioni ed esegue le applicazioni in contenitori isolati
ja: 分離されたコンテナーでアプリケーションをパッケージ化して実行します
ko: 격리된 컨테이너에서 애플리케이션 패키지 및 실행
pt_br: Empacota e executa aplicativos em contêineres isolados
ru: Упаковывает и запускает приложения в изолированных контейнерах
zh_hans: 在独立容器中打包和运行应用程序
zh_hant: 封裝應用程式並在隔離的容器中執行

# resourceDeployment.AzCLIDescription
source: Manages Azure resources
de: Verwaltet Azure-Ressourcen.
es: Administra recursos de Azure.
fr: Gère les ressources Azure
it: Gestisce le risorse di Azure
ja: Azure リソースを管理します
ko: Azure 리소스 관리
pt_br: Gerencia recursos do Azure
ru: Управляет ресурсами Azure
zh_hans: 管理 Azure 资源
zh_hant: 管理 Azure 資源

# resourceDeployment.AziCli.DeletingPreviousAzureCli.msi
source: deleting previously downloaded azurecli.msi if one exists …
de: Zuvor heruntergeladene Datei "azurecli.msi" wird ggf. gelöscht…
es: Se está eliminando el archivo azurecli.msi descargado anteriormente, si existe...
fr: suppression du fichier azurecli.msi précédemment téléchargé, le cas échéant...
it: eliminazione del file azurecli.msi scaricato in precedenza se presente…
ja: 以前にダウンロードされた azurecli.msi が存在する場合にそれを削除しています...
ko: 이전에 다운로드한 azurecli.msi 삭제 중(있는 경우)...
pt_br: excluindo o azurecli.msi baixado anteriormente, se houver…
ru: удаление ранее скачанного файла azurecli.msi, если он существует…
zh_hans: 正在删除以前下载的 azurecli.msi (如果存在)…
zh_hant: 正在刪除先前下載的 azurecli.msi (如果有的話)…

# resourceDeployment.AziCli.DownloadingAndInstallingAzureCli
source: downloading azurecli.msi and installing azure-cli …
de: "azurecli.msi" wird heruntergeladen, und die Azure CLI wird installiert…
es: Se está descargando azurecli.msi e instalando azure-cli...
fr: téléchargement d'azurecli.msi et installation d'azure-cli...
it: download di azurecli.msi e installazione di azure-cli…
ja: azurecli.msi をダウンロードして、azure-cli をインストールしています...
ko: azurecli.msi를 다운로드하고 azure-cli를 설치하는 중…
pt_br: baixando o azurecli.msi e instalando o azure-cli…
ru: скачивание azurecli.msi и установка azure-cli…
zh_hans: 正在下载 azurecli.msi 并安装 azure-cli…
zh_hant: 正在下載 azurecli.msi 並安裝 azure-cli…

# resourceDeployment.AziCli.DisplayingInstallationLog
source: displaying the installation log …
de: Installationsprotokoll wird angezeigt…
es: Se muestra el registro de la instalación...
fr: affichage du journal d'installation...
it: visualizzazione del log di installazione…
ja: インストール ログを表示しています...
ko: 설치 로그를 표시하는 중...
pt_br: exibindo o log de instalação…
ru: отображение журнала установки…
zh_hans: 正在显示安装日志…
zh_hant: 正在顯示安裝記錄…

# resourceDeployment.AziCli.UpdatingBrewRepository
source: updating your brew repository for azure-cli installation …
de: Ihr Brew-Repository wird für die Azure CLI-Installation aktualisiert…
es: Se está actualizando el repositorio de brew para la instalación de azure-cli...
fr: mise à jour de votre dépôt brew pour l'installation d'azure-cli...
it: aggiornamento del repository brew per l'installazione di azure-cli…
ja: azure-cli インストール用の brew リポジトリを更新しています...
ko: azure-cli 설치를 위해 brew 리포지토리를 업데이트하는 중...
pt_br: atualizando o seu repositório brew para a instalação do azure-cli…
ru: обновление репозитория brew для установки azure-cli…
zh_hans: 正在更新 azure-cli 安装的 brew 存储库…
zh_hant: 正在更新 Brew 存放庫以安裝 azure-cli…

# resourceDeployment.AziCli.InstallingAzureCli
source: installing azure-cli …
de: Azure CLI wird installiert…
es: Se está instalando azure-cli...
fr: installation d'azure-cli...
it: installazione di azure-cli…
ja: azure-cli をインストールしています...
ko: azure-cli를 설치하는 중...
pt_br: instalando o azure-cli.…
ru: установка azure-cli…
zh_hans: 正在安装 azure-cli…
zh_hant: 正在安裝 azure-cli…

# resourceDeployment.AziCli.AptGetUpdate
source: updating repository information before installing azure-cli …
de: Repositoryinformationen werden vor der Installation der Azure CLI aktualisiert…
es: Se está actualizando la información del repositorio antes de instalar azure-cli...
fr: mise à jour des informations de dépôt avant l'installation d'azure-cli...
it: aggiornamento delle informazioni sul repository prima dell'installazione di azure-cli…
ja: azure-cli をインストールする前にリポジトリ情報を更新しています...
ko: azure-cli를 설치하기 전에 리포지토리 정보를 업데이트하는 중...
pt_br: atualizando as informações do repositório antes de instalar o azure-cli…
ru: обновление сведений в репозитории перед установкой azure-cli…
zh_hans: 在安装 azure-cli 之前更新存储库信息…
zh_hant: 正在更新存放庫資訊，然後再安裝 azure-cli…
