Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# extension-displayName
source: SQL Server Deployment extension for Azure Data Studio
de: SQL Server-Bereitstellungserweiterung für Azure Data Studio
es: Extensión de implementación de SQL Server para Azure Data Studio
fr: Extension de déploiement SQL Server pour Azure Data Studio
it: Estensione Distribuzione SQL Server per Azure Data Studio
ja: Azure Data Studio 用の SQL Server デプロイの拡張
ko: Azure Data Studio용 SQL Server 배포 확장
pt_br: Extensão de Implantação do SQL Server para o Azure Data Studio
ru: Расширение развертывания SQL Server для Azure Data Studio
zh_hans: Azure Data Studio 的 SQL Server 部署扩展
zh_hant: 適用於 Azure Data Studio 的 SQL Server 部署延伸模組

# extension-description
source: Provides a notebook-based experience to deploy Microsoft SQL Server
de: Bietet eine Notebook-basierte Oberfläche zum Bereitstellen von Microsoft SQL Server.
es: Proporciona una experiencia basada en cuadernos para implementar Microsoft SQL Server
fr: Fournit une expérience de notebook pour déployer Microsoft SQL Server
it: Offre un'esperienza basata su notebook per la distribuzione di Microsoft SQL Server
ja: Microsoft SQL Server をデプロイするためのノートブック ベースのエクスペリエンスを提供します
ko: Microsoft SQL Server 배포를 위한 Notebook 기반 환경을 제공합니다.
pt_br: Fornece uma experiência baseada em Notebook para implantar o Microsoft SQL Server
ru: Обеспечивает развертывание Microsoft SQL Server на основе записных книжек
zh_hans: 提供部署 Microsoft SQL Server 的基于笔记本的体验
zh_hant: 提供部署 Microsoft SQL Server 的筆記本式體驗

# deploy-resource-command-name
source: New Deployment…
de: Neue Bereitstellung…
es: Nueva implementación...
fr: Nouveau déploiement...
it: Nuova distribuzione…
ja: 新しいデプロイ…
ko: 새 배포...
pt_br: Nova Implantação…
ru: Новое развертывание…
zh_hans: 新建部署…
zh_hant: 新增部署…

# deploy-resource-command-category
source: Deployment
de: Bereitstellung
es: Implementación
fr: Déploiement
it: Distribuzione
ja: デプロイ
ko: 배포
pt_br: Implantação
ru: Развертывание
zh_hans: 部署
zh_hant: 部署

# resource-type-sql-image-display-name
source: SQL Server container image
es: Imagen de contenedor de SQL Server
fr: Image conteneur SQL Server
it: Immagine del contenitore di SQL Server
ja: SQL Server コンテナー イメージ
ko: SQL Server 컨테이너 이미지
pt_br: Imagem de contêiner do SQL Server
ru: Образ контейнера SQL Server
zh_hans: SQL Server 容器映像
zh_hant: SQL Server 容器映像

# resource-type-sql-image-description
source: Run SQL Server container image with docker
de: SQL Server-Containerimage mit Docker ausführen
es: Ejecutar la imagen de contenedor de SQL Server con Docker
fr: Exécuter l'image conteneur SQL Server avec Docker
it: Esegue l'immagine del contenitore di SQL Server con Docker
ja: Docker を使用して SQL Server コンテナー イメージを実行する
ko: Docker를 사용하여 SQL Server 컨테이너 이미지 실행
pt_br: Executar a imagem de contêiner do SQL Server com o Docker
ru: Запустить образ контейнера SQL Server с помощью Docker
zh_hans: 使用 Docker 运行 SQL Server 容器映像
zh_hant: 以 Docker 執行 SQL Server 容器映像

# version-display-name
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本

# docker-sql-2017-title
source: Deploy SQL Server 2017 container images
de: SQL Server 2017-Containerimages bereitstellen
es: Implementación de imágenes de contenedor de SQL Server 2017
fr: Déployer des images conteneur SQL Server 2017
it: Distribuisci immagini del contenitore di SQL Server 2017
ja: SQL Server 2017 コンテナー イメージのデプロイ
ko: SQL Server 2017 컨테이너 이미지 배포
pt_br: Implantar imagens de contêiner do SQL Server 2017
ru: Развертывание образов контейнеров SQL Server 2017
zh_hans: 部署 SQL Server 2017 容器映像
zh_hant: 部署 SQL Server 2017 容器映像

# docker-sql-2019-title
source: Deploy SQL Server 2019 container images
de: SQL Server 2019-Containerimages bereitstellen
es: Implementación de imágenes de contenedor de SQL Server 2019
fr: Déployer des images conteneur SQL Server 2019
it: Distribuisci immagini del contenitore di SQL Server 2019
ja: SQL Server 2019 コンテナー イメージをデプロイする
ko: SQL Server 2019 컨테이너 이미지 배포
pt_br: Implantar imagens de contêiner do SQL Server 2019
ru: Развертывание образов контейнеров SQL Server 2019
zh_hans: 部署 SQL Server 2019 容器映像
zh_hant: 部署 SQL Server 2019 容器映像

# docker-container-name-field
source: Container name
es: Nombre del contenedor
fr: Nom de conteneur
it: Nome del contenitore
ja: コンテナー名
ko: 컨테이너 이름
pt_br: Nome do contêiner
ru: Имя контейнера
zh_hans: 容器名称
zh_hant: 容器名稱

# docker-sql-password-field
source: SQL Server password
de: SQL Server-Kennwort
es: Contraseña de SQL Server
fr: Mot de passe SQL Server
it: Password di SQL Server
ja: SQL Server のパスワード
ko: SQL Server 암호
pt_br: Senha do SQL Server
ru: Пароль SQL Server
zh_hans: SQL Server 密码
zh_hant: SQL Server 密碼

# docker-confirm-sql-password-field
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# docker-sql-port-field
source: Port
es: Puerto
it: Porta
ja: ポート
ko: 포트
pt_br: Porta
ru: Порт
zh_hans: 端口
zh_hant: 連接埠

# resource-type-sql-windows-setup-display-name
source: SQL Server on Windows
de: SQL Server unter Windows
es: SQL Server en Windows
fr: SQL Server sur Windows
it: SQL Server in Windows
ko: Windows의 SQL Server
pt_br: SQL Server no Windows
ru: SQL Server в Windows
zh_hans: Windows 上的 SQL Server
zh_hant: Windows 上的 SQL Server

# resource-type-sql-windows-setup-description
source: Run SQL Server on Windows, select a version to get started.
de: Führen Sie SQL Server unter Windows aus, und wählen Sie eine Version aus, um loszulegen.
es: Ejecute SQL Server en Windows y seleccione una versión para comenzar.
fr: Exécutez SQL Server sur Windows, sélectionnez une version pour commencer.
it: Consente di eseguire SQL Server in Windows. Selezionare una versione per iniziare.
ja: SQL Server on Windows を実行し、開始するバージョンを選択します。
ko: Windows에서 SQL Server를 실행하고 시작할 버전을 선택합니다.
pt_br: Execute o SQL Server no Windows, selecione uma versão para começar.
ru: Запустите SQL Server в Windows, выберите версию для начала работы.
zh_hans: 在 Windows 上运行 SQL Server，选择版本以开始使用。
zh_hant: 在 Windows 上執行 SQL Server，選取要開始使用的版本。

source: Microsoft Privacy Statement
de: Microsoft-Datenschutzerklärung
es: Declaración de privacidad de Microsoft
fr: Déclaration de confidentialité Microsoft
it: Informativa sulla privacy di Microsoft
ja: Microsoft のプライバシーに関する声明
ko: Microsoft 개인정보처리방침
pt_br: Política de Privacidade da Microsoft
ru: Заявление о конфиденциальности Майкрософт
zh_hans: Microsoft 隐私声明
zh_hant: Microsoft 隱私權聲明

# deployment.configuration.title
source: Deployment configuration
de: Bereitstellungskonfiguration
es: Configuración de la implementación
fr: Configuration du déploiement
it: Configurazione della distribuzione
ja: デプロイ構成
ko: 배포 구성
pt_br: Configuração de implantação
ru: Конфигурация развертывания
zh_hans: 部署配置
zh_hant: 部署組態

# azdata-install-location-description
source: Location of the azdata package used for the install command
de: Speicherort des azdata-Pakets, das für den Installationsbefehl verwendet wird
es: Ubicación del paquete de azdata empleada para el comando de la instalación
fr: Emplacement du package azdata utilisé pour la commande d'installation
it: Percorso del pacchetto azdata usato per il comando di installazione
ja: インストール コマンドに使用される azdata パッケージの場所
ko: 설치 명령에 사용되는 azdata 패키지의 위치
pt_br: Localização do pacote azdata usado para o comando de instalação
ru: Расположение пакета azdata, используемого для команды установки
zh_hans: 用于安装命令的 azdata 程序包的位置
zh_hant: 用於安裝命令的 azdata 套件位置

# azure-sqlvm-display-name
source: SQL Server on Azure Virtual Machine
de: SQL Server auf Azure-VM
es: SQL Server en una máquina virtual de Azure
fr: SQL Server dans une machine virtuelle Azure
it: SQL Server per la macchina virtuale di Azure
ja: Azure Virtual Machine 上の SQL Server
ko: Azure 가상 머신의 SQL Server
pt_br: SQL Server na Máquina Virtual do Azure
ru: SQL Server на виртуальной машине Azure
zh_hans: Azure 虚拟机上的 SQL Server
zh_hant: Azure 虛擬機器上的 SQL Server

# azure-sqlvm-description
source: Create SQL virtual machines on Azure. Best for migrations and applications requiring OS-level access.
de: Hiermit erstellen Sie SQL-VMs in Azure. Optimal für Migrationen und Anwendungen, die Zugriff auf Betriebssystemebene erfordern.
es: Cree máquinas virtuales de SQL en Azure. Resulta ideal para migraciones y aplicaciones que requieran acceso de nivel de sistema operativo.
fr: Créez des machines virtuelles SQL sur Azure. Idéal pour les migrations et les applications nécessitant un accès au niveau du système d'exploitation.
it: Creare macchine virtuali SQL in Azure. Ideale per le migrazioni e le applicazioni che richiedono l'accesso a livello di sistema operativo.
ja: Azure で SQL 仮想マシンを作成します。移行と OS レベルのアクセスが必要なアプリケーションに最適です。
ko: Azure에서 SQL 가상 머신을 만듭니다. OS 수준 액세스가 필요한 마이그레이션 및 애플리케이션에 가장 적합합니다.
pt_br: Crie máquinas virtuais do SQL no Azure. Isso é ideal para migrações e aplicativos que exigem acesso ao nível do SO.
ru: Создание виртуальных машин SQL в Azure. Лучше всего подходит для миграций и приложений, требующих доступа на уровне ОС.
zh_hans: 在 Azure 上创建 SQL 虚拟机。最适合需要 OS 级别访问权限的迁移和应用程序。
zh_hant: 在 Azure 上建立 SQL 虛擬機器。適用於需要 OS 層級存取權的移轉及應用程式。

# azure-sqlvm-deploy-dialog-title
source: Deploy Azure SQL virtual machine
de: Azure SQL-VM bereitstellen
es: Implementación de una máquina virtual de Azure SQL
fr: Déployer une machine virtuelle Azure SQL
it: Distribuisci macchina virtuale SQL di Azure
ja: Azure SQL 仮想マシンのデプロイ
ko: Azure SQL 가상 머신 배포
pt_br: Implantar a máquina virtual do SQL do Azure
ru: Развертывание виртуальной машины SQL Azure
zh_hans: 部署 Azure SQL 虚拟机
zh_hant: 部署 Azure SQL 虛擬機器

# azure-sqlvm-deploy-dialog-action-text
source: Script to notebook
de: Skript in Notebook schreiben
es: De script a cuaderno
fr: Exécuter un script sur un notebook
it: Genera script nel notebook
ja: ノートブックへのスクリプト
ko: Notebook으로 스크립트
pt_br: Script para o notebook
ru: Скрипт в записную книжку
zh_hans: 脚本到笔记本
zh_hant: 編寫指令碼到筆記本

# azure-sqlvm-agreement
source: I accept {0}, {1} and {2}.
de: Ich akzeptiere {0}, {1} und {2}.
es: Acepto {0}, {1} y {2}.
fr: J'accepte {0}, {1} et {2}.
it: Accetto {0}, {1} e {2}.
ja: {0}、{1}、{2} に同意します。
ko: {0}, {1} 및 {2}에 동의합니다.
pt_br: Aceito {0}, {1} e {2}.
ru: Я принимаю {0}, {1} и {2}.
zh_hans: 我接受 {0}、{1} 和 {2}。
zh_hant: 我接受 {0}、{1} 和 {2}。

# azure-sqlvm-agreement-sqlvm-eula
source: Azure SQL VM License Terms
de: Azure SQL-VM-Lizenzbedingungen
es: Términos de licencia de la máquina virtual de Azure SQL
fr: Termes du contrat de licence Azure SQL VM
it: Condizioni di licenza della macchina virtuale SQL di Azure
ja: Azure SQL VM ライセンス条項
ko: Azure SQL VM 사용 조건
pt_br: Termos de Licença da VM do SQL do Azure
ru: Условия лицензии виртуальной машины SQL Azure
zh_hans: Azure SQL VM 许可条款
zh_hant: Azure SQL VM 授權條款

# azure-sqlvm-agreement-azdata-eula
source: azdata License Terms
de: azdata-Lizenzbedingungen
es: Términos de licencia de azdata
fr: Termes du contrat de licence azdata
it: Condizioni di licenza di azdata
ja: azdata ライセンス条項
ko: azdata 사용 조건
pt_br: Termos de Licença do azdata
ru: Условия лицензии azdata
zh_hans: azdata 许可条款
zh_hant: azdata 授權條款

# azure-sqlvm-azure-account-page-label
source: Azure information
de: Azure-Informationen
es: Información de Azure
fr: Informations Azure
it: Informazioni su Azure
ja: Azure 情報
ko: Azure 정보
pt_br: Informações do Azure
ru: Информация об Azure
zh_hans: Azure 信息
zh_hant: Azure 資訊

# azure-sqlvm-azure-location-label
source: Azure locations
de: Azure-Standorte
es: Ubicaciones de Azure
fr: Localisations Azure
it: Località di Azure
ja: Azure の場所
ko: Azure 위치
pt_br: Locais do Azure
ru: Расположения Azure
zh_hans: Azure 位置
zh_hant: Azure 位置

# azure-sqlvm-vm-information-page-label
source: VM information
de: VM-Informationen
es: Información de la máquina virtual
fr: Informations VM
it: Informazioni sulla macchina virtuale
ja: VM 情報
ko: VM 정보
pt_br: Informações da VM
ru: Информация о виртуальной машине
zh_hans: VM 信息
zh_hant: VM 資訊

# azure-sqlvm-image-label
source: Image
es: Imagen
it: Immagine
ja: イメージ
ko: 이미지
pt_br: Imagem
ru: Образ
zh_hans: 映像
zh_hant: 映像

# azure-sqlvm-image-sku-label
source: VM image SKU
es: SKU de la imagen de la máquina virtual
fr: Référence SKU d'image VM
it: SKU dell'immagine della macchina virtuale
ja: VM イメージ SKU
ko: VM 이미지 SKU
pt_br: SKU da imagem de VM
ru: Номер SKU образа виртуальной машины
zh_hans: VM 映像 SKU
zh_hant: VM 映像 SKU

# azure-sqlvm-publisher-label
source: Publisher
de: Herausgeber
es: Editor
fr: Serveur de publication
it: Editore
ja: パブリッシャー
ko: 게시자
pt_br: Editor
ru: Издатель
zh_hans: 发布者
zh_hant: 發行者

# azure-sqlvm-vmname-label
source: Virtual machine name
de: VM-Name
es: Nombre de la máquina virtual
fr: Nom de la machine virtuelle
it: Nome macchina virtuale
ja: 仮想マシン名
ko: 가상 머신 이름
pt_br: Nome da máquina virtual
ru: Имя виртуальной машины
zh_hans: 虚拟机名称
zh_hant: 虛擬機器名稱

# azure-sqlvm-vmsize-label
source: Size
de: Größe
es: Tamaño
fr: Taille
it: Dimensioni
ja: サイズ
ko: 크기
pt_br: Tamanho
ru: Размер
zh_hans: 大小
zh_hant: 大小

# azure-sqlvm-storage-page-lable
source: Storage account
de: Speicherkonto
es: Cuenta de almacenamiento
fr: Compte de stockage
it: Account di archiviazione
ja: ストレージ アカウント
ko: 스토리지 계정
pt_br: Conta de armazenamento
ru: Учетная запись хранения
zh_hans: 存储帐户
zh_hant: 儲存體帳戶

# azure-sqlvm-storage-accountname-label
source: Storage account name
de: Speicherkontoname
es: Nombre de la cuenta de almacenamiento
fr: Nom du compte de stockage
it: Nome account di archiviazione
ja: ストレージ アカウント名
ko: 스토리지 계정 이름
pt_br: Nome da conta de armazenamento
ru: Имя учетной записи хранения
zh_hans: 存储帐户名称
zh_hant: 儲存體帳戶名稱

# azure-sqlvm-storage-sku-label
source: Storage account SKU type
de: SKU-Typ für Speicherkonto
es: Tipo de SKU de la cuenta de almacenamiento
fr: Type de référence SKU du compte de stockage
it: Tipo di SKU dell'account di archiviazione
ja: ストレージ アカウント SKU の種類
ko: 스토리지 계정 SKU 유형
pt_br: Tipo de SKU da conta de armazenamento
ru: Тип SKU учетной записи хранения
zh_hans: 存储帐户 SKU 类型
zh_hant: 儲存體帳戶 SKU 類型

# azure-sqlvm-vm-administrator-account-page-label
source: Administrator account
de: Administratorkonto
es: Cuenta de administrador
fr: Compte Administrateur
it: Account amministratore
ja: 管理者アカウント
ko: 관리자 계정
pt_br: Conta de administrador
ru: Учетная запись администратора
zh_hans: 管理员帐户
zh_hant: 系統管理員帳戶

# azure-sqlvm-username-label
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# azure-sqlvm-password-label
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# azure-sqlvm-password-confirm-label
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# azure-sqlvm-vm-summary-page-label
source: Summary
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
it: Riepilogo
ja: 概要
ko: 요약
pt_br: Resumo
ru: Сводка
zh_hans: 摘要
zh_hant: 摘要

# azure-sqldb-display-name
source: Azure SQL Database
de: Azure SQL-Datenbank
it: Database SQL di Azure
pt_br: Banco de Dados SQL do Azure
ru: База данных SQL Azure
zh_hans: Azure SQL 数据库

# azure-sqldb-description
source: Create a SQL database, database server, or elastic pool in Azure.
de: Hiermit erstellen Sie eine SQL-Datenbank, einen Datenbankserver oder einen Pool für elastische Datenbanken in Azure.
es: Cree una base de datos SQL, un servidor de bases de datos o un grupo elástico en Azure.
fr: Créez une base de données SQL, un serveur de base de données ou un pool élastique dans Azure.
it: Creare un database SQL, un server di database o un pool elastico in Azure.
ja: Azure で SQL データベース、データベースサーバー、またはエラスティック プールを作成します。
ko: Azure에서 SQL 데이터베이스, 데이터베이스 서버 또는 탄력적 풀을 만듭니다.
pt_br: Crie um banco de dados SQL, um servidor de banco de dados ou um pool elástico no Azure.
ru: Создайте базу данных, сервер базы данных или эластичный пул в Azure.
zh_hans: 在 Azure 中创建 SQL 数据库、数据库服务器或弹性池。
zh_hant: 在 Azure 中建立 SQL 資料庫、資料庫伺服器或彈性集區。

# azure-sqldb-portal-ok-button-text
source: Create in Azure portal
de: Im Azure-Portal erstellen
es: Crear en Azure Portal
fr: Créer dans le portail Azure
it: Crea nel portale di Azure
ja: Azure portal で作成
ko: Azure Portal에서 만들기
pt_br: Criar no portal do Azure
ru: Создать на портале Azure
zh_hans: 在 Azure 门户中创建
zh_hant: 在 Azure 入口網站中建立

# azure-sqldb-notebook-ok-button-text
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

# resource-type-display-name
source: Resource Type
de: Ressourcentyp
es: Tipo de recurso
fr: Type de ressource
it: Tipo di risorsa
ja: リソースの種類
ko: 리소스 종류
pt_br: Tipo de Recurso
ru: Тип ресурса
zh_hans: 资源类型
zh_hant: 資源類型

# sql-azure-single-database-display-name
source: Single Database
de: Einzeldatenbank
es: Base de datos única
fr: Base de données unique
it: Database singolo
ja: 単一データベース
ko: 단일 데이터베이스
pt_br: Banco de Dados Individual
ru: Отдельная база данных
zh_hans: 单一数据库
zh_hant: 單一資料庫

# sql-azure-elastic-pool-display-name
source: Elastic Pool
de: Pool für elastische Datenbanken
es: Grupo elástico
fr: Pool élastique
it: Pool elastico
ja: エラスティック プール
ko: 탄력적 풀
pt_br: Pool Elástico
ru: Эластичный пул
zh_hans: 弹性池
zh_hant: 彈性集區

# sql-azure-database-server-display-name
source: Database Server
de: Datenbankserver
es: Servidor de bases de datos
fr: Serveur de base de données
it: Server di database
ja: データベース サーバー
ko: 데이터베이스 서버
pt_br: Servidor de Banco de Dados
ru: Сервер базы данных
zh_hans: 数据库服务器
zh_hant: 資料庫伺服器

# azure-sqldb-agreement
source: I accept {0}, {1} and {2}.
de: Ich akzeptiere {0}, {1} und {2}.
es: Acepto {0}, {1} y {2}.
fr: J'accepte {0}, {1} et {2}.
it: Accetto {0}, {1} e {2}.
ja: {0}、{1}、{2} に同意します。
ko: {0}, {1} 및 {2}에 동의합니다.
pt_br: Aceito {0}, {1} e {2}.
ru: Я принимаю {0}, {1} и {2}.
zh_hans: 我接受 {0}、{1} 和 {2}。
zh_hant: 我接受 {0}、{1} 和 {2}。

# azure-sqldb-agreement-sqldb-eula
source: Azure SQL DB License Terms
de: Lizenzbedingungen für Azure SQL-Datenbank
es: Términos de licencia de Azure SQL Database
fr: Termes du contrat de licence Azure SQL DB
it: Condizioni di licenza del Database SQL di Azure
ja: Azure SQL DB ライセンス条項
ko: Azure SQL DB 사용 조건
pt_br: Termos de Licença do BD SQL do Azure
ru: Условия лицензии Базы данных SQL Azure
zh_hans: Azure SQL DB 许可条款
zh_hant: Azure SQL DB 授權條款

# azure-sqldb-agreement-azdata-eula
source: azdata License Terms
de: azdata-Lizenzbedingungen
es: Términos de licencia de azdata
fr: Termes du contrat de licence azdata
it: Condizioni di licenza di azdata
ja: azdata ライセンス条項
ko: azdata 사용 조건
pt_br: Termos de Licença do azdata
ru: Условия лицензии azdata
zh_hans: azdata 许可条款
zh_hant: azdata 授權條款

# azure-sql-mi-display-name
source: Azure SQL managed instance
es: Instancia administrada de Azure SQL
fr: Instance managée Azure SQL
it: Istanza gestita di SQL di Azure
pt_br: Instância gerenciada de SQL do Azure
ru: Управляемый экземпляр SQL Azure
zh_hans: Azure SQL 托管实例
zh_hant: Azure SQL 受控執行個體

# azure-sql-mi-display-description
source: Create a SQL Managed Instance in either Azure or a customer-managed environment
de: SQL Managed Instance in Azure oder einer kundenseitig verwalteten Umgebung erstellen
es: Cree un servicio SQL Managed Instance en Azure o en un entorno administrado por el cliente.
fr: Créer une instance managée SQL dans Azure ou dans un environnement géré par le client
it: Creare un'Istanza gestita di SQL in Azure o in un ambiente gestito dal cliente
ja: Azure または顧客が管理する環境に SQL Managed Instance を作成します
ko: Azure 또는 고객 관리형 환경에서 SQL Managed Instance 만들기
pt_br: Criar uma Instância Gerenciada de SQL no Azure ou em um ambiente gerenciado pelo cliente
ru: Создайте Управляемый экземпляр SQL в Azure или в управляемой пользователем среде
zh_hans: 在 Azure 或客户管理的环境中创建 SQL 托管实例
zh_hant: 在 Azure 或客戶自控環境中建立 SQL 受控執行個體

# azure-sql-mi-okButton-text
source: Open in Portal
de: Im Portal öffnen
es: Abrir en el portal
fr: Ouvrir dans le portail
it: Apri nel portale
ja: ポータルで開く
ko: Portal에서 열기
pt_br: Abrir no Portal
ru: Открыть на портале
zh_hans: 在门户中打开
zh_hant: 在入口網站中開啟

# azure-sql-mi-resource-type-option-label
source: Resource Type
de: Ressourcentyp
es: Tipo de recurso
fr: Type de ressource
it: Tipo di risorsa
ja: リソースの種類
ko: 리소스 종류
pt_br: Tipo de Recurso
ru: Тип ресурса
zh_hans: 资源类型
zh_hant: 資源類型

# azure-sql-mi-agreement
source: I accept {0} and {1}.
de: Ich akzeptiere die {0} und die {1}.
es: Acepto {0} y {1}.
fr: J'accepte {0} et {1}.
it: Accetto {0} e {1}.
ja: {0} および {1} に同意します。
ko: {0} 및 {1}에 동의합니다.
pt_br: Aceito {0} e {1}.
ru: Я принимаю {0} и {1}.
zh_hans: 我接受 {0} 和 {1}。
zh_hant: 我接受 {0} 和 {1}。

# azure-sql-mi-agreement-eula
source: Azure SQL MI License Terms
de: Azure SQL MI-Lizenzbedingungen
es: Términos de licencia de Azure SQL MI
fr: Termes du contrat de licence Azure SQL MI
it: Condizioni di licenza dell'Istanza gestita di SQL di Azure
ja: Azure SQL MI ライセンス条項
ko: Azure SQL MI 사용 조건
pt_br: Termos de Licença da MI do SQL do Azure
ru: Условия лицензии Управляемого экземпляра SQL Azure
zh_hans: Azure SQL MI 许可条款
zh_hant: Azure SQL MI 授權條款

# azure-sql-mi-help-text
source: Azure SQL Managed Instance provides full SQL Server access and feature compatibility for migrating SQL Servers to Azure, or developing new applications. {0}.
de: Azure SQL Managed Instance bietet vollständigen Zugriff auf SQL Server sowie Featurekompatibilität für die Migration von SQL Server-Computern zu Azure oder die Entwicklung neuer Anwendungen. {0}.
es: Instancia administrada de Azure SQL proporciona acceso completo a SQL Server y compatibilidad de características para la migración de servidores SQL Server a Azure o para el desarrollo de nuevas aplicaciones. {0}.
fr: Azure SQL Managed Instance offre un accès total à SQL Server ainsi que la compatibilité des fonctionnalités afin de migrer les serveurs SQL vers Azure ou développer de nouvelles applications. {0}.
it: L'Istanza gestita di SQL di Azure fornisce l'accesso completo a SQL Server e la compatibilità delle funzionalità per la migrazione delle istanze di SQL Server ad Azure o lo sviluppo di nuove applicazioni. {0}.
ja: Azure SQL Managed Instance によって、SQL Server を Azure に移行したり、新しいアプリケーションを開発したりするための SQL Server のフル アクセスと機能互換性が提供されます。{0}。
ko: Azure SQL Managed Instance는 SQL Server를 Azure로 마이그레이션하거나 새 애플리케이션을 개발하는 데 필요한 전체 SQL Server 액세스 및 기능 호환성을 제공합니다. {0}.
pt_br: A Instância Gerenciada de SQL do Azure fornece acesso completo ao SQL Server e compatibilidade de recurso para migrar SQL Servers para o Azure ou desenvolver novos aplicativos. {0}.
ru: Управляемый экземпляр SQL Azure предоставляет полный доступ к SQL Server и совместимость функций для миграции серверов SQL Server в Azure или для разработки новых приложений. {0}.
zh_hans: Azure SQL 托管实例提供全面的 SQL Server 访问和功能兼容性，用于将 SQL Server 迁移到 Azure，或开发新应用程序。{0}。
zh_hant: Azure SQL 受控執行個體提供完整的 SQL Server 存取及功能相容性，以將 SQL Server 移轉至 Azure，或開發新的應用程式。{0}。

# azure-sql-mi-help-text-learn-more
source: Learn More
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Saiba Mais
ru: Дополнительные сведения
zh_hans: 了解更多
zh_hant: 深入了解

source: Azure Account
de: Azure-Konto
es: Cuenta de Azure
fr: Compte Azure
it: Account Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Conta do Azure
ru: Учетная запись Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶
