Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# deployCluster.ClusterAdminsDescription
source: The Active Directory group for cluster admin.
de: Die Active Directory-Gruppe für den Clusteradministrator
es: El grupo de Active Directory para el administrador del clúster.
fr: Groupe Active Directory de l'administrateur de cluster.
it: Gruppo di Active Directory per l'amministratore del cluster.
ja: クラスター管理者の Active Directory グループ。
ko: 클러스터 관리자의 Active Directory 그룹입니다.
pt_br: O grupo do Active Directory para administrador de clusters.
ru: Группа Active Directory для администратора кластера.
zh_hans: 群集管理员的 Active Directory 组。
zh_hant: 叢集系統管理員的 Active Directory 群組。

# deployCluster.ClusterUsers
source: Cluster users
de: Clusterbenutzer
es: Usuarios del clúster
fr: Utilisateurs du cluster
it: Utenti del cluster
ja: クラスター ユーザー
ko: 클러스터 사용자
pt_br: Usuários do cluster
ru: Пользователи кластера
zh_hans: 群集用户
zh_hant: 叢集使用者

# deployCluster.ClusterUsersPlaceHolder
source: Use comma to separate the values.
de: Trennen Sie die Werte durch Kommas.
es: Utilice la coma para separar los valores.
fr: Utilisez une virgule pour séparer les valeurs.
it: Usare la virgola per separare i valori.
ja: コンマを使用して値を区切ります。
ko: 쉼표를 사용하여 값을 구분합니다.
pt_br: Use vírgula para separar os valores.
ru: Используйте запятую для разделения значений.
zh_hans: 使用逗号分隔值。
zh_hant: 使用逗號分隔值。

# deployCluster.ClusterUsersDescription
source: The Active Directory users/groups with cluster users role. Use comma to separate multiple users/groups.
de: Die Active Directory-Benutzer und -Gruppen mit der Rolle "Clusterbenutzer". Trennen Sie mehrere Benutzer oder Gruppen durch Kommas.
es: Grupos/usuarios de Active Directory con rol de usuarios del clúster. Utilice la coma para separar varios usuarios/grupos.
fr: Utilisateurs/groupes Active Directory avec un rôle d'utilisateurs de cluster. Utilisez une virgule pour séparer plusieurs utilisateurs/groupes.
it: Utenti/gruppi di Active Directory con il ruolo di utenti del cluster. Usare la virgola come delimitatore tra più utenti/gruppi.
ja: クラスター ユーザー ロールを持つ Active Directory のユーザーまたはグループ。複数のユーザーまたはグループを区切るには、コンマを使用します。
ko: 클러스터 사용자 역할이 있는 Active Directory 사용자/그룹입니다. 쉼표를 사용하여 여러 사용자/그룹을 구분합니다.
pt_br: Os usuários ou grupos do Active Directory com a função de usuários do cluster. Use vírgula para separar vários usuários ou grupos.
ru: Пользователи/группы Active Directory с ролью пользователей кластера. Используйте запятую для разделения нескольких пользователей/групп.
zh_hans: 具有群集用户角色的 Active Directory 用户/组。使用逗号分隔多个用户/组。
zh_hant: 具有叢集使用者角色的 Active Directory 使用者/群組。請使用逗號分隔多個使用者/群組。

# deployCluster.DomainServiceAccountUserName
source: Service account username
de: Benutzername des Dienstkontos
es: Nombre de usuario de la cuenta de servicio
fr: Nom d'utilisateur du compte de service
it: Nome utente dell'account del servizio
ja: サービス アカウントのユーザー名
ko: 서비스 계정 사용자 이름
pt_br: Nome de usuário da conta de serviço
ru: Имя пользователя учетной записи службы
zh_hans: 服务帐户用户名
zh_hant: 服務帳戶使用者名稱

# deployCluster.DomainServiceAccountUserNameDescription
source: Domain service account for Big Data Cluster
de: Domänendienstkonto für Big Data-Cluster
es: Cuenta de servicio de dominio para el clúster de macrodatos
fr: Compte de service de domaine pour le cluster Big Data
it: Account del servizio di dominio per il cluster Big Data
ja: ビッグ データ クラスターのドメイン サービス アカウント
ko: 빅 데이터 클러스터의 도메인 서비스 계정
pt_br: Conta de serviço de domínio do Cluster de Big Data
ru: Учетная запись службы домена для кластера больших данных
zh_hans: 大数据群集的域服务帐户
zh_hant: 巨量資料叢集的網域服務帳戶

# deployCluster.DomainServiceAccountPassword
source: Service account password
de: Kennwort für Dienstkonto
es: Contraseña de la cuenta de servicio
fr: Mot de passe de compte de service
it: Password dell'account del servizio
ja: サービス アカウントのパスワード
ko: 서비스 계정 암호
pt_br: Senha da conta de serviço
ru: Пароль учетной записи службы
zh_hans: 服务帐户密码
zh_hant: 服務帳戶密碼

# deployCluster.AppOwners
source: App owners
de: App-Besitzer
es: Propietarios de aplicaciones
fr: Propriétaires d'application
it: Proprietari dell'app
ja: アプリの所有者
ko: 앱 소유자
pt_br: Proprietários de aplicativos
ru: Владельцы приложений
zh_hans: 应用所有者
zh_hant: 應用程式擁有者

# deployCluster.AppOwnersPlaceHolder
source: Use comma to separate the values.
de: Trennen Sie die Werte durch Kommas.
es: Utilice la coma para separar los valores.
fr: Utilisez une virgule pour séparer les valeurs.
it: Usare la virgola per separare i valori.
ja: コンマを使用して値を区切ります。
ko: 쉼표를 사용하여 값을 구분합니다.
pt_br: Use vírgula para separar os valores.
ru: Используйте запятую для разделения значений.
zh_hans: 使用逗号分隔值。
zh_hant: 使用逗號分隔值。

# deployCluster.AppOwnersDescription
source: The Active Directory users or groups with app owners role. Use comma to separate multiple users/groups.
de: Die Active Directory-Benutzer oder -Gruppen mit der Rolle "App-Besitzer". Trennen Sie mehrere Benutzer oder Gruppen durch Kommas.
es: Los usuarios o grupos de Active Directory con el rol de propietarios de aplicaciones. Utilice la coma para separar varios usuarios/grupos.
fr: Utilisateurs ou groupes Active Directory avec un rôle de propriétaires d'application. Utilisez une virgule pour séparer plusieurs utilisateurs/groupes.
it: Utenti o gruppi di Active Directory con il ruolo di proprietari dell'app. Usare la virgola come delimitatore tra più utenti/gruppi.
ja: アプリ所有者ロールを持つ Active Directory ユーザーまたはグループ。複数のユーザーまたはグループを区切るには、コンマを使用します。
ko: 앱 소유자 역할이 있는 Active Directory 사용자 또는 그룹입니다. 쉼표를 사용하여 여러 사용자/그룹을 구분합니다.
pt_br: Os usuários ou grupos do Active Directory com a função de proprietários de aplicativos. Use vírgula para separar vários usuários ou grupos.
ru: Пользователи или группы Active Directory с ролью владельцев приложений. Используйте запятую для разделения нескольких пользователей/групп.
zh_hans: 具有应用所有者角色的 Active Directory 用户或组。使用逗号分隔多个用户/组。
zh_hant: 具有應用程式擁有者角色的 Active Directory 使用者或群組。請使用逗號分隔多個使用者/群組。

# deployCluster.AppReaders
source: App readers
de: App-Leseberechtigte
es: Lectores de aplicaciones
fr: Lecteurs d'application
it: Lettori dell'app
ja: アプリ リーダー
ko: 앱 읽기 권한자
pt_br: Leitores de aplicativos
ru: Читатели приложений
zh_hans: 应用读者
zh_hant: 應用程式讀者

# deployCluster.AppReadersPlaceHolder
source: Use comma to separate the values.
de: Trennen Sie die Werte durch Kommas.
es: Utilice la coma para separar los valores.
fr: Utilisez une virgule pour séparer les valeurs.
it: Usare la virgola per separare i valori.
ja: コンマを使用して値を区切ります。
ko: 쉼표를 사용하여 값을 구분합니다.
pt_br: Use vírgula para separar os valores.
ru: Используйте запятую для разделения значений.
zh_hans: 使用逗号分隔值。
zh_hant: 使用逗號分隔值。

# deployCluster.AppReadersDescription
source: The Active Directory users or groups of app readers. Use comma as separator them if there are multiple users/groups.
de: Die Active Directory-Benutzer oder -Gruppen mit Leseberechtigungen für Apps. Verwenden Sie Kommas als Trennzeichen, wenn mehrere Benutzer oder Gruppen vorhanden sind.
es: Los usuarios o grupos de Active Directory de lectores de aplicaciones. Utilice la coma como separador si hay varios usuarios/grupos.
fr: Utilisateurs ou groupes Active Directory des lecteurs d'application. Utilisez une virgule pour séparer les différents groupes/utilisateurs s'il y en a plusieurs.
it: Utenti o gruppi di Active Directory con il ruolo di lettori dell'app. Usare la virgola come delimitatore tra più utenti/gruppi.
ja: アプリ リーダーの Active Directory ユーザーまたはグループ。複数のユーザーまたはグループがある場合は、コンマを区切り記号として使用します。
ko: 앱 읽기 권한자의 Active Directory 사용자 또는 그룹입니다. 여러 사용자/그룹이 있는 경우 쉼표를 구분 기호로 사용합니다.
pt_br: Os usuários ou os grupos de leitores de aplicativos do Active Directory. Use vírgula como separador se houver vários usuários ou grupos.
ru: Пользователи Active Directory или группы читателей приложений. Используйте запятую в качестве разделителя при наличии нескольких пользователей/групп.
zh_hans: Active Directory 用户或应用读者组。如果有多个用户/组，请使用逗号作为分隔符。
zh_hant: 應用程式讀者的 Active Directory 使用者或群組。如果有多個使用者/群組，請使用逗號予以分隔。

# deployCluster.Subdomain
source: Subdomain
de: Unterdomäne
es: Subdominio
fr: Sous-domaine
it: Sottodominio
ja: サブドメイン
ko: 하위 도메인
pt_br: Subdomínio
ru: Поддомен
zh_hans: 子域
zh_hant: 子網域

# deployCluster.SubdomainDescription
source: A unique DNS subdomain to use for this SQL Server Big Data Cluster. If not provided, the cluster name will be used as the default value.
de: Eine eindeutige DNS-Unterdomäne, die für diesen SQL Server-Big Data-Cluster verwendet werden soll. Wenn keine Angabe vorliegt, wird der Clustername als Standardwert verwendet.
es: Subdominio DNS único que se va a usar para este clúster de macrodatos de SQL Server. Si no se proporciona, se usará el nombre del clúster como valor predeterminado.
fr: Sous-domaine DNS unique à utiliser pour ce cluster Big Data SQL Server. S'il n'est pas fourni, le nom de cluster est utilisé comme valeur par défaut.
it: Sottodominio DNS univoco da usare per questo cluster Big Data di SQL Server. Se non viene specificato, verrà usato il nome del cluster come valore predefinito.
ja: この SQL Server ビッグ データ クラスターで使用する一意の DNS サブドメイン。指定されていない場合は、クラスター名が既定値として使用されます。
ko: 이 SQL Server 빅 데이터 클러스터에 사용할 고유한 DNS 하위 도메인입니다. 제공되지 않으면 클러스터 이름이 기본값으로 사용됩니다.
pt_br: Um subdomínio DNS exclusivo a ser usado neste Cluster de Big Data do SQL Server. Se não for fornecido, o nome do cluster será usado como o valor padrão.
ru: Уникальный поддомен DNS, который будет использоваться для этого кластера больших данных SQL Server. Если не указан, то в качестве значения по умолчанию будет использоваться имя кластера.
zh_hans: 用于此 SQL Server 大数据群集的唯一 DNS 子域。如果未提供，则将群集名称用作默认值。
zh_hant: 供此 SQL Server 巨量資料叢集使用的唯一 DNS 子網域。若未提供，則會使用叢集名稱作為預設值。

# deployCluster.AccountPrefix
source: Account prefix
de: Kontopräfix
es: Prefijo de cuenta
fr: Préfixe du compte
it: Prefisso dell'account
ja: アカウント プレフィックス
ko: 계정 접두사
pt_br: Prefixo da conta
ru: Префикс учетной записи
zh_hans: 帐户前缀
zh_hant: 帳戶首碼

# deployCluster.AccountPrefixDescription
source: A unique prefix for AD accounts SQL Server Big Data Cluster will generate. If not provided, the subdomain name will be used as the default value. If a subdomain is not provided, the cluster name will be used as the default value.
de: Ein eindeutiges Präfix für AD-Konten, die vom SQL Server-Big Data-Cluster generiert werden. Wenn keine Angabe vorliegt, wird der Name der Unterdomäne als Standardwert verwendet. Wenn keine Unterdomäne angegeben wird, dient der Clustername als Standardwert.
es: Prefijo único para las cuentas de AD que el clúster de macrodatos de SQL Server generará. Si no se proporciona, se usará el nombre del subdominio como valor predeterminado. Si no se proporciona un subdominio, se utilizará el nombre del clúster como valor predeterminado.
fr: Préfixe unique pour les comptes AD que le cluster Big Data SQL Server génère. S'il n'est pas fourni, le nom du sous-domaine est utilisé comme valeur par défaut. Si aucun sous-domaine n'est fourni, le nom du cluster est utilisé comme valeur par défaut.
it: Verrà generato un prefisso univoco per il cluster Big Data di SQL Server degli account AD. Se non viene specificato, verrà usato il nome del sottodominio come valore predefinito. Se non viene specificato un sottodominio, verrà usato il nome del cluster come valore predefinito.
ja: SQL Server ビッグ データ クラスターによって生成される AD アカウントの一意のプレフィックス。指定されていない場合は、サブドメイン名が既定値として使用されます。サブドメインが指定されていない場合は、クラスター名が既定値として使用されます。
ko: AD 계정 SQL Server 빅 데이터 클러스터의 고유한 접두사가 생성됩니다. 제공되지 않으면 하위 도메인 이름이 기본값으로 사용됩니다. 하위 도메인이 제공되지 않으면 클러스터 이름이 기본값으로 사용됩니다.
pt_br: Um prefixo exclusivo para contas do AD que o Cluster de Big Data do SQL Server vai gerar. Se não for fornecido, o nome de subdomínio será usado como o valor padrão. Se um subdomínio não for fornecido, o nome do cluster será usado como o valor padrão.
ru: Уникальный префикс для учетных записей AD, которые будет создавать кластер больших данных SQL Server. Если не указан, то в качестве значения по умолчанию будет использоваться имя поддомена. Если поддомен не указан, то в качестве значения по умолчанию будет использоваться имя кластера.
zh_hans: SQL Server 大数据群集将生成的 AD 帐户的唯一前缀。如果未提供，则将子域名用作默认值。如果未提供子域，则将群集名称用作默认值。
zh_hant: 將為 SQL Server 巨量資料叢集 AD 帳戶產生唯一首碼。若未提供，則會使用子網域名稱作為預設值。若未提供子網域，則會使用叢集名稱作為預設值。

# deployCluster.AdminPasswordField
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# deployCluster.ValidationError
source: There are some errors on this page, click 'Show Details' to view the errors.
de: Es liegen Fehler auf dieser Seite vor. Klicken Sie auf "Details anzeigen", um diese anzuzeigen.
es: Hay algunos errores en esta página, haga clic en "Mostrar detalles" para verlos.
fr: Cette page a des erreurs, cliquez sur 'Afficher les détails' pour les voir.
it: In questa pagina sono presenti alcuni errori. Per visualizzarli, fare clic su 'Mostra dettagli'.
ja: このページにはいくつかのエラーがあります。エラーを表示するには、[詳細を表示] をクリックします。
ko: 이 페이지에 오류가 있습니다. 오류를 보려면 '세부 정보 표시'를 클릭합니다.
pt_br: Há alguns erros nesta página. Clique em 'Mostrar Detalhes' para exibir os erros.
ru: На этой странице есть ошибки, для их просмотра щелкните "Показать сведения".
zh_hans: 此页面上存在一些错误，请单击“显示详细信息”以查看错误。
zh_hant: 此頁面有一些錯誤，按一下 [顯示詳細資料] 即可檢視錯誤。

# deployCluster.ServiceSettingsPageTitle
source: Service settings
de: Diensteinstellungen
es: Configuración del servicio
fr: Paramètres de service
it: Impostazioni del servizio
ja: サービスの設定
ko: 서비스 설정
pt_br: Configurações do serviço
ru: Параметры службы
zh_hans: 服务设置
zh_hant: 服務設定

# deployCluster.scaleSectionTitle
source: Scale settings
de: Skalierungseinstellungen
es: Ajustes de escala
fr: Paramètres de mise à l'échelle
it: Impostazioni di scalabilità
ja: スケールの設定
ko: 크기 조정 설정
pt_br: Configurações de escala
ru: Параметры масштабирования
zh_hans: 缩放设置
zh_hant: 調整設定

# deployCluster.MasterSqlServerInstances
source: SQL Server master instances
de: SQL Server-Masterinstanzen
es: Instancias maestras de SQL Server
fr: Instances maîtres SQL Server
it: Istanze master di SQL Server
ja: SQL Server マスター インスタンス
ko: SQL Server 마스터 인스턴스
pt_br: Instâncias mestras do SQL Server
ru: Главные экземпляры SQL Server
zh_hans: SQL Server 主实例
zh_hant: SQL Server 主要執行個體

# deployCluster.ComputePoolInstances
source: Compute pool instances
de: Computepoolinstanzen
es: Instancias del grupo de proceso
fr: Instances de pool de calcul
it: Istanze del pool di calcolo
ja: コンピューティング プール インスタンス
ko: 컴퓨팅 풀 인스턴스
pt_br: Instâncias do pool de computação
ru: Экземпляры вычислительного пула
zh_hans: 计算池实例
zh_hant: 計算集區執行個體

# deployCluster.DataPoolInstances
source: Data pool instances
de: Datenpoolinstanzen
es: Instancias del grupo de datos
fr: Instances de pool de données
it: Istanze del pool di dati
ja: データ プール インスタンス
ko: 데이터 풀 인스턴스
pt_br: Instâncias do pool de dados
ru: Экземпляры пула данных
zh_hans: 数据池实例
zh_hant: 資料集區執行個體

# deployCluster.SparkPoolInstances
source: Spark pool instances
de: Spark-Poolinstanzen
es: Instancias de grupo de Spark
fr: Instances de pool Spark
it: Istanze del pool di Spark
ja: Spark プール インスタンス
ko: Spark 풀 인스턴스
pt_br: Instâncias do pool do Spark
ru: Экземпляры пула Spark
zh_hans: Spark 池实例
zh_hant: Spark 集區執行個體

# deployCluster.StoragePoolInstances
source: Storage pool (HDFS) instances
de: Speicherpoolinstanzen (HDFS)
es: Instancias del grupo de almacenamiento (HDFS)
fr: Instances de pool de stockage (HDFS)
it: Istanze del pool di archiviazione (HDFS)
ja: 記憶域プール (HDFS) インスタンス
ko: 스토리지 풀(HDFS) 인스턴스
pt_br: Instâncias do pool de armazenamento (HDFS)
ru: Экземпляры пула носителей (HDFS)
zh_hans: 存储池(HDFS)实例
zh_hant: 儲存集區 (HDFS) 執行個體

# deployCluster.IncludeSparkInStoragePool
source: Include Spark in storage pool
de: Spark in Speicherpool einbeziehen
es: Incluir Spark en el grupo de almacenamiento
fr: Inclure Spark dans le pool de stockage
it: Includi Spark nel pool di archiviazione
ja: 記憶域プールに Spark を含める
ko: 스토리지 풀에 Spark 포함
pt_br: Incluir o Spark no pool de armazenamento
ru: Включить Spark в пул носителей
zh_hans: 在存储池中包括 Spark
zh_hant: 在儲存集區中包含 Spark

# deployCluster.DNSNameHeader
source: DNS name
es: Nombre DNS
fr: Nom DNS
it: Nome DNS
ja: DNS 名
ko: DNS 이름
pt_br: Nome DNS
ru: DNS-имя
zh_hans: DNS 名称
zh_hant: DNS 名稱

# deployCluster.PortHeader
source: Port
es: Puerto
it: Porta
ja: ポート
ko: 포트
pt_br: Porta
ru: Порт
zh_hans: 端口
zh_hant: 連接埠

# deployCluster.ControllerText
source: Controller
es: Controlador
fr: Contrôleur
ja: コントローラー
ko: 컨트롤러
pt_br: Controlador
ru: Контроллер
zh_hans: 控制器
zh_hant: 控制器

# deployCluster.ControllerDNSName
source: Controller DNS name
de: DNS-Name des Controllers
es: Nombre DNS del controlador
fr: Nom DNS du contrôleur
it: Nome DNS del controller
ja: コントローラー DNS 名
ko: 컨트롤러 DNS 이름
pt_br: Nome DNS do controlador
ru: DNS-имя контроллера
zh_hans: 控制器 DNS 名称
zh_hant: 控制器 DNS 名稱

# deployCluster.ControllerPortName
source: Controller port
es: Puerto del controlador
fr: Port de contrôleur
it: Porta del controller
ja: コントローラー ポート
ko: 컨트롤러 포트
pt_br: Porta do controlador
ru: Порт контроллера
zh_hans: 控制器端口
zh_hant: 控制器連接埠

# deployCluster.MasterSqlText
source: SQL Server Master
es: Servidor SQL Server maestro
fr: Instance maître SQL Server
it: Master SQL Server
ja: SQL Server マスター
ko: SQL Server 마스터
pt_br: SQL Server Mestre
ru: База данных master SQL Server
zh_hans: SQL Server 主实例
zh_hant: SQL Server 主機

# deployCluster.MasterSQLServerDNSName
source: SQL Server Master DNS name
de: DNS-Name der SQL Server-Masterinstanz
es: Nombre DNS maestro de SQL Server
fr: Nom DNS de l'instance maître SQL Server
it: Nome DNS dell'istanza master di SQL Server
ja: SQL Server マスター DNS 名
ko: SQL Server 마스터 DNS 이름
pt_br: Nome DNS mestre do SQL Server
ru: DNS-имя основного сервера SQL Server
zh_hans: SQL Server 主 DNS 名称
zh_hant: SQL Server 主要 DNS 名稱

# deployCluster.MasterSQLServerPortName
source: SQL Server Master port
es: Puerto maestro de SQL Server
fr: Port de l'instance maître SQL Server
it: Porta dell'istanza master di SQL Server
ja: SQL Server マスター ポート
ko: SQL Server 마스터 포트
pt_br: Porta mestra do SQL Server
ru: Порт основного сервера SQL Server
zh_hans: SQL Server 主端口
zh_hant: SQL Server 主要連接埠

# deployCluster.GatewayText
source: Gateway
es: Puerta de enlace
fr: Passerelle
ja: ゲートウェイ
ko: 게이트웨이
ru: Шлюз
zh_hans: 网关
zh_hant: 閘道

# deployCluster.GatewayDNSName
source: Gateway DNS name
de: DNS-Name des Gateways
es: Nombre DNS de puerta de enlace
fr: Nom DNS de la passerelle
it: Nome DNS del gateway
ja: ゲートウェイ DNS 名
ko: 게이트웨이 DNS 이름
pt_br: Nome DNS do gateway
ru: DNS-имя шлюза
zh_hans: 网关 DNS 名称
zh_hant: 閘道 DNS 名稱

# deployCluster.GatewayPortName
source: Gateway port
es: Puerto de puerta de enlace
fr: Port de passerelle
it: Porta del gateway
ja: ゲートウェイ ポート
ko: 게이트웨이 포트
pt_br: Porta do gateway
ru: Порт шлюза
zh_hans: 网关端口
zh_hant: 閘道連接埠

# deployCluster.ServiceProxyText
source: Management proxy
de: Verwaltungsproxy
es: Proxy de administración
fr: Proxy de gestion
it: Proxy di gestione
ja: 管理プロキシ
ko: 관리 프록시
pt_br: Proxy de gerenciamento
ru: Прокси-сервер управления
zh_hans: 管理代理
zh_hant: 管理 Proxy

# deployCluster.ServiceProxyDNSName
source: Management proxy DNS name
de: DNS-Name des Verwaltungsproxys
es: Nombre DNS del proxy de administración
fr: Nom DNS du proxy de gestion
it: Nome DNS del proxy di gestione
ja: 管理プロキシ DNS 名
ko: 관리 프록시 DNS 이름
pt_br: Nome DNS do proxy de gerenciamento
ru: DNS-имя прокси-сервера управления
zh_hans: 管理代理 DNS 名称
zh_hant: 管理 Proxy DNS 名稱

# deployCluster.ServiceProxyPortName
source: Management proxy port
de: Port des Verwaltungsproxys
es: Puerto proxy de administración
fr: Port du proxy de gestion
it: Porta del proxy di gestione
ja: 管理プロキシ ポート
ko: 관리 프록시 포트
pt_br: Porta do proxy de gerenciamento
ru: Порт прокси-сервера управления
zh_hans: 管理代理端口
zh_hant: 管理 Proxy 連接埠

# deployCluster.AppServiceProxyText
source: Application proxy
de: Anwendungsproxy
es: Proxy de aplicación
fr: Proxy d'application
it: Proxy dell'applicazione
ja: アプリケーション プロキシ
ko: 애플리케이션 프록시
pt_br: Proxy de aplicativo
ru: Прокси приложения
zh_hans: 应用程序代理
zh_hant: 應用程式 Proxy

# deployCluster.AppServiceProxyDNSName
source: Application proxy DNS name
de: DNS-Name des Anwendungsproxys
es: Nombre DNS del proxy de aplicación
fr: Nom DNS du proxy d'application
it: Nome DNS del proxy dell'applicazione
ja: アプリケーション プロキシ DNS 名
ko: 애플리케이션 프록시 DNS 이름
pt_br: Nome DNS do proxy de aplicativo
ru: DNS-имя прокси приложения
zh_hans: 应用程序代理 DNS 名称
zh_hant: 應用程式 Proxy DNS 名稱

# deployCluster.AppServiceProxyPortName
source: Application proxy port
de: Port des Anwendungsproxys
es: Puerto proxy de aplicación
fr: Port du proxy d'application
it: Porta del proxy dell'applicazione
ja: アプリケーション プロキシ ポート
ko: 애플리케이션 프록시 포트
pt_br: Porta do proxy de aplicativo
ru: Порт прокси приложения
zh_hans: 应用程序代理端口
zh_hant: 應用程式 Proxy 連接埠

# deployCluster.ReadableSecondaryText
source: Readable secondary
de: Lesbares sekundäres Replikat
es: Réplica secundaria legible
fr: Secondaire accessible en lecture
it: Replica secondaria leggibile
ja: 読み取り可能なセカンダリ
ko: 읽기 가능한 보조
pt_br: Réplica secundária para leitura
ru: Вторичная реплика для чтения
zh_hans: 可读辅助
zh_hant: 可讀取次要

# deployCluster.ReadableSecondaryDNSName
source: Readable secondary DNS name
de: DNS-Name des lesbaren sekundären Replikats
es: Nombre DNS de la réplica secundaria legible
fr: Nom DNS du secondaire accessible en lecture
it: Nome DNS della replica secondaria leggibile
ja: 読み取り可能なセカンダリ DNS 名
ko: 읽기 가능한 보조 DNS 이름
pt_br: Nome DNS de réplica secundária para leitura
ru: Доступное для чтения дополнительное DNS-имя
zh_hans: 可读辅助 DNS 名称
zh_hant: 可讀取次要 DNS 名稱

# deployCluster.ReadableSecondaryPortName
source: Readable secondary port
de: Port des lesbaren sekundären Replikats
es: Puerto de la réplica secundaria legible
fr: Port du secondaire accessible en lecture
it: Porta della replica secondaria leggibile
ja: 読み取り可能なセカンダリ ポート
ko: 읽기 가능한 보조 포트
pt_br: Porta de réplica secundária para leitura
ru: Доступный для чтения дополнительный порт
zh_hans: 可读辅助端口
zh_hant: 可讀取次要連接埠

# deployCluster.EndpointSettings
source: Endpoint settings
de: Endpunkteinstellungen
es: Configuración del punto de conexión
fr: Paramètres de point de terminaison
it: Impostazioni dell'endpoint
ja: エンドポイントの設定
ko: 엔드포인트 설정
pt_br: Configurações de ponto de extremidade
ru: Параметры конечной точки
zh_hans: 终结点设置
zh_hant: 端點設定

# deployCluster.storageFieldTooltip
source: Use controller settings
de: Controllereinstellungen verwenden
es: Usar la configuración del controlador
fr: Utiliser les paramètres du contrôleur
it: Usa le impostazioni del controller
ja: コントローラー設定を使用する
ko: 컨트롤러 설정 사용
pt_br: Usar as configurações do controlador
ru: Использовать параметры контроллера
zh_hans: 使用控制器设置
zh_hant: 使用者控制器設定
