Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# resourceDeployment.AziCli.AptGetPackages
source: getting packages needed for azure-cli installation …
de: Die für die Azure CLI-Installation erforderlichen Pakete werden abgerufen…
es: Se están obteniendo los paquetes necesarios para la instalación de azure-cli...
fr: obtention des packages nécessaires à l'installation d'azure-cli...
it: recupero dei pacchetti necessari per l'installazione di azure-cli…
ja: azure-cli のインストールに必要なパッケージを取得しています...
ko: azure-cli 설치에 필요한 패키지를 가져오는 중...
pt_br: obtendo pacotes necessários para a instalação do azure-cli…
ru: получение пакетов, необходимых для установки azure-cli…
zh_hans: 正在获取 azure-cli 安装所需的包…
zh_hant: 正在取得安裝 azure-cli 所需的套件…

# resourceDeployment.AziCli.DownloadAndInstallingSigningKey
source: downloading and installing the signing key for azure-cli …
de: Der Signaturschlüssel für Azure CLI wird heruntergeladen und installiert…
es: Se está descargando e instalando la clave de firma para azure-cli...
fr: téléchargement et installation de la clé de signature pour azure-cli...
it: download e installazione della chiave di firma per azure-cli…
ja: azure-cli の署名キーをダウンロードしてインストールしています...
ko: azure-cli의 서명 키를 다운로드하고 설치하는 중...
pt_br: baixando e instalando a chave de assinatura do azure-cli…
ru: скачивание и установка ключа подписывания для azure-cli…
zh_hans: 正在下载并安装 azure-cli 的签名密钥…
zh_hant: 正在下載並安裝 azure-cli 的簽署金鑰…

# resourceDeployment.AziCli.AddingAzureCliRepositoryInformation
source: adding the azure-cli repository information …
de: Die Azure CLI-Repositoryinformationen werden hinzugefügt…
es: Se está agregando la información del repositorio de azure-cli...
fr: ajout des informations du dépôt azure-cli...
it: aggiunta delle informazioni sul repository azure-cli…
ja: azure-cli リポジトリ情報を追加しています...
ko: azure-cli 리포지토리 정보를 추가하는 중...
pt_br: adicionando informações do repositório do azure-cli…
ru: добавление в репозиторий сведений для azure-cli…
zh_hans: 正在添加 azure-cli 存储库信息…
zh_hant: 正在新增 azure-cli 存放庫資訊…

# resourceDeployment.AziCli.AptGetUpdateAgain
source: updating repository information again for azure-cli …
de: Repositoryinformationen für die Azure CLI werden erneut aktualisiert…
es: Se está actualizando de nuevo la información del repositorio para azure-cli...
fr: remise à jour des informations de dépôt pour azure-cli...
it: nuovo aggiornamento delle informazioni sul repository per azure-cli…
ja: azure-cli のリポジトリ情報をもう一度更新しています...
ko: azure-cli의 리포지토리 정보를 다시 업데이트하는 중...
pt_br: atualizando as informações do repositório novamente do azure-cli…
ru: повторное обновление сведений в репозитории для azure-cli…
zh_hans: 正在更新 azure-cli 的存储库信息…
zh_hant: 正再次更新存放庫資訊，以取得 azure-cli…

# resourceDeployment.AziCli.ScriptedInstall
source: download and invoking script to install azure-cli …
de: Skript zum Installieren der Azure CLI wird heruntergeladen und aufgerufen…
es: Descargue e invoque el script para instalar azure-cli...
fr: télécharger et appeler un script pour installer azure-cli...
it: download e chiamata dello script per l'installazione di azure-cli…
ja: azure-cli をインストールするためにスクリプトをダウンロードして呼び出しています...
ko: azure-cli를 설치하는 스크립트 다운로드 및 호출 중...
pt_br: baixe e invoque o script para instalar o azure-cli…
ru: скачивание и вызов скрипта для установки azure-cli…
zh_hans: 下载并调用脚本以安装 azure-cli…
zh_hant: 正在下載並叫用指令碼以安裝 azure-cli…

# resourceDeployment.AzdataDescription
source: Azure Data command line interface
de: Azure Data-Befehlszeilenschnittstelle
es: Interfaz de la línea de comandos de datos de Azure
fr: Interface de ligne de commande Azure Data
it: Interfaccia della riga di comando di Azure Data
ja: Azure Data コマンド ライン インターフェイス
ko: Azure 데이터 명령줄 인터페이스
pt_br: Interface de linha de comando dos Dados do Azure
ru: Интерфейс командной строки Azure Data
zh_hans: Azure 数据命令行界面
zh_hant: Azure Data 命令列介面

# resourceDeployment.AzdataDisplayName
source: Azure Data CLI
es: CLI de datos de Azure
it: Interfaccia della riga di comando di Azure Data
pt_br: CLI de Dados do Azure
zh_hans: Azure 数据 CLI

# deploy.azdataExtMissing
source: The Azure Data CLI extension must be installed to deploy this resource. Please install it through the extension gallery and try again.
de: Die Azure Data CLI-Erweiterung muss installiert sein, damit diese Ressource bereitgestellt werden kann. Installieren Sie sie über den Erweiterungskatalog, und versuchen Sie es noch mal.
es: La extensión CLI de datos de Azure debe estar instalada para implementar este recurso. Instálela a través de la galería de extensiones y vuelva a intentarlo.
fr: L’extension CLI de données Azure doit être installée pour déployer cette ressource. Veuillez l’installer via la galerie d’extensions et essayer à nouveau.
it: Per distribuire la risorsa, è necessario installare l'estensione AZURE Data CLI. Installare l'estensione tramite la raccolta estensioni e riprovare.
ja: このリソースをデプロイするには、Azure Data CLI 拡張機能をインストールする必要があります。拡張機能ギャラリーを使用してインストールしてから、もう一度お試しください。
ko: 이 리소스를 배포하려면 Azure Data CLI 확장을 설치해야 합니다. 확장 갤러리를 통해 설치한 후 다시 시도하세요.
pt_br: A extensão Azure Data CLI deve ser instalada para implantar esse recurso. Instale-o por meio da galeria de extensões e tente novamente.
ru: Для развертывания этого ресурса необходимо установить расширение Azure Data CLI. Установите его из коллекции расширений и повторите попытку.
zh_hans: 必须安装 Azure Data CLI 以部署此资源。请通过扩展库安装，然后重试。
zh_hant: 必須安裝 Azure Data CLI 延伸模組，以部署此資源。請透過延伸模組庫安裝，然後再試一次。

# resourceDeployment.Azdata.DeletingPreviousAzdata.msi
source: deleting previously downloaded Azdata.msi if one exists …
de: Zuvor heruntergeladene Datei "Azdata.msi" wird ggf. gelöscht…
es: Se está eliminando el archivo Azdata.msi descargado anteriormente, si existe...
fr: suppression du fichier Azdata.msi précédemment téléchargé, le cas échéant...
it: eliminazione del file Azdata.msi scaricato in precedenza se presente…
ja: 以前にダウンロードされた Azdata.msi が存在する場合にそれを削除しています...
ko: 이전에 다운로드한 Azdata.msi를 삭제하는 중(있는 경우)...
pt_br: excluindo o Azdata.msi baixado anteriormente, se houver…
ru: удаление ранее скачанного файла Azdata.msi, если он существует…
zh_hans: 正在删除以前下载的 Azdata.msi (如果存在)…
zh_hant: 正在刪除先前下載的 Azdata.msi (如果有的話)…

# resourceDeployment.Azdata.DownloadingAndInstallingAzdata
source: downloading Azdata.msi and installing azdata-cli …
de: "Azdata.msi" wird heruntergeladen, und die azdata-CLI wird installiert…
es: Se está descargando Azdata.msi e instalando azdata-cli...
fr: téléchargement d'azdata.msi et installation d'azdata-cli...
it: download di Azdata.msi e installazione di azdata-cli…
ja: Azdata.msi をダウンロードして、azdata cli をインストールしています...
ko: Azdata.msi를 다운로드하고 azdata-cli를 설치하는 중...
pt_br: baixando o Azdata.msi e instalando o azdata-cli…
ru: скачивание Azdata.msi и установка azdata-cli…
zh_hans: 正在下载 Azdata.msi 并安装 azdata-cli…
zh_hant: 正在下載 Azdata.msi 並安裝 azdata-cli…

# resourceDeployment.Azdata.DisplayingInstallationLog
source: displaying the installation log …
de: Installationsprotokoll wird angezeigt…
es: Se muestra el registro de la instalación...
fr: affichage du journal d'installation...
it: visualizzazione del log di installazione…
ja: インストール ログを表示しています...
ko: 설치 로그를 표시하는 중...
pt_br: exibindo o log de instalação…
ru: отображение журнала установки…
zh_hans: 正在显示安装日志…
zh_hant: 正在顯示安裝記錄…

# resourceDeployment.Azdata.TappingBrewRepository
source: tapping into the brew repository for azdata-cli …
de: Für die azdata-CLI werden Ressourcen aus dem Brew-Repository abgerufen…
es: Se está accediendo al repositorio de brew para azdata-cli...
fr: recherche dans le dépôt brew pour azdata-cli...
it: accesso al repository brew per azdata-cli…
ja: azdata-cli に brew リポジトリを利用しています...
ko: azdata-cli의 brew 리포지토리를 활용하는 중...
pt_br: explorando o repositório brew para azdata-cli…
ru: получение доступа к репозиторию brew для azdata-cli…
zh_hans: 正在访问 azdata-cli 的 brew 存储库…
zh_hant: 點選 Brew 存放庫以取得 azdata-cli…

# resourceDeployment.Azdata.UpdatingBrewRepository
source: updating the brew repository for azdata-cli installation …
de: Das Brew-Repository für die azdata-CLI-Installation wird aktualisiert…
es: Se está actualizando el repositorio de brew para la instalación de azdata-cli...
fr: mise à jour du dépôt brew pour l'installation d'azdata-cli...
it: aggiornamento del repository brew per l'installazione di azdata-cli…
ja: azdata-cli インストール用に brew リポジトリを更新しています...
ko: azdata-cli 설치를 위해 brew 리포지토리를 업데이트하는 중...
pt_br: atualizando o repositório brew para a instalação do azdata-cli…
ru: обновление репозитория brew для установки azdata-cli…
zh_hans: 正在更新 azdata-cli 安装的 brew 存储库…
zh_hant: 正在更新 Brew 存放庫以安裝 azdata-cli…

# resourceDeployment.Azdata.InstallingAzdata
source: installing azdata …
de: azdata wird installiert…
es: Se está instalando azdata...
fr: installation d'azdata...
it: installazione di azdata…
ja: azdata をインストールしています...
ko: azdata를 설치하는 중...
pt_br: instalando o azdata…
ru: установка azdata…
zh_hans: 正在安装 azdata…
zh_hant: 正在安裝 azdata…

# resourceDeployment.Azdata.AptGetUpdate
source: updating repository information …
de: Repositoryinformationen werden aktualisiert…
es: Se está actualizando la información del repositorio...
fr: mise à jour des informations de dépôt...
it: aggiornamento delle informazioni sul repository…
ja: リポジトリ情報を更新しています...
ko: 리포지토리 정보를 업데이트하는 중...
pt_br: atualizando informações do repositório…
ru: обновление сведений в репозитории…
zh_hans: 正在更新存储库信息…
zh_hant: 正在更新存放庫資訊…

# resourceDeployment.Azdata.AptGetPackages
source: getting packages needed for azdata installation …
de: Die für die azdata-Installation erforderlichen Pakete werden abgerufen…
es: Se están obteniendo los paquetes necesarios para la instalación de azdata...
fr: obtention des packages nécessaires à l'installation d'azdata...
it: recupero dei pacchetti necessari per l'installazione di azdata…
ja: azdata インストールに必要なパッケージを取得しています...
ko: azdata 설치에 필요한 패키지를 가져오는 중...
pt_br: obtendo pacotes necessários para a instalação do azdata…
ru: получение пакетов, необходимых для установки azdata…
zh_hans: 正在获取 azdata 安装所需的包…
zh_hant: 正在取得安裝 azdata 所需的套件…

# resourceDeployment.Azdata.DownloadAndInstallingSigningKey
source: downloading and installing the signing key for azdata …
de: Der Signaturschlüssel für azdata wird heruntergeladen und installiert…
es: Se está descargando e instalando la clave de firma para azdata...
fr: téléchargement et installation de la clé de signature pour azdata...
it: download e installazione della chiave di firma per azdata…
ja: azdata の署名キーをダウンロードしてインストールしています...
ko: azdata의 서명 키를 다운로드하고 설치하는 중...
pt_br: baixando e instalando a chave de assinatura para azdata…
ru: скачивание и установка ключа подписывания для azdata…
zh_hans: 正在下载并安装 azdata 的签名密钥…
zh_hant: 正在下載並安裝 azdata 的簽署金鑰…

# resourceDeployment.Azdata.AddingAzdataRepositoryInformation
source: adding the azdata repository information …
de: Die azdata-Repositoryinformationen werden hinzugefügt…
es: Se está agregando la información del repositorio de azdata...
fr: ajout des informations du dépôt azdata...
it: aggiunta delle informazioni sul repository azdata…
ja: azdata リポジトリ情報を追加しています...
ko: azdata 리포지토리 정보를 추가하는 중...
pt_br: adicionando informações do repositório azdata…
ru: добавление в репозиторий сведений для azdata…
zh_hans: 正在添加 azdata 存储库信息…
zh_hant: 正在新增 azdata 存放庫資訊…

# deploymentDialog.deploymentOptions
source: Deployment options
de: Bereitstellungsoptionen
es: Opciones de la implementación
fr: Options de déploiement
it: Opzioni di distribuzione
ja: デプロイ オプション
ko: 배포 옵션
pt_br: Opções de implantação
ru: Параметры развертывания
zh_hans: 部署选项
zh_hant: 部署選項

# resourceDeployment.AzCLIDisplayName
source: Azure CLI
es: CLI de Azure
it: Interfaccia della riga di comando di Azure
pt_br: CLI do Azure

# deployCluster.hdfsLabel
source: HDFS + Spark
de: HDFS und Spark
