Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# deployAzureSQLDB.CollationNameLabel
source: Database collation
de: Datenbanksortierung
es: Intercalación de bases de datos
fr: Classement de base de données
it: Regole di confronto database
ja: データベース照合順序
ko: 데이터베이스 데이터 정렬
pt_br: Ordenação de banco de dados
ru: Параметры сортировки базы данных
zh_hans: 数据库排序规则
zh_hant: 資料庫定序

# deployAzureSQLDB.CollationNameSummaryLabel
source: Collation for database
de: Sortierung für Datenbank
es: Intercalación para la base de datos
fr: Classement de la base de données
it: Regole di confronto per il database
ja: データベースの照合順序
ko: 데이터베이스 데이터 정렬
pt_br: Ordenação para banco de dados
ru: Параметры сортировки для базы данных
zh_hans: 数据库的排序规则
zh_hant: 資料庫的定序

# deployAzureSQLDB.IpAddressInfoLabel
source: Enter IP addresses in IPv4 format.
de: Geben Sie IP-Adressen im IPv4-Format ein.
es: Escriba las direcciones IP en formato IPv4.
fr: Entrez les adresses IP au format IPv4.
it: Immettere gli indirizzi IP in formato IPv4.
ja: IP アドレスを IPv4 形式で入力します。
ko: IPv4 형식으로 IP 주소를 입력합니다.
pt_br: Insira os endereços IP no formato IPv4.
ru: Введите IP-адреса в формате IPv4.
zh_hans: 输入 IPv4 格式的 IP 地址。
zh_hant: 請以 IPv4 格式輸入 IP 位址。

# deployAzureSQLDB.StartIpAddressLabel
source: Min IP address in firewall IP range
de: Niedrigste IP-Adresse im IP-Adressbereich der Firewall
es: Dirección IP mínima en el intervalo IP del firewall
fr: Adresse IP min. dans la plage IP du pare-feu
it: Indirizzo IP minimo nell'intervallo IP del firewall
ja: ファイアウォール IP 範囲の最小 IP アドレス
ko: 방화벽 IP 범위의 최소 IP 주소
pt_br: Endereço IP mínimo no intervalo de IP do firewall
ru: Минимальный IP-адрес в диапазоне IP-адресов брандмауэра
zh_hans: 防火墙 IP 范围内的最小 IP 地址
zh_hant: 防火牆 IP 範圍內的最小 IP 位址

# deployAzureSQLDB.EndIpAddressLabel
source: Max IP address in firewall IP range
de: Höchste IP-Adresse im IP-Adressbereich der Firewall
es: Dirección IP máxima en el intervalo IP del firewall
fr: Adresse IP max. dans la plage IP du pare-feu
it: Indirizzo IP massimo nell'intervallo IP del firewall
ja: ファイアウォール IP 範囲の最大 IP アドレス
ko: 방화벽 IP 범위의 최대 IP 주소
pt_br: Endereço IP máximo no intervalo de IP do firewall
ru: Максимальный IP-адрес в диапазоне IP-адресов брандмауэра
zh_hans: 防火墙 IP 范围内的最大 IP 地址
zh_hant: 防火牆 IP 範圍內的最大 IP 位址

# deployAzureSQLDB.StartIpAddressShortLabel
source: Min IP address
de: Niedrigste IP-Adresse
es: Dirección IP mínima
fr: Adresse IP min.
it: Indirizzo IP minimo
ja: 最小 IP アドレス
ko: 최소 IP 주소
pt_br: Endereço IP mínimo
ru: Минимальный IP-адрес
zh_hans: 最小 IP 地址
zh_hant: 最小 IP 位址

# deployAzureSQLDB.EndIpAddressShortLabel
source: Max IP address
de: Höchste IP-Adresse
es: Dirección IP máxima
fr: Adresse IP max.
it: Indirizzo IP massimo
ja: 最大 IP アドレス
ko: 최대 IP 주소
pt_br: Endereço IP máximo
ru: Максимальный IP-адрес
zh_hans: 最大 IP 地址
zh_hant: 最大 IP 位址

# deployAzureSQLDB.FirewallRuleDescription
source: Create a firewall rule for your local client IP in order to connect to your database through Azure Data Studio after creation is completed.
de: Erstellen Sie eine Firewallregel für Ihre lokale Client-IP-Adresse, um nach Abschluss der Erstellung eine Verbindung mit Ihrer Datenbank über Azure Data Studio herzustellen.
es: Cree una regla de firewall para la dirección IP del cliente local para conectarse a la base de datos mediante Azure Data Studio una vez completada la creación.
fr: Créez une règle de pare-feu pour votre IP de client local afin de vous connecter à votre base de données via Azure Data Studio une fois la création effectuée.
it: Creare una regola del firewall per l'indirizzo IP client locale per connettersi al database tramite Azure Data Studio dopo il completamento della creazione.
ja: 作成の完了後に、Azure Data Studio を使用してデータベースに接続するには、ローカル クライアント IP のファイアウォール規則を作成します。
ko: 만들기가 완료된 후 Azure Data Studio를 통해 데이터베이스에 연결하려면 로컬 클라이언트 IP의 방화벽 규칙을 만듭니다.
pt_br: Crie uma regra de firewall para o IP do cliente local para se conectar ao seu banco de dados por meio do Azure Data Studio após a conclusão da criação.
ru: Создайте правило брандмауэра для локального клиентского IP-адреса, чтобы подключиться к базе данных с помощью Azure Data Studio после завершения создания.
zh_hans: 创建本地客户端 IP 的防火墙规则，以便在创建完成后通过 Azure Data Studio 连接到数据库。
zh_hant: 建立本機用戶端 IP 的防火牆規則，以便在建立完成後透過 Azure Data Studio 連線到您的資料庫。

# deployAzureSQLDB.FirewallToggleLabel
source: Create a firewall rule
de: Firewallregel erstellen
es: Crear una regla de firewall
fr: Créer une règle de pare-feu
it: Crea una regola del firewall
ja: ファイアウォール規則の作成
ko: 방화벽 규칙 만들기
pt_br: Criar uma regra de firewall
ru: Создание правила брандмауэра
zh_hans: 创建防火墙规则
zh_hant: 建立防火牆規則

# resourceDeployment.KubeCtlDescription
source: Runs commands against Kubernetes clusters
de: Führt Befehle für Kubernetes-Cluster aus.
es: Ejecuta comandos en clústeres de Kubernetes.
fr: Exécute des commandes sur des clusters Kubernetes
it: Esegue i comandi su cluster Kubernetes
ja: Kubernetes クラスターに対してコマンドを実行します
ko: Kubernetes 클러스터에 대해 명령 실행
pt_br: Executa comandos em clusters do Kubernetes
ru: Запускает команды для кластеров Kubernetes
zh_hans: 针对 Kubernetes 群集运行命令
zh_hant: 對 Kubernetes 叢集執行命令

# resourceDeployment.invalidKubectlVersionOutput
source: Unable to parse the kubectl version command output: "{0}"
de: Die Ausgabe des kubectl-Versionsbefehls kann nicht analysiert werden: {0}
es: No se puede analizar la salida del comando de la versión kubectl "{0}".
fr: Impossible d'analyser la sortie de la commande de version kubectl : « {0} »
it: Non è possibile analizzare l'output del comando della versione di kubectl: "{0}"
ja: Kubectl バージョン コマンドの出力を解析できません: "{0}"
ko: Kubectl 버전 명령 출력을 구문 분석할 수 없음: "{0}"
pt_br: Não é possível analisar a saída do comando da versão do kubectl: "{0}"
ru: Не удалось проанализировать выходные данные команды kubectl version: "{0}"
zh_hans: 无法分析 kubectl 版本命令输出:“{0}”
zh_hant: 無法剖析 kubectl 版本命令輸出: "{0}"

# resourceDeployment.Kubectl.UpdatingBrewRepository
source: updating your brew repository for kubectl installation …
de: Ihr Brew-Repository wird für die kubectl-Installation aktualisiert…
es: Se está actualizando el repositorio de brew para la instalación de kubectl...
fr: mise à jour de votre dépôt brew pour l'installation de kubectl...
it: aggiornamento del repository brew per l'installazione di kubectl…
ja: kubectl インストール用の brew リポジトリを更新しています...
ko: kubectl 설치를 위해 brew 리포지토리를 업데이트하는 중...
pt_br: atualizando o seu repositório brew para a instalação do kubectl…
ru: обновление репозитория brew для установки kubectl…
zh_hans: 正在更新 kubectl 安装的 brew 存储库…
zh_hant: 正在更新您的 brew 存放庫以安裝 kubectl…

# resourceDeployment.Kubectl.InstallingKubeCtl
source: installing kubectl …
de: kubectl wird installiert…
es: Se está instalando kubectl...
fr: installation de kubectl...
it: installazione di kubectl…
ja: kubectl をインストールしています...
ko: kubectl을 설치하는 중...
pt_br: instalando o kubectl…
ru: установка kubectl…
zh_hans: 正在安装 kubectl…
zh_hant: 正在安裝 kubectl…

# resourceDeployment.Kubectl.AptGetUpdate
source: updating repository information …
de: Repositoryinformationen werden aktualisiert…
es: Se está actualizando la información del repositorio...
fr: mise à jour des informations de dépôt...
it: aggiornamento delle informazioni sul repository…
ja: リポジトリ情報を更新しています...
ko: 리포지토리 정보를 업데이트하는 중...
pt_br: atualizando informações do repositório…
ru: обновление сведений в репозитории…
zh_hans: 正在更新存储库信息…
zh_hant: 正在更新存放庫資訊…

# resourceDeployment.Kubectl.AptGetPackages
source: getting packages needed for kubectl installation …
de: Die für die kubectl-Installation erforderlichen Pakete werden abgerufen…
es: Se están obteniendo los paquetes necesarios para la instalación de kubectl...
fr: obtention des packages nécessaires à l'installation de kubectl...
it: recupero dei pacchetti necessari per l'installazione di kubectl…
ja: kubectl のインストールに必要なパッケージを取得しています...
ko: kubectl 설치에 필요한 패키지를 가져오는 중...
pt_br: obtendo pacotes necessários para a instalação do kubectl…
ru: получение пакетов, необходимых для установки kubectl…
zh_hans: 正在获取 kubectl 安装所需的包…
zh_hant: 正在取得安裝 kubectl 的必要套件…

# resourceDeployment.Kubectl.DownloadAndInstallingSigningKey
source: downloading and installing the signing key for kubectl …
de: Der Signaturschlüssel für kubectl wird heruntergeladen und installiert…
es: Se está descargando e instalando la clave de firma para kubectl...
fr: téléchargement et installation de la clé de signature pour kubectl...
it: download e installazione della chiave di firma per kubectl…
ja: kubectl の署名キーをダウンロードしてインストールしています...
ko: kubectl의 서명 키를 다운로드하고 설치하는 중...
pt_br: baixando e instalando a chave de assinatura para kubectl…
ru: скачивание и установка ключа подписывания для kubectl…
zh_hans: 正在下载并安装 kubectl 的签名密钥…
zh_hant: 正在下載並安裝 kubectl 的簽署金鑰…

# resourceDeployment.Kubectl.AddingKubectlRepositoryInformation
source: adding the kubectl repository information …
de: Die kubectl-Repositoryinformationen werden hinzugefügt…
es: Se está agregando la información del repositorio de kubectl...
fr: ajout des informations du dépôt kubectl...
it: aggiunta delle informazioni sul repository kubectl…
ja: kubectl リポジトリ情報を追加しています...
ko: kubectl 리포지토리 정보를 추가하는 중...
pt_br: adicionando informações do repositório kubectl…
ru: добавление в репозиторий сведений для kubectl…
zh_hans: 正在添加 kubectl 存储库信息…
zh_hant: 正在新增 kubectl 存放庫資訊…

# resourceDeployment.Kubectl.InstallingKubectl
source: installing kubectl …
de: kubectl wird installiert…
es: Se está instalando kubectl...
fr: installation de kubectl...
it: installazione di kubectl…
ja: kubectl をインストールしています...
ko: kubectl을 설치하는 중...
pt_br: instalando o kubectl…
ru: установка kubectl…
zh_hans: 正在安装 kubectl…
zh_hant: 正在安裝 kubectl…

# resourceDeployment.Kubectl.DeletePreviousDownloadedKubectl.exe
source: deleting previously downloaded kubectl.exe if one exists …
de: Zuvor heruntergeladene Datei "kubectl.exe" wird ggf. gelöscht…
es: Se está eliminando el archivo kubectl.exe descargado anteriormente, si existe...
fr: suppression du fichier kubectl.exe précédemment téléchargé, le cas échéant...
it: eliminazione di kubectl.exe scaricato in precedenza se presente…
ja: 以前にダウンロードされた kubectl.exe が存在する場合にそれを削除しています...
ko: 이전에 다운로드한 kubectl.exe 삭제 중(있는 경우)...
pt_br: excluindo o kubectl.exe baixado anteriormente, se houver…
ru: удаление ранее скачанного файла kubectl.exe, если он существует…
zh_hans: 正在删除以前下载的 kubectl.exe (如果存在)…
zh_hant: 正在刪除先前下載的 kubectl.exe (如果有的話)…

# resourceDeployment.Kubectl.DownloadingAndInstallingKubectl
source: downloading and installing the latest kubectl.exe …
de: Die neueste Datei "kubectl.exe" wird heruntergeladen und installiert…
es: Se está descargando e instalando el archivo kubectl.exe más reciente...
fr: téléchargement et installation du dernier fichier kubectl.exe...
it: download e installazione del file kubectl.exe più recente…
ja: 最新の kubectl.exe をダウンロードしてインストールしています...
ko: 최신 kubectl.exe를 다운로드하고 설치하는 중...
pt_br: baixando e instalando o kubectl.exe mais recente…
ru: скачивание и установка последней версии файла kubectl.exe…
zh_hans: 正在下载并安装最新的 kubectl.exe…
zh_hant: 正在下載並安裝最新的 kubectl.exe…

# resourceDeployment.Kubectl.DeletePreviousDownloadedKubectl
source: deleting previously downloaded kubectl if one exists …
de: Zuvor heruntergeladene kubectl-Datei wird ggf. gelöscht…
es: Se está eliminando el archivo kubectl descargado anteriormente, si existe...
fr: suppression du kubectl précédemment téléchargé, le cas échéant...
it: eliminazione di kubectl scaricato in precedenza se presente…
ja: 以前にダウンロードされた kubectl が存在する場合にそれを削除しています...
ko: 이전에 다운로드한 kubectl 삭제 중(있는 경우)...
pt_br: excluindo o kubectl baixado anteriormente, se houver…
ru: удаление ранее скачанного файла kubectl, если он существует…
zh_hans: 正在删除以前下载的 kubectl (如果存在)…
zh_hant: 正在刪除先前下載的 kubectl (如果有的話)…

# resourceDeployment.Kubectl.DownloadingKubectl
source: downloading the latest kubectl release …
de: Das neueste kubectl-Release wird heruntergeladen…
es: Se está descargando la versión más reciente de kubectl...
fr: téléchargement de la dernière mise en production de kubectl...
it: download della versione più recente di kubectl…
ja: 最新の kubectl リリースをダウンロードしています...
ko: 최신 kubectl 릴리스를 다운로드하는 중...
pt_br: baixando a versão mais recente do kubectl…
ru: выполняется скачивание последнего выпуска kubectl…
zh_hans: 正在下载最新的 kubectl 版本…
zh_hant: 正在下載最新的 kubectl 版本…

# resourceDeployment.Kubectl.MakingExecutable
source: making kubectl executable …
de: Ausführbare kubectl-Datei wird erstellt…
es: Se está convirtiendo kubectl en ejecutable...
fr: création de l'exécutable kubectl...
it: creazione dell'eseguibile di kubectl…
ja: kubectl 実行可能ファイルを作成しています...
ko: kubectl 실행 파일을 만드는 중...
pt_br: tornando o kubectl executável…
ru: установка атрибутов исполняемого файла для kubectl…
zh_hans: 正在创建 kubectl 可执行文件…
zh_hant: 正在建立 kubectl 可執行檔…

# resourceDeployment.Kubectl.CleaningUpOldBackups
source: cleaning up any previously backed up version in the install location if they exist …
de: Die zuvor gesicherte Version am Installationsspeicherort wird bereinigt (falls vorhanden)…
es: Se está borrando cualquier versión de copia de seguridad existente en la ubicación de la instalación...
fr: nettoyage des versions précédemment sauvegardées dans l'emplacement d'installation, le cas échéant...
it: pulizia delle versioni di cui è stato eseguito il backup in precedenza nel percorso di installazione, se presenti…
ja: インストール場所に以前にバックアップされたバージョンが存在する場合に、それをクリーンアップしています...
ko: 설치 위치에서 이전에 백업된 버전을 정리하는 중(있는 경우)...
pt_br: limpando todas as versões das quais foi feito backup anteriormente na localização de instalação, se houver…
ru: очистка всех ранее архивированных версий в расположении установки, если они существуют…
zh_hans: 正在安装位置清除任何以前备份的版本(如果存在)…
zh_hant: 正在清除安裝位置中任何先前備份的版本 (如果有的話)…

# resourceDeployment.Kubectl.BackupCurrentBinary
source: backing up any existing kubectl in the install location …
de: Am Installationsspeicherort vorhandenes kubectl wird gesichert…
es: Se está realizando una copia de seguridad de cualquier kubectl existente en la ubicación de la instalación...
fr: sauvegarde de tout kubectl existant dans l'emplacement d'installation...
it: backup di eventuali strumenti kubectl esistenti nel percorso di installazione…
ja: インストール場所にある既存の kubectl をバックアップしています...
ko: 설치 위치의 기존 kubectl을 백업하는 중...
pt_br: fazendo backup de qualquer kubectl existente na localização de instalação…
ru: архивация имеющихся версий kubectl в расположении установки…
zh_hans: 正在备份安装位置中的任何现有 kubectl…
zh_hant: 正在備份安裝位置中任何現有的 kubectl…

# resourceDeployment.Kubectl.MoveToSystemPath
source: moving kubectl into the install location in the PATH …
de: kubectl wird in den Installationspfad in PATH verschoben…
es: Se está moviendo kubectl a la ubicación de la instalación en PATH...
fr: déplacement de kubectl dans l'emplacement d'installation dans PATH...
it: spostamento di kubectl nel percorso di installazione nella variabile PATH…
ja: kubectl を PATH のインストール場所に移動しています...
ko: PATH에서 설치 위치로 kubectl을 이동하는 중...
pt_br: movendo o kubectl para a localização de instalação em PATH…
ru: перемещение kubectl в расположение установки, указанное в переменной PATH…
zh_hans: 正在将 kubectl 移到路径中的安装位置…
zh_hant: 正在將 kubectl 移至路徑中的安裝位置…

# wizardPage.ValidationError
source: There are some errors on this page, click 'Show Details' to view the errors.
de: Es liegen Fehler auf dieser Seite vor. Klicken Sie auf "Details anzeigen", um diese anzuzeigen.
es: Hay algunos errores en esta página, haga clic en "Mostrar detalles" para verlos.
fr: Cette page a des erreurs, cliquez sur 'Afficher les détails' pour les voir.
it: In questa pagina sono presenti alcuni errori. Per visualizzarli, fare clic su 'Mostra dettagli'.
ja: このページにはいくつかのエラーがあります。エラーを表示するには、[詳細を表示] をクリックします。
ko: 이 페이지에 오류가 있습니다. 오류를 보려면 '세부 정보 표시'를 클릭합니다.
pt_br: Há alguns erros nesta página. Clique em 'Mostrar Detalhes' para exibir os erros.
ru: На этой странице есть ошибки, для их просмотра щелкните "Показать сведения".
zh_hans: 此页面上存在一些错误，请单击“显示详细信息”以查看错误。
zh_hant: 此頁面有一些錯誤，按一下 [顯示詳細資料] 即可檢視錯誤。

# deploymentDialog.OpenNotebook
source: Open Notebook
de: Notebook öffnen
es: Abrir cuaderno
fr: Ouvrir le notebook
it: Apri notebook
ja: ノートブックを開く
ko: Notebook 열기
pt_br: Abrir Notebook
ru: Открыть записную книжку
zh_hans: 打开笔记本
zh_hant: 開啟筆記本

# deploymentDialog.OkButtonText
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定
zh_hant: 確定

source: Notebook type
de: Notebook-Typ
es: Tipo de cuaderno
fr: Type de notebook
it: Tipo di notebook
ja: Notebook の種類
ko: Notebook 유형
pt_br: Tipo de notebook
ru: Тип записной книжки
zh_hans: 笔记本类型
zh_hant: 筆記本類型

# resourceDeployment.UnknownResourceType
source: The resource type: {0} is not defined
de: Der Ressourcentyp "{0}" ist nicht definiert.
es: El tipo de recurso {0} no está definido
fr: Le type de ressource {0} n'est pas défini
it: Il tipo di risorsa {0} non è definito
ja: リソースの種類: {0} が定義されていません
ko: 리소스 종류 {0}이(가) 정의되지 않았습니다.
pt_br: O tipo de recurso: {0} não está definido
ru: Тип ресурса: {0} не определен
zh_hans: 未定义资源类型: {0}
zh_hant: 資源類型: 未定義 {0}

# resourceDeployment.notebookNotFound
source: The notebook {0} does not exist
de: Das Notebook "{0}" ist nicht vorhanden.
es: El cuaderno {0} no existe
fr: Le notebook {0} n'existe pas
it: Il notebook {0} non esiste
ja: ノートブック {0} が存在しません
ko: {0} Notebook이 없습니다.
pt_br: O notebook {0} não existe
ru: Записная книжка {0} не существует
zh_hans: 笔记本 {0} 不存在
zh_hant: 筆記本 {0} 不存在

# resourceDeployment.outputChannel
source: Deployments
de: Bereitstellungen
es: Implementaciones
fr: Déploiements
it: Distribuzioni
ja: デプロイ
ko: 배포
pt_br: Implantações
ru: Развертывания
zh_hans: 部署
zh_hant: 部署

# platformService.RunCommand.ErroredOut
source: >>> {0} … errored out: {1}
de: >>> {0} … Fehler: {1}
es: >>> {0} … errores: {1}
fr: >>> {0} … a donné une erreur : {1}
it: >>> {0} … ha restituito un errore: {1}
ja: >>> {0} ...エラーが発生しました: {1}
ko: >>> {0} ... 오류가 발생했습니다. {1}
pt_br: >>> {0} … com o erro: {1}
ru: >>> {0} … выдал ошибку: {1}
zh_hans: >>> {0} … 出错: {1}
zh_hant: >>> {0} … 發生錯誤: {1}

# platformService.RunCommand.IgnoringError
source: >>> Ignoring error in execution and continuing tool deployment
de: >>> Fehler bei der Ausführung wird ignoriert, und Toolbereitstellung wird fortgesetzt.
es: >>> Se va a ignorar el error de ejecución y a continuar con la implementación de la herramienta.
fr: >>> Omission de l'erreur dans l'exécution et poursuite du déploiement de l'outil
it: >>> Ignorare l'errore durante l'esecuzione e continuare la distribuzione dello strumento
ja: >>> 実行中のエラーを無視し、ツールのデプロイを続行しています
ko: >>> 실행 시 오류 무시 및 도구 배포 계속
pt_br: >>> Ignorando erro na execução e continuando a implantação da ferramenta
ru: >>> Пропуск ошибки при выполнении и продолжение развертывания средства
zh_hans: >>> 忽略执行中的错误并继续部署工具
zh_hant: >>> 正在忽略執行中的錯誤並繼續工具部署

# platformService.RunStreamedCommand.ExitedWithCode
source: >>> {0} … exited with code: {1}
de: >>> {0} … mit Code beendet: {1}
es: >>> {0} … cerrado con el código {1}
fr: >>> {0} … a quitté avec le code : {1}
it: >>> {0} … terminato con codice: {1}
ja: >>> {0} … コード {1} で終了しました
ko: >>> {0} … 종료됨(코드: {1})
pt_br: >>> {0} … foi encerrado com o código: {1}
ru: >>> {0} … завершил работу с кодом: {1}
zh_hans: >>> {0} … 已退出，代码为: {1}
zh_hant: >>> {0} …已結束。代碼: {1}

# platformService.RunStreamedCommand.ExitedWithSignal
source: >>> {0} … exited with signal: {1}
de: >>> {0} … mit Signal beendet: {1}
es: >>> {0} … cerrado con la señal {1}
fr: >>> {0} … a quitté avec le signal : {1}
it: >>> {0} … terminato con segnale: {1}
ja: >>> {0} … シグナル {1} で終了しました
ko: >>> {0} … 종료됨(신호: {1})
pt_br: >>> {0} … foi encerrado com o sinal: {1}
ru: >>> {0} … завершил работу с сигналом: {1}
zh_hans: >>> {0} … 已退出，信号: {1}
zh_hant: >>> {0} …已結束。訊號: {1}

# downloadError
source: Download failed, status code: {0}, message: {1}
de: Fehler bei Download. Statuscode: {0}, Meldung: {1}
es: Error en la descarga, código de estado: {0}, mensaje: {1}
fr: Le téléchargement a échoué, code d'état : {0}, message : {1}
it: Download non riuscito. Codice di stato: {0}. Messaggio: {1}
ja: ダウンロードに失敗しました。状態コード: {0}、メッセージ: {1}
ko: 다운로드 실패, 상태 코드: {0}, 메시지: {1}
pt_br: Falha ao baixar, código de status: {0}, mensagem: {1}
ru: Ошибка при скачивании, код состояния: {0}, сообщение: {1}
zh_hans: 下载失败，状态代码: {0}，消息: {1}
zh_hant: 下載失敗，狀態碼: {0}，訊息: {1}

# deployCluster.serviceScaleTableTitle
source: Service scale settings (Instances)
de: Dienstskalierungseinstellungen (Instanzen)
es: Configuración de la escala del servicio (instancias)
fr: Paramètres de mise à l'échelle du service (instances)
it: Impostazioni di scalabilità del servizio (istanze)
ja: サービス スケーリング設定 (インスタンス)
ko: 서비스 스케일링 설정(인스턴스)
pt_br: Configurações de escala de serviço (Instâncias)
ru: Параметры масштабирования службы (экземпляры)
zh_hans: 服务规模设置(实例)
zh_hant: 服務級別設定 (執行個體)

# deployCluster.storageTableTitle
source: Service storage settings (GB per Instance)
de: Dienstspeichereinstellungen (GB pro Instanz)
es: Configuración del almacenamiento del servicio (GB por instancia)
fr: Paramètres de stockage du service (Go par instance)
it: Impostazioni di archiviazione del servizio (GB per istanza)
ja: サービス ストレージ設定 (1 インスタンスあたりの GB)
ko: 서비스 스토리지 설정(인스턴스당 GB)
pt_br: Configurações de armazenamento de serviço (GB por Instância)
ru: Параметры хранилища службы (ГБ на экземпляр)
zh_hans: 服务存储设置(每个实例的 GB)
zh_hant: 服務儲存體設定 (GB/執行個體)

# deployCluster.featureTableTitle
source: Features
es: Características
fr: Fonctionnalités
it: Funzionalità
ja: 機能
ko: 기능
pt_br: Recursos
ru: Функции
zh_hans: 功能
zh_hant: 功能

# deployCluster.yesText
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# deployCluster.noText
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# deployCluster.summaryPageTitle
source: Deployment configuration profile
de: Bereitstellungskonfigurationsprofil
es: Perfil de configuración de la implementación
fr: Profil de configuration de déploiement
it: Profilo di configurazione della distribuzione
ja: デプロイ構成プロファイル
ko: 배포 구성 프로필
pt_br: Perfil de configuração de implantação
ru: Профиль конфигурации развертывания
zh_hans: 部署配置文件
zh_hant: 部署組態設定檔

# deployCluster.summaryPageDescription
source: Select the target configuration profile
de: Wählen Sie das Profil für die Zielkonfiguration aus.
es: Seleccione la plantilla de configuración de destino.
fr: Sélectionner le profil de configuration cible
it: Selezionare il profilo di configurazione di destinazione
ja: ターゲット構成プロファイルを選択します
ko: 대상 구성 프로필 선택
pt_br: Selecione o perfil de configuração de destino
ru: Выберите целевой профиль конфигурации
zh_hans: 选择目标配置文件
zh_hant: 選取目標組態設定檔

# deployCluster.ProfileHintText
source: Note: The settings of the deployment profile can be customized in later steps.
de: Hinweis: Die Einstellungen des Bereitstellungsprofils können in späteren Schritten angepasst werden.
es: Nota: La configuración del perfil de implementación se puede personalizar en pasos posteriores.
fr: Remarque : Les paramètres du profil de déploiement peuvent être personnalisés dans les étapes ultérieures.
it: Nota: le impostazioni del profilo di distribuzione possono essere personalizzate nei passaggi successivi.
ja: 注: デプロイ プロファイルの設定は、後の手順でカスタマイズできます。
ko: 참고: 배포 프로필의 설정은 이후 단계에서 사용자 지정할 수 있습니다.
pt_br: Observação: as configurações do perfil de implantação podem ser personalizadas nas etapas posteriores.
ru: Примечание. Параметры профиля развертывания можно настроить в последующих шагах.
zh_hans: 注意: 可在后续步骤中自定义部署配置文件的设置。
zh_hant: 注意: 您可在之後的步驟中自訂部署設定檔的設定。

# deployCluster.loadingProfiles
source: Loading profiles
de: Profile werden geladen.
es: Carga de los perfiles en curso
fr: Chargement des profils
it: Caricamento dei profili
ja: プロファイルを読み込んでいます
ko: 프로필 로드
pt_br: Carregando perfis
ru: Загрузка профилей
zh_hans: 正在加载配置文件
zh_hant: 正在載入設定檔
