Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# resourceDeployment.discoverPathOrAdditionalInformation
source: Discovered Path or Additional Information
de: Ermittelter Pfad oder zusätzliche Informationen
es: Información adicional o ruta de acceso detectada
fr: Chemin découvert ou informations supplémentaires
it: Percorso individuato o altre informazioni
ja: 検出されたパスまたは追加情報
ko: 검색된 경로 또는 추가 정보
pt_br: Caminho Descoberto ou Informações Adicionais
ru: Обнаруженный путь или дополнительные сведения
zh_hans: 发现的路径或其他信息
zh_hant: 探索到的路徑或其他資訊

# resourceDeployment.requiredTools
source: Required tools
de: Erforderliche Tools
es: Herramientas necesarias
fr: Outils obligatoires
it: Strumenti necessari
ja: 必要なツール
ko: 필요한 도구
pt_br: Ferramentas necessárias
ru: Необходимые инструменты
zh_hans: 所需的工具
zh_hant: 所需工具

# resourceDeployment.InstallTools
source: Install tools
de: Tools installieren
es: Instalar herramientas
fr: Installer les outils
it: Installa strumenti
ja: ツールのインストール
ko: 도구 설치
pt_br: Ferramentas de instalação
ru: Средства установки
zh_hans: 安装工具
zh_hant: 安裝工具

# resourceDeployment.Options
source: Options
de: Optionen
es: Opciones
it: Opzioni
ja: オプション​​
ko: 옵션
pt_br: Opções
ru: Параметры
zh_hans: 选项
zh_hant: 選項

# deploymentDialog.InstallingTool
source: Required tool '{0}' [ {1} ] is being installed now.
de: Das erforderliche Tool "{0}" [{1}] wird jetzt installiert.
es: La herramienta necesaria "{0}" [ {1} ] se está instalando.
fr: L'outil nécessaire « {0} » [ {1} ] est en cours d'installation.
it: È in corso l'installazione dello strumento necessario '{0}' [ {1} ].
ja: 必要なツール '{0}' [{1}] は現在インストール中です。
ko: 지금 필요한 도구 '{0}'[{1}]을(를) 설치하는 중입니다.
pt_br: A ferramenta obrigatória '{0}' [ {1} ] está sendo instalada agora.
ru: Обязательное средство "{0}" [{1}] сейчас устанавливается.
zh_hans: 当前正在安装所需的工具“{0}”[ {1} ]。
zh_hant: 目前正在安裝必要的工具 '{0}' [{1}]。

# getClusterContexts.errorFetchingClusters
source: An error ocurred while loading or parsing the config file:{0}, error is:{1}
de: Fehler beim Laden oder Analysieren der Konfigurationsdatei "{0}": {1}
es: Error al cargar o analizar el archivo de configuración {0}; {1}.
fr: Erreur pendant le chargement ou l'analyse du fichier de configuration : {0}, erreur : {1}
it: Si è verificato un errore durante il caricamento o l'analisi del file di configurazione: {0}, errore: {1}
ja: 構成ファイル {0} の読み込み中または解析中にエラーが発生しました、エラー: {1}
ko: {0} 구성 파일을 로드하거나 구문 분석하는 동안 오류가 발생했습니다. 오류: {1}
pt_br: Ocorreu um erro ao carregar ou analisar o arquivo de configuração: {0}. O erro é: {1}
ru: При загрузке или анализе файла конфигурации {0} произошла ошибка: {1}
zh_hans: 加载或分析配置文件 {0} 时出错，错误为: {1}
zh_hant: 載入或剖析組態檔 {0} 時發生錯誤。錯誤: {1}

# fileChecker.NotFile
source: Path: {0} is not a file, please select a valid kube config file.
de: Der Pfad "{0}" ist keine Datei. Wählen Sie eine gültige Kube-Konfigurationsdatei aus.
es: En relación con la ruta de acceso, {0} no es un archivo. Seleccione un archivo kubeconfig válido.
fr: Le chemin {0} n'est pas un fichier, sélectionnez un fichier de configuration Kube valide.
it: Il percorso: {0} non è un file. Selezionare un file di configurazione kube valido.
ja: パス: {0} はファイルではありません。有効な kube 構成ファイルを選択してください。
ko: {0} 경로가 파일이 아닙니다. 유효한 kube 구성 파일을 선택하세요.
pt_br: Caminho: {0} não é um arquivo, selecione um arquivo de configuração de kube válido.
ru: Путь {0} не является файлом, выберите допустимый файл kube config.
zh_hans: 路径 {0} 不是文件，请选择有效的 kube 配置文件。
zh_hant: 路徑 {0} 不是檔案，請選取有效的 kube 組態檔。

# fileChecker.FileNotFound
source: File: {0} not found. Please select a kube config file.
de: Die Datei "{0}" wurde nicht gefunden. Wählen Sie eine Kube-Konfigurationsdatei aus.
es: No se encuentra el archivo {0}. Seleccione un archivo kubeconfig.
fr: Fichier {0} introuvable. Sélectionnez un fichier de configuration Kube.
it: File: {0} non trovato. Selezionare un file di configurazione kube.
ja: ファイル: {0} が見つかりません。Kube 構成ファイルを選択してください。
ko: {0} 파일을 찾을 수 없습니다. kube 구성 파일을 선택하세요.
pt_br: Arquivo: {0} não encontrado. Selecione um arquivo de configuração de kube.
ru: Файл {0} не найден. Выберите файл kube config.
zh_hans: 找不到文件 {0}。请选择 kube 配置文件。
zh_hant: 找不到檔案 {0}。請選取 kube 組態檔。

# azure.accounts.unexpectedAccountsError
source: Unexpected error fetching accounts: {0}
de: Unerwarteter Fehler beim Abrufen von Konten: {0}
es: Error inesperado al obtener las cuentas: {0}.
fr: Erreur inattendue pendant la récupération des comptes : {0}
it: Errore imprevisto durante il recupero degli account: {0}
ja: アカウントの取り込みで予期しないエラーが発生しました: {0}
ko: 계정을 가져오는 동안 예기치 않은 오류 발생: {0}
pt_br: Erro inesperado ao buscar contas: {0}
ru: Непредвиденная ошибка при получении учетных записей: {0}
zh_hans: 提取帐户时出现意外错误: {0}
zh_hant: 擷取帳戶時發生未預期的錯誤: {0}

# resourceDeployment.errorFetchingStorageClasses
source: Unexpected error fetching available kubectl storage classes : {0}
de: Unerwarteter Fehler beim Abrufen der verfügbaren kubectl-Speicherklassen: {0}
es: Error inesperado al obtener las clases de almacenamiento de kubectl disponibles: {0}.
fr: Erreur inattendue pendant la récupération des classes de stockage kubectl disponibles : {0}
it: Errore imprevisto durante il recupero delle classi di archiviazione kubectl disponibili: {0}
ja: 利用可能な kubectl ストレージ クラスの取り込みで予期しないエラーが発生しました: {0}
ko: 사용 가능한 kubectl 스토리지 클래스를 가져오는 동안 예기치 않은 오류 발생: {0}
pt_br: Erro inesperado ao buscar classes de armazenamento kubectl disponíveis: {0}
ru: Непредвиденная ошибка при получении доступных классов хранилища kubectl: {0}
zh_hans: 提取可用的 kubectl 存储类时出现意外错误: {0}
zh_hant: 擷取可用的 kubectl 儲存體類別時發生未預期的錯誤: {0}

# azure.accounts.unexpectedSubscriptionsError
source: Unexpected error fetching subscriptions for account {0}: {1}
de: Unerwarteter Fehler beim Abrufen von Abonnements für das Konto "{0}": {1}
es: Error inesperado al recuperar las suscripciones de la cuenta {0}: {1}.
fr: Erreur inattendue pendant la récupération des abonnements pour le compte {0} : {1}
it: Errore imprevisto durante il recupero delle sottoscrizioni per l'account {0}: {1}
ja: アカウント {0} のサブスクリプションの取り込みで予期しないエラーが発生しました: {1}
ko: {0} 계정의 구독을 가져오는 동안 예기치 않은 오류 발생: {1}
pt_br: Erro inesperado ao buscar assinaturas para a conta {0}: {1}
ru: Непредвиденная ошибка при получении подписок для учетной записи {0}: {1}
zh_hans: 为帐户 {0} 提取订阅时出现意外错误: {1}
zh_hant: 擷取帳戶 {0} 的訂閱時發生未預期的錯誤: {1}

# azure.accounts.accountNotFoundError
source: The selected account '{0}' is no longer available. Click sign in to add it again or select a different account.
de: Das ausgewählte Konto "{0}" ist nicht mehr verfügbar. Klicken Sie auf "Anmelden", um es erneut hinzuzufügen, oder wählen Sie ein anderes Konto aus.
es: La cuenta seleccionada ("{0}") ya no está disponible. Haga clic en el botón de inicio de sesión para volver a agregarla o seleccione otra cuenta.
fr: Le compte sélectionné « {0} » n'est plus disponible. Cliquez sur Se connecter pour le rajouter ou sélectionnez un autre compte.
it: L'account selezionato '{0}' non è più disponibile. Fare clic su Accedi per aggiungerlo di nuovo o selezionare un account diverso.
ja: 選択したアカウント '{0}' は使用できなくなりました。[サインイン] をクリックしてもう一度追加するか、別のアカウントを選択してください。
ko: 선택한 계정 '{0}'은(는) 더 이상 사용할 수 없습니다. [로그인]을 클릭하여 다시 추가하거나 다른 계정을 선택합니다.
pt_br: A conta selecionada '{0}' não está mais disponível. Clique em entrar para adicioná-la novamente ou selecione uma conta diferente.
ru: Выбранная учетная запись "{0}" больше не доступна. Нажмите кнопку "Войти", чтобы добавить ее снова, или выберите другую учетную запись.
zh_hans: 所选帐户“{0}”不再可用。请单击“登录”以再次添加，或选择其他帐户。
zh_hant: 選取的帳戶 '{0}' 已無法使用。請按一下 [登入] 重新新增該帳戶，或選取其他帳戶。

# azure.accessError
source: Error Details: {0}.
de: Fehlerdetails: {0}.
es: Detalles del error: {0}.
fr: Détails de l'erreur : {0}.
it: Dettagli dell'errore: {0}.
ja: エラーの詳細: {0}。
ko: 오류 세부 정보: {0}.
pt_br: Detalhes do Erro: {0}.
ru: Сведения об ошибке: {0}.
zh_hans: 错误详细信息: {0}。
zh_hant: 錯誤詳細資料: {0}。

# azure.accounts.accountStaleError
source: The access token for selected account '{0}' is no longer valid. Please click the sign in button and refresh the account or select a different account.
de: Das Zugriffstoken für das ausgewählte Konto "{0}" ist nicht mehr gültig. Klicken Sie auf die Schaltfläche "Anmelden", und aktualisieren Sie das Konto, oder wählen Sie ein anderes Konto aus.
es: El token de acceso para la cuenta seleccionada ("{0}") ya no es válido. Haga clic en el botón pertinente para iniciar sesión y actualice la cuenta, o seleccione otra.
fr: Le jeton d'accès pour le compte sélectionné « {0} » n'est plus valide. Cliquez sur le bouton Se connecter, actualisez le compte ou sélectionnez un autre compte.
it: Il token di accesso per l'account selezionato '{0}' non è più valido. Fare clic sul pulsante Accedi per aggiornare l'account o selezionare un account diverso.
ja: 選択したアカウント '{0}' のアクセス トークンは有効でなくなりました。サインイン ボタンをクリックして、アカウントを更新するか、別のアカウントを選択してください。
ko: 선택한 계정 '{0}'의 액세스 토큰이 더 이상 유효하지 않습니다. [로그인] 단추를 클릭하고 계정을 새로 고치거나, 다른 계정을 선택하세요.
pt_br: O token de acesso para a conta selecionada '{0}' não é mais válido. Clique no botão Entrar e atualize a conta ou selecione uma conta diferente.
ru: Токен доступа для выбранной учетной записи "{0}" больше не действителен. Нажмите кнопку "Войти" и обновите учетную запись или выберите другую учетную запись.
zh_hans: 所选帐户“{0}”的访问令牌不再有效。请单击“登录”按钮，刷新帐户或选择其他帐户。
zh_hant: 選取的帳戶 '{0}' 存取權杖已失效。請按一下 [登入] 按鈕並重新整理該帳戶，或選取其他帳戶。

# azure.accounts.unexpectedResourceGroupsError
source: Unexpected error fetching resource groups for subscription {0}: {1}
de: Unerwarteter Fehler beim Abrufen von Ressourcengruppen für das Abonnement "{0}": {1}
es: Error inesperado al recuperar los grupos de recursos para la suscripción {0}: {1}.
fr: Erreur inattendue pendant la récupération des groupes de ressources pour l'abonnement {0} : {1}
it: Errore imprevisto durante il recupero dei gruppi di risorse per la sottoscrizione {0}: {1}
ja: サブスクリプション {0} のリソース グループの取り込みで予期しないエラーが発生しました: {1}
ko: {0} 구독의 리소스 그룹을 가져오는 동안 예기치 않은 오류 발생: {1}
pt_br: Erro inesperado ao buscar grupos de recursos para a assinatura {0}: {1}
ru: Непредвиденная ошибка при получении групп ресурсов для подписки {0}: {1}
zh_hans: 为订阅 {0} 提取资源组时出现意外错误: {1}
zh_hant: 擷取訂閱 {0} 的資源群組時發生未預期的錯誤: {1}

# invalidSQLPassword
source: {0} doesn't meet the password complexity requirement. For more information: https://docs.microsoft.com/sql/relational-databases/security/password-policy
de: "{0}" entspricht nicht den Anforderungen an die Kennwortkomplexität. Weitere Informationen: https://docs.microsoft.com/sql/relational-databases/security/password-policy
es: {0} no cumple el requisito de complejidad de contraseña. Para obtener más información: https://docs.microsoft.com/sql/relational-databases/security/password-policy
fr: {0} n'est pas conforme aux exigences de complexité de mot de passe. Pour plus d'informations : https://docs.microsoft.com/sql/relational-databases/security/password-policy
it: {0} non è conforme al requisito di complessità delle password. Per altre informazioni, vedere: https://docs.microsoft.com/sql/relational-databases/security/password-policy
ja: {0} がパスワードの複雑さの要件を満たしていません。詳細: https://docs.microsoft.com/sql/relational-databases/security/password-policy
ko: {0}이(가) 암호 복잡성 요구 사항을 충족하지 않습니다. 자세한 정보: https://docs.microsoft.com/sql/relational-databases/security/password-policy
pt_br: {0} não atende ao requisito de complexidade de senha. Para obter mais informações: https://docs.microsoft.com/sql/relational-databases/security/password-policy
ru: {0} не соответствует требованиям к сложности пароля. Дополнительные сведения: https://docs.microsoft.com/sql/relational-databases/security/password-policy
zh_hans: {0} 不符合密码复杂性要求。有关详细信息，请访问: https://docs.microsoft.com/sql/relational-databases/security/password-policy
zh_hant: {0} 不符合密碼複雜度要求。如需詳細資訊，請前往: https://docs.microsoft.com/sql/relational-databases/security/password-policy

# passwordNotMatch
source: {0} doesn't match the confirmation password
de: "{0}" stimmt nicht mit dem Bestätigungskennwort überein.
es: {0} no coincide con la contraseña de confirmación
fr: {0} ne correspond pas au mot de passe de confirmation
it: {0} non corrisponde alla password di conferma
ja: {0} が確認パスワードと一致しません
ko: {0}이(가) 확인 암호와 일치하지 않습니다.
pt_br: {0} não corresponde à senha de confirmação
ru: {0} не соответствует подтверждению пароля
zh_hans: {0} 与确认密码不匹配
zh_hant: {0} 與確認密碼不符

# deployAzureSQLVM.NewSQLVMTitle
source: Deploy Azure SQL VM
de: Azure SQL-VM bereitstellen
es: Implementación de una VM de Azure SQL
fr: Déployer Azure SQL VM
it: Distribuisci macchina virtuale SQL di Azure
ja: Azure SQL VM のデプロイ
ko: Azure SQL VM 배포
pt_br: Implantar a VM do SQL do Azure
ru: Развертывание ВМ SQL Azure
zh_hans: 部署 Azure SQL VM
zh_hant: 部署 Azure SQL VM

# deployAzureSQLVM.ScriptToNotebook
source: Script to Notebook
de: Skript in Notebook schreiben
es: De script a cuaderno
fr: Exécuter un script sur un notebook
it: Genera script nel notebook
ja: ノートブックへのスクリプト
ko: Notebook으로 스크립트
pt_br: Script para o Notebook
ru: Скрипт в записную книжку
zh_hans: 脚本到笔记本
zh_hant: 編寫指令碼到筆記本

# deployAzureSQLVM.MissingRequiredInfoError
source: Please fill out the required fields marked with red asterisks.
de: Füllen Sie die mit einem roten Sternchen markierten Pflichtfelder aus.
es: Rellene los campos obligatorios marcados con asteriscos rojos.
fr: Remplissez les champs obligatoires marqués d'un astérisque rouge.
it: Compilare i campi obbligatori contrassegnati con asterischi rossi.
ja: 赤いアスタリスクでマークされた必須フィールドに入力してください。
ko: 빨간색 별표가 표시된 필수 필드를 입력하세요.
pt_br: Preencha os campos obrigatórios marcados com asteriscos vermelhos.
ru: Заполните обязательные поля, отмеченные красными звездочками.
zh_hans: 请填写标有红色星号的必填字段。
zh_hant: 請填寫標有紅色星號的必要欄位。

# deployAzureSQLVM.AzureSettingsPageTitle
source: Azure settings
de: Azure-Einstellungen
es: Configuración de Azure
fr: Paramètres Azure
it: Impostazioni di Azure
ja: Azure の設定
ko: Azure 설정
pt_br: Configurações do Azure
ru: Параметры Azure
zh_hans: Azure 设置
zh_hant: Azure 設定

# deployAzureSQLVM.AzureAccountDropdownLabel
source: Azure Account
de: Azure-Konto
es: Cuenta de Azure
fr: Compte Azure
it: Account Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Conta do Azure
ru: Учетная запись Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶

# deployAzureSQLVM.AzureSubscriptionDropdownLabel
source: Subscription
de: Abonnement
es: Suscripción
fr: Abonnement
it: Sottoscrizione
ja: サブスクリプション
ko: 구독
pt_br: Assinatura
ru: Подписка
zh_hans: 订阅
zh_hant: 訂閱

# deployAzureSQLVM.ResourceGroup
source: Resource Group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de Recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# deployAzureSQLVM.AzureRegionDropdownLabel
source: Region
es: Región
fr: Région
it: Area
ja: リージョン
ko: 지역
pt_br: Região
ru: Регион
zh_hans: 区域
zh_hant: 區域

# deployeAzureSQLVM.VmSettingsPageTitle
source: Virtual machine settings
de: VM-Einstellungen
es: Configuración de la máquina virtual
fr: Paramètres de la machine virtuelle
it: Impostazioni macchina virtuale
ja: 仮想マシンの設定
ko: 가상 머신 설정
pt_br: Configurações de máquina virtual
ru: Параметры виртуальной машины
zh_hans: 虚拟机设置
zh_hant: 虛擬機器設定

# deployAzureSQLVM.VmNameTextBoxLabel
source: Virtual machine name
de: VM-Name
es: Nombre de la máquina virtual
fr: Nom de la machine virtuelle
it: Nome macchina virtuale
ja: 仮想マシン名
ko: 가상 머신 이름
pt_br: Nome da máquina virtual
ru: Имя виртуальной машины
zh_hans: 虚拟机名称
zh_hant: 虛擬機器名稱

# deployAzureSQLVM.VmAdminUsernameTextBoxLabel
source: Administrator account username
de: Benutzername des Administratorkontos
es: Nombre de usuario de la cuenta de administrador
fr: Nom d'utilisateur du compte Administrateur
it: Nome utente dell'account amministratore
ja: 管理者アカウントのユーザー名
ko: 관리자 계정 사용자 이름
pt_br: Nome de usuário da conta de administrador
ru: Имя пользователя учетной записи администратора
zh_hans: 管理员帐户用户名
zh_hant: 系統管理員帳戶使用者名稱

# deployAzureSQLVM.VmAdminPasswordTextBoxLabel
source: Administrator account password
de: Kennwort für Administratorkonto
es: Contraseña de la cuenta de administrador
fr: Mot de passe du compte Administrateur
it: Password dell'account amministratore
ja: 管理者アカウントのパスワード
ko: 관리자 계정 암호
pt_br: Senha da conta de administrador
ru: Пароль учетной записи администратора
zh_hans: 管理员帐户密码
zh_hant: 系統管理員帳戶密碼

# deployAzureSQLVM.VmAdminConfirmPasswordTextBoxLabel
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# deployAzureSQLVM.VmImageDropdownLabel
source: Image
es: Imagen
it: Immagine
ja: イメージ
ko: 이미지
pt_br: Imagem
ru: Образ
zh_hans: 映像
zh_hant: 映像

# deployAzureSQLVM.VmSkuDropdownLabel
source: Image SKU
es: SKU de la imagen
fr: Référence SKU de l'image
it: SKU immagine
ja: 画像の SKU
ko: 이미지 SKU
pt_br: SKU da Imagem
ru: Номер SKU образа
zh_hans: 映像 SKU
zh_hant: 映像 SKU

# deployAzureSQLVM.VmImageVersionDropdownLabel
source: Image Version
es: Versión de imagen
fr: Version de l'image
it: Versione immagine
ja: 画像のバージョン
ko: 이미지 버전
pt_br: Versão da Imagem
ru: Версия образа
zh_hans: 映像版本
zh_hant: 映像版本

# deployAzureSQLVM.VmSizeDropdownLabel
source: Size
de: Größe
es: Tamaño
fr: Taille
it: Dimensioni
ja: サイズ
ko: 크기
pt_br: Tamanho
ru: Размер
zh_hans: 大小
zh_hant: 大小

# deployeAzureSQLVM.VmSizeLearnMoreLabel
source: Click here to learn more about pricing and supported VM sizes
de: Klicken Sie hier, um weitere Informationen zu Preisen und unterstützten VM-Größen zu erhalten.
es: Haga clic aquí para obtener más información sobre los precios y los tamaños admitidos para las máquinas virtuales.
fr: Cliquer ici pour en savoir plus sur les prix et les tailles de VM prises en charge
it: Fare clic qui per altre informazioni sui prezzi e sulle dimensioni di macchina virtuale supportate
ja: 価格とサポートされている VM サイズの詳細については、ここをクリックしてください
ko: 가격 책정 및 지원되는 VM 크기를 자세히 알아보려면 여기를 클릭합니다.
pt_br: Clique aqui para saber mais sobre o preço e os tamanhos de VM com suporte
ru: Щелкните здесь, чтобы просмотреть подробные сведения о ценах и поддерживаемых размерах виртуальных машин
zh_hans: 单击此处详细了解定价和支持的 VM 大小
zh_hant: 按一下這裡深入了解定價及支援的 VM 大小

# deployAzureSQLVM.NetworkSettingsPageTitle
source: Networking
de: Netzwerk
es: Redes
fr: Réseau
it: Rete
ja: ネットワーク
ko: 네트워킹
pt_br: Rede
ru: Сеть
zh_hans: 网络
zh_hant: 網路

# deployAzureSQLVM.NetworkSettingsPageDescription
source: Configure network settings
de: Netzwerkeinstellungen konfigurieren
es: Configurar opciones de red
fr: Configurer les paramètres réseau
it: Configura impostazioni di rete
ja: ネットワーク設定の構成
ko: 네트워크 설정 구성
pt_br: Definir configurações de rede
ru: Настройка параметров сети
zh_hans: 配置网络设置
zh_hant: 進行網路設定

# deployAzureSQLVM.NetworkSettingsNewVirtualNetwork
source: New virtual network
de: Neues virtuelles Netzwerk
es: Nueva red virtual
fr: Nouveau réseau virtuel
it: Nuova rete virtuale
ja: 新しい仮想ネットワーク
ko: 새 가상 네트워크
pt_br: Nova rede virtual
ru: Новая виртуальная сеть
zh_hans: 新建虚拟网络
zh_hant: 新增虛擬網路

# deployAzureSQLVM.VirtualNetworkDropdownLabel
source: Virtual Network
es: Red virtual
fr: Réseau virtuel
it: Rete virtuale
pt_br: Rede Virtual
ru: Виртуальная сеть
zh_hans: 虚拟网络
zh_hant: 虛擬網路

# deployAzureSQLVM.NetworkSettingsNewSubnet
source: New subnet
de: Neues Subnetz
es: Nueva subred
fr: Nouveau sous-réseau
it: Nuova subnet
ja: 新しいサブネット
ko: 새 서브넷
pt_br: Nova sub-rede
ru: Новая подсеть
zh_hans: 新建子网
zh_hant: 新增子網路

# deployAzureSQLVM.SubnetDropdownLabel
source: Subnet
de: Subnetz
es: Subred
fr: Sous-réseau
ja: サブネット
ko: 서브넷
pt_br: Sub-rede
ru: Подсеть
zh_hans: 子网
zh_hant: 子網路

# deployAzureSQLVM.PublicIPDropdownLabel
source: Public IP
de: Öffentliche IP-Adresse
es: IP pública
fr: IP publique
it: IP pubblico
ja: パブリック IP
ko: 공용 IP
pt_br: IP
ru: Общедоступный IP-адрес
zh_hans: 公共 IP
zh_hant: 公用 IP

# deployAzureSQLVM.NetworkSettingsUseExistingPublicIp
source: New public ip
de: Neue öffentliche IP-Adresse
es: Nueva IP pública
fr: Nouvelle IP publique
it: Nuovo indirizzo IP pubblico
ja: 新しいパブリック IP
ko: 새 공용 IP
pt_br: Novo IP
ru: Новый общедоступный IP-адрес
zh_hans: 新建公共 IP
zh_hant: 新增公用 IP

# deployAzureSQLVM.VmRDPAllowCheckboxLabel
source: Enable Remote Desktop (RDP) inbound port (3389)
de: Eingangsport (3389) für Remotedesktop (RDP) aktivieren
es: Habilitar puerto de entrada (3389) del Escritorio remoto (RDP)
fr: Activer le port d'entrée Bureau à distance (RDP) (3389)
it: Abilita porta in ingresso Desktop remoto (RDP) (3389)
ja: リモート デスクトップ (RDP) 受信ポート (3389) を有効にする
ko: RDP(원격 데스크톱) 인바운드 포트(3389) 사용
pt_br: Habilitar a porta de entrada da RDP (Área de Trabalho Remota) (3389)
ru: Включить входящий порт (3389) для удаленного рабочего стола (RDP)
zh_hans: 启用远程桌面(RDP)入站端口(3389)
zh_hant: 啟用遠端桌面 (RDP) 輸入連接埠 (3389)

# deployAzureSQLVM.SqlServerSettingsPageTitle
source: SQL Servers settings
de: SQL Server-Einstellungen
es: Configuración de SQL Server
fr: Paramètres des serveurs SQL
it: Impostazioni istanze di SQL Server
ja: SQL Server 設定
ko: SQL Server 설정
pt_br: Configurações de SQL Servers
ru: Параметры SQL Server
zh_hans: SQL Server 设置
zh_hant: SQL Server 設定

# deployAzureSQLVM.SqlConnectivityTypeDropdownLabel
source: SQL connectivity
de: SQL-Konnektivität
es: Conectividad SQL
fr: Connectivité SQL
it: Connettività SQL
ja: SQL の接続
ko: SQL 연결
pt_br: Conectividade do SQL
ru: Подключение SQL
zh_hans: SQL 连接
zh_hant: SQL 連線

# deployAzureSQLVM.SqlPortLabel
source: Port
es: Puerto
it: Porta
ja: ポート
ko: 포트
pt_br: Porta
ru: Порт
zh_hans: 端口
zh_hant: 連接埠

# deployAzureSQLVM.SqlEnableSQLAuthenticationLabel
source: Enable SQL authentication
de: SQL-Authentifizierung aktivieren
es: Habilitar autenticación de SQL
fr: Activer l'authentification SQL
it: Abilita autenticazione SQL
ja: SQL 認証を有効にする
ko: SQL 인증 사용
pt_br: Habilitar autenticação do SQL
ru: Включить проверку подлинности SQL
zh_hans: 启用 SQL 身份验证
zh_hant: 啟用 SQL 驗證

# deployAzureSQLVM.SqlAuthenticationUsernameLabel
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# deployAzureSQLVM.SqlAuthenticationPasswordLabel
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# deployAzureSQLVM.SqlAuthenticationConfirmPasswordLabel
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# deployCluster.SaveConfigFiles
source: Save config files
de: Konfigurationsdateien speichern
es: Guardar archivos de configuración
fr: Enregistrer les fichiers config
it: Salva file di configurazione
ja: 構成ファイルを保存する
ko: 구성 파일 저장
pt_br: Salvar arquivos de configuração
ru: Сохранить файлы конфигурации
zh_hans: 保存配置文件
zh_hant: 儲存組態檔

# deployCluster.ScriptToNotebook
source: Script to Notebook
de: Skript in Notebook schreiben
es: De script a cuaderno
fr: Exécuter un script sur un notebook
it: Genera script nel notebook
ja: ノートブックへのスクリプト
ko: Notebook으로 스크립트
pt_br: Script para o Notebook
ru: Скрипт в записную книжку
zh_hans: 脚本到笔记本
zh_hant: 編寫指令碼到筆記本

# deployCluster.SelectConfigFileFolder
source: Save config files
de: Konfigurationsdateien speichern
es: Guardar archivos de configuración
fr: Enregistrer les fichiers config
it: Salva file di configurazione
ja: 構成ファイルを保存する
ko: 구성 파일 저장
pt_br: Salvar arquivos de configuração
ru: Сохранить файлы конфигурации
zh_hans: 保存配置文件
zh_hant: 儲存組態檔
