Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# deployCluster.loadingProfilesCompleted
source: Loading profiles completed
de: Profile wurden vollständig geladen.
es: La carga de los perfiles se ha completado.
fr: Profils chargés
it: Caricamento dei profili completato
ja: プロファイルの読み込みが完了しました
ko: 프로필 로드 완료
pt_br: Carregamento de perfis concluído
ru: Загрузка профилей завершена
zh_hans: 配置文件加载已完成
zh_hant: 已完成載入設定檔

# deployCluster.profileRadioGroupLabel
source: Deployment configuration profile
de: Bereitstellungskonfigurationsprofil
es: Perfil de configuración de la implementación
fr: Profil de configuration de déploiement
it: Profilo di configurazione della distribuzione
ja: デプロイ構成プロファイル
ko: 배포 구성 프로필
pt_br: Perfil de configuração de implantação
ru: Профиль конфигурации развертывания
zh_hans: 部署配置文件
zh_hant: 部署組態設定檔

# deployCluster.loadProfileFailed
source: Failed to load the deployment profiles: {0}
de: Fehler beim Laden der Bereitstellungsprofile: {0}
es: No se han podido cargar los perfiles de implementación: {0}
fr: Le chargement des profils de déploiement a échoué : {0}
it: Non è stato possibile caricare i profili di distribuzione: {0}
ja: デプロイ プロファイルの読み込みに失敗しました: {0}
ko: 배포 프로필 {0}을(를) 로드하지 못했습니다.
pt_br: Falha ao carregar os perfis de implantação: {0}
ru: Не удалось загрузить профили развертывания: {0}
zh_hans: 未能加载部署配置文件: {0}
zh_hant: 無法載入部署設定檔: {0}

# deployCluster.masterPoolLabel
source: SQL Server Master
es: Servidor SQL Server maestro
fr: Instance maître SQL Server
it: Master SQL Server
ja: SQL Server マスター
ko: SQL Server 마스터
pt_br: SQL Server Mestre
ru: База данных master SQL Server
zh_hans: SQL Server 主实例
zh_hant: SQL Server 主機

# deployCluster.computePoolLable
source: Compute
es: Proceso
fr: Calcul
it: Calcolo
ja: コンピューティング
ko: 컴퓨팅
pt_br: Computação
ru: Вычислительный
zh_hans: 计算
zh_hant: 計算

# deployCluster.dataPoolLabel
source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
ru: Данные
zh_hans: 数据
zh_hant: 資料

# deployCluster.ServiceName
source: Service
de: Dienst
es: Servicio
it: Servizio
ja: サービス
ko: 서비스
pt_br: Serviço
ru: Служба
zh_hans: 服务
zh_hant: 服務

# deployCluster.dataStorageType
source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
ru: Данные
zh_hans: 数据
zh_hant: 資料

# deployCluster.logsStorageType
source: Logs
de: Protokolle
es: Registros
fr: Journaux
it: Log
ja: ログ
ko: 로그
ru: Журналы
zh_hans: 日志
zh_hant: 記錄

# deployCluster.StorageType
source: Storage type
de: Speichertyp
es: Tipo de almacenamiento
fr: Type de stockage
it: Tipo di archiviazione
ja: ストレージの種類
ko: 스토리지 유형
pt_br: Tipo de armazenamento
ru: Тип хранилища
zh_hans: 存储类型
zh_hant: 儲存體類型

# deployCluster.basicAuthentication
source: Basic authentication
de: Standardauthentifizierung
es: Autenticación básica
fr: Authentification de base
it: Autenticazione di base
ja: 基本認証
ko: 기본 인증
pt_br: Autenticação básica
ru: Базовая проверка подлинности
zh_hans: 基本身份验证
zh_hant: 基本驗證

# deployCluster.activeDirectoryAuthentication
source: Active Directory authentication
de: Active Directory-Authentifizierung
es: Autenticación de Active Directory
fr: Authentification Active Directory
it: Autenticazione di Active Directory
ja: Active Directory 認証
ko: Active Directory 인증
pt_br: Autenticação do Active Directory
ru: Проверка подлинности Active Directory
zh_hans: Active Directory 身份验证
zh_hant: Active Directory 驗證

# deployCluster.hadr
source: High Availability
de: Hochverfügbarkeit
es: Alta disponibilidad
fr: Haute disponibilité
it: Disponibilità elevata
ja: 高可用性
ko: 고가용성
pt_br: Alta disponibilidade
ru: Высокая доступность
zh_hans: 高可用性
zh_hant: 高可用性

# deployCluster.featureText
source: Feature
de: Funktion
es: Característica
fr: Composant
it: Funzionalità
ja: 機能
ko: 기능
pt_br: Recurso
ru: Функция
zh_hans: 功能
zh_hant: 功能

# deployCluster.ProfileNotSelectedError
source: Please select a deployment profile.
de: Wählen Sie ein Bereitstellungsprofil aus.
es: Seleccione un perfil de implementación.
fr: Sélectionnez un profil de déploiement.
it: Selezionare un profilo di distribuzione.
ja: デプロイ プロファイルを選択してください。
ko: 배포 프로필을 선택하세요.
pt_br: Selecione um perfil de implantação.
ru: Выберите профиль развертывания.
zh_hans: 请选择部署配置文件。
zh_hant: 請選取部署設定檔。

# deployCluster.MissingRequiredInfoError
source: Please fill out the required fields marked with red asterisks.
de: Füllen Sie die mit einem roten Sternchen markierten Pflichtfelder aus.
es: Rellene los campos obligatorios marcados con asteriscos rojos.
fr: Remplissez les champs obligatoires marqués d'un astérisque rouge.
it: Compilare i campi obbligatori contrassegnati con asterischi rossi.
ja: 赤いアスタリスクでマークされた必須フィールドに入力してください。
ko: 빨간색 별표가 표시된 필수 필드를 입력하세요.
pt_br: Preencha os campos obrigatórios marcados com asteriscos vermelhos.
ru: Заполните обязательные поля, отмеченные красными звездочками.
zh_hans: 请填写标有红色星号的必填字段。
zh_hant: 請填寫標有紅色星號的必要欄位。

# deployCluster.AzureSettingsPageTitle
source: Azure settings
de: Azure-Einstellungen
es: Configuración de Azure
fr: Paramètres Azure
it: Impostazioni di Azure
ja: Azure の設定
ko: Azure 설정
pt_br: Configurações do Azure
ru: Параметры Azure
zh_hans: Azure 设置
zh_hant: Azure 設定

# deployCluster.AzureSettingsPageDescription
source: Configure the settings to create an Azure Kubernetes Service cluster
de: Konfigurieren Sie die Einstellungen, um Azure Kubernetes Service-Cluster zu erstellen.
es: Configure las opciones para crear un clúster de Azure Kubernetes Service
fr: Configurer les paramètres pour créer un cluster Azure Kubernetes Service
it: Consente di configurare le impostazioni per creare un cluster del servizio Azure Kubernetes
ja: Azure Kubernetes Service クラスターを作成するための設定を構成します
ko: Azure Kubernetes Service 클러스터를 만들기 위한 설정 구성
pt_br: Definir as configurações para criar um cluster do Serviço de Kubernetes do Azure
ru: Настройка параметров для создания кластера Службы Azure Kubernetes
zh_hans: 配置设置以创建 Azure Kubernetes 服务群集
zh_hant: 進行設定以建立 Azure Kubernetes Service 叢集

# deployCluster.SubscriptionField
source: Subscription id
de: Abonnement-ID
es: Identificador de suscripción
fr: ID d'abonnement
it: ID sottoscrizione
ja: サブスクリプション ID
ko: 구독 ID
pt_br: ID da assinatura
ru: Идентификатор подписки
zh_hans: 订阅 ID
zh_hant: 訂用帳戶識別碼

# deployCluster.SubscriptionPlaceholder
source: Use my default Azure subscription
de: Mein Azure-Standardabonnement verwenden
es: Usar mi suscripción predeterminada de Azure
fr: Utiliser mon abonnement Azure par défaut
it: Usa la sottoscrizione di Azure predefinita personale
ja: 既定の Azure サブスクリプションを使用する
ko: 내 기본 Azure 구독 사용
pt_br: Usar minha assinatura padrão do Azure
ru: Использовать мою подписку Azure по умолчанию
zh_hans: 使用默认 Azure 订阅
zh_hant: 使用我的預設 Azure 訂用帳戶

# deployCluster.SubscriptionDescription
source: The default subscription will be used if you leave this field blank.
de: Wenn Sie dieses Feld leer lassen, wird das Standardabonnement verwendet.
es: Se usará la suscripción predeterminada si deja este campo en blanco.
fr: L'abonnement par défaut est utilisé si vous laissez ce champ vide.
it: Se si lascia vuoto questo campo, verrà usata la sottoscrizione predefinita.
ja: このフィールドを空白のままにすると、既定のサブスクリプションが使用されます。
ko: 이 필드를 비워 두면 기본 구독이 사용됩니다.
pt_br: A assinatura padrão será usada se você deixar esse campo em branco.
ru: Если вы оставите это поле пустым, будет использоваться подписка по умолчанию.
zh_hans: 如果将此字段留空，将使用默认订阅。
zh_hant: 如果將此欄位保留空白，將會使用預設訂用帳戶。

# deployCluster.SubscriptionHelpLink
source: View available Azure subscriptions
de: Verfügbare Azure-Abonnements anzeigen
es: Ver las suscripciones de Azure disponibles
fr: Voir les abonnements Azure disponibles
it: Visualizza le sottoscrizioni di Azure disponibili
ja: 利用可能な Azure サブスクリプションの表示
ko: 사용 가능한 Azure 구독 보기
pt_br: Exibir as assinaturas do Azure disponíveis
ru: Просмотр доступных подписок Azure
zh_hans: 查看可用的 Azure 订阅
zh_hant: 檢視可用的 Azure 訂用帳戶

# deployCluster.ResourceGroupName
source: New resource group name
de: Name der neuen Ressourcengruppe
es: Nuevo nombre de grupo de recursos
fr: Nom du nouveau groupe de ressources
it: Nuovo nome del gruppo di risorse
ja: 新しいリソース グループ名
ko: 새 리소스 그룹 이름
pt_br: Nome do novo grupo de recursos
ru: Новое имя группы ресурсов
zh_hans: 新资源组名称
zh_hant: 新的資源群組名稱

# deployCluster.Location
source: Location
de: Speicherort
es: Ubicación
fr: Emplacement
it: Percorso
ja: 場所
ko: 위치
pt_br: Local
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# deployCluster.AzureLocationHelpLink
source: View available Azure locations
de: Verfügbare Azure-Standorte anzeigen
es: Ver las ubicaciones de Azure disponibles
fr: Voir les emplacements Azure disponibles
it: Visualizza le località di Azure disponibili
ja: 利用可能な Azure の場所を表示する
ko: 사용 가능한 Azure 위치 보기
pt_br: Exibir as localizações do Azure disponíveis
ru: Просмотр доступных расположений Azure
zh_hans: 查看可用的 Azure 位置
zh_hant: 檢視可用的 Azure 位置

# deployCluster.AksName
source: AKS cluster name
de: Name des AKS-Clusters
es: Nombre del clúster de AKS
fr: Nom du cluster AKS
it: Nome del cluster del servizio Azure Kubernetes
ja: AKS クラスター名
ko: AKS 클러스터 이름
pt_br: Nome do cluster do AKS
ru: Имя кластера AKS
zh_hans: AKS 群集名称
zh_hant: AKS 叢集名稱

# deployCluster.VMCount
source: VM count
de: VM-Anzahl
es: Recuento de máquinas virtuales
fr: Nombre de machines virtuelles
it: Numero di macchine virtuali
ja: VM 数
ko: VM 수
pt_br: Contagem de VMs
ru: Число виртуальных машин
zh_hans: VM 计数
zh_hant: VM 計數

# deployCluster.VMSize
source: VM size
de: VM-Größe
es: Tamaño de la máquina virtual
fr: Taille de machine virtuelle
it: Dimensioni della macchina virtuale
ja: VM サイズ
ko: VM 크기
pt_br: Tamanho da VM
ru: Размер виртуальной машины
zh_hans: VM 大小
zh_hant: VM 大小

# deployCluster.VMSizeHelpLink
source: View available VM sizes
de: Verfügbare VM-Größen anzeigen
es: Ver los tamaños de máquina virtual disponibles
fr: Voir les tailles de machine virtuelle disponibles
it: Visualizza le dimensioni delle macchine virtuali disponibili
ja: 使用可能な VM サイズの表示
ko: 사용 가능한 VM 크기 보기
pt_br: Exibir os tamanhos de VM disponíveis
ru: Просмотр доступных размеров виртуальных машин
zh_hans: 查看可用的 VM 大小
zh_hant: 檢視可用的 VM 大小

# deployCluster.ClusterNameDescription
source: The cluster name must consist only of alphanumeric lowercase characters or '-' and must start and end with an alphanumeric character.
de: Der Clustername darf nur aus Kleinbuchstaben, Ziffern oder Bindestrichen (-) bestehen und mit einem alphanumerischen Zeichen beginnen und enden.
es: El nombre del clúster debe estar formado únicamente por caracteres alfanuméricos en minúscula o "-", y debe comenzar y terminar con un carácter alfanumérico.
fr: Le nom de cluster doit contenir seulement des caractères alphanumériques en minuscules ou « - », et doit commencer et se terminer par un caractère alphanumérique.
it: Il nome del cluster deve essere composto solo da caratteri alfanumerici minuscoli o da '-' e deve iniziare e terminare con un carattere alfanumerico.
ja: クラスター名は、小文字の英数字または '-' のみで構成されている必要があり、先頭と末尾には英数字を使用する必要があります。
ko: 클러스터 이름은 영숫자 소문자 또는 '-'로만 구성되어야 하며 영숫자 문자로 시작하고 끝나야 합니다.
pt_br: O nome do cluster precisa conter apenas caracteres alfanuméricos em minúsculas ou '-', e começar e terminar com um caractere alfanumérico.
ru: Имя кластера может включать только строчные буквы, цифры и символы "-". Оно должно начинаться и заканчиваться буквой или цифрой.
zh_hans: 群集名称只能包含字母数字小写字符或 "-"，并且必须以字母数字字符开头和结尾。
zh_hant: 叢集名稱只能包含小寫英數字元或 '-'，而且開頭與結尾必須是英數字元。

# deployCluster.ClusterSettingsPageTitle
source: Cluster settings
de: Clustereinstellungen
es: Configuración del clúster
fr: Paramètres de cluster
it: Impostazioni del cluster
ja: クラスター設定
ko: 클러스터 설정
pt_br: Configurações de cluster
ru: Параметры кластера
zh_hans: 群集设置
zh_hant: 叢集設定

# deployCluster.ClusterSettingsPageDescription
source: Configure the SQL Server Big Data Cluster settings
de: SQL Server-Big Data-Cluster-Einstellungen konfigurieren
es: Configurar los parámetros del clúster de macrodatos de SQL Server
fr: Configurer les paramètres du cluster Big Data SQL Server
it: Consente di configurare le impostazioni del cluster Big Data di SQL Server
ja: SQL Server ビッグ データ クラスター設定の構成
ko: SQL Server 빅 데이터 클러스터 설정 구성
pt_br: Definir as configurações do Cluster de Big Data do SQL Server
ru: Настройка параметров кластера больших данных SQL Server
zh_hans: 配置 SQL Server 大数据群集设置
zh_hant: 進行 SQL Server 巨量資料叢集設定

# deployCluster.ClusterName
source: Cluster name
es: Nombre del clúster
fr: Nom de cluster
it: Nome del cluster
ja: クラスター名
ko: 클러스터 이름
pt_br: Nome do cluster
ru: Имя кластера
zh_hans: 群集名称
zh_hant: 叢集名稱

# deployCluster.AdminUsername
source: Admin username
de: Administratorbenutzername
es: Nombre de usuario del administrador
fr: Nom d'utilisateur de l'administrateur
it: Nome utente dell'amministratore
ja: 管理者ユーザー名
ko: 관리자 사용자 이름
pt_br: Nome de usuário administrador
ru: Имя пользователя администратора
zh_hans: 管理员用户名
zh_hant: 系統管理員使用者名稱

# deployCluster.AdminUsernameDescription
source: This username will be used for controller and SQL Server. Username for the gateway will be root.
de: Dieser Benutzername wird für Controller und SQL Server verwendet. Der Benutzername für das Gateway lautet "root".
es: Este nombre de usuario se usará para el controlador y SQL Server. El nombre de usuario de la puerta de enlace será de raíz.
fr: Ce nom d'utilisateur est utilisé pour le contrôleur et SQL Server. Le nom d'utilisateur de la passerelle est root.
it: Questo nome utente verrà usato per il controller e per SQL Server. Il nome utente del gateway sarà root.
ja: このユーザー名は、コントローラーと SQL Server に使用されます。ゲートウェイのユーザー名は root になります。
ko: 이 사용자 이름은 컨트롤러 및 SQL Server에 사용됩니다. 게이트웨이의 사용자 이름은 root입니다.
pt_br: Este nome de usuário será usado para o controlador e o SQL Server. O nome de usuário do gateway será raiz.
ru: Это имя пользователя будет использоваться для контроллера и SQL Server. Имя пользователя для шлюза будет корнем.
zh_hans: 此用户名将用于控制器和 SQL Server。网关的用户名将为 root。
zh_hant: 這個使用者名稱會用於控制器與 SQL Server。閘道的使用者名稱會成為根。

# deployCluster.AdminPassword
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# deployCluster.AdminPasswordDescription
source: This password can be used to access the controller, SQL Server and gateway.
de: Dieses Kennwort kann für den Zugriff auf den Controller, SQL Server und das Gateway verwendet werden.
es: Esta contraseña se puede usar para tener acceso al controlador, SQL Server y puerta de enlace.
fr: Ce mot de passe peut être utilisé pour accéder au contrôleur, à SQL Server et à la passerelle.
it: È possibile usare questa password per accedere al controller, a SQL Server e al gateway.
ja: このパスワードは、コントローラー、SQL Server、およびゲートウェイにアクセスするために使用できます。
ko: 이 암호를 사용하여 컨트롤러, SQL Server 및 게이트웨이에 액세스할 수 있습니다.
pt_br: Essa senha pode ser usada para acessar o controlador, o SQL Server e o gateway.
ru: Этот пароль можно использовать для доступа к контроллеру, серверу SQL Server и шлюзу.
zh_hans: 此密码可用于访问控制器、SQL Server 和网关。
zh_hant: 此密碼可用於存取控制器、SQL Server 和閘道。

# deployCluster.ConfirmPassword
source: Confirm password
de: Kennwort bestätigen
es: Confirmar contraseña
fr: Confirmer le mot de passe
it: Conferma password
ja: パスワードの確認
ko: 암호 확인
pt_br: Confirmar a senha
ru: Подтверждение пароля
zh_hans: 确认密码
zh_hant: 確認密碼

# deployCluster.AuthenticationMode
source: Authentication mode
de: Authentifizierungsmodus
es: Modo de autenticación
fr: Mode d'authentification
it: Modalità di autenticazione
ja: 認証モード
ko: 인증 모드
pt_br: Modo de autenticação
ru: Режим проверки подлинности
zh_hans: 身份验证模式
zh_hant: 驗證模式

# deployCluster.AuthenticationMode.Basic
source: Basic
de: Standard
es: Básico
fr: De base
it: Di base
ja: 基本
ko: 기본
pt_br: Básico
ru: Обычный
zh_hans: 基本
zh_hant: 基本

# deployCluster.DockerSettings
source: Docker settings
de: Docker-Einstellungen
es: Configuración de Docker
fr: Paramètres Docker
it: Impostazioni di Docker
ja: Docker 設定
ko: Docker 설정
pt_br: Configurações do Docker
ru: Параметры Docker
zh_hans: Docker 设置
zh_hant: Docker 設定

# deployCluster.DockerRegistry
source: Registry
de: Registrierung
es: Registro
fr: Registre
it: Registro
ja: レジストリ
ko: 레지스트리
pt_br: Registro
ru: Реестр
zh_hans: 注册表
zh_hant: 登錄

# deployCluster.DockerRepository
source: Repository
es: Repositorio
fr: Dépôt
ja: リポジトリ
ko: 리포지토리
pt_br: Repositório
ru: Репозиторий
zh_hans: 存储库
zh_hant: 存放庫

# deployCluster.DockerImageTag
source: Image tag
es: Etiqueta de imagen
fr: Balise d'image
it: Tag dell'immagine
ja: イメージ タグ
ko: 이미지 태그
pt_br: Marca de imagem
ru: Тег изображения
zh_hans: 图像标记
zh_hant: 映像標籤

# deployCluster.DockerUsername
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# deployCluster.DockerPassword
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt_br: Senha
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

# deployCluster.ActiveDirectorySettings
source: Active Directory settings
de: Active Directory-Einstellungen
es: Configuración de Active Directory
fr: Paramètres Active Directory
it: Impostazioni di Active Directory
ja: Active Directory の設定
ko: Active Directory 설정
pt_br: Configurações do Active Directory
ru: Параметры Active Directory
zh_hans: Active Directory 设置
zh_hant: Active Directory 設定

# deployCluster.OuDistinguishedName
source: Organizational unit
de: Organisationseinheit
es: Unidad organizativa
fr: Unité d'organisation
it: Unità organizzativa
ja: 組織単位
ko: 조직 구성 단위
pt_br: Unidade organizacional
ru: Подразделение
zh_hans: 组织单位
zh_hant: 組織單位

# deployCluster.OuDistinguishedNameDescription
source: Distinguished name for the organizational unit. For example: OU=bdc,DC=contoso,DC=com.
de: Der DN (Distinguished Name) für die Organisationseinheit. Beispiel: OU=bdc,DC=contoso,DC=com
es: Nombre distintivo de la unidad organizativa. Por ejemplo: OU=bdc,DC=contoso,DC=com.
fr: Nom unique de l'unité d'organisation. Par exemple : OU=bdc,DC=contoso,DC=com.
it: Nome distinto dell'unità organizzativa, ad esempio OU=bdc,DC=contoso,DC=com.
ja: 組織単位の識別名。例: OU=bdc,DC=contoso,DC=com。
ko: 조직 구성 단위의 고유 이름(예: OU=bdc,DC=contoso,DC=com)입니다.
pt_br: Nome distinto da unidade organizacional. Por exemplo: OU=BDC, DC=contoso, DC=com.
ru: Различающееся имя подразделения. Например: OU=bdc,DC=contoso,DC=com.
zh_hans: 组织单位的可区分名称，例如 OU=bdc,DC=contoso,DC=com。
zh_hant: 組織單位的辨別名稱。例如: OU=bdc,DC=contoso,DC=com。

# deployCluster.DomainControllerFQDNs
source: Domain controller FQDNs
de: FQDNs des Domänencontrollers
es: FQDN del controlador de dominio
fr: FQDN des contrôleurs de domaine
it: FQDN del controller di dominio
ja: ドメイン コントローラー FQDN
ko: 도메인 컨트롤러 FQDN
pt_br: FQDNs do controlador de domínio
ru: Полные доменные имена контроллеров домена
zh_hans: 域控制器 FQDN
zh_hant: 網域控制器 FQDN

# deployCluster.DomainControllerFQDNsPlaceHolder
source: Use comma to separate the values.
de: Trennen Sie die Werte durch Kommas.
es: Utilice la coma para separar los valores.
fr: Utilisez une virgule pour séparer les valeurs.
it: Usare la virgola per separare i valori.
ja: コンマを使用して値を区切ります。
ko: 쉼표를 사용하여 값을 구분합니다.
pt_br: Use vírgula para separar os valores.
ru: Используйте запятую для разделения значений.
zh_hans: 使用逗号分隔值。
zh_hant: 使用逗號分隔值。

# deployCluster.DomainControllerFQDNDescription
source: Fully qualified domain names for the domain controller. For example: DC1.CONTOSO.COM. Use comma to separate multiple FQDNs.
de: Die vollqualifizierten Domänennamen (FQDN) für den Domänencontroller, zum Beispiel: DC1.CONTOSO.COM. Trennen Sie mehrere FQDNs durch Kommas.
es: Nombres de dominio completos (FQDN) para el controlador de dominio. Por ejemplo: DC1. CONTOSO.COM. Utilice la coma para separar varios FQDN.
fr: Nom de domaine complet des contrôleurs de domaine. Par exemple : DC1.CONTOSO.COM. Utilisez une virgule pour séparer plusieurs FQDN.
it: Nomi di dominio completi per il controller di dominio, ad esempio DC1.CONTOSO.COM. Usare la virgola come delimitatore tra più FQDN.
ja: ドメイン コントローラーの完全修飾ドメイン名。たとえば、DC1.CONTOSO.COM です。複数の FQDN を区切るには、コンマを使用します。
ko: 도메인 컨트롤러의 정규화된 도메인 이름(예: DC1. CONTOSO.COM)입니다. 쉼표를 사용하여 여러 FQDN을 구분합니다.
pt_br: Nomes de domínio totalmente qualificados para o controlador de domínio. Por exemplo: DC1.CONTOSO.COM. Use vírgula para separar vários FQDNs.
ru: Полные доменные имена для контроллера домена. Например: DC1.CONTOSO.COM. Используйте запятую для разделения нескольких полных доменных имен.
zh_hans: 域控制器的完全限定域名，例如 DC1.CONTOSO.COM。使用逗号分隔多个 FQDN。
zh_hant: 網域控制器的完整網域名稱。例如: DC1.CONTOSO.COM。請使用逗號分隔多個 FQDN。

# deployCluster.DomainDNSIPAddresses
source: Domain DNS IP addresses
de: DNS-IP-Adressen der Domäne
es: Direcciones IP de DNS de dominio
fr: Adresses IP du DNS de domaine
it: Indirizzi IP DNS del dominio
ja: ドメイン DNS IP アドレス
ko: 도메인 DNS IP 주소
pt_br: Endereços IP do DNS do domínio
ru: IP-адреса DNS домена
zh_hans: 域 DNS IP 地址
zh_hant: 網域 DNS IP 位址

# deployCluster.DomainDNSIPAddressesPlaceHolder
source: Use comma to separate the values.
de: Trennen Sie die Werte durch Kommas.
es: Utilice la coma para separar los valores.
fr: Utilisez une virgule pour séparer les valeurs.
it: Usare la virgola per separare i valori.
ja: コンマを使用して値を区切ります。
ko: 쉼표를 사용하여 값을 구분합니다.
pt_br: Use vírgula para separar os valores.
ru: Используйте запятую для разделения значений.
zh_hans: 使用逗号分隔值。
zh_hant: 使用逗號分隔值。

# deployCluster.DomainDNSIPAddressesDescription
source: Domain DNS servers' IP Addresses. Use comma to separate multiple IP addresses.
de: IP-Adressen der DNS-Server der Domäne. Trennen Sie mehrere IP-Adressen durch Kommas.
es: Direcciones IP de los servidores DNS de dominio. Utilice la coma para separar varias direcciones IP.
fr: Adresses IP des serveurs DNS de domaine. Utilisez une virgule pour séparer plusieurs adresses IP.
it: Indirizzi IP dei server DNS di dominio. Usare la virgola come delimitatore tra più indirizzi IP.
ja: ドメイン DNS サーバーの IP アドレス。複数の IP アドレスを区切るにはコンマを使用します。
ko: 도메인 DNS 서버의 IP 주소입니다. 쉼표를 사용하여 여러 IP 주소를 구분합니다.
pt_br: Endereços IP dos servidores DNS do domínio. Use vírgula para separar vários endereços IP.
ru: IP-адреса серверов DNS домена. Используйте запятую для разделения нескольких IP-адресов.
zh_hans: 域 DNS 服务器的 IP 地址。使用逗号分隔多个 IP 地址。
zh_hant: 網域 DNS 伺服器的 IP 位址。請使用逗號分隔多個 IP 位址。

# deployCluster.DomainDNSName
source: Domain DNS name
de: DNS-Name der Domäne
es: Nombre DNS de dominio
fr: Nom du DNS de domaine
it: Nome DNS del dominio
ja: ドメイン DNS 名
ko: 도메인 DNS 이름
pt_br: Nome do DNS do domínio
ru: DNS-имя домена
zh_hans: 域 DNS 名称
zh_hant: 網域 DNS 名稱

# deployCluster.RealmDescription
source: If not provided, the domain DNS name will be used as the default value.
de: Wenn keine Angabe vorliegt, wird der DNS-Name der Domäne als Standardwert verwendet.
es: Si no se indica, se usará el nombre DNS del dominio como valor predeterminado.
fr: S'il n'est pas fourni, le nom DNS du domaine est utilisé comme valeur par défaut.
it: Se non viene specificato, verrà usato il nome DNS del dominio come valore predefinito.
ja: 指定されていない場合、ドメイン DNS 名が既定値として使用されます。
ko: 제공하지 않으면 도메인 DNS 이름이 기본값으로 사용됩니다.
pt_br: Se não for fornecido, o nome DNS do domínio será usado como o valor padrão.
ru: Если не указано, то в качестве значения по умолчанию будет использоваться имя DNS домена.
zh_hans: 如果未提供，则将域 DNS 名称用作默认值。
zh_hant: 若未提供，則會使用網域 DNS 名稱作為預設值。

# deployCluster.ClusterAdmins
source: Cluster admin group
de: Gruppe der Clusteradministratoren
es: Grupo de administración de clústeres
fr: Groupe d'administration de cluster
it: Gruppo di amministratori del cluster
ja: クラスター管理グループ
ko: 클러스터 관리자 그룹
pt_br: Grupo de administração do cluster
ru: Группа администраторов кластера
zh_hans: 群集管理员组
zh_hant: 叢集系統管理員群組
