Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# deployCluster.SaveConfigFileSucceeded
source: Config files saved to {0}
de: Die Konfigurationsdateien wurden in "{0}" gespeichert.
es: Archivos de configuración guardados en {0}
fr: Fichiers config enregistrés dans {0}
it: I file di configurazione sono stati salvati in {0}
ja: 構成ファイルが {0} に保存されました
ko: 구성 파일이 {0}에 저장됨
pt_br: Arquivos de configuração salvos em {0}
ru: Файлы конфигурации сохранены в {0}
zh_hans: 配置文件已保存到 {0}
zh_hant: 已將組態檔儲存到 {0}

# deployCluster.NewAKSWizardTitle
source: Deploy SQL Server 2019 Big Data Cluster on a new AKS cluster
de: SQL Server 2019-Big Data-Cluster in neuem AKS-Cluster bereitstellen
es: Implementar el clúster de macrodatos de SQL Server 2019 en un nuevo clúster de AKS
fr: Déployer le cluster Big Data SQL Server 2019 sur un nouveau cluster AKS
it: Distribuisci cluster Big Data di SQL Server 2019 in un nuovo cluster del servizio Azure Kubernetes
ja: 新しい AKS クラスターに SQL Server 2019 ビッグ データ クラスターをデプロイする
ko: 새 AKS 클러스터에 SQL Server 2019 빅 데이터 클러스터 배포
pt_br: Implantar o Cluster de Big Data do SQL Server 2019 em um novo cluster do AKS
ru: Развертывание кластера больших данных SQL Server 2019 в новом кластере AKS
zh_hans: 在新的 AKS 群集上部署 SQL Server 2019 大数据群集
zh_hant: 在新的 AKS 叢集上部署 SQL Server 2019 巨量資料叢集

# deployCluster.ExistingAKSWizardTitle
source: Deploy SQL Server 2019 Big Data Cluster on an existing AKS cluster
de: SQL Server 2019-Big Data-Cluster in vorhandenem AKS-Cluster bereitstellen
es: Implementar el clúster de metadatos de SQL Server 2019 en un clúster AKS existente
fr: Déployer le cluster Big Data SQL Server 2019 sur un cluster AKS existant
it: Distribuisci cluster Big Data di SQL Server 2019 in un cluster esistente del servizio Azure Kubernetes
ja: 既存の AKS クラスターに SQL Server 2019 ビッグ データ クラスターをデプロイする
ko: 기존 AKS 클러스터에 SQL Server 2019 빅 데이터 클러스터 배포
pt_br: Implantar o Cluster de Big Data do SQL Server 2019 em um cluster do AKS existente
ru: Развертывание кластера больших данных SQL Server 2019 в существующем кластере AKS
zh_hans: 在现有 AKS 群集上部署 SQL Server 2019 大数据群集
zh_hant: 在現有的 AKS 叢集上部署 SQL Server 2019 巨量資料叢集

# deployCluster.ExistingKubeAdm
source: Deploy SQL Server 2019 Big Data Cluster on an existing kubeadm cluster
de: SQL Server 2019-Big Data-Cluster in vorhandenem kubeadm-Cluster bereitstellen
es: Implementar el clúster de macrodatos de SQL Server 2019 en un clúster kubeadm existente
fr: Déployer le cluster Big Data SQL Server 2019 sur un cluster kubeadm existant
it: Distribuisci cluster Big Data di SQL Server 2019 in un cluster kubeadm esistente
ja: 既存の kubeadm クラスターに SQL Server 2019 ビッグ データ クラスターをデプロイします
ko: 기존 kubeadm 클러스터에 SQL Server 2019 빅 데이터 클러스터 배포
pt_br: Implantar o Cluster de Big Data do SQL Server 2019 em um cluster de kubeadm existente
ru: Развернуть кластер больших данных SQL Server 2019 в существующем кластере kubeadm
zh_hans: 在现有 kubeadm 群集上部署 SQL Server 2019 大数据群集
zh_hant: 在現有的 kubeadm 叢集上部署 SQL Server 2019 巨量資料叢集

# deployCluster.ExistingARO
source: Deploy SQL Server 2019 Big Data Cluster on an existing Azure Red Hat OpenShift cluster
de: SQL Server 2019-Big Data-Cluster in vorhandenem Azure Red Hat OpenShift-Cluster bereitstellen
es: Implementar clúster de macrodatos de SQL Server 2019 en un clúster de Red Hat OpenShift en Azure
fr: Déployer le cluster Big Data SQL Server 2019 sur un cluster Azure Red Hat OpenShift existant
it: Distribuisci cluster Big Data di SQL Server 2019 in un cluster Azure Red Hat OpenShift esistente
ja: 既存の Azure Red Hat OpenShift クラスターに SQL Server 2019 ビッグ データ クラスターをデプロイします
ko: 기존 Azure Red Hat OpenShift 클러스터에 SQL Server 2019 빅 데이터 클러스터 배포
pt_br: Implante o Cluster de Big Data do SQL Server 2019 em um cluster do Red Hat OpenShift no Azure existente
ru: Развернуть кластер больших данных SQL Server 2019 в существующем кластере Azure Red Hat OpenShift
zh_hans: 在现有 Azure Red Hat OpenShift 群集上部署 SQL Server 2019 大数据群集
zh_hant: 在現有的 Azure Red Hat OpenShift 叢集上部署 SQL Server 2019 巨量資料叢集

# deployCluster.ExistingOpenShift
source: Deploy SQL Server 2019 Big Data Cluster on an existing OpenShift cluster
de: SQL Server 2019-Big Data-Cluster in vorhandenem OpenShift-Cluster bereitstellen
es: Implementar clúster de macrodatos de SQL Server 2019 en un clúster de OpenShift
fr: Déployer le cluster Big Data SQL Server 2019 sur un cluster OpenShift existant
it: Distribuisci cluster Big Data di SQL Server 2019 in un cluster OpenShift esistente
ja: 既存の OpenShift クラスターに SQL Server 2019 ビッグ データ クラスターをデプロイします
ko: 기존 OpenShift 클러스터에 SQL Server 2019 빅 데이터 클러스터 배포
pt_br: Implante o Cluster de Big Data do SQL Server 2019 em um cluster do OpenShift existente
ru: Развернуть кластер больших данных SQL Server 2019 в существующем кластере OpenShift
zh_hans: 在现有 OpenShift 群集上部署 SQL Server 2019 大数据群集
zh_hant: 在現有的 OpenShift 叢集上部署 SQL Server 2019 巨量資料叢集

# deploymentDialog.ToolStatus.NotInstalled
source: Not Installed
de: Nicht installiert
es: Sin instalar
fr: Non installé
it: Non installato
ja: インストールされていません
ko: 설치되지 않음
pt_br: Não Instalado
ru: Не установлено
zh_hans: 未安装
zh_hant: 未安裝

# deploymentDialog.ToolStatus.Installed
source: Installed
de: Installiert
es: Instalado
fr: Installé
it: Installato
ja: インストール済み
ko: 설치됨
pt_br: Instalado
ru: Установлено
zh_hans: 已安装
zh_hant: 已安裝

# deploymentDialog.ToolStatus.Installing
source: Installing…
de: Wird installiert…
es: Instalación en curso…
fr: Installation…
it: Installazione…
ja: インストールしています...
ko: 설치하는 중...
pt_br: Instalando…
ru: Установка…
zh_hans: 正在安装…
zh_hant: 正在安裝…

# deploymentDialog.ToolStatus.Error
source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pt_br: Erro
ru: Ошибка
zh_hans: 错误
zh_hant: 錯誤

# deploymentDialog.ToolStatus.Failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
it: Non riuscito
ja: 失敗
ko: 실패
pt_br: Com falha
ru: Сбой
zh_hans: 失败
zh_hant: 失敗

# deploymentDialog.ToolInformationalMessage.Brew
source: • brew is needed for deployment of the tools and needs to be pre-installed before necessary tools can be deployed
de: • Brew ist für die Bereitstellung der Tools erforderlich und muss vorab installiert werden, damit die erforderlichen Tools bereitgestellt werden können.
es: • brew es necesario para la implementación de las herramientas y debe preinstalarse antes de que se puedan implementar las herramientas necesarias.
fr: • brew est nécessaire pour le déploiement des outils et doit être préinstallé pour pouvoir déployer les outils nécessaires
it: • brew è necessario per la distribuzione degli strumenti e deve essere pre-installato prima di poter distribuire gli strumenti necessari
ja: • brew はツールのデプロイに必要であり、必要なツールをデプロイする前に、事前インストールされている必要があります
ko: • brew는 도구를 배포하는 데 필요하며 필요한 도구를 배포하기 전에 미리 설치해야 합니다.
pt_br: • O brew é necessário na implantação das ferramentas e precisa ser pré-instalado antes que as ferramentas necessárias possam ser implantadas
ru: • средство brew необходимо для развертывания инструментов и должно быть установлено перед развертыванием необходимых инструментов
zh_hans: • 部署这些工具时需要 brew，并且需要预先安装它才能部署必要的工具
zh_hant: • 工具的部署需要 brew，而且必須預先安裝才能部署必要工具

# deploymentDialog.ToolInformationalMessage.Curl
source: • curl is needed for installation and needs to be pre-installed before necessary tools can be deployed
de: • Curl ist für die Installation erforderlich und muss vorab installiert werden, damit die erforderlichen Tools bereitgestellt werden können.
es: • curl es necesario para la instalación y debe preinstalarse antes de que se puedan implementar las herramientas necesarias.
fr: • curl est nécessaire pour l'installation et doit être préinstallé pour pouvoir déployer les outils nécessaires
it: • curl è necessario per l'installazione e deve essere pre-installato prima di poter distribuire gli strumenti necessari
ja: • curl はインストールに必要であり、必要なツールをデプロイする前に、事前インストールされている必要があります
ko: • curl은 설치에 필요하며 필요한 도구를 배포하기 전에 미리 설치해야 합니다.
pt_br: • O curl é necessário na instalação e precisa ser pré-instalado antes que as ferramentas necessárias possam ser implantadas
ru: • средство tcurl необходимо для установки и должно быть установлено перед развертыванием необходимых инструментов
zh_hans: • 安装需要 curl，并且需要预先安装它才能部署必要的工具
zh_hant: • 安裝需要 curl，而且必須預先安裝才能部署必要工具

# toolBase.getPip3InstallationLocation.LocationNotFound
source: Could not find 'Location' in the output:
de: "Location" wurde in der Ausgabe nicht gefunden:
es: No se puede encontrar "Location" en la salida:
fr: « Location » est introuvable dans la sortie :
it: Non è stato possibile trovare 'Location' nell'output:
ja: 出力に '場所' が見つかりませんでした:
ko: 출력에서 'Location'을 찾을 수 없습니다.
pt_br: Não foi possível encontrar 'Localização' na saída:
ru: Не удалось найти расположение (Location) в выходных данных:
zh_hans: 在输出中找不到“位置”:
zh_hant: 在輸出中找不到「位置」:

# toolBase.getPip3InstallationLocation.Output
source: output:
de: Ausgabe:
es: salida:
fr: sortie :
ja: 出力:
ko: 출력:
pt_br: saída:
ru: выходные данные:
zh_hans: 输出:
zh_hant: 輸出:

# toolBase.InstallError
source: Error installing tool '{0}' [ {1} ].{2}Error: {3}{2}See output channel '{4}' for more details
de: Fehler beim Installieren des Tools "{0}" [ {1} ].{2}Fehler: {3}{2}Weitere Informationen finden Sie im Ausgabekanal "{4}".
es: Error al instalar la herramienta "{0}" [ {1} ]. {2}Error: {3}{2}Consulte el canal de salida "{4}" para obtener más detalles.
fr: Erreur d'installation de l'outil « {0} » [ {1} ].{2}Erreur : {3}{2}Voir le canal de sortie « {4} » pour plus de détails
it: Errore durante l'installazione dello strumento '{0}' [ {1} ].{2}Errore: {3}{2}Per altri dettagli, vedere il canale di output '{4}'
ja: ツール '{0}' [{1}] のインストールでエラーが発生しました。{2}エラー: {3}{2}詳細については、出力チャネル '{4}' を参照してください
ko: '{0}'[{1}] 도구를 설치하는 동안 오류가 발생했습니다. {2}오류: {3}{2}자세한 내용은 출력 채널 '{4}'을(를) 참조하세요.
pt_br: Erro ao instalar a ferramenta '{0}' [ {1} ].{2}Erro: {3}{2}Confira o canal de saída '{4}' para obter mais detalhes
ru: Ошибка при установке средства "{0}" [{1}].{2}Ошибка: {3}{2}Дополнительные сведения см. в канале вывода "{4}"
zh_hans: 安装工具“{0}”[{1}]时出错。{2}错误: {3}{2}有关详细信息，请参阅输出通道“{4}”
zh_hant: 安裝工具 '{0}' [ {1} ] 時發生錯誤。{2}錯誤: {3}{2}如需詳細資料，請參閱輸出通道 '{4}'

# toolBase.InstallErrorInformation
source: Error installing tool. See output channel '{0}' for more details
de: Fehler beim Installieren des Tools. Weitere Informationen finden Sie im Ausgabekanal "{0}".
es: Error al instalar la herramienta. Consulte el canal de salida "{0}" para obtener más detalles.
fr: Erreur d'installation de l'outil. Voir le canal de sortie « {0} » pour plus de détails
it: Errore durante l'installazione dello strumento. Per altri dettagli, vedere il canale di output '{0}'
ja: ツールのインストールでエラーが発生しました。詳細については、出力チャネル '{0}' を参照してください
ko: 도구를 설치하는 동안 오류가 발생했습니다. 자세한 내용은 출력 채널 '{0}'을(를) 참조하세요.
pt_br: Erro ao instalar a ferramenta. Confira o canal de saída '{0}' para obter mais detalhes
ru: Ошибка при установке инструмента. Дополнительные сведения см. в канале вывода "{0}"
zh_hans: 安装工具时出错。有关详细信息，请参阅输出通道“{0}”
zh_hant: 安裝工具時發生錯誤。如需詳細資料，請參閱輸出通道 '{0}'

# toolBase.InstallFailed
source: Installation commands completed but version of tool '{0}' could not be detected so our installation attempt has failed. Detection Error: {1}{2}Cleaning up previous installations would help.
de: Die Installationsbefehle wurden durchgeführt, aber die Version des Tools ({0}) wurde nicht gefunden. Daher ist bei der Installation ein Fehler aufgetreten. Erkennungsfehler: {1}{2}Bereinigen Sie vorherige Installationen, um das Problem zu beheben.
es: Los comandos de la instalación se han completado, pero no se ha podido detectar la versión de la herramienta "{0}", por lo que el intento ha sido erróneo. Error de detección: {1}{2}La limpieza de las instalaciones anteriores podría resultar útil.
fr: Commandes d'installation exécutées, mais impossible de détecter la version de l'outil « {0} ». La tentative d'installation a donc échoué. Erreur de détection : {1}{2}Essayez de nettoyer les installations précédentes.
it: I comandi di installazione sono stati completati ma non è stato possibile rilevare la versione dello strumento '{0}', quindi il tentativo di installazione non è riuscito. Errore di rilevamento: {1}{2}Può essere utile pulire le installazioni precedenti.
ja: インストール コマンドは完了しましたが、ツール '{0}' のバージョンを検出できなかったため、インストール試行に失敗しました。検出エラー: {1}{2}以前のインストールをクリーンアップすると役立つことがあります。
ko: 설치 명령이 완료되었지만 '{0}' 도구의 버전을 검색할 수 없어서 설치하지 못했습니다. 검색 오류: {1}{2}이전 설치를 정리하는 것이 도움이 됩니다.
pt_br: Os comandos de instalação foram concluídos, mas a versão da ferramenta '{0}' não pôde ser detectada, portanto, houve uma falha na tentativa de instalação. Erro de detecção: {1}{2}Limpar instalações anteriores pode ajudar.
ru: Команды установки завершены, но не удалось обнаружить версию средства "{0}", поэтому попытка установки завершилась сбоем. Ошибка обнаружения: {1}{2}Чтобы устранить эту проблему, удалите предыдущие установленные версии.
zh_hans: 安装命令已完成，但无法检测到工具版本“{0}”，因此安装尝试失败。检测错误: {1}{2}清除以前的安装会有所帮助。
zh_hant: 安裝命令已完成，但無法偵測工具 '{0}' 的版本，因此嘗試安裝失敗。偵測錯誤: {1}{2}清除先前的安裝可改善情況。

# toolBase.InstallFailInformation
source: Failed to detect version post installation. See output channel '{0}' for more details
de: Fehler beim Ermitteln der Version nach der Installation. Weitere Informationen finden Sie im Ausgabekanal "{0}".
es: No se pudo detectar la versión posterior a la instalación. Consulte el canal de salida "{0}" para obtener más detalles.
fr: La détection de la version après l'installation a échoué. Voir le canal de sortie « {0} » pour plus de détails
it: Non è stato possibile rilevare la versione dopo l'installazione. Per altri dettagli, vedere il canale di output '{0}'
ja: バージョン ポストのインストールを検出できませんでした。詳細については、出力チャネル '{0}' を参照してください
ko: 설치 후 버전을 검색하지 못했습니다. 자세한 내용은 출력 채널 '{0}'을(를) 참조하세요.
pt_br: Falha ao detectar a versão após a instalação. Confira o canal de saída '{0}' para obter mais detalhes
ru: Не удалось определить версию после установки. Дополнительные сведения см. в канале вывода "{0}"
zh_hans: 未能检测到安装后的版本。有关详细信息，请参阅输出通道“{0}”
zh_hant: 無法偵測安裝後的版本。如需詳細資料，請參閱輸出通道 '{0}'

# toolBase.ManualUninstallCommand
source: A possibly way to uninstall is using this command:{0} >{1}
de: Zur Deinstallation kann beispielsweise folgender Befehl verwendet werden: {0} >{1}
es: Una manera de realizar la desinstalación es mediante este comando:{0} >{1}
fr: Vous pouvez effectuer la désinstallation à l'aide de cette commande : {0} >{1}
it: Un modo possibile per eseguire la disinstallazione è usare questo comando: {0} >{1}
ja: アンインストールの可能性のある方法はこのコマンドを使用することです: {0} >{1}
ko: 제거할 수 있는 방법은 {0} >{1} 명령을 사용하는 것입니다.
pt_br: Um modo possível de desinstalar é usando este comando:{0} >{1}
ru: Для удаления можно выполнить следующую команду:{0} >{1}
zh_hans: 一种可行的卸载方法是使用以下命令: {0} >{1}
zh_hant: 使用此命令是可行的解除安裝方法:{0} >{1}

# toolBase.SeeOutputChannel
source: {0}See output channel '{1}' for more details
de: {0}Weitere Informationen finden Sie im Ausgabekanal "{1}".
es: {0}Consulte el canal de salida "{1}" para obtener más detalles.
fr: {0}Voir le canal de sortie « {1} » pour plus de détails
it: Per altri dettagli, {0}vedere il canale di output '{1}'
ja: {0}詳細については、出力チャネル '{1}' を参照してください
ko: {0}자세한 내용은 출력 채널 '{1}' 참조
pt_br: {0}Confira o canal de saída '{1}' para obter mais detalhes
ru: {0}Дополнительные сведения см. в канале вывода "{1}"
zh_hans: {0}有关详细信息，请参阅输出通道“{1}”
zh_hant: {0}如需詳細資料，請參閱輸出通道 '{1}'

# toolBase.installCore.CannotInstallTool
source: Cannot install tool:{0}::{1} as installation commands are unknown for your OS distribution, Please install {0} manually before proceeding
de: Die Installation des Tools ist nicht möglich:{0}::{1}. Die Installationsbefehle sind für Ihre Distribution des Betriebssystems unbekannt. Installieren Sie "{0}" manuell, bevor Sie fortfahren.
es: No se puede instalar tool:{0}::{1}, ya que los comandos de instalación son desconocidos para la distribución de su sistema operativo. Instale {0} manualmente antes de continuar.
fr: Impossible d'installer l'outil : {0}::{1}, car les commandes d'installation sont inconnues pour la distribution de votre système d'exploitation. Installez {0} manuellement avant de continuer
it: Non è possibile installare lo strumento: {0}::{1} poiché i comandi di installazione sono sconosciuti per la distribuzione del sistema operativo. Installare {0} manualmente prima di procedere
ja: OS ディストリビューションにインストール コマンドが認識されないため、ツール {0}::{1} をインストールできません。続行する前に {0} を手動でインストールしてください
ko: OS 배포를 위한 설치 명령을 알 수 없으므로 {0}::{1} 도구를 설치할 수 없습니다. 계속하기 전에 {0}을(를) 수동으로 설치하세요.
pt_br: Não é possível instalar a ferramenta {0}::{1}, pois os comandos de instalação são desconhecidos pela sua distribuição de SO. Instale o {0} manualmente antes de continuar
ru: Не удается установить инструмент {0}::{1}, так как команды установки являются неизвестными для вашего дистрибутива ОС. Установите {0} вручную, чтобы продолжить
zh_hans: 无法安装工具:{0}::{1}，因为安装命令对于你的 OS 分发是未知的。请先手动安装 {0}，然后再继续操作
zh_hant: 因為 OS 發行版的安裝命令未知，所以無法安裝工具:{0}::{1}。請手動安裝 {0} 後再繼續

# toolBase.addInstallationSearchPathsToSystemPath.SearchPaths
source: Search Paths for tool '{0}': {1}
de: Suchpfade für Tool "{0}": {1}
es: Buscar rutas de acceso para la herramienta "{0}": {1}
fr: Chemins de recherche de l'outil « {0} » : {1}
it: Percorsi di ricerca per lo strumento '{0}': {1}
ja: ツール '{0}' の検索パス: {1}
ko: '{0}' 도구의 검색 경로: {1}
pt_br: Caminhos de pesquisa para a ferramenta '{0}': {1}
ru: Пути поиска для инструмента "{0}": {1}
zh_hans: 工具“{0}”的搜索路径: {1}
zh_hant: 工具 '{0}' 的搜尋路徑: {1}

# deployCluster.GetToolVersionErrorInformation
source: Error retrieving version information. See output channel '{0}' for more details
de: Fehler beim Abrufen der Versionsinformationen. Weitere Informationen finden Sie im Ausgabekanal "{0}".
es: Error al recuperar la información de la versión. Consulte el canal de salida "{0}" para obtener más detalles.
fr: Erreur de récupération des informations de version. Voir le canal de sortie « {0} » pour plus de détails
it: Errore durante il recupero delle informazioni sulla versione. Per altri dettagli, vedere il canale di output '{0}'
ja: バージョン情報の取得でエラーが発生しました。詳細については、出力チャネル '{0}' を参照してください
ko: 버전 정보를 검색하는 동안 오류가 발생했습니다. 자세한 내용은 출력 채널 '{0}'을(를) 참조하세요.
pt_br: Erro ao recuperar as informações da versão. Confira o canal de saída '{0}' para obter mais detalhes
ru: Ошибка при получении сведений о версии. Дополнительные сведения см. в канале вывода "{0}"
zh_hans: 检索版本信息时出错。有关详细信息，请参阅输出通道“{0}”
zh_hant: 擷取版本資訊時發生錯誤。如需詳細資料，請參閱輸出通道 '{0}'

# deployCluster.GetToolVersionError
source: Error retrieving version information.{0}Invalid output received, get version command output: '{1}'
de: Fehler beim Abrufen der Versionsinformationen.{0}Ungültige Ausgabe empfangen, Versionsbefehlsausgabe abrufen: {1}
es: Error al recuperar la información de la versión. {0}Se ha recibido una salida no válida; salida del comando GET de la versión: "{1}".
fr: Erreur de récupération des informations de version.{0}Sortie non valide reçue, sortie de la commande get version : « {1} »
it: Errore durante il recupero delle informazioni sulla versione.{0}È stato ricevuto un output non valido. Ottenere l'output del comando della versione: '{1}'
ja: バージョン情報の取得でエラーが発生しました。{0}無効な出力を受け取りました。バージョン取得コマンドの出力: '{1}'
ko: 버전 정보를 검색하는 동안 오류가 발생했습니다. {0}잘못된 출력이 수신되었습니다. 버전 명령 출력 '{1}'을(를) 가져옵니다.
pt_br: Erro ao recuperar informações de versão.{0}Saída inválida recebida, obtenha a saída do comando da versão: '{1}'
ru: Ошибка при получении сведений о версии.{0}Получены недопустимые выходные данные, выходные данные команды get version: "{1}"
zh_hans: 检索版本信息时出错。{0}收到无效输出，获取版本命令输出:“{1}”
zh_hant: 擷取版本資訊時發生錯誤。{0}接收到的輸出無效，請取得版本命令輸出: '{1}'

# deployAzureSQLDB.NewSQLDBTitle
source: Deploy Azure SQL DB
de: Azure SQL-Datenbank bereitstellen
es: Implementación de una base de datos de Azure SQL
fr: Déployer Azure SQL DB
it: Distribuisci database SQL di Azure
ja: Azure SQL DB のデプロイ
ko: Azure SQL DB 배포
pt_br: Implantar o BD SQL do Azure
ru: Развертывание Базы данных SQL Azure
zh_hans: 部署 Azure SQL DB
zh_hant: 部署 Azure SQL DB

# deployAzureSQLDB.ScriptToNotebook
source: Script to Notebook
de: Skript in Notebook schreiben
es: De script a cuaderno
fr: Exécuter un script sur un notebook
it: Genera script nel notebook
ja: ノートブックへのスクリプト
ko: Notebook으로 스크립트
pt_br: Script para o Notebook
ru: Скрипт в записную книжку
zh_hans: 脚本到笔记本
zh_hant: 編寫指令碼到筆記本

# deployAzureSQLDB.MissingRequiredInfoError
source: Please fill out the required fields marked with red asterisks.
de: Füllen Sie die mit einem roten Sternchen markierten Pflichtfelder aus.
es: Rellene los campos obligatorios marcados con asteriscos rojos.
fr: Remplissez les champs obligatoires marqués d'un astérisque rouge.
it: Compilare i campi obbligatori contrassegnati con asterischi rossi.
ja: 赤いアスタリスクでマークされた必須フィールドに入力してください。
ko: 빨간색 별표가 표시된 필수 필드를 입력하세요.
pt_br: Preencha os campos obrigatórios marcados com asteriscos vermelhos.
ru: Заполните обязательные поля, отмеченные красными звездочками.
zh_hans: 请填写标有红色星号的必填字段。
zh_hant: 請填寫標有紅色星號的必要欄位。

# deployAzureSQLDB.AzureSettingsPageTitle
source: Azure SQL Database - Azure account settings
de: Azure SQL-Datenbank – Azure-Kontoeinstellungen
es: Azure SQL Database: configuración de la cuenta de Azure
fr: Azure SQL Database - Paramètres de compte Azure
it: Database SQL di Azure - Impostazioni dell'account Azure
ja: Azure SQL Database - Azure アカウント設定
ko: Azure SQL Database - Azure 계정 설정
pt_br: Banco de Dados SQL do Azure – Configurações da conta do Azure
ru: База данных SQL Azure — параметры учетной записи Azure
zh_hans: Azure SQL 数据库 - Azure 帐户设置
zh_hant: Azure SQL Database - Azure 帳戶設定

# deployAzureSQLDB.AzureSettingsSummaryPageTitle
source: Azure account settings
de: Azure-Kontoeinstellungen
es: Opciones de la cuenta de Azure
fr: Paramètres de compte Azure
it: Impostazioni dell'account Azure
ja: Azure アカウント設定
ko: Azure 계정 설정
pt_br: Configurações de conta do Azure
ru: Параметры учетной записи Azure
zh_hans: Azure 帐户设置
zh_hant: Azure 帳戶設定

# deployAzureSQLDB.AzureAccountDropdownLabel
source: Azure account
de: Azure-Konto
es: Cuenta de Azure
fr: Compte Azure
it: Account Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Conta do Azure
ru: Учетная запись Azure
zh_hans: Azure 帐户
zh_hant: Azure 帳戶

# deployAzureSQLDB.AzureSubscriptionDropdownLabel
source: Subscription
de: Abonnement
es: Suscripción
fr: Abonnement
it: Sottoscrizione
ja: サブスクリプション
ko: 구독
pt_br: Assinatura
ru: Подписка
zh_hans: 订阅
zh_hant: 訂閱

# deployAzureSQLDB.AzureDatabaseServersDropdownLabel
source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器

# deployAzureSQLDB.ResourceGroup
source: Resource group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# deployAzureSQLDB.DatabaseSettingsPageTitle
source: Database settings
de: Datenbankeinstellungen
es: Configuración de la base de datos
fr: Paramètres de base de données
it: Impostazioni database
ja: データベースの設定
ko: 데이터베이스 설정
pt_br: Configurações do banco de dados
ru: Параметры базы данных
zh_hans: 数据库设置
zh_hant: 資料庫設定

# deployAzureSQLDB.FirewallRuleNameLabel
source: Firewall rule name
de: Name der Firewallregel
es: Nombre de la regla de firewall
fr: Nom de la règle de pare-feu
it: Nome regola del firewall
ja: ファイアウォール規則名
ko: 방화벽 규칙 이름
pt_br: Nome da regra de firewall
ru: Имя правила брандмауэра
zh_hans: 防火墙规则名称
zh_hant: 防火牆規則名稱

# deployAzureSQLDB.DatabaseNameLabel
source: SQL database name
de: SQL-Datenbank-Name
es: Nombre de la base de datos SQL
fr: Nom de la base de données SQL
it: Nome del database SQL
ja: SQL データベース名
ko: SQL 데이터베이스 이름
pt_br: Nome do banco de dados SQL
ru: Имя базы данных SQL
zh_hans: SQL 数据库名称
zh_hant: SQL 資料庫名稱
