Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# azure.account.subscription
source: Subscription (selected subset)
de: Abonnement (ausgewählte Teilmenge)
es: Suscripción (subconjunto seleccionado)
fr: Abonnement (sous-ensemble sélectionné)
it: Sottoscrizione (subset selezionato)
ja: サブスクリプション (選択されたサブセット)
ko: 구독(선택한 하위 집합)
pt_br: Assinatura (subconjunto selecionado)
ru: Подписка (выбранное подмножество)
zh_hans: 订阅(所选子集)
zh_hant: 訂閱 (選取的子集)

# azure.account.subscriptionDescription
source: Change the currently selected subscriptions through the 'Select Subscriptions' action on an account listed in the 'Azure' tree view of the 'Connections' viewlet
de: Ändern Sie über die Aktion "Abonnements auswählen" die aktuelle Auswahl an Abonnements für ein Konto, das in der Azure-Strukturansicht des Viewlet "Verbindungen" aufgeführt ist.
es: Cambie las suscripciones seleccionadas actualmente mediante la acción "Seleccionar suscripciones" en una cuenta que aparezca en la vista de árbol "Azure" del viewlet "Conexiones".
fr: Changer les abonnements actuellement sélectionnés par le biais de l'action « Sélectionner des abonnements » dans un compte listé dans l'arborescence « Azure » de la viewlet « Connexions »
it: Modificare le sottoscrizioni attualmente selezionate tramite l'azione 'Seleziona sottoscrizioni' in un account elencato nella visualizzazione albero 'Azure' del viewlet 'Connessioni'
ja: '接続' ビューレットの 'Azure' ツリー ビューに一覧表示されているアカウントに対して、'サブスクリプションの選択' アクションから、現在選択されているサブスクリプションを変更します
ko: '연결' 뷰렛의 'Azure' 트리 뷰에 나열된 계정의 '구독 선택' 작업을 통해 현재 선택된 구독 변경
pt_br: Altere as assinaturas atualmente selecionadas por meio da ação 'Selecionar Assinaturas' em uma conta listada no modo de exibição de árvore 'Azure' do viewlet 'Conexões'
ru: Измените текущие выбранные подписки с помощью действия "Выбрать подписки" в учетной записи, указанной в представлении дерева Azure во вьюлете "Подключения"
zh_hans: 在“连接”Viewlet 的 "Azure" 树状视图中列出的帐户上，通过“选择订阅”操作更改当前所选订阅
zh_hant: 在列入 [連線] viewlet 之 [Azure] 樹狀檢視中的帳戶上，透過 [選取訂閱] 動作變更目前選取的訂閱

# azure.account.resourceGroup
source: Resource Group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de Recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# azure.account.location
source: Azure Location
de: Azure-Standort
es: Ubicación de Azure
fr: Localisation Azure
it: Località di Azure
ja: Azure の場所
ko: Azure 위치
pt_br: Localização do Azure
ru: Расположение Azure
zh_hans: Azure 位置
zh_hant: Azure 位置

# filePicker.browse
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
pt_br: Procurar
ru: Обзор
zh_hans: 浏览
zh_hant: 瀏覽

# button.label
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

# kubeConfigClusterPicker.kubeConfigFilePath
source: Kube config file path
de: Pfad der kube-Konfigurationsdatei
es: Ruta de acceso al archivo de configuración de Kube
fr: Chemin du fichier de configuration Kube
it: Percorso del file di configurazione kube
ja: Kube 構成のファイル パス
ko: Kube 구성 파일 경로
pt_br: Caminho do arquivo de configuração de Kube
ru: Путь к файлу kube config
zh_hans: Kube 配置文件路径
zh_hant: Kube 設定檔路徑

# kubeConfigClusterPicker.clusterContextNotFound
source: No cluster context information found
de: Keine Informationen zum Clusterkontext gefunden.
es: No se ha encontrado información de contexto del clúster.
fr: Aucune information de contexte de cluster
it: Non sono state trovate informazioni sul contesto del cluster
ja: クラスター コンテキスト情報が見つかりません
ko: 클러스터 컨텍스트 정보를 찾을 수 없음
pt_br: Nenhuma informação de contexto de cluster encontrada
ru: Сведения о контексте кластера не найдены
zh_hans: 未找到任何群集上下文信息
zh_hant: 找不到任何叢集內容資訊

# azure.signin
source: Sign in…
de: Anmelden…
es: Iniciar sesión…
fr: Connexion…
it: Accedi…
ja: サインイン…
ko: 로그인…
pt_br: Entrar…
ru: Войти…
zh_hans: 登录…
zh_hant: 登入…

# azure.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
ru: Обновить
zh_hans: 刷新
zh_hant: 重新整理

# azure.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# azure.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# azure.resourceGroup.createNewResourceGroup
source: Create a new resource group
de: Eine neue Ressourcengruppe erstellen
es: Crear un nuevo grupo de recursos
fr: Créer un groupe de ressources
it: Crea un nuovo gruppo di risorse
ja: 新しいリソース グループの作成
ko: 새 리소스 그룹 만들기
pt_br: Criar um novo grupo de recurso
ru: Создать группу ресурсов
zh_hans: 创建新资源组
zh_hant: 建立新的資源群組

# azure.resourceGroup.NewResourceGroupAriaLabel
source: New resource group name
de: Name der neuen Ressourcengruppe
es: Nuevo nombre de grupo de recursos
fr: Nom du nouveau groupe de ressources
it: Nuovo nome del gruppo di risorse
ja: 新しいリソース グループ名
ko: 새 리소스 그룹 이름
pt_br: Nome do novo grupo de recursos
ru: Новое имя группы ресурсов
zh_hans: 新资源组名称
zh_hant: 新的資源群組名稱

# deployCluster.Realm
source: Realm
de: Bereich
es: Dominio
fr: Domaine
it: Area di autenticazione
ja: 領域
ko: 영역
ru: Область
zh_hans: 领域
zh_hant: 領域

# UnknownFieldTypeError
source: Unknown field type: "{0}"
de: Unbekannter Feldtyp: "{0}"
es: Tipo de campo desconocido: "{0}"
fr: Type de champ inconnu : "{0}"
it: Tipo di campo sconosciuto: "{0}"
ja: 不明なフィールドの種類: "{0}"
ko: 알 수 없는 필드 형식: "{0}"
pt_br: Tipo de campo desconhecido: "{0}"
ru: Неизвестный тип поля: "{0}"
zh_hans: 未知字段类型:“{0}”
zh_hant: 未知的欄位類型: “{0}"

# optionsSource.alreadyDefined
source: Options Source with id:{0} is already defined
de: Die Optionsquelle mit ID "{0}" ist bereits definiert.
es: El origen de las opciones con el identificador {0} ya está definido.
fr: La source d'options avec l'ID : {0} est déjà définie
it: L'origine opzioni con ID: {0} è già stata definita
ja: ID {0} のオプション ソースは既に定義されています
ko: ID가 {0}인 옵션 원본이 이미 정의되어 있습니다.
pt_br: A Fonte de Opções com a ID {0} já está definida
ru: Источник параметров с идентификатором {0} уже определен
zh_hans: 已定义 ID 为 {0} 的选项源
zh_hant: 已定義識別碼為 {0} 的選項來源

# valueProvider.alreadyDefined
source: Value Provider with id:{0} is already defined
de: Der Wertanbieter mit ID "{0}" ist bereits definiert.
es: Ya se ha definido un valor de proveedor con el id. {0}.
fr: Le fournisseur de valeur avec l'ID : {0} est déjà défini
it: Il provider di valori con ID: {0} è già stato definito
ja: ID {0} の値プロバイダーは既に定義されています
ko: ID가 {0}인 값 공급자가 이미 정의되어 있습니다.
pt_br: O Provedor de Valor com a ID {0} já está definido
ru: Поставщик значения с идентификатором {0} уже определен
zh_hans: 已定义 ID 为 {0} 的值提供程序
zh_hant: 已定義識別碼為 {0} 的值提供者

# optionsSource.notDefined
source: No Options Source defined for id: {0}
de: Für die ID "{0}" wurde keine Optionsquelle definiert.
es: No se ha definido ningún origen de opciones para el id. {0}.
fr: Aucune source d'options définie pour l'ID : {0}
it: Nessuna origine opzioni definita per l'ID: {0}
ja: ID {0} のオプション ソースが定義されていません
ko: {0} ID에 대해 정의된 옵션 원본 없음
pt_br: Nenhuma Fonte de Opções definida para a ID: {0}
ru: Источник параметров для идентификатора {0} не определен
zh_hans: 没有为 ID {0} 定义选项源
zh_hant: 未對識別碼 {0} 定義任何選項來源

# valueProvider.notDefined
source: No Value Provider defined for id: {0}
de: Für die ID "{0}" wurde kein Wertanbieter definiert.
es: No se ha definido ningún valor de proveedor para el id. {0}.
fr: Aucun fournisseur de valeur défini pour l'ID : {0}
it: Nessun provider di valori definito per l'ID: {0}
ja: ID {0} の値プロバイダーが定義されていません
ko: {0} ID에 대해 정의된 값 공급자 없음
pt_br: Nenhum Provedor de Valor foi definido para a ID: {0}
ru: Для идентификатора {0} не определен поставщик значения
zh_hans: 没有为 ID {0} 定义值提供程序
zh_hant: 未對識別碼 {0} 定義任何值提供者

# getVariableValue.unknownVariableName
source: Attempt to get variable value for unknown variable:{0}
de: Es wird versucht, den Variablenwert für eine unbekannte Variable abzurufen: {0}
es: Intento de obtener un valor de variable para una variable desconocida: {0}
fr: Tentative d'obtention de la valeur de variable pour une variable inconnue : {0}
it: Tentativo di ottenere il valore della variabile per la variabile sconosciuta: {0}
ja: 不明な変数 {0} の変数値の取得を試みます
ko: 알 수 없는 변수 {0}의 변수 값을 가져오려고 시도합니다.
pt_br: Tentativa de obter o valor de variável para a variável desconhecida: {0}
ru: Попытка получить значение переменной для неизвестной переменной: {0}
zh_hans: 尝试获取未知变量的变量值: {0}
zh_hant: 嘗試取得未知變數 {0} 的變數值

# getIsPassword.unknownVariableName
source: Attempt to get isPassword for unknown variable:{0}
de: Es wird versucht, "isPassword" für eine unbekannte Variable abzurufen: {0}
es: Intento de obtener isPassword para una variable desconocida: {0}
fr: Tentative d'obtention de isPassword pour une variable inconnue : {0}
it: Tentativo di ottenere isPassword per la variabile sconosciuta: {0}
ja: 不明な変数 {0} の isPassword の取得を試みます
ko: 알 수 없는 변수 {0}의 isPassword를 가져오려고 시도합니다.
pt_br: Tentativa de obter isPassword para uma variável desconhecida: {0}
ru: Попытка получить пароль (isPassword) для неизвестной переменной: {0}
zh_hans: 尝试获取未知变量的 isPassword: {0}
zh_hant: 嘗試取得未知變數 {0} 的 isPassword

# optionsNotDefined
source: FieldInfo.options was not defined for field type: {0}
de: "FieldInfo.options" wurde für folgenden Feldtyp nicht definiert: {0}
es: FieldInfo.options no se ha definido para el tipo de campo {0}.
fr: FieldInfo.options n'a pas été défini pour le type de champ : {0}
it: FieldInfo.options non è stato definito per il tipo di campo: {0}
ja: フィールドの種類に FieldInfo.options が定義されていません: {0}
ko: FieldInfo.options가 필드 형식 {0}에 대해 정의되지 않았습니다.
pt_br: FieldInfo.options não foi definido para o tipo de campo: {0}
ru: Объект FieldInfo.options не определен для типа поля: {0}
zh_hans: 没有为字段类型 {0} 定义 FieldInfo.options
zh_hant: 未對欄位類型 {0} 定義 FieldInfo.options

# optionsNotObjectOrArray
source: FieldInfo.options must be an object if it is not an array
de: "FieldInfo.options" muss ein Objekt sein, wenn es sich nicht um ein Array handelt.
es: FieldInfo.options debe ser un objeto si no es una matriz.
fr: FieldInfo.options doit être un objet s'il ne s'agit pas d'un tableau
it: FieldInfo.options deve essere un oggetto se non è una matrice
ja: FieldInfo.options は、配列でない場合にオブジェクトである必要があります
ko: FieldInfo.options는 배열이 아닌 경우 개체여야 합니다.
pt_br: FieldInfo.options precisa ser um objeto se não for uma matriz
ru: FieldInfo.options должен быть объектом, если он не является массивом
zh_hans: 如果 FieldInfo.options 不是数组，则它必须是一个对象
zh_hant: 若 FieldInfo.options 並非陣列，則一定是物件

# optionsTypeNotFound
source: When FieldInfo.options is an object it must have 'optionsType' property
de: Wenn "FieldInfo.options" ein Objekt ist, muss es die Eigenschaft "optionsType" aufweisen.
es: Si FieldInfo.options es un objeto, debe tener la propiedad "optionsType".
fr: Quand FieldInfo.options est un objet, il doit avoir la propriété « optionsType »
it: Quando FieldInfo.options è un oggetto, deve avere la proprietà 'optionsType'
ja: FieldInfo.options がオブジェクトである場合、'optionsType' プロパティが必要です
ko: FieldInfo.options가 개체인 경우 'optionsType' 속성을 포함해야 합니다.
pt_br: Quando FieldInfo.options for um objeto, ele precisará ter a propriedade 'optionsType'
ru: Если FieldInfo.options является объектом, он должен иметь свойство optionsType
zh_hans: 如果 FieldInfo.options 是一个对象，它必须具有 "optionsType" 属性
zh_hant: 當 FieldInfo.options 為物件時，其必須具有 'optionsType' 屬性

# optionsTypeRadioOrDropdown
source: When optionsType is not {0} then it must be {1}
de: Wenn "optionsType" nicht "{0}" ist, muss er "{1}" lauten.
es: Si optionsType no es {0}, debe ser {1}.
fr: Quand optionsType n'est pas {0}, il doit être {1}
it: Quando optionsType non è {0}, deve essere {1}
ja: optionsType が {0} でない場合、{1} である必要があります
ko: optionsType이 {0}이(가) 아니면 {1}이어야 합니다.
pt_br: Quando optionsType não for {0}, ele precisará ser {1}
ru: Если optionsType не равен {0}, он должен быть равен {1}
zh_hans: 如果 optionsType 不是 {0}，则它必须是 {1}
zh_hant: 若 optionsType 並非 {0}，則一定是 {1}

# azdataEulaNotAccepted
source: Deployment cannot continue. Azure Data CLI license terms have not yet been accepted. Please accept the EULA to enable the features that requires Azure Data CLI.
de: Die Bereitstellung kann nicht fortgesetzt werden. Die Lizenzbedingungen für die Azure Data CLI wurden noch nicht akzeptiert. Akzeptieren Sie die Lizenzbedingungen, um die Features zu aktivieren, für die die Azure Data CLI erforderlich ist.
es: La implementación no puede continuar. Aún no se han aceptado los términos de licencia de la CLI de datos de Azure. Acepte el CLUF para habilitar las características que requieren la CLI de datos de Azure.
fr: Le déploiement ne peut pas continuer. Les termes du contrat de licence Azure Data CLI n'ont pas encore été acceptés. Acceptez le CLUF pour activer les fonctionnalités nécessitant Azure Data CLI.
it: La distribuzione non può continuare. Le condizioni di licenza dell'interfaccia della riga di comando di Azure Data non sono ancora state accettate. Accettare il contratto di licenza per abilitare le funzionalità che richiedono l'interfaccia della riga di comando di Azure Data.
ja: デプロイを続行できません。Azure Data CLI ライセンス条項にまだ同意していません。Azure Data CLI を必要とする機能を有効にするには、EULA に同意してください。
ko: 배포를 계속할 수 없습니다. Azure Data CLI 사용 조건에 아직 동의하지 않았습니다. Azure Data CLI가 필요한 기능을 사용하려면 EULA에 동의하세요.
pt_br: A implantação não pode continuar. Os termos de licença da CLI de Dados do Azure ainda não foram aceitos. Aceite os Termos de Licença para Software Microsoft para habilitar os recursos que exigem a CLI de Dados do Azure.
ru: Продолжение развертывания невозможно. Условия лицензии Azure Data CLI еще не приняты. Примите условия лицензионного соглашения, чтобы включить функции, требующие использования Azure Data CLI.
zh_hans: 部署无法继续。Azure 数据 CLI 许可条款尚未被接受。请接受 EULA 以启用需要 Azure 数据 CLI 的功能。
zh_hant: 部署無法繼續。尚未接受 Azure Data CLI 授權條款。請接受 EULA 以啟用需要 Azure Data CLI 的功能。

# azdataEulaDeclined
source: Deployment cannot continue. Azure Data CLI license terms were declined.You can either Accept EULA to continue or Cancel this operation
de: Die Bereitstellung kann nicht fortgesetzt werden. Die Lizenzbedingungen für die Azure Data CLI wurden abgelehnt. Sie können entweder die Lizenzbedingungen akzeptieren, um den Vorgang fortzusetzen, oder den Vorgang abbrechen.
es: La implementación no puede continuar. Se han rechazado los términos de licencia de la CLI de datos de Azure. Puede aceptar el CLUF para continuar o cancelar esta operación.
fr: Le déploiement ne peut pas continuer. Les termes du contrat de licence d'Azure Data CLI ont été refusés. Vous pouvez accepter le CLUF pour continuer ou annuler cette opération
it: La distribuzione non può continuare. Le condizioni di licenza dell'interfaccia della riga di comando di Azure Data sono state rifiutate. È possibile accettare il contratto di licenza per continuare oppure annullare questa operazione
ja: デプロイを続行できません。Azure Data CLI のライセンス条項が拒否されました。EULA に同意して続行するか、この操作を取り消すことができます
ko: 배포를 계속할 수 없습니다. Azure Data CLI 사용 조건이 거부되었습니다. EULA에 동의하여 계속하거나 이 작업을 취소할 수 있습니다.
pt_br: A implantação não pode continuar. Os termos de licença da CLI de Dados do Azure foram recusados. Você pode aceitar os Termos de Licença para Software Microsoft para continuar ou cancelar esta operação
ru: Продолжение развертывания невозможно. Условия лицензии Azure Data CLI были отклонены. Вы можете принять условия лицензионного соглашения или отменить эту операцию, нажав кнопку "Отмена"
zh_hans: 部署无法继续。Azure 数据 CLI 许可条款被拒绝。你可以接受 EULA 以继续，也可以取消此操作
zh_hant: 部署無法繼續。Azure Data CLI 授權條款遭到拒絕。您可以接受 EULA 以繼續，或是取消此作業

# deploymentDialog.RecheckEulaButton
source: Accept EULA & Select
de: Lizenzbedingungen akzeptieren und auswählen
es: Aceptar CLUF y seleccionar
fr: Accepter le CLUF et sélectionner
it: Accetta contratto di licenza e seleziona
ja: EULA に同意して選択
ko: EULA에 동의 및 선택
pt_br: Aceitar os Termos de Licença para Software Microsoft e Selecionar
ru: Принять лицензионное соглашение и выбрать
zh_hans: 接受 EULA 并选择
zh_hant: 接受 EULA 並選取

# resourceDeployment.extensionRequiredPrompt
source: The '{0}' extension is required to deploy this resource, do you want to install it now?
de: Die Erweiterung "{0}" ist für die Bereitstellung dieser Ressource erforderlich. Möchten Sie sie jetzt installieren?
es: Se requiere la extensión "{0}" para implementar este recurso, ¿desea instalarla ahora?
fr: L’extension «{0}» est nécessaire pour déployer cette ressource. Voulez-vous l’installer maintenant ?
it: L'estensione "{0}" è necessaria per distribuire la risorsa, si vuole installarla subito?
ja: このリソースを展開するには、'{0}' の拡張機能が必要です。今すぐインストールしますか?
ko: 이 리소스를 배포하려면 '{0}' 확장이 필요합니다. 지금 설치하시겠습니까?
pt_br: A extensão '{0}' é necessária para implantar esse recurso, deseja instalá-lo agora?
ru: Для развертывания этого ресурса требуется расширение "{0}". Хотите ли вы установить его?
zh_hans: 部署此资源需要“{0}”扩展，现在是否希望安装此扩展?
zh_hant: 需要 ' {0} ' 延伸模組才可部署此資源，要立即安裝嗎?

# resourceDeployment.install
source: Install
de: Installieren
es: Instalar
fr: Installer
it: Installare
ja: インストール
ko: 설치
pt_br: Instalar
ru: Установить
zh_hans: 安装
zh_hant: 安裝

# resourceDeployment.installingExtension
source: Installing extension '{0}'...
de: Die Erweiterung "{0}" wird installiert...
es: Instalando la extensión "{0}"...
fr: Installation de l'extension '{0}'...
it: Installazione dell'estensione "{0}" in corso...
ja: 拡張機能 '{0}' をインストールしています...
ko: '{0}' 확장을 설치하는 중...
pt_br: Instalando a Extensão '{0}'...
ru: Установка расширения "{0}"...
zh_hans: 正在安装扩展“{0}”...
zh_hant: 正在安裝延伸模組 '{0}'...

# resourceDeployment.unknownExtension
source: Unknown extension '{0}'
de: Unbekannte Erweiterung "{0}".
es: Extensión "{0}" desconocida
fr: Extension inconnue '{0}'
it: Estensione "{0}" sconosciuta
ja: 不明な拡張機能 '{0}'
ko: '{0}'은(는) 알 수 없는 확장입니다.
pt_br: Extensão desconhecida '{0}'
ru: Неизвестное расширение "{0}"
zh_hans: 未知扩展“{0}”
zh_hant: 未知的延伸模組 '{0}'

# resourceTypePickerDialog.title
source: Select the deployment options
de: Bereitstellungsoptionen auswählen
es: Seleccione las opciones de implementación
fr: Sélectionner les options de déploiement
it: Seleziona le opzioni di distribuzione
ja: デプロイ オプションを選択します
ko: 배포 옵션 선택
pt_br: Selecione as opções de implantação
ru: Выбор параметров развертывания
zh_hans: 选择部署选项
zh_hant: 選擇部署選項

# resourceTypePickerDialog.resourceSearchPlaceholder
source: Filter resources...
de: Ressourcen filtern...
es: Filtrar recursos...
fr: Filtrer les ressources...
it: Filtra risorse...
ja: リソースのフィルター...
ko: 리소스 필터링...
pt_br: Filtrar recursos...
ru: Фильтровать ресурсы…
zh_hans: 筛选资源...
zh_hant: 篩選資源...

# resourceTypePickerDialog.tagsListViewTitle
source: Categories
de: Kategorien
es: Categorías
fr: Catégories
it: Categorie
ja: カテゴリ
ko: 범주
pt_br: Categorias
ru: Категории
zh_hans: 类别
zh_hant: 類別

# validation.multipleValidationErrors
source: There are some errors on this page, click 'Show Details' to view the errors.
de: Es liegen Fehler auf dieser Seite vor. Klicken Sie auf "Details anzeigen", um diese anzuzeigen.
es: Hay algunos errores en esta página, haga clic en "Mostrar detalles" para verlos.
fr: Cette page a des erreurs, cliquez sur 'Afficher les détails' pour les voir.
it: In questa pagina sono presenti alcuni errori. Per visualizzarli, fare clic su 'Mostra dettagli'.
ja: このページにはいくつかのエラーがあります。エラーを表示するには、[詳細を表示] をクリックします。
ko: 이 페이지에 오류가 있습니다. 오류를 보려면 '세부 정보 표시'를 클릭합니다.
pt_br: Há alguns erros nesta página. Clique em 'Mostrar Detalhes' para exibir os erros.
ru: На этой странице есть ошибки, для их просмотра щелкните "Показать сведения".
zh_hans: 此页面上存在一些错误，请单击“显示详细信息”以查看错误。
zh_hant: 此頁面有一些錯誤，按一下 [顯示詳細資料] 即可檢視錯誤。

# ui.ScriptToNotebookButton
source: Script
de: Skript
fr: Exécuter le script
ja: スクリプト
ko: 스크립트
ru: Скрипт
zh_hans: 脚本
zh_hant: 指令碼

# ui.DeployButton
source: Run
de: Ausführen
es: Ejecutar
fr: Exécuter
it: Esegui
ja: 実行
ko: 실행
pt_br: Executar
ru: Выполнить
zh_hans: 运行
zh_hant: 執行

# resourceDeployment.ViewErrorDetail
source: View error detail
de: Fehlerdetails anzeigen
es: Ver detalle de error
fr: Voir le détail de l'erreur
it: Visualizza dettagli dell'errore
ja: エラーの詳細の表示
ko: 오류 세부 정보 보기
pt_br: Exibir detalhe do erro
ru: Просмотреть сведения об ошибке
zh_hans: 查看错误详细信息
zh_hant: 檢視錯誤詳細資料

# resourceDeployment.FailedToOpenNotebook
source: An error occurred opening the output notebook. {1}{2}.
de: Fehler beim Öffnen von Ausgabe-Notebook. {1}{2}.
es: Error al iniciar el cuaderno de salida. {1}{2}.
fr: Erreur pendant l'ouverture du notebook de sortie. {1}{2}.
it: Si è verificato un errore durante l'apertura del notebook di output. {1}{2}.
ja: 出力ノートブックを開こうとしてエラーが発生しました。{1}{2}。
ko: 출력 Notebook을 여는 동안 오류가 발생했습니다. {1}{2}.
pt_br: Ocorreu um erro ao abrir o notebook de saída. {1}{2}.
ru: Произошла ошибка при открытии выходной записной книжки. {1}{2}.
zh_hans: 打开输出笔记本时出错。{1}{2}。
zh_hant: 開啟輸出筆記本時發生錯誤。{1}{2}。

# resourceDeployment.BackgroundExecutionFailed
source: The task "{0}" has failed.
de: Fehler bei der Aufgabe "{0}".
es: Error de la tarea "{0}".
fr: La tâche « {0} » a échoué.
it: L'attività "{0}" non è riuscita.
ja: タスク "{0}" が失敗しました。
ko: "{0}" 작업이 실패했습니다.
pt_br: Falha na tarefa "{0}".
ru: Не удалось выполнить задачу "{0}".
zh_hans: 任务“{0}”失败。
zh_hant: 工作 "{0}" 已失敗。

# resourceDeployment.TaskFailedWithNoOutputNotebook
source: The task "{0}" failed and no output Notebook was generated.
de: Fehler bei Aufgabe "{0}". Es wurde kein Ausgabe-Notebook generiert.
es: Error de la tarea "{0}"; no se ha generado ningún cuaderno de salida.
fr: La tâche « {0} » a échoué et aucun notebook de sortie n'a été généré.
it: L'attività "{0}" non è riuscita e non è stato generato alcun notebook di output.
ja: タスク "{0}" が失敗し、出力ノートブックが生成されませんでした。
ko: "{0}" 작업이 실패했으며 출력 Notebook이 생성되지 않았습니다.
pt_br: Houve uma falha na tarefa "{0}" e nenhum Notebook de saída foi gerado.
ru: Не удалось выполнить задачу "{0}", и выходная записная книжка не была создана.
zh_hans: 任务“{0}”失败，并且未生成任何输出笔记本。
zh_hant: 工作 "{0}" 失敗，且未產生任何輸出筆記本。

# resourceTypePickerDialog.resourceTypeCategoryAll
source: All
de: Alle
es: Todo
fr: Tout
it: Tutto
ja: すべて
ko: 모두
pt_br: Tudo
ru: Все
zh_hans: 全部
zh_hant: 全部

# resourceTypePickerDialog.resourceTypeCategoryOnPrem
source: On-premises
de: Lokal
es: Local
fr: Local
it: Locale
ja: オンプレミス
ko: 온-프레미스
pt_br: Local
ru: Локальные
zh_hans: 本地
zh_hant: 內部部署

# resourceTypePickerDialog.resourceTypeCategoryOnHybrid
source: Hybrid
es: Híbrido
fr: Hybride
it: Ibrido
ja: ハイブリッド
ko: 하이브리드
pt_br: Híbrido
ru: Гибридные
zh_hans: 混合
zh_hant: 混合式

# resourceTypePickerDialog.resourceTypeCategoryOnCloud
source: Cloud
es: Nube
ja: クラウド
ko: 클라우드
pt_br: Nuvem
ru: Облачные
zh_hans: 云
zh_hant: 雲端

# resourceDeployment.Description
source: Description
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
pt_br: Descrição
ru: Описание
zh_hans: 说明
zh_hant: 描述

# resourceDeployment.Tool
source: Tool
es: Herramienta
fr: Outil
it: Strumento
ja: ツール
ko: 도구
pt_br: Ferramenta
ru: Инструмент
zh_hans: 工具
zh_hant: 工具

# resourceDeployment.Status
source: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# resourceDeployment.Version
source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
ru: Версия
zh_hans: 版本
zh_hant: 版本

# resourceDeployment.RequiredVersion
source: Required Version
de: Erforderliche Version
es: Versión necesaria
fr: Version obligatoire
it: Versione richiesta
ja: 必要なバージョン
ko: 필요한 버전
pt_br: Versão Obrigatória
ru: Требуемая версия
zh_hans: 所需版本
zh_hant: 所需版本
