Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/resource-deployment.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# deployCluster.AdvancedStorageDescription
source: By default Controller storage settings will be applied to other services as well, you can expand the advanced storage settings to configure storage for other services.
de: Standardmäßig werden Speichereinstellungen für Controller auch auf andere Dienste angewendet. Sie können die erweiterten Speichereinstellungen einblenden, um Speicher für andere Dienste zu konfigurieren.
es: De forma predeterminada, la configuración de almacenamiento del controlador también se aplicará a otros servicios, puede expandir la configuración de almacenamiento avanzada para configurar el almacenamiento para otros servicios.
fr: Par défaut, les paramètres de stockage du contrôleur sont aussi appliqués aux autres services, vous pouvez développer les paramètres de stockage avancés pour configurer le stockage des autres services.
it: Per impostazione predefinita, le impostazioni di archiviazione del controller verranno applicate anche ad altri servizi. Per configurare l'archiviazione per altri servizi, è possibile espandere le impostazioni di archiviazione avanzate.
ja: 既定では、コントローラー ストレージ設定は他のサービスにも適用されます。ストレージの詳細設定を展開して、他のサービスのストレージを構成できます。
ko: 기본적으로 컨트롤러 스토리지 설정은 다른 서비스에도 적용되며 고급 스토리지 설정을 확장하여 다른 서비스용으로 스토리지를 구성할 수 있습니다.
pt_br: Por padrão, as configurações de armazenamento do Controlador também serão aplicadas a outros serviços. Você pode expandir as configurações de armazenamento avançadas para configurar o armazenamento para outros serviços.
ru: По умолчанию параметры хранилища контроллера будут применены и к другим службам, вы можете развернуть расширенные параметры хранилища, чтобы настроить его для других служб.
zh_hans: 默认情况下，控制器存储设置也将应用于其他服务，可展开高级存储设置以配置其他服务的存储。
zh_hant: 根據預設，控制器儲存設定也會套用到其他服務，您可以展開進階儲存設定來設定其他服務的儲存。

# deployCluster.controllerDataStorageClass
source: Controller's data storage class
de: Speicherklasse für Controllerdaten
es: Clase de almacenamiento de datos del controlador
fr: Classe de stockage de données du contrôleur
it: Classe di archiviazione dati del controller
ja: コントローラーのデータ ストレージ クラス
ko: 컨트롤러의 데이터 스토리지 클래스
pt_br: Classe de armazenamento de dados do controlador
ru: Класс хранилища данных контроллера
zh_hans: 控制器的数据存储类
zh_hant: 控制器的資料儲存體類別

# deployCluster.controllerDataStorageClaimSize
source: Controller's data storage claim size
de: Größe des Speicheranspruchs für Controllerdaten
es: Tamaño de las notificaciones de almacenamiento de datos del controlador
fr: Taille de la revendication de stockage de données du contrôleur
it: Dimensioni della richiesta di archiviazione dati del controller
ja: コントローラーのデータ ストレージ要求サイズ
ko: 컨트롤러의 데이터 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de dados do controlador
ru: Размер требования для хранилища данных контроллера
zh_hans: 控制器的数据存储声明大小
zh_hant: 控制器的資料儲存體宣告大小

# deployCluster.controllerLogsStorageClass
source: Controller's logs storage class
de: Speicherklasse für Controllerprotokolle
es: Clase de almacenamiento de registros del controlador
fr: Classe de stockage des journaux du contrôleur
it: Classe di archiviazione dei log del controller
ja: コントローラーのログ ストレージ クラス
ko: 컨트롤러의 로그 스토리지 클래스
pt_br: Classe de armazenamento de logs do controlador
ru: Класс хранилища журналов контроллера
zh_hans: 控制器的日志存储类
zh_hant: 控制器的記錄儲存體類別

# deployCluster.controllerLogsStorageClaimSize
source: Controller's logs storage claim size
de: Größe des Speicheranspruchs für Controllerprotokolle
es: Tamaño de las notificaciones de almacenamiento de registros del controlador
fr: Taille de la revendication de stockage des journaux du contrôleur
it: Dimensioni della richiesta di archiviazione dei log del controller
ja: コントローラーのログ ストレージ要求サイズ
ko: 컨트롤러의 로그 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de logs do controlador
ru: Размер требования для хранилища журналов контроллера
zh_hans: 控制器的日志存储声明大小
zh_hant: 控制器的記錄儲存體宣告大小

# deployCluster.StoragePool
source: Storage pool (HDFS)
de: Speicherpool (HDFS)
es: Grupo de almacenamiento (HDFS)
fr: Pool de stockage (HDFS)
it: Pool di archiviazione (HDFS)
ja: 記憶域プール (HDFS)
ko: 스토리지 풀(HDFS)
pt_br: Pool de armazenamento (HDFS)
ru: Пул носителей (HDFS)
zh_hans: 存储池(HDFS)
zh_hant: 儲存集區 (HDFS)

# deployCluster.storagePoolDataStorageClass
source: Storage pool's data storage class
de: Speicherklasse für Speicherpooldaten
es: Clase de almacenamiento de datos del bloque de almacenamiento
fr: Classe de stockage de données du pool de stockage
it: Classe di archiviazione dati del pool di archiviazione
ja: 記憶域プールのデータ ストレージ クラス
ko: 스토리지 풀의 데이터 스토리지 클래스
pt_br: Classe de armazenamento de dados do pool de armazenamento
ru: Класс хранилища данных в пуле хранилища
zh_hans: 存储池的数据存储类
zh_hant: 存放集區的資料儲存體類別

# deployCluster.storagePoolDataStorageClaimSize
source: Storage pool's data storage claim size
de: Größe des Speicheranspruchs für Speicherpooldaten
es: Tamaño de las notificaciones de almacenamiento de datos del bloque de almacenamiento
fr: Taille de la revendication de stockage de données du pool de stockage
it: Dimensioni della richiesta di archiviazione dati del pool di archiviazione
ja: 記憶域プールのデータ ストレージ要求サイズ
ko: 스토리지 풀의 데이터 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de dados do pool de armazenamento
ru: Размер требования для хранилища данных в пуле хранилища
zh_hans: 存储池的数据存储声明大小
zh_hant: 存放集區的資料儲存體宣告大小

# deployCluster.storagePoolLogsStorageClass
source: Storage pool's logs storage class
de: Speicherklasse für Speicherpoolprotokolle
es: Clase de almacenamiento de registros del bloque de almacenamiento
fr: Classe de stockage des journaux du pool de stockage
it: Classe di archiviazione dei log del pool di archiviazione
ja: 記憶域プールのログ ストレージ クラス
ko: 스토리지 풀의 로그 스토리지 클래스
pt_br: Classe de armazenamento de logs do pool de armazenamento
ru: Класс хранилища журналов в пуле хранилища
zh_hans: 存储池的日志存储类
zh_hant: 存放集區的記錄儲存體類別

# deployCluster.storagePoolLogsStorageClaimSize
source: Storage pool's logs storage claim size
de: Größe des Speicheranspruchs für Speicherpoolprotokolle
es: Tamaño de las notificaciones de almacenamiento de registros del bloque de almacenamiento
fr: Taille de la revendication de stockage des journaux du pool de stockage
it: Dimensioni della richiesta di archiviazione dei log del pool di archiviazione
ja: 記憶域プールのログ ストレージ要求サイズ
ko: 스토리지 풀의 로그 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de logs do pool de armazenamento
ru: Размер требования для хранилища журналов в пуле хранилища
zh_hans: 存储池的日志存储声明大小
zh_hant: 存放集區的記錄儲存體宣告大小

# deployCluster.DataPool
source: Data pool
de: Datenpool
es: Grupo de datos
fr: Pool de données
it: Pool di dati
ja: データ プール
ko: 데이터 풀
pt_br: Pool de dados
ru: Пул данных
zh_hans: 数据池
zh_hant: 資料集區

# deployCluster.dataPoolDataStorageClass
source: Data pool's data storage class
de: Speicherklasse für Datenpooldaten
es: Clase de almacenamiento de datos del grupo de datos
fr: Classe de stockage de données du pool de données
it: Classe di archiviazione dati del pool di dati
ja: データ プールのデータ ストレージ クラス
ko: 데이터 풀의 데이터 스토리지 클래스
pt_br: Classe de armazenamento de dados do pool de dados
ru: Класс хранилища данных пула данных
zh_hans: 数据池的数据存储类
zh_hant: 資料集區的資料儲存體類別

# deployCluster.dataPoolDataStorageClaimSize
source: Data pool's data storage claim size
de: Größe des Speicheranspruchs für Datenpooldaten
es: Tamaño de las notificaciones de almacenamiento de datos del grupo de datos
fr: Taille de la revendication de stockage de données du pool de données
it: Dimensioni della richiesta di archiviazione dati del pool di dati
ja: データ プールのデータ ストレージ要求サイズ
ko: 데이터 풀의 데이터 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de dados do pool de dados
ru: Размер требования для хранилища данных пула данных
zh_hans: 数据池的数据存储声明大小
zh_hant: 資料集區的資料儲存體宣告大小

# deployCluster.dataPoolLogsStorageClass
source: Data pool's logs storage class
de: Speicherklasse für Datenpoolprotokolle
es: Clase de almacenamiento de registros del grupo de datos
fr: Classe de stockage des journaux du pool de données
it: Classe di archiviazione dei log del pool di dati
ja: データ プールのログ ストレージ クラス
ko: 데이터 풀의 로그 스토리지 클래스
pt_br: Classe de armazenamento de logs do pool de dados
ru: Класс хранилища журналов пула данных
zh_hans: 数据池的日志存储类
zh_hant: 資料集區的記錄儲存體類別

# deployCluster.dataPoolLogsStorageClaimSize
source: Data pool's logs storage claim size
de: Größe des Speicheranspruchs für Datenpoolprotokolle
es: Tamaño de las notificaciones de almacenamiento de registros del grupo de datos
fr: Taille de la revendication de stockage des journaux du pool de données
it: Dimensioni della richiesta di archiviazione dei log del pool di dati
ja: データ プールのログ ストレージ要求サイズ
ko: 데이터 풀의 로그 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de logs do pool de dados
ru: Размер требования для хранилища журналов пула данных
zh_hans: 数据池的日志存储声明大小
zh_hant: 資料集區的記錄儲存體宣告大小

# deployCluster.sqlServerMasterDataStorageClass
source: SQL Server master's data storage class
de: Speicherklasse für SQL Server-Masterdaten
es: Clase de almacenamiento de datos del servidor maestro de SQL Server
fr: Classe de stockage de données de l'instance maître SQL Server
it: Classe di archiviazione dati dell'istanza master di SQL Server
ja: SQL Server マスターのデータ ストレージ クラス
ko: SQL Server 마스터의 데이터 스토리지 클래스
pt_br: Classe de armazenamento de dados do SQL Server mestre
ru: Класс хранилища данных основного экземпляра SQL Server
zh_hans: SQL Server 主服务器的数据存储类
zh_hant: SQL Server master 的資料儲存體類別

# deployCluster.sqlServerMasterDataStorageClaimSize
source: SQL Server master's data storage claim size
de: Größe des Speicheranspruchs für SQL Server-Masterdaten
es: Tamaño de las notificaciones de almacenamiento de datos del servidor maestro de SQL Server
fr: Taille de la revendication de stockage de données de l'instance maître SQL Server
it: Dimensioni della richiesta di archiviazione dati dell'istanza master di SQL Server
ja: SQL Server マスターのデータ ストレージ要求サイズ
ko: SQL Server 마스터의 데이터 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de dados do SQL Server mestre
ru: Размер требования для хранилища данных основного экземпляра SQL Server
zh_hans: SQL Server 主服务器的数据存储声明大小
zh_hant: SQL Server master 的資料儲存體宣告大小

# deployCluster.sqlServerMasterLogsStorageClass
source: SQL Server master's logs storage class
de: Speicherklasse für SQL Server-Masterprotokolle
es: Clase de almacenamiento de registros del servidor maestro de SQL Server
fr: Classe de stockage des journaux de l'instance maître SQL Server
it: Classe di archiviazione dei log dell'istanza master di SQL Server
ja: SQL Server マスターのログ ストレージ クラス
ko: SQL Server 마스터의 로그 스토리지 클래스
pt_br: Classe de armazenamento de logs do SQL Server mestre
ru: Класс хранилища журналов основного экземпляра SQL Server
zh_hans: SQL Server 主服务器的日志存储类
zh_hant: SQL Server master 的記錄儲存體類別

# deployCluster.sqlServerMasterLogsStorageClaimSize
source: SQL Server master's logs storage claim size
de: Größe des Speicheranspruchs für SQL Server-Masterprotokolle
es: Tamaño de las notificaciones de almacenamiento de registros del servidor maestro de SQL Server
fr: Taille de la revendication de stockage des journaux de l'instance maître SQL Server
it: Dimensioni della richiesta di archiviazione dei log dell'istanza master di SQL Server
ja: SQL Server マスターのログ ストレージ要求サイズ
ko: SQL Server 마스터의 로그 스토리지 클레임 크기
pt_br: Tamanho da declaração de armazenamento de logs do SQL Server mestre
ru: Размер требования для хранилища журналов основного экземпляра SQL Server
zh_hans: SQL Server 主服务器的日志存储声明大小
zh_hant: SQL Server master 的記錄儲存體宣告大小

# deployCluster.ServiceName
source: Service name
de: Dienstname
es: Nombre del servicio
fr: Nom du service
it: Nome servizio
ja: サービス名
ko: 서비스 이름
pt_br: Nome do serviço
ru: Имя службы
zh_hans: 服务名称
zh_hant: 服務名稱

# deployCluster.DataStorageClassName
source: Storage class for data
de: Speicherklasse für Daten
es: Clase de almacenamiento para datos
fr: Classe de stockage pour les données
it: Classe di archiviazione per i dati
ja: データのストレージ クラス
ko: 데이터용 스토리지 클래스
pt_br: Classe de armazenamento para dados
ru: Класс хранения данных
zh_hans: 数据的存储类
zh_hant: 資料的儲存類別

# deployCluster.DataClaimSize
source: Claim size for data (GB)
de: Anspruchsgröße für Daten (GB)
es: Tamaño de la notificación de los datos (GB)
fr: Taille de réclamation pour les données (Go)
it: Dimensioni dell'attestazione per i dati (GB)
ja: データの要求サイズ (GB)
ko: 데이터의 클레임 크기(GB)
pt_br: Tamanho da declaração de dados (GB)
ru: Размер требования для данных (ГБ)
zh_hans: 数据的声明大小(GB)
zh_hant: 宣告資料的大小 (GB)

# deployCluster.LogStorageClassName
source: Storage class for logs
de: Speicherklasse für Protokolle
es: Clase de almacenamiento para registros
fr: Classe de stockage pour les journaux
it: Classe di archiviazione per i log
ja: ログのストレージ クラス
ko: 로그용 스토리지 클래스
pt_br: Classe de armazenamento de logs
ru: Класс хранения журналов
zh_hans: 日志的存储类
zh_hant: 記錄的儲存類別

# deployCluster.LogsClaimSize
source: Claim size for logs (GB)
de: Anspruchsgröße für Protokolle (GB)
es: Tamaño de la notificación para los registros (GB)
fr: Taille de réclamation pour les journaux (Go)
it: Dimensioni dell'attestazione per i log (GB)
ja: ログの要求サイズ (GB)
ko: 로그의 클레임 크기(GB)
pt_br: Tamanho da declaração de logs (GB)
ru: Размер требования для журналов (ГБ)
zh_hans: 日志的声明大小(GB)
zh_hant: 宣告記錄的大小 (GB)

# deployCluster.StorageSettings
source: Storage settings
de: Speichereinstellungen
es: Configuración de almacenamiento
fr: Paramètres de stockage
it: Impostazioni di archiviazione
ja: ストレージ設定
ko: 스토리지 설정
pt_br: Configurações de armazenamento
ru: Параметры хранилища
zh_hans: 存储设置
zh_hant: 儲存體設定

# deployCluster.StorageSectionTitle
source: Storage settings
de: Speichereinstellungen
es: Configuración de almacenamiento
fr: Paramètres de stockage
it: Impostazioni di archiviazione
ja: ストレージ設定
ko: 스토리지 설정
pt_br: Configurações de armazenamento
ru: Параметры хранилища
zh_hans: 存储设置
zh_hant: 儲存設定值

# deployCluster.SparkMustBeIncluded
source: Invalid Spark configuration, you must check the 'Include Spark' checkbox or set the 'Spark pool instances' to at least 1.
de: Ungültige Spark-Konfiguration. Sie müssen das Kontrollkästchen "Spark einschließen" aktivieren oder für "Spark-Poolinstanzen" mindestens den Wert 1 festlegen.
es: Configuración de Spark no válida, debe marcar la casilla para incluir Spark o establecer las instancias de grupo de Spark en al menos 1.
fr: Configuration Spark non valide, vous devez cocher la case 'Inclure Spark' ou définir 'Instances de pool Spark' sur une valeur au moins égale à 1.
it: Configurazione Spark non valida. È necessario selezionare la casella di controllo 'Includi Spark' oppure impostare 'Istanze del pool di Spark' almeno su 1.
ja: Spark 構成が無効です。[Spark を含める] チェック ボックスをオンにするか、[Spark プール インスタンス] を少なくとも 1 に設定する必要があります。
ko: 잘못된 Spark 구성입니다. 'Spark 포함' 확인란을 선택하거나 'Spark 풀 인스턴스'를 1 이상으로 설정해야 합니다.
pt_br: Configuração inválida do Spark. Marque a caixa de seleção 'Incluir o Spark' ou defina as 'Instâncias do pool do Spark' para pelo menos 1.
ru: Недопустимая конфигурация Spark, вам нужно установить флажок "Включить Spark" или задать для параметра "Экземпляры пула Spark" значение не меньше 1.
zh_hans: Spark 配置无效，必须选中“包括 Spark”复选框或将“Spark 池实例数”设置为至少 1 个。
zh_hant: Spark 組態無效，您必須選取 [包含 Spark] 核取方塊，或至少將 [Spark 集區執行個體] 設定為 1.

# deployCluster.summaryPageTitle
source: Summary
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
it: Riepilogo
ja: 概要
ko: 요약
pt_br: Resumo
ru: Сводка
zh_hans: 摘要
zh_hant: 摘要

# deployCluster.DeploymentTarget
source: Deployment target
de: Bereitstellungsziel
es: Destino de implementación
fr: Cible de déploiement
it: Destinazione di distribuzione
ja: デプロイ ターゲット
ko: 배포 대상
pt_br: Destino de implantação
ru: Целевой объект развертывания
zh_hans: 部署目标
zh_hant: 部署目標

# deployCluster.Kubeconfig
source: Kube config
de: Kube-Konfiguration
es: Configuración de Kube
fr: Configuration Kube
it: Configurazione kube
ja: Kube 構成
ko: Kube 구성
pt_br: Configuração de Kube
zh_hans: Kube 配置
zh_hant: Kube 組態

# deployCluster.ClusterContext
source: Cluster context
de: Clusterkontext
es: Contexto del clúster
fr: Contexte de cluster
it: Contesto del cluster
ja: クラスター コンテキスト
ko: 클러스터 컨텍스트
pt_br: Contexto de cluster
ru: Контекст кластера
zh_hans: 群集上下文
zh_hant: 叢集內容

# deployCluster.ClusterSettings
source: Cluster settings
de: Clustereinstellungen
es: Configuración del clúster
fr: Paramètres de cluster
it: Impostazioni del cluster
ja: クラスター設定
ko: 클러스터 설정
pt_br: Configurações de cluster
ru: Параметры кластера
zh_hans: 群集设置
zh_hant: 叢集設定

# deployCluster.DeploymentProfile
source: Deployment profile
de: Bereitstellungsprofil
es: Perfil de implementación
fr: Profil de déploiement
it: Profilo di distribuzione
ja: デプロイ プロファイル
ko: 배포 프로필
pt_br: Perfil de implantação
ru: Профиль развертывания
zh_hans: 部署配置文件
zh_hant: 部署設定檔

# deployCluster.ControllerUsername
source: Controller username
de: Benutzername für Controller
es: Nombre de usuario del controlador
fr: Nom d'utilisateur du contrôleur
it: Nome utente del controller
ja: コントローラーのユーザー名
ko: 컨트롤러 사용자 이름
pt_br: Nome de usuário do controlador
ru: Имя пользователя контроллера
zh_hans: 控制器用户名
zh_hant: 控制器使用者名稱

# deployCluster.AzureSettings
source: Azure settings
de: Azure-Einstellungen
es: Configuración de Azure
fr: Paramètres Azure
it: Impostazioni di Azure
ja: Azure の設定
ko: Azure 설정
pt_br: Configurações do Azure
ru: Параметры Azure
zh_hans: Azure 设置
zh_hant: Azure 設定

# deployCluster.SubscriptionId
source: Subscription id
de: Abonnement-ID
es: Identificador de suscripción
fr: ID d'abonnement
it: ID sottoscrizione
ja: サブスクリプション ID
ko: 구독 ID
pt_br: ID da assinatura
ru: Идентификатор подписки
zh_hans: 订阅 ID
zh_hant: 訂用帳戶識別碼

# deployCluster.DefaultSubscription
source: Default Azure Subscription
de: Azure-Standardabonnement
es: Suscripción predeterminada a Azure
fr: Abonnement Azure par défaut
it: Sottoscrizione di Azure predefinita
ja: 既定の Azure サブスクリプション
ko: 기본 Azure 구독
pt_br: Assinatura Padrão do Azure
ru: Подписка Azure по умолчанию
zh_hans: 默认 Azure 订阅
zh_hant: 預設 Azure 訂用帳戶

# deployCluster.ResourceGroup
source: Resource group
de: Ressourcengruppe
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de recursos
ru: Группа ресурсов
zh_hans: 资源组
zh_hant: 資源群組

# deployCluster.AksClusterName
source: AKS cluster name
de: Name des AKS-Clusters
es: Nombre del clúster de AKS
fr: Nom du cluster AKS
it: Nome del cluster del servizio Azure Kubernetes
ja: AKS クラスター名
ko: AKS 클러스터 이름
pt_br: Nome do cluster do AKS
ru: Имя кластера AKS
zh_hans: AKS 群集名称
zh_hant: AKS 叢集名稱

# deployCluster.ScaleSettings
source: Scale settings
de: Skalierungseinstellungen
es: Ajustes de escala
fr: Paramètres de mise à l'échelle
it: Impostazioni di scalabilità
ja: スケールの設定
ko: 크기 조정 설정
pt_br: Configurações de escala
ru: Параметры масштабирования
zh_hans: 缩放设置
zh_hant: 調整設定

# deployCluster.WithSpark
source: (Spark included)
de: (inklusive Spark)
es: (Spark incluido)
fr: (Spark inclus)
it: (Spark incluso)
ja: (Spark を含む)
ko: (Spark 포함)
pt_br: (Spark incluído)
ru: (Включая Spark)
zh_hans: (包含 Spark)
zh_hant: (包含 Spark)

# deployCluster.DataText
source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
ru: Данные
zh_hans: 数据
zh_hant: 資料

# deployCluster.SqlServerText
source: SQL Server Master
es: Servidor SQL Server maestro
fr: Instance maître SQL Server
it: Master SQL Server
ja: SQL Server マスター
ko: SQL Server 마스터
pt_br: SQL Server Mestre
ru: База данных master SQL Server
zh_hans: SQL Server 主实例
zh_hant: SQL Server 主機

# deployCluster.TargetClusterContextPageTitle
source: Target cluster context
de: Zielclusterkontext
es: Contexto del clúster de destino
fr: Contexte de cluster cible
it: Contesto del cluster di destinazione
ja: ターゲット クラスター コンテキスト
ko: 대상 클러스터 컨텍스트
pt_br: Contexto de cluster de destino
ru: Контекст целевого кластера
zh_hans: 目标群集上下文
zh_hant: 目標叢集內容

# deployCluster.TargetClusterContextPageDescription
source: Select the kube config file and then select a cluster context from the list
de: Wählen Sie die kube-Konfigurationsdatei und anschließend einen Clusterkontext aus der Liste aus.
es: Seleccione el archivo de configuración de kube y, a continuación, seleccione un contexto de clúster de la lista
fr: Sélectionnez le fichier de configuration Kube, puis sélectionnez un contexte de cluster dans la liste
it: Consente di selezionare il file di configurazione kube e quindi selezionare un contesto del cluster dall'elenco
ja: kube 構成ファイルを選択し、リストからクラスター コンテキストを選択します。
ko: kube 구성 파일을 선택한 후 목록에서 클러스터 컨텍스트 선택
pt_br: Selecione o arquivo de configuração de Kube e, em seguida, selecione um contexto de cluster na lista
ru: Выберите файл kube config, а затем контекст кластера из списка
zh_hans: 选择 kube 配置文件，然后从列表中选择群集上下文
zh_hant: 選取 kube 組態檔，然後從清單選取叢集內容

# deployCluster.ClusterContextNotSelectedMessage
source: Please select a cluster context.
de: Wählen Sie einen Clusterkontext aus.
es: Seleccione un contexto de clúster.
fr: Sélectionnez un contexte de cluster.
it: Selezionare un contesto del cluster.
ja: クラスター コンテキストを選択してください。
ko: 클러스터 컨텍스트를 선택하세요.
pt_br: Selecione um contexto de cluster.
ru: Выберите контекст кластера.
zh_hans: 请选择群集上下文。
zh_hant: 請選取叢集內容。

# deployCluster.kubeConfigFileLabelText
source: Kube config file path
de: Pfad der kube-Konfigurationsdatei
es: Ruta de acceso al archivo de configuración de Kube
fr: Chemin du fichier de configuration Kube
it: Percorso del file di configurazione kube
ja: Kube 構成のファイル パス
ko: Kube 구성 파일 경로
pt_br: Caminho do arquivo de configuração de Kube
ru: Путь к файлу kube config
zh_hans: Kube 配置文件路径
zh_hant: Kube 設定檔路徑

# deployCluster.browseText
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
pt_br: Procurar
ru: Обзор
zh_hans: 浏览
zh_hant: 瀏覽

# deployCluster.clusterContextsLabelText
source: Cluster Contexts
de: Clusterkontexte
es: Contextos de clúster
fr: Contextes de cluster
it: Contesti del cluster
ja: クラスター コンテキスト
ko: 클러스터 컨텍스트
pt_br: Contextos de cluster
ru: Контексты кластера
zh_hans: 群集上下文
zh_hant: 叢集內容

# deployCluster.errorLoadingClustersText
source: No cluster information is found in the config file or an error ocurred while loading the config file
de: In der Konfigurationsdatei wurden keine Clusterinformationen gefunden, oder beim Laden der Konfigurationsdatei ist ein Fehler aufgetreten.
es: No se ha encontrado información de clúster en el archivo de configuración o se ha producido un error al cargar este archivo
fr: Aucune information de cluster dans le fichier config ou une erreur s'est produite pendant le chargement du fichier config
it: Non sono state trovate informazioni sul cluster nel file di configurazione oppure si è verificato un errore durante il caricamento del file di configurazione
ja: 構成ファイルにクラスター情報が見つからないか、構成ファイルの読み込み中にエラーが発生しました
ko: 구성 파일에서 클러스터 정보를 찾지 못했거나 구성 파일을 로드하는 동안 오류가 발생했습니다.
pt_br: Informações de cluster não encontradas no arquivo de configuração ou ocorreu um erro ao carregar o arquivo de configuração
ru: Не найдены сведения о кластере в файле конфигурации, либо при загрузке этого файла произошла ошибка
zh_hans: 未在配置文件中找到群集信息，或者加载配置文件时出错
zh_hant: 在設定檔中找不到叢集資訊，或載入設定檔時發生錯誤

# deployCluster.selectKubeConfigFileText
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選擇

# deployCluster.ConfigParseError
source: Failed to load the config file
de: Fehler beim Laden der Konfigurationsdatei.
es: No se pudo cargar el archivo de configuración
fr: Le chargement du fichier config a échoué
it: Non è stato possibile caricare il file di configurazione
ja: 構成ファイルの読み込みに失敗しました
ko: 구성 파일을 로드하지 못함
pt_br: Falha ao carregar o arquivo de configuração
ru: Не удалось загрузить файл конфигурации
zh_hans: 未能加载配置文件
zh_hant: 無法載入組態檔
