Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# displayName
source: SQL Server Schema Compare
de: SQL Server-Schemavergleich
es: Comparación de esquemas de SQL Server
it: Confronto schemi di SQL Server
ko: SQL Server 스키마 비교
pt_br: Comparação de Esquemas do SQL Server
ru: Сравнение схем SQL Server
zh_hans: SQL Server 架构比较
zh_hant: SQL Server 結構描述比較

# description
source: SQL Server Schema Compare for Azure Data Studio supports comparing the schemas of databases and dacpacs.
de: Der SQL Server-Schemavergleich für Azure Data Studio unterstützt den Vergleich der Schemas von Datenbanken und DACPAC-Dateien.
es: La comparación de esquemas de SQL Server para Azure Data Studio admite la comparación de los esquemas de bases de datos y paquetes DAC.
it: La funzionalità Confronto schemi di SQL Server per Azure Data Studio supporta il confronto degli schemi di database e pacchetti di applicazione livello dati.
ja: Azure Data Studio 用 SQL Server Schema Compare では、データベースと dacpac のスキーマを比較できます。
ko: Azure Data Studio에 대한 SQL Server 스키마 비교는 데이터베이스 및 Dacpac의 스키마 비교를 지원합니다.
pt_br: A Comparação de Esquemas do SQL Server para o Azure Data Studio dá suporte à comparação de esquemas de bancos de dados e dacpacs.
ru: Сравнение схем SQL для Azure Data Studio поддерживает сравнение схем баз данных и файлов DACPAC.
zh_hans: Azure Data Studio 的 SQL Server 架构比较支持对数据库和 dacpacs 的架构进行比较。
zh_hant: Azure Data Studio 的 SQL Server 結構描述比較支援比較資料庫和 dacpac 的結構描述。

# schemaCompare.start
source: Schema Compare
de: Schemavergleich
es: Comparación de esquemas
it: Confronto schemi
ko: 스키마 비교
pt_br: Comparação de Esquemas
ru: Сравнение схем
zh_hans: 架构比较
zh_hant: 結構描述比較

# schemaCompareDialog.ok
source: OK
es: Aceptar
ko: 확인
ru: ОК
zh_hans: 确定
zh_hant: 確定

# schemaCompareDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# schemaCompareDialog.SourceTitle
source: Source
de: Quelle
es: Origen
it: Origine
ja: ソース
ko: 원본
pt_br: Fonte
ru: Исходная база данных
zh_hans: 源
zh_hant: 來源

# schemaCompareDialog.TargetTitle
source: Target
de: Ziel
es: Destino
it: Destinazione
ja: ターゲット
ko: 대상
pt_br: Destino
ru: Целевой объект
zh_hans: 目标
zh_hant: 目標

# schemaCompareDialog.fileTextBoxLabel
source: File
de: Datei
es: Archivo
ja: ファイル
ko: 파일
pt_br: Arquivo
ru: Файл
zh_hans: 文件

# schemaCompare.dacpacRadioButtonLabel
source: Data-tier Application File (.dacpac)
de: Datei der Datenschichtanwendung (DACPAC)
es: Archivo de aplicación de capa de datos (.dacpac)
it: File dell'applicazione livello dati (con estensione dacpac)
ja: データ層アプリケーション ファイル (.dacpac)
ko: 데이터 계층 애플리케이션 파일(.dacpac)
pt_br: Arquivo do Aplicativo da Camada de Dados (.dacpac)
ru: Файл приложения уровня данных (DACPAC)
zh_hans: 数据层应用程序文件(.dacpac)
zh_hant: 資料層應用程式檔案 (.dacpac)

# schemaCompare.databaseButtonLabel
source: Database
de: Datenbank
es: Base de datos
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# schemaCompare.radioButtonsLabel
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# schemaCompareDialog.serverDropdownTitle
source: Server
es: Servidor
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器

# schemaCompareDialog.databaseDropdownTitle
source: Database
de: Datenbank
es: Base de datos
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# schemaCompare.dialogTitle
source: Schema Compare
de: Schemavergleich
es: Comparación de esquemas
it: Confronto schemi
ko: 스키마 비교
pt_br: Comparação de Esquemas
ru: Сравнение схем
zh_hans: 架构比较
zh_hant: 結構描述比較

# schemaCompareDialog.differentSourceMessage
source: A different source schema has been selected. Compare to see the comparison?
de: Es wurde ein anderes Quellschema ausgewählt. Möchten Sie einen Vergleich durchführen?
es: Se ha seleccionado un esquema de origen diferente. ¿Comparar para ver la comparación?
it: È stato selezionato uno schema di origine diverso. Eseguire il confronto?
ja: 別のソース スキーマが選択されました。比較を表示して比較しますか?
ko: 다른 원본 스키마를 선택했습니다. 비교를 확인하려면 비교를 누르세요.
pt_br: Um esquema de origem diferente foi selecionado. Comparar para ver a comparação?
ru: Выбрана другая исходная схема. Выполнить сравнение для просмотра его результатов?
zh_hans: 已选择其他源架构。是否进行比较以查看比较结果?
zh_hant: 已選取其他來源結構描述。要比較以查看比較結果嗎?

# schemaCompareDialog.differentTargetMessage
source: A different target schema has been selected. Compare to see the comparison?
de: Es wurde ein anderes Zielschema ausgewählt. Möchten Sie einen Vergleich durchführen?
es: Se ha seleccionado un esquema de destino diferente. ¿Comparar para ver la comparación?
it: È stato selezionato uno schema di destinazione diverso. Eseguire il confronto?
ja: 別のターゲット スキーマが選択されました。比較を表示して比較しますか?
ko: 다른 대상 스키마를 선택했습니다. 비교를 확인하려면 비교를 누르세요.
pt_br: Um esquema de destino diferente foi selecionado. Comparar para ver a comparação?
ru: Выбрана другая целевая схема. Выполнить сравнение для просмотра его результатов?
zh_hans: 已选择其他目标架构。是否进行比较以查看比较结果?
zh_hant: 已選取其他目標結構描述。要比較以查看比較結果嗎?

# schemaCompareDialog.differentSourceTargetMessage
source: Different source and target schemas have been selected. Compare to see the comparison?
de: Es wurden verschiedene Quell- und Zielschemas ausgewählt. Möchten Sie einen Vergleich durchführen?
es: Se han seleccionado diferentes esquemas de origen y destino. ¿Comparar para ver la comparación?
it: Sono stati selezionati schemi di origine e di destinazione diversi. Eseguire il confronto?
ja: 異なるソース スキーマとターゲット スキーマが選択されています。比較を表示して比較しますか?
ko: 다른 원본 및 대상 스키마를 선택했습니다. 비교를 확인하려면 비교를 누르세요.
pt_br: Diferentes esquemas de origem e de destino foram selecionados. Comparar para ver a comparação?
ru: Выбраны другие исходная и целевая схемы. Выполнить сравнение для просмотра его результатов?
zh_hans: 已选择其他源和目标架构。是否进行比较以查看比较结果?
zh_hant: 已選取不同的來源和結構描述。要比較以查看比較結果嗎?

# schemaCompareDialog.Yes
source: Yes
de: Ja
es: Sí
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# schemaCompareDialog.No
source: No
de: Nein
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# schemaCompareDialog.sourceTextBox
source: Source file
de: Quelldatei
es: Archivo de código fuente
it: File di origine
ja: ソース ファイル
ko: 원본 파일
pt_br: Arquivo de origem
ru: Исходный файл
zh_hans: 源文件
zh_hant: 原始程式檔

# schemaCompareDialog.targetTextBox
source: Target file
de: Zieldatei
es: Archivo de destino
it: File di destinazione
ja: ターゲット ファイル
ko: 대상 파일
pt_br: Arquivo de destino
ru: Целевой файл
zh_hans: 目标文件
zh_hant: 目標檔案

# schemaCompareDialog.sourceDatabaseDropdown
source: Source Database
de: Quelldatenbank
es: Base de datos de origen
it: Database di origine
ja: ソース データベース
ko: 원본 데이터베이스
pt_br: Banco de Dados de Origem
ru: Исходная база данных
zh_hans: 源数据库
zh_hant: 來源資料庫

# schemaCompareDialog.targetDatabaseDropdown
source: Target Database
de: Zieldatenbank
es: Base de datos de destino
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de Dados de Destino
ru: Целевая база данных
zh_hans: 目标数据库
zh_hant: 目標資料庫

# schemaCompareDialog.sourceServerDropdown
source: Source Server
de: Quellserver
es: Servidor de origen
it: Server di origine
ja: ソース サーバー
ko: 원본 서버
pt_br: Servidor de Origem
ru: Исходный сервер
zh_hans: 源服务器
zh_hant: 來源伺服器

# schemaCompareDialog.targetServerDropdown
source: Target Server
de: Zielserver
es: Servidor de destino
it: Server di destinazione
ja: ターゲット サーバー
ko: 대상 서버
pt_br: Servidor de Destino
ru: Целевой сервер
zh_hans: 目标服务器
zh_hant: 目標伺服器

# schemaCompareDialog.defaultUser
source: default
de: Standardeinstellung
es: predeterminado
it: predefinito
ja: 既定
ko: 기본값
pt_br: padrão
ru: По умолчанию
zh_hans: 默认
zh_hant: 預設

# schemaCompare.openFile
source: Open
de: Öffnen
es: Abrir
it: Apri
ja: 開く
ko: 열기
pt_br: Abrir
ru: Открыть
zh_hans: 打开
zh_hant: 開啟

# schemaCompare.selectSourceFile
source: Select source file
de: Quelldatei auswählen
es: Seleccionar archivo de origen
it: Selezionare file di origine
ja: ソース ファイルの選択
ko: 원본 파일 선택
pt_br: Selecione o arquivo de origem
ru: Выберите исходный файл
zh_hans: 选择源文件
zh_hant: 選取來源檔案

# schemaCompare.selectTargetFile
source: Select target file
de: Zieldatei auswählen
es: Selección del archivo de destino
it: Selezionare il file di destinazione
ja: ターゲット ファイルの選択
ko: 대상 파일 선택
pt_br: Selecionar a pasta de destino
ru: Выберите целевой файл
zh_hans: 选择目标文件
zh_hant: 選取目標檔案

# SchemaCompareOptionsDialog.Reset
source: Reset
de: Zurücksetzen
es: Restablecer
it: Reimposta
ja: リセット
ko: 다시 설정
pt_br: Redefinir
ru: Сброс
zh_hans: 重置
zh_hant: 重設

# schemaCompareOptions.RecompareMessage
source: Options have changed. Recompare to see the comparison?
de: Die Optionen wurden geändert. Möchten Sie den Vergleich wiederholen und neu anzeigen?
es: Las opciones han cambiado. ¿Volver a comparar para ver la comparación?
it: Le opzioni sono state modificate. Ripetere il confronto?
ja: オプションが変更されました。比較を表示して再比較しますか?
ko: 옵션이 변경되었습니다. 비교를 확인하려면 다시 비교를 누르세요.
pt_br: As opções mudaram. Comparar novamente para ver a comparação?
ru: Параметры изменились. Выполнить повторное сравнение для просмотра его результатов?
zh_hans: 选项已更改。是否重新比较以查看比较结果?
zh_hant: 選項已變更。要重新比較以查看比較嗎?

# SchemaCompare.SchemaCompareOptionsDialogLabel
source: Schema Compare Options
de: Optionen für Schemavergleich
es: Opciones de comparación de esquemas
it: Opzioni di confronto schemi
ja: Schema Compare のオプション
ko: 스키마 비교 옵션
pt_br: Opções da Comparação de Esquemas
ru: Параметры Сравнения схем
zh_hans: 架构比较选项
zh_hant: 結構描述比較選項

# SchemaCompare.GeneralOptionsLabel
source: General Options
de: Allgemeine Optionen
es: Opciones generales
it: Opzioni generali
ja: 全般オプション
ko: 일반 옵션
pt_br: Opções Gerais
ru: Общие параметры
zh_hans: 常规选项
zh_hant: 一般選項

# SchemaCompare.ObjectTypesOptionsLabel
source: Include Object Types
de: Objekttypen einschließen
es: Incluir tipos de objeto
it: Includi tipi di oggetto
ja: オブジェクトの種類を含める
ko: 개체 유형 포함
pt_br: Incluir Tipos de Objetos
ru: Включить типы объектов
zh_hans: 包括对象类型
zh_hant: 包含物件類型

# schemaCompare.CompareDetailsTitle
source: Compare Details
de: Details vergleichen
es: Comparar detalles
it: Dettagli confronto
ja: 詳細の比較
ko: 세부 정보 비교
pt_br: Comparar os Detalhes
ru: Сравнить сведения
zh_hans: 比较详细信息
zh_hant: 比較詳細資料

# schemaCompare.ApplyConfirmation
source: Are you sure you want to update the target?
de: Möchten Sie das Ziel aktualisieren?
es: ¿Seguro de que desea actualizar el destino?
it: Aggiornare la destinazione?
ja: ターゲットを更新しますか?
ko: 대상을 업데이트하시겠습니까?
pt_br: Tem certeza de que deseja atualizar o destino?
ru: Вы действительно хотите обновить целевой объект?
zh_hans: 确定要更新目标吗?
zh_hant: 確定要更新目標嗎?

# schemaCompare.RecompareToRefresh
source: Press Compare to refresh the comparison.
de: Klicken Sie auf "Vergleichen", um den Vergleich zu aktualisieren.
es: Presione Comparar para actualizar la comparación.
it: Fare clic su Confronta per aggiornare il confronto.
ja: 比較を更新するには、[比較] を押します。
ko: 비교를 눌러 비교를 새로 고칩니다.
pt_br: Pressione Comparar para atualizar a comparação.
ru: Нажмите "Сравнить", чтобы обновить сравнение.
zh_hans: 按“比较”以刷新比较结果。
zh_hant: 按下 [比較] 即可重新整理比較結果。

# schemaCompare.generateScriptEnabledButton
source: Generate script to deploy changes to target
de: Skript zum Bereitstellen von Änderungen am Ziel generieren
es: Generar script para implementar cambios en el destino
it: Genera script per distribuire le modifiche nella destinazione
ja: ターゲットに変更をデプロイするスクリプトを生成します
ko: 대상에 변경 내용을 배포하는 스크립트 생성
pt_br: Gerar script para implantar alterações no destino
ru: Создать сценарий для развертывания изменений в целевом объекте
zh_hans: 生成脚本以将更改部署到目标
zh_hant: 產生指令碼以將變更部署至目標

# schemaCompare.generateScriptNoChanges
source: No changes to script
de: Keine Änderungen am Skript
es: No hay cambios en el script
it: Non sono presenti modifiche per cui generare lo script
ja: スクリプトに変更はありません
ko: 스크립트 변경 내용 없음
pt_br: Nenhuma alteração no script
ru: Нет изменений в сценарии
zh_hans: 未更改脚本
zh_hant: 指令碼沒有任何變更

# schemaCompare.applyButtonEnabledTitle
source: Apply changes to target
de: Änderungen auf das Ziel anwenden
es: Aplicar cambios al objetivo
it: Applica modifiche alla destinazione
ja: ターゲットに変更を適用する
ko: 대상에 변경 내용 적용
pt_br: Aplicar alterações ao destino
ru: Применить изменения к целевому объекту
zh_hans: 将更改应用到目标
zh_hant: 將變更套用至目標

# schemaCompare.applyNoChanges
source: No changes to apply
de: Keine Änderungen zur Anwendung vorhanden.
es: No hay cambios que aplicar
it: Non sono presenti modifiche da applicare
ja: 適用する変更はありません
ko: 적용할 변경 내용 없음
pt_br: Não há nenhuma alteração a ser aplicada
ru: Нет изменений для применения
zh_hans: 没有可应用的更改
zh_hant: 沒有任何要套用的變更

# schemaCompare.includeExcludeInfoMessage
source: Please note that include/exclude operations can take a moment to calculate affected dependencies
de: Beachten Sie, dass Vorgänge zum Einschließen/Ausschließen einen Moment dauern können, während betroffene Abhängigkeiten berechnet werden.
es: Tenga en cuenta que las operaciones de inclusión o exclusión pueden tardar unos instantes en calcular las dependencias afectadas
it: Tenere presente che le operazioni di inclusione/esclusione possono richiedere qualche minuto per calcolare le dipendenze interessate
ja: 対象の依存関係を計算するために、包含/除外操作に少し時間がかかる場合があることにご注意ください
ko: 포함/제외 작업은 영향을 받는 종속성을 계산하는 데 잠시 걸릴 수 있습니다.
pt_br: Observe que as operações incluir/excluir podem demorar um pouco para calcular as dependências afetadas
ru: Обратите внимание, что операции включения и исключения могут занять некоторое время, чтобы вычислить затронутые зависимости
zh_hans: 请注意，包括/排除操作可能需要一点时间来计算受影响的依赖项
zh_hant: 請注意，包含/排除作業可能需要一些時間來計算受影響的相依性

# schemaCompare.deleteAction
source: Delete
de: Löschen
es: Eliminar
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# schemaCompare.changeAction
source: Change
de: Ändern
es: Cambiar
it: Modifica
ja: 変更
ko: 변경
pt_br: Alterar
ru: Изменить
zh_hans: 更改
zh_hant: 變更

# schemaCompare.addAction
source: Add
de: Hinzufügen
es: Agregar
it: Aggiungi
ja: 追加
ko: 추가
pt_br: Adicionar
ru: Добавить
zh_hans: 添加
zh_hant: 新增

# schemaCompare.differencesTableTitle
source: Comparison between Source and Target
de: Vergleich zwischen Quelle und Ziel
es: Comparación entre el origen y el destino
it: Confronto tra origine e destinazione
ja: ソースとターゲットの比較
ko: 원본과 대상 간의 비교
pt_br: Comparação entre Origem e Destino
ru: Сравнение между исходным и целевым объектами
zh_hans: 源和目标之间的比较
zh_hant: 來源和目標之間的比較

# schemaCompare.waitText
source: Initializing Comparison. This might take a moment.
de: Der Vergleich wird gestartet. Dies kann einen Moment dauern.
es: Iniciando comparación. Esto podría tardar un momento.
it: Inizializzazione del confronto. L'operazione potrebbe richiedere qualche istante.
ja: 比較を初期化します。しばらく時間がかかる場合があります。
ko: 비교를 초기화하는 중입니다. 시간이 약간 걸릴 수 있습니다.
pt_br: Inicializando a comparação. Isso pode demorar um pouco.
ru: Инициализация сравнения. Это может занять некоторое время.
zh_hans: 初始化比较。这可能需要一段时间。
zh_hant: 正在將比較結果初始化。這可能需要一些時間。

# schemaCompare.startText
source: To compare two schemas, first select a source schema and target schema, then press Compare.
de: Um zwei Schemas zu vergleichen, wählen Sie zunächst ein Quellschema und ein Zielschema aus. Klicken Sie anschließend auf "Vergleichen".
es: Para comparar dos esquemas, seleccione primero un esquema de origen y un esquema de destino y, a continuación, presione Comparar.
it: Per confrontare due schemi, selezionare lo schema di origine e quello di destinazione, quindi fare clic su Confronta.
ja: 2 つのスキーマを比較するには、最初にソース スキーマとターゲット スキーマを選択し、[比較] を押します。
ko: 두 스키마를 비교하려면 먼저 원본 스키마 및 대상 스키마를 선택한 다음, 비교를 누릅니다.
pt_br: Para comparar dois esquemas, primeiro selecione um esquema de origem e um esquema de destino e, em seguida, pressione Comparar.
ru: Чтобы сравнить две схемы, сначала выберите исходную и целевую схему, а затем нажмите кнопку "Сравнить".
zh_hans: 要比较两个架构，请先选择源架构和目标架构，然后按“比较”。
zh_hant: 若要比較兩個結構描述，請先選取來源結構描述，然後按下 [比較]。

# schemaCompare.noDifferences
source: No schema differences were found.
de: Es wurden keine Schemaunterschiede gefunden.
es: No se encontraron diferencias de esquema.
it: Non sono state trovate differenze di schema.
ja: スキーマの違いは見つかりませんでした。
ko: 스키마 차이를 찾을 수 없습니다.
pt_br: Não foi encontrada nenhuma diferença de esquema.
ru: Различия в схемах не найдены.
zh_hans: 未找到架构差异。
zh_hant: 找不到任何結構描述差異。

# schemaCompare.typeColumn
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

# schemaCompare.sourceNameColumn
source: Source Name
de: Quellname
es: Nombre de origen
it: Nome origine
ja: ソース名
ko: 원본 이름
pt_br: Nome da Origem
ru: Имя источника
zh_hans: 源名称
zh_hant: 來源名稱

# schemaCompare.includeColumnName
source: Include
de: Einschließen
es: Incluir
it: Includi
ja: 包含
ko: 포함
pt_br: Incluir
ru: Включить
zh_hans: 包括
zh_hant: 包含

# schemaCompare.actionColumn
source: Action
de: Aktion
es: Acción
it: Azione
ja: アクション
ko: 작업
pt_br: Ação
ru: Действие
zh_hans: 操作
zh_hant: 動作

# schemaCompare.targetNameColumn
source: Target Name
de: Zielname
es: Nombre de destino
it: Nome destinazione
ja: ターゲット名
ko: 대상 이름
pt_br: Nome do Destino
ru: Имя цели
zh_hans: 目标名称
zh_hant: 目標名稱

# schemaCompare.generateScriptButtonDisabledTitle
source: Generate script is enabled when the target is a database
de: "Skript generieren" ist aktiviert, wenn das Ziel eine Datenbank ist.
es: La generación de script se habilita cuando el destino es una base de datos
it: L'opzione Genera script è abilitata quando la destinazione è un database
ja: ターゲットがデータベースの場合にスクリプトの生成が有効になります
ko: 대상이 데이터베이스이면 스크립트 생성이 사용하도록 설정됩니다.
pt_br: Gerar script é habilitado quando o destino é um banco de dados
ru: Создание сценария включено, когда целевой объект является базой данных
zh_hans: 当目标为数据库时启用生成脚本
zh_hant: 當目標為資料庫時，會啟用產生指令碼

# schemaCompare.applyButtonDisabledTitle
source: Apply is enabled when the target is a database
de: "Anwenden" ist aktiviert, wenn das Ziel eine Datenbank ist.
es: Aplicar está habilitado cuando el objetivo es una base de datos
it: L'opzione Applica è abilitata quando la destinazione è un database
ja: ターゲットがデータベースの場合に適用が有効になります
ko: 대상이 데이터베이스이면 적용이 사용하도록 설정됩니다.
pt_br: Aplicar é habilitado quando o destino é um banco de dados
ru: Применение включено, когда целевой объект является базой данных
zh_hans: 当目标为数据库时启用应用
zh_hant: 當目標為資料庫時會啟用套用

# schemaCompare.cannotExcludeMessageWithDependent
source: Cannot exclude {0}. Included dependents exist, such as {1}
de: "{0}" kann nicht ausgeschlossen werden. Eingeschlossene abhängige Elemente vorhanden: {1}
es: No se puede excluir {0}. Existen dependientes incluidos, como {1}
it: Non è possibile escludere {0}. Esistono dipendenti inclusi, ad esempio {1}
ja: {0} を除外することはできません。対象の依存関係が存在します ({1} など)
ko: {0}을(를) 제외할 수 없습니다. {1} 같은 포함된 종속 항목이 있습니다.
pt_br: Não é possível excluir {0}. Existem dependentes incluídos, como {1}
ru: Невозможно исключить {0}. Существуют включенные зависимости, например {1}
zh_hans: 无法排除 {0}。存在包括的依赖项，例如 {1}
zh_hant: 無法排除 {0}。包含的相依性已存在，例如 {1}

# schemaCompare.cannotIncludeMessageWithDependent
source: Cannot include {0}. Excluded dependents exist, such as {1}
de: "{0}" kann nicht eingeschlossen werden. Ausgeschlossene abhängige Elemente vorhanden: {1}
es: No se puede incluir {0}. Existen dependientes excluidos, como {1}
it: Non è possibile includere {0}. Esistono dipendenti esclusi, ad esempio {1}
ja: {0} を含めることはできません。対象外の依存関係が存在します ({1} など)
ko: {0}을(를) 포함할 수 없습니다. {1} 같은 제외된 종속 항목이 있습니다.
pt_br: Não é possível incluir {0}. Existem dependentes excluídos, como {1}
ru: Невозможно включить {0}. Существуют исключенные зависимости, например {1}
zh_hans: 无法包括 {0}。存在被排除的依赖项，如 {1}
zh_hant: 不無法包含 {0}。排除的相依性已存在，例如 {1}

# schemaCompare.cannotExcludeMessage
source: Cannot exclude {0}. Included dependents exist
de: "{0}" kann nicht ausgeschlossen werden. Eingeschlossene abhängige Elemente vorhanden.
es: No se pueden excluir {0}. Existen dependientes incluidos
it: Non è possibile escludere {0}. Esistono dipendenti inclusi
ja: {0} を除外することはできません。対象の依存関係が存在します
ko: {0}을(를) 제외할 수 없습니다. 포함된 종속 항목이 있습니다.
pt_br: Não é possível excluir {0}. Existem dependentes incluídos
ru: Невозможно исключить {0}. Существуют включенные зависимости
zh_hans: 无法排除 {0}。存在包括的依赖项
zh_hant: 無法排除 {0}。包含的相依性已存在

# schemaCompare.cannotIncludeMessage
source: Cannot include {0}. Excluded dependents exist
de: "{0}" kann nicht eingeschlossen werden. Ausgeschlossene abhängige Elemente vorhanden.
es: No se puede incluir {0}. Existen dependientes excluidos
it: Non è possibile includere {0}. Esistono dipendenti esclusi
ja: {0} を含めることはできません。対象外の依存関係が存在します
ko: {0}을(를) 포함할 수 없습니다. 제외된 종속 항목이 있습니다.
pt_br: Não é possível incluir {0}. Existem dependentes excluídos
ru: Невозможно включить {0}. Существуют исключенные зависимости
zh_hans: 无法包括 {0}。存在排除的依赖项
zh_hant: 無法包含 {0}。排除的相依性已存在

# schemaCompare.compareButton
source: Compare
de: Vergleichen
es: Comparar
it: Confronta
ja: 比較
ko: 비교
pt_br: Comparar
ru: Сравнить
zh_hans: 比较
zh_hant: 比較

# schemaCompare.cancelCompareButton
source: Stop
de: Beenden
es: Detener
it: Arresta
ja: 停止
ko: 중지
pt_br: Parar
ru: Остановить
zh_hans: 停止
zh_hant: 停止

# schemaCompare.generateScriptButton
source: Generate script
de: Skript generieren
es: Generar script
it: Genera script
ja: スクリプトの生成
ko: 스크립트 생성
pt_br: Gerar script
ru: Создать сценарий
zh_hans: 生成脚本
zh_hant: 產生指令碼

# schemaCompare.optionsButton
source: Options
de: Optionen
es: Opciones
it: Opzioni
ja: オプション​​
ko: 옵션
pt_br: Opções
ru: Параметры
zh_hans: 选项
zh_hant: 選項

# schemaCompare.updateButton
source: Apply
de: Anwenden
es: Aplicar
it: Applica
ja: 適用
ko: 적용
pt_br: Aplicar
ru: Применить
zh_hans: 应用
zh_hant: 套用

# schemaCompare.switchDirectionButton
source: Switch direction
de: Richtung wechseln
es: Intercambiar dirección
it: Cambia direzione
ja: 方向の切り替え
ko: 방향 전환
pt_br: Alternar direção
ru: Сменить направление
zh_hans: 切换方向
zh_hant: 切換方向

# schemaCompare.switchButtonTitle
source: Switch source and target
de: Quelle und Ziel wechseln
es: Intercambiar origen y destino
it: Scambia origine e destinazione
ja: ソースとターゲットの切り替え
ko: 원본과 대상 전환
pt_br: Alternar origem e destino
ru: Поменять местами источник и назначение
zh_hans: 切换源和目标
zh_hant: 切換來源和目標

# schemaCompare.sourceButtonTitle
source: Select Source
de: Quelle auswählen
es: Seleccionar origen
it: Seleziona origine
ja: ソースの選択
ko: 원본 선택
pt_br: Selecionar Origem
ru: Выбор источника
zh_hans: 选择源
zh_hant: 選取來源

# schemaCompare.targetButtonTitle
source: Select Target
de: Ziel auswählen
es: Seleccionar destino
it: Seleziona destinazione
ja: ターゲットの選択
ko: 대상 선택
pt_br: Selecionar Destino
ru: Выберите целевой объект
zh_hans: 选择目标
zh_hant: 選取目標

# schemaCompare.openScmpButton
source: Open .scmp file
de: SCMP-Datei öffnen
es: Abrir el archivo .scmp
it: Apri file con estensione scmp
ja: .scmp ファイルを開く
ko: .scmp 파일 열기
pt_br: Abrir arquivo .scmp
ru: Открыть файл SCMP
zh_hans: 打开 .scmp 文件
zh_hant: 開啟 .scmp 檔案

# schemaCompare.openScmpButtonTitle
source: Load source, target, and options saved in an .scmp file
de: Quelle und Ziel sowie die in einer SCMP-Datei gespeicherten Optionen laden
es: Cargue el origen, el destino y las opciones guardadas en un archivo .scmp
it: Carica origine, destinazione e opzioni salvate in un file con estensione scmp
ja: .scmp ファイルに保存されたソース、ターゲット、およびオプションを読み込みます
ko: .scmp 파일에 저장된 원본, 대상 및 옵션 로드
pt_br: Carregar a origem, o destino e as opções salvas em um arquivo .scmp
ru: Загрузить источник, целевой объект и параметры, сохраненные в файле SCMP
zh_hans: 加载保存在 .smp 文件中的源、目标和选项
zh_hant: 載入儲存在 .scmp 檔案中的來源、目標和選項

# schemaCompare.saveScmpButton
source: Save .scmp file
de: SCMP-Datei speichern
es: Guardar archivo .scmp
it: Salva file con estensione scmp
ja: .scmp ファイルを保存
ko: .scmp 파일 저장
pt_br: Salvar o arquivo .scmp
ru: Сохранить файл SCMP
zh_hans: 保存 .smp 文件
zh_hant: 儲存 .scmp 檔案
