Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SchemaCompare.Description.IgnoreColumnOrder
source: Specifies whether differences in table column order should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Tabellenspaltenreihenfolge beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si hay que ignorar las diferencias en el orden de columnas de una tabla o bien hay que actualizarlas al publicar en una base de datos.
it: Specifica se le differenze nell'ordine colonne della tabella devono essere ignorate o aggiornate durante la pubblicazione di un database.
ja: データベースに公開するときに、テーブルの列の順序の違いを無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 테이블 열 순서의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se as diferenças na ordem das colunas da tabela deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Указывает, следует ли игнорировать или обновлять различия в порядке столбцов таблицы при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新表列顺序的差异。
zh_hant: 指定當您發佈至資料庫時，要略過或更新資料表資料行順序的差異。

# schemaCompare.compareErrorMessage
source: Schema Compare failed: {0}
de: Fehler beim Schemavergleich: {0}
es: Error en la comparación de esquemas: {0}
it: Il confronto schemi non è riuscito: {0}
ja: Schema Compare に失敗しました: {0}
ko: 스키마 비교 실패: {0}
pt_br: Falha na Comparação de Esquemas: {0}
ru: Сбой при сравнении схем: {0}
zh_hans: 架构比较失败: {0}
zh_hant: 結構描述比較失敗: {0}

# schemaCompare.saveScmpErrorMessage
source: Save scmp failed: '{0}'
de: Fehler beim Speichern der SCMP-Datei: {0}
es: Error al guardar scmp: "{0}"
it: Il salvataggio del file scmp non è riuscito: '{0}'
ja: scmp を保存できませんでした: '{0}'
ko: scmp 저장 실패: '{0}'
pt_br: Falha ao salvar scmp: '{0}'
ru: Сбой при сохранении файла SCMP: "{0}"
zh_hans: 保存 scmp 失败:“{0}”
zh_hant: 無法儲存 scmp: '{0}'

# schemaCompare.cancelErrorMessage
source: Cancel schema compare failed: '{0}'
de: Fehler beim Abbrechen des Schemavergleichs: {0}
es: Error al cancelar la comparación de esquemas: "{0}"
it: L'annullamento del confronto schemi non è riuscito: '{0}'
ja: スキーマ比較を取り消すことができませんでした: '{0}'
ko: 스키마 비교 취소 실패: '{0}'
pt_br: Falha no cancelamento da comparação de esquemas: '{0}'
ru: Сбой при отмене сравнения схем: "{0}"
zh_hans: 取消架构比较失败:“{0}”
zh_hant: 取消結構描述比較失敗: '{0}'

# schemaCompare.generateScriptErrorMessage
source: Generate script failed: '{0}'
de: Fehler beim Generieren des Skripts: {0}
es: Error al generar el script "{0}"
it: La generazione dello script non è riuscita: '{0}'
ja: スクリプトを生成できませんでした: '{0}'
ko: 스크립트 생성 실패: '{0}'
pt_br: Falha ao gerar script: '{0}'
ru: Сбой при создании сценария: "{0}"
zh_hans: 生成脚本失败:“{0}”
zh_hant: 無法產生指令碼: '{0}'

# schemaCompare.updateErrorMessage
source: Schema Compare Apply failed '{0}'
de: Fehler beim Anwenden des Schemavergleichs: {0}
es: Error en la aplicación de comparación de esquemas "0"
it: L'applicazione del confronto schemi non è riuscita: '{0}'
ja: Schema Compare を適用できませんでした '{0}'
ko: 스키마 비교 적용 실패 '{0}'
pt_br: Falha ao Aplicar a Comparação de Esquemas '{0}'
ru: Сбой при применении Сравнения схем "{0}"
zh_hans: 架构比较应用失败“{0}”
zh_hant: 結構描述比較套用失敗 '{0}'

# schemaCompare.openScmpErrorMessage
source: Open scmp failed: '{0}'
de: Fehler beim Öffnen der SCMP-Datei: {0}
es: Error al abrir el scmp "{0}"
it: L'apertura del file scmp non è riuscita: '{0}'
ja: scmp を開くことができませんでした: '{0}'
ko: scmp 열기 실패: '{0}'
pt_br: Falha ao abrir o scmp: '{0}'
ru: Сбой при открытии файла SCMP: "{0}"
zh_hans: 打开 scmp 失败:“{0}”
zh_hant: 無法開啟 scmp: '{0}'
