Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SchemaCompare.Description.TreatVerificationErrorsAsWarnings
source: Specifies whether errors encountered during publish verification should be treated as warnings. The check is performed against the generated deployment plan before the plan is executed against your target database. Plan verification detects problems such as the loss of target-only objects (such as indexes) that must be dropped to make a change. Verification will also detect situations where dependencies (such as a table or view) exist because of a reference to a composite project, but do not exist in the target database. You might choose to do this to get a complete list of all issues, instead of having the publish action stop on the first error.
de: Gibt an, ob während der Veröffentlichungsüberprüfung ermittelte Fehler als Warnungen behandelt werden sollen. Die Überprüfung wird anhand des generierten Bereitstellungsplans durchgeführt, bevor der Plan für die Zieldatenbank ausgeführt wird. Bei der Planüberprüfung werden Probleme wie der Verlust von nur in der Zieldatenbank vorkommenden Objekten (z. B. Indizes) ermittelt, die gelöscht werden müssen, damit eine Änderung vorgenommen werden kann. Bei der Überprüfung werden auch Situationen ermittelt, in denen Abhängigkeiten (z. B. eine Tabelle oder Sicht) aufgrund eines Verweises auf ein zusammengesetztes Projekt vorhanden sind, die jedoch nicht in der Zieldatenbank vorhanden sind. Sie können diese Option verwenden, um eine vollständige Liste aller Probleme abzurufen, und dadurch erreichen, dass der Veröffentlichungsvorgang nicht beim ersten Fehler beendet wird.
es: Especifica si los errores detectados durante la comprobación de la publicación deben tratarse como advertencias. La comprobación se realiza sobre el plan de implementación generado antes de que se ejecute sobre la base de datos de destino. La comprobación del plan detecta problemas tales como la pérdida de objetos que solo existen en el destino (tales como índices) y que deben quitarse para realizar un cambio, así como la existencia de dependencias (como una tabla o vista) por referencia a un proyecto inexistentes en la base de datos de destino. Puede seleccionar esta opción para obtener una lista completa de todos los problemas en lugar de que la acción de publicación se detenga en el primer error.
it: Specifica se gli errori rilevati durante la verifica della pubblicazione devono essere considerati avvisi. Il controllo viene effettuato sul piano di distribuzione generato prima che questo venga eseguito sul database di destinazione. La verifica del piano rileva problemi quali la perdita di oggetti della sola destinazione (ad esempio gli indici) che devono essere rimossi per apportare una modifica. La verifica inoltre individua le dipendenze (ad esempio una tabella o una visualizzazione) che sono presenti a causa di un riferimento a un progetto composito, ma che non esistono nel database di destinazione. È possibile scegliere di eseguire questo controllo per ottenere un elenco completo di tutti i problemi anziché l'arresto dell'azione di pubblicazione al primo errore.
ja: 公開の検証中に発生したエラーを警告として扱うかを指定します。デプロイ計画をターゲット データベースに対して実行する前に、生成されたデプロイ計画がチェックされます。計画の検証では、変更を加えるために取り除く必要のあるターゲットのみのオブジェクト (インデックスなど) の損失などの問題が検出されます。また、複合プロジェクトへの参照のためテーブルやビューなどに依存関係が存在するのに、それがターゲット データベースに存在しない状況も検出されます。すべての問題の完全な一覧を取得するには、最初のエラー発生時に公開操作を停止するのではなく、この方法を使用することをお勧めします。
ko: 게시 확인 중 발생한 오류를 경고로 처리할지 여부를 지정합니다. 생성된 배포 계획이 대상 데이터베이스를 대상으로 실행되기 전에 이 계획을 대상으로 검사가 수행됩니다. 계획 확인에서는 변경하기 위해 삭제해야 하는 대상 전용 개체(예: 인덱스) 손실과 같은 문제를 검색합니다. 또한 확인에서는 복합 프로젝트에 대한 참조로 인해 종속성(예: 테이블 또는 뷰)이 존재하지만 대상 데이터베이스에는 이와 같은 종속성이 존재하지 않는 상황을 검색합니다. 첫 번째 오류에서 게시 작업을 중지하는 대신 모든 문제의 전체 목록을 가져오려면 이 작업을 수행하도록 선택할 수 있습니다.
pt_br: Especifica se erros encontrados durante a verificação de publicação deverão ser tratados como avisos. A verificação é executada no plano de implantação gerado antes de o plano ser executado no banco de dados de destino. A verificação do plano detecta problemas, como a perda de objetos somente destino (como índices), que deverão ser removidos para fazer uma alteração. A verificação também detecta situações em que dependências (como uma tabela ou exibição) existem por causa de uma referência a um projeto composto, mas não existem no banco de dados de destino. Convém fazer isso para obter uma lista completa de todos os problemas, ao invés de interromper a publicação no primeiro erro.
ru: Определяет, будут ли ошибки, обнаруженные при проверке публикации, обрабатываться как предупреждения. Проверка созданного плана развертывания проводится до его выполнения в целевой базе данных. При проверке плана обнаруживаются такие проблемы, как потеря объектов, которые существуют только в целевой базе данных (например, индексы) и которые необходимо удалить для внесения изменения. Также выявляются ситуации, в которых зависимые объекты (например, таблицы и представления) должны существовать из-за ссылки на составной проект, но не существуют в целевой базе данных. Выбрав этот вариант, можно получить полный список проблем, а не прекращать действие публикации после первой ошибки.
zh_hans: 指定是否应将发布验证期间遇到的错误视为警告。在对目标数据库执行生成的部署计划之前，会对计划执行检查。计划验证过程将检测仅适用于目标的对象(如索引)是否丢失等问题，必须删除这些对象才能进行更改。验证过程还将检测以下情况: 由于有对复合项目的引用，因而存在依赖项(如表或视图)，但这些依赖项不存在于目标数据库中。如果需要获取所有问题的完整列表，而不是在出现第一个错误时停止发布操作，可以选择执行此操作。
zh_hant: 指定是否應該將發行驗證期間所發生的錯誤視為警告。系統會先針對產生的部署計畫執行檢查，之後再針對您的目標資料庫執行計畫。計畫驗證會偵測出遺漏僅限於目標的物件 (例如索引) 這類必須卸除後才能進行變更的問題。驗證也會偵測因為參考複合物件而有相依性 (例如資料表或檢視) 存在，但是卻不存在目標資料庫中的情況。您可以選擇執行這個動作，以取得所有問題的清單，而不讓發行動作在第一次錯誤時就停止。

# SchemaCompare.Description.ScriptRefreshModule
source: Include refresh statements at the end of the publish script.
de: Hiermit werden Aktualisierungsanweisungen am Ende des Veröffentlichungsskripts eingeschlossen.
es: Incluir instrucciones de actualización al final del script de publicación.
it: Includi istruzioni di aggiornamento alla fine dello script di pubblicazione.
ja: 公開スクリプトの末尾に更新ステートメントを含めます。
ko: 게시 스크립트의 끝에 새로 고침 문을 포함합니다.
pt_br: Inclui instruções de atualização no fim do script de publicação.
ru: Включать инструкции обновления в конец скрипта публикации.
zh_hans: 在发布脚本的末尾包括刷新语句。
zh_hant: 在發佈指令碼的結尾包含重新整理陳述式。

# SchemaCompare.Description.ScriptNewConstraintValidation
source: At the end of publish all of the constraints will be verified as one set, avoiding data errors caused by a check or foreign key constraint in the middle of publish. If set to False, your constraints will be published without checking the corresponding data.
de: Hiermit werden am Ende der Veröffentlichung alle Einschränkungen gemeinsam überprüft, um Datenfehler durch eine CHECK- oder Fremdschlüsseleinschränkung während der Veröffentlichung zu vermeiden. Bei Festlegung auf FALSE werden die Einschränkungen veröffentlicht, ohne dass die zugehörigen Daten überprüft werden.
es: Al final de la publicación, todas las restricciones se comprobarán como un conjunto, evitando errores de datos debidos a una restricción CHECK o de clave externa en medio de la publicación. Si se establece en False, las restricciones se publicarán sin comprobar los datos correspondientes.
it: Al termine della pubblicazione tutti i vincoli verranno verificati come un unico set, in modo da evitare errori di dati provocati da vincoli CHECK o di chiave esterna durante la pubblicazione. Se l'impostazione è False, i vincoli verranno pubblicati senza il controllo dei dati corrispondenti.
ja: 公開の最後に、すべての制約が 1 つのセットとしてチェックされるため、公開の途中でチェックまたは外部キー制約によってデータ エラーが発生することを回避できます。False に設定した場合、対応するデータをチェックすることなく制約が公開されます。
ko: 게시가 끝나면 모든 제약 조건을 하나의 세트로 확인하여 게시 중에 CHECK 또는 FOREIGN KEY 제약 조건으로 인한 데이터 오류를 방지합니다. False로 설정하면 해당 데이터를 검사하지 않고 제약 조건이 게시됩니다.
pt_br: Ao final da publicação, todas as restrições serão verificadas em conjunto, evitando erros de dados causados por uma restrição de verificação ou chave estrangeira no meio da publicação. Se o item for definido como False, as restrições serão publicadas sem que os dados correspondentes sejam verificados.
ru: В конце публикации все ограничения будут проверяться как один набор, что позволяет избежать ошибок данных, вызванных проверочным ограничением или ограничением внешнего ключа в середине публикации. Если задано значение FALSE, то ограничения будут публиковаться без проверки соответствующих данных.
zh_hans: 在发布的末尾，所有约束将作为一个集合进行验证，以避免由发布中间的检查或外键约束导致的数据错误。如果设置为 False，则发布约束时不会检查相应的数据。
zh_hant: 在發行結束時，系統會將所有條件約束當做單一集合進行驗證，避免檢查或外部索引鍵條件約束在發行進行中導致資料錯誤。如果設定為 False，系統將會發行您的條件約束，但不檢查對應的資料。

# SchemaCompare.Description.ScriptFileSize
source: Controls whether size is specified when adding a file to a filegroup.
de: Hiermit wird gesteuert, ob beim Hinzufügen einer Datei zu einer Dateigruppe die Größe angegeben wird.
es: Controla si se especifica el tamaño al agregar un archivo a un grupo de archivos.
it: Controlla se nell'aggiunta di un file a un filegroup vengono specificate le dimensioni.
ja: ファイル グループにファイルを追加するときにサイズを指定するかを設定します。
ko: 파일 그룹에 파일을 추가할 때 크기를 지정할지 여부를 제어합니다.
pt_br: Determina se o tamanho é especificado ao adicionar um arquivo a um filegroup.
ru: Определяет, указывается ли размер при добавлении файла в файловую группу filegroup.
zh_hans: 控制在将文件添加到文件组时是否指定大小。
zh_hant: 控制將檔案加入 filegroup 時是否指定大小。

# SchemaCompare.Description.ScriptDeployStateChecks
source: Specifies whether statements are generated in the publish script to verify that the database name and server name match the names specified in the database project.
de: Gibt an, ob Anweisungen im Veröffentlichungsskript generiert werden, um zu überprüfen, ob der Datenbankname und der Servername mit den im Datenbankprojekt angegebenen Namen übereinstimmen.
es: Especifica si se generan instrucciones en el script de publicación para comprobar que los nombres de la base de datos y del servidor coinciden con los nombres especificados en el proyecto de base de datos.
it: Specifica se le istruzioni vengono generate nello script di pubblicazione per verificare che il nome del database e il nome del server corrispondano ai nomi specificati nel progetto di database.
ja: データベース名とサーバー名がデータベース プロジェクトで指定された名前と一致していることを確認するステートメントを公開スクリプト内に生成するかを指定します。
ko: 데이터베이스 이름 및 서버 이름이 데이터베이스 프로젝트에 지정된 이름과 일치하는지 확인하는 문을 게시 스크립트에 생성할지 여부를 지정합니다.
pt_br: Especifica se as instruções serão geradas no script de publicação para verificar se o nome do banco de dados e o nome do servidor correspondem aos nomes especificados no projeto de banco de dados.
ru: Определяет, создаются ли инструкции в скрипте публикации, чтобы проверить соответствие имен базы данных и сервера с именами, указанными в проекте базы данных.
zh_hans: 指定是否在发布脚本中生成语句以验证数据库名称和服务器名称是否与在数据库项目中指定的名称相匹配。
zh_hant: 指定是否在發行指令碼中產生陳述式，來驗證資料庫名稱和伺服器名稱是否符合資料庫專案中指定的名稱。

# SchemaCompare.Description.ScriptDatabaseOptions
source: Specifies whether target database properties should be set or updated as part of the publish action.
de: Gibt an, ob die Eigenschaften der Zieldatenbank als Teil des Veröffentlichungsvorgangs festgelegt oder aktualisiert werden sollen.
es: Especifica si las propiedades de la base de datos deben establecerse o actualizarse como parte de la acción de publicación.
it: Specifica se le proprietà del database di destinazione devono essere impostate o aggiornate durante l'azione di pubblicazione.
ja: ターゲット データベースのプロパティを公開操作の一部として設定するか、更新するかを指定します。
ko: 게시 동작의 일부로 대상 데이터베이스 속성을 설정할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se as propriedades do banco de dados de destino devem ser definidas ou atualizadas como parte da ação de publicação.
ru: Определяет, будут ли свойства целевой базы данных задаваться или обновляться в рамках действия публикации.
zh_hans: 指定是否应在发布操作中设置或更新目标数据库属性。
zh_hant: 指定是否要在執行發佈動作時，設定或更新目標資料庫屬性。

# SchemaCompare.Description.ScriptDatabaseCompatibility
source: Specifies whether differences in the database compatibility should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Datenbankkompatibilität beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en la compatibilidad de la base de datos se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nella compatibilità del database devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データベース互換性の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 데이터베이스 호환성 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na compatibilidade do banco de dados deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в уровне совместимости базы данных при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新数据库兼容性差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新資料庫相容性的差異。

# SchemaCompare.Description.ScriptDatabaseCollation
source: Specifies whether differences in the database collation should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Datenbanksortierung beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en la intercalación de la base de datos se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nelle regole di confronto del database devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データベース照合順序の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 데이터베이스 데이터 정렬의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no agrupamento do banco de dados deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Указывает, будут пропускаться или обновляться различия в параметрах сортировки базы данных при выполнении публикации в нее.
zh_hans: 指定在发布到数据库时忽略还是更新数据库排序规则差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新資料庫定序的差異。

# SchemaCompare.Description.RunDeploymentPlanExecutors
source: Specifies whether DeploymentPlanExecutor contributors should be run when other operations are executed.
de: Gibt an, ob DeploymentPlanExecutor-Mitwirkende beim Ausführen anderer Vorgänge ausgeführt werden sollen.
es: Especifica si los contribuyentes de DeploymentPlanExecutor deben ejecutarse cuando se ejecutan otras operaciones.
it: Specifica se eseguire i collaboratori DeploymentPlanExecutor quando vengono eseguite le altre operazioni.
ja: 他の操作が実行されているときに、DeploymentPlanExecutor の共同作成者を実行するかを指定します。
ko: 다른 작업을 실행할 때 DeploymentPlanExecutor 기여자를 실행할지 여부를 지정합니다.
pt_br: Especifica se os colaboradores de DeploymentPlanExecutor deverão ser executados quando outras operações forem executadas.
ru: Указывает, должны ли участники DeploymentPlanExecutor запускаться при выполнении других операций.
zh_hans: 指定在执行其他操作时 DeploymentPlanExecutor 参与者是否应运行。
zh_hant: 指定其他作業執行時，是否應該執行 DeploymentPlanExecutor 參與者。

# SchemaCompare.Description.RegisterDataTierApplication
source: Specifies whether the schema is registered with the database server.
de: Gibt an, ob das Schema beim Datenbankserver registriert wird.
es: Especifica si el esquema se registra en el servidor de base de datos.
it: Specifica se lo schema viene registrato con il server di database.
ja: スキーマをデータベース サーバーに登録するかを指定します。
ko: 스키마가 데이터베이스 서버에 등록되는지 여부를 지정합니다.
pt_br: Especifica se o esquema é registrado no servidor de banco de dados.
ru: Указывает, регистрируется ли схема на сервере базы данных.
zh_hans: 指定是否向数据库服务器注册架构。
zh_hant: 指定結構描述是否向資料庫伺服器註冊。

# SchemaCompare.Description.PopulateFilesOnFileGroups
source: Specifies whether a new file is also created when a new FileGroup is created in the target database.
de: Gibt an, ob beim Erstellen einer neuen FileGroup in der Zieldatenbank ebenfalls eine neue Datei erstellt wird.
es: Especifica si se crea también un nuevo archivo cuando se crea un nuevo grupo de archivos en la base de datos de destino.
it: Specifica se viene anche creato un nuovo file quando si crea un nuovo oggetto FileGroup nel database di destinazione.
ja: ターゲット データベースで新しいファイル グループが作成されたときに新しいファイルも作成するかを指定します。
ko: 대상 데이터베이스에 새 파일 그룹을 만들 때 새 파일도 만들어지는지 여부를 지정합니다.
pt_br: Especifica se um novo arquivo também será criado quando um novo FileGroup for criado no banco de dados de destino.
ru: Указывает, будет ли также создан файл при создании файловой группы FileGroup в целевой базе данных.
zh_hans: 指定在目标数据库中创建新文件组时是否也创建新文件。
zh_hant: 指定在目標資料庫中建立新 FileGroup 時，是否一併建立新檔案。

# SchemaCompare.Description.NoAlterStatementsToChangeClrTypes
source: Specifies that publish should always drop and re-create an assembly if there is a difference instead of issuing an ALTER ASSEMBLY statement
de: Gibt an, dass bei der Veröffentlichung eine abweichende Assembly immer gelöscht und neu erstellt wird, anstatt eine ALTER ASSEMBLY-Anweisung auszugeben.
es: Especifica que la publicación siempre debe quitar y volver a crear un ensamblado si hay una diferencia en lugar de emitir una instrucción ALTER ASSEMBLY
it: Specifica che se durante la pubblicazione viene rilevata una differenza, viene sempre rimosso e ricreato un assembly invece di eseguire un'istruzione ALTER ASSEMBLY
ja: アセンブリに相違がある場合、公開で ALTER ASSEMBLY ステートメントを発行するのではなく、常にアセンブリを削除して作成し直すことを指定します。
ko: ALTER ASSEMBLY 문을 실행하는 대신, 차이가 있는 경우 게시에서 항상 어셈블리를 삭제했다가 다시 만들도록 지정합니다.
pt_br: Especifica que a publicação sempre deverá remover e recriar um assembly quando houver uma diferença em vez de emitir uma instrução ALTER ASSEMBLY
ru: Указывает, что при обнаружении различий в процессе публикации всегда следует удалять и повторно создавать сборку, а не использовать инструкцию ALTER ASSEMBLY.
zh_hans: 指定在存在差异时，发布应始终删除并重新创建程序集，而不是发出 ALTER ASSEMBLY 语句
zh_hant: 指定發佈應在有差異時一律捨棄並重新建立組件，而非發出 ALTER ASSEMBLY 陳述式

# SchemaCompare.Description.IncludeTransactionalScripts
source: Specifies whether transactional statements should be used where possible when you publish to a database.
de: Gibt an, ob beim Veröffentlichen in einer Datenbank nach Möglichkeit Transaktionsanweisungen verwendet werden sollen.
es: Especifica si las instrucciones transaccionales se deben usar siempre que sea posible al publicar en una base de datos.
it: Specifica se usare quando possibile le istruzioni transazionali quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、可能であればトランザクション ステートメントを使用するかを指定します。
ko: 데이터베이스에 게시할 때 가능한 경우 트랜잭션 문을 사용할지 여부를 지정합니다.
pt_br: Especifica se instruções transacionais deverão ser usadas onde possível quando você publicar em um banco de dados.
ru: Определяет, будут ли по возможности использоваться инструкции транзакций при публикации в базе данных.
zh_hans: 指定在发布到数据库时是否应在可能的位置使用事务性语句。
zh_hant: 指定當您發佈至資料庫時，是否應該盡可能地使用交易陳述式。

# SchemaCompare.Description.IncludeCompositeObjects
source: Include all composite elements as part of a single publish operation.
de: Hiermit werden alle zusammengesetzten Elemente als Teil eines einzigen Veröffentlichungsvorgangs eingeschlossen.
es: Incluya todos los elementos compuestos como parte de una única operación de publicación.
it: Include tutti gli elementi compositi in un'unica operazione di pubblicazione.
ja: 単一の公開操作の一部としてすべての複合要素を含めます。
ko: 모든 복합 요소를 단일 게시 작업의 일부로 포함합니다.
pt_br: Inclua todos os elementos compostos como parte de uma única operação de publicação.
ru: Включить все составные элементы в единую операцию публикации.
zh_hans: 将所有复合元素包含为单个发布操作的一部分。
zh_hant: 將所有複合項目加入單一發佈作業中。

# SchemaCompare.Description.AllowUnsafeRowLevelSecurityDataMovement
source: Do not block data motion on a table which has Row Level Security if this property is set to true. Default is false.
de: Bei Festlegung dieser Eigenschaft auf TRUE wird das Verschieben von Daten in einer Tabelle mit Sicherheit auf Zeilenebene nicht blockiert. Der Standardwert lautet FALSE.
es: No bloquee la transmisión de datos en una tabla con seguridad de nivel de fila si esta propiedad está establecida en true. El valor predeterminado es false.
it: Non blocca il movimento di dati in una tabella con Sicurezza a livello di riga se questa proprietà è impostata su true. L'impostazione predefinita è false.
ja: このプロパティが true に設定されている場合、行レベル セキュリティを使用するテーブルに対するデータ モーションをブロックしません。既定値は false です。
ko: 이 속성을 True로 설정하면 행 수준 보안이 설정된 테이블에서 데이터 이동을 차단하지 않습니다. 기본값은 False입니다.
pt_br: Não bloqueie a movimentação de dados em uma tabela que tem Segurança em Nível de Linha se esta propriedade estiver definida como true. O padrão é false.
ru: Не блокировать перемещение данных в таблице с безопасностью на уровне строк, если свойство имеет значение TRUE. Значение по умолчанию — FALSE.
zh_hans: 如果此属性设置为 true，则不阻止具有行级安全性的表上的数据运动。默认为 false。
zh_hant: 若此屬性設定為 True，請勿封鎖具有資料列層級安全性之資料表的資料移動 (data motion)。預設為 False。

# SchemaCompare.Description.IgnoreWithNocheckOnCheckConstraints
source: Specifies whether differences in the value of the WITH NOCHECK clause for check constraints will be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede im Wert der WITH NOCHECK-Klausel für CHECK-Einschränkungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el valor de la cláusula WITH NOCHECK para las restricciones CHECK se ignorarán o se actualizarán al publicar en una base de datos.
it: Specifica se le differenze nel valore della clausola WITH NOCHECK per vincoli CHECK devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、CHECK 制約の WITH NOCHECK 句の値の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 CHECK 제약 조건의 WITH NOCHECK 절 값의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no valor da cláusula WITH NOCHECK para restrições de verificação serão ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в значении предложения WITH NOCHECK для проверочных ограничений при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新检查约束的 WITH NOCHECK 子句值差异。
zh_hant: 指定當您發行至資料庫時，將忽略或更新檢查條件約束之 WITH NOCHECK 子句值的差異。

# SchemaCompare.Description.IgnoreFillFactor
source: Specifies whether differences in the fill factor for index storage should be ignored or whether a warning should be issued when you publish to a database.
de: Gibt an, ob Unterschiede beim Füllfaktor für den Indexspeicher beim Veröffentlichen in einer Datenbank ignoriert werden sollen oder ob eine Warnung ausgegeben werden soll.
es: Especifica si las diferencias en el factor de relleno del almacenamiento de índices se deben ignorar o si debe generarse una advertencia al publicar en una base de datos.
it: Specifica se le differenze nel fattore di riempimento per l'archiviazione degli indici devono essere ignorate o se viene inviato un avviso quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、インデックス格納の FILL FACTOR の相違を無視するか、または警告を発するかを指定します。
ko: 데이터베이스에 게시할 때 인덱스 스토리지의 채우기 비율 차이를 무시할지 또는 경고를 발생시킬지 여부를 지정합니다.
pt_br: Especifica se diferenças no fator de preenchimento de armazenamento de índice deverão ser ignoradas ou se um aviso deverá ser emitido quando você publicar em um banco de dados.
ru: Определяет, создается ли предупреждение о различиях в коэффициенте заполнения для хранилища индексов при публикации в базе данных.
zh_hans: 指定在发布到数据库时是忽略索引存储的填充因子差异还是发出警告。
zh_hant: 指定當您發行至資料庫時，應該忽略索引儲存體之填滿因數的差異或應該發出警告。
