Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# schemaCompare.saveScmpButtonTitle
source: Save source and target, options, and excluded elements
de: Quelle und Ziel, Optionen und ausgeschlossene Elemente speichern
es: Guardar origen y destino, opciones y elementos excluidos
it: Salva origine e destinazione, opzioni ed elementi esclusi
ja: ソース、ターゲット、オプション、および除外された要素を保存します
ko: 원본 및 대상, 옵션 및 제외된 요소 저장
pt_br: Salvar a origem e o destino, as opções e os elementos excluídos
ru: Сохранить источник, целевой объект, параметры и исключенные элементы
zh_hans: 保存源、目标、选项和已排除的元素
zh_hant: 儲存來源和目標、選項及排除的元素

# schemaCompare.saveFile
source: Save
de: Speichern
es: Guardar
it: Salva
ja: 保存
ko: 저장
pt_br: Salvar
ru: Сохранить
zh_hans: 保存
zh_hant: 儲存

# schemaCompare.GetConnectionString
source: Do you want to connect to {0}?
de: Möchten Sie eine Verbindung mit "{0}" herstellen?
es: ¿Quiere conectar con {0}?
it: Si desidera connettersi a {0}?
ja: {0} に接続しますか?
ko: {0}에 연결하시겠습니까?
pt_br: Você deseja se conectar a {0}?
ru: Установить подключение к {0}?
zh_hans: 是否要连接到 {0}?
zh_hant: 是否要連接到 {0}?

# schemaCompare.selectConnection
source: Select connection
de: Verbindung auswählen
es: Seleccionar conexión
it: Selezionare connessione
ja: 接続の選択
ko: 연결 선택
pt_br: Selecionar a conexão
ru: Выберите подключение
zh_hans: 选择连接
zh_hant: 選取連線

# SchemaCompare.IgnoreTableOptions
source: Ignore Table Options
de: Tabellenoptionen ignorieren
es: Ignorar opciones de tabla
it: Ignora opzioni di tabella
ja: テーブル オプションを無視する
ko: 테이블 옵션 무시
pt_br: Ignorar as Opções de Tabela
ru: Игнорировать параметры таблицы
zh_hans: 忽略表选项
zh_hant: 忽略資料表選項

# SchemaCompare.IgnoreSemicolonBetweenStatements
source: Ignore Semicolon Between Statements
de: Semikolon zwischen Anweisungen ignorieren
es: Ignorar punto y coma entre instrucciones
it: Ignora punto e virgola tra istruzioni
ja: ステートメント間のセミコロンを無視する
ko: 문 사이의 세미콜론 무시
pt_br: Ignorar Ponto e Vírgula Entre Instruções
ru: Игнорировать точки с запятой между инструкциями
zh_hans: 忽略语句之间的分号
zh_hant: 忽略陳述式之間的分號

# SchemaCompare.IgnoreRouteLifetime
source: Ignore Route Lifetime
de: Gültigkeitsdauer von Routen ignorieren
es: Ignorar la vigencia de la ruta
it: Ignora durata route
ja: ルートの有効期間を無視する
ko: 경로 수명 무시
pt_br: Ignorar o Tempo de Vida da Rota
ru: Игнорировать время существования маршрута
zh_hans: 忽略路由生存期
zh_hant: 忽略路由存留期

# SchemaCompare.IgnoreRoleMembership
source: Ignore Role Membership
de: Rollenmitgliedschaft ignorieren
es: Ignorar la pertenencia a roles
it: Ignora appartenenza al ruolo
ja: ロール メンバーシップを無視する
ko: 역할 멤버 자격 무시
pt_br: Ignorar Associação de Função
ru: Игнорировать членство в роли
zh_hans: 忽略角色成员身份
zh_hant: 忽略角色成員資格

# SchemaCompare.IgnoreQuotedIdentifiers
source: Ignore Quoted Identifiers
de: Bezeichner in Anführungszeichen ignorieren
es: Ignorar identificadores entrecomillados
it: Ignora identificatori delimitati
ja: 引用符で囲まれた識別子を無視する
ko: 따옴표 붙은 식별자 무시
pt_br: Ignorar Identificadores Entre Aspas
ru: Игнорировать нестандартные идентификаторы
zh_hans: 忽略带引号的标识符
zh_hant: 忽略引號識別碼

# SchemaCompare.IgnorePermissions
source: Ignore Permissions
de: Berechtigungen ignorieren
es: Ignorar permisos
it: Ignora autorizzazioni
ja: アクセス許可を無視する
ko: 사용 권한 무시
pt_br: Ignorar Permissões
ru: Игнорировать разрешения
zh_hans: 忽略权限
zh_hant: 忽略權限

# SchemaCompare.IgnorePartitionSchemes
source: Ignore Partition Schemes
de: Partitionsschemas ignorieren
es: Ignorar esquemas de partición
it: Ignora schemi di partizione
ja: パーティション構成を無視する
ko: 파티션 구성표 무시
pt_br: Ignorar os Esquemas de Partição
ru: Игнорировать схемы секционирования
zh_hans: 忽略分区方案
zh_hant: 忽略資料分隔配置

# SchemaCompare.IgnoreObjectPlacementOnPartitionScheme
source: Ignore Object Placement On Partition Scheme
de: Objektplatzierung im Partitionsschema ignorieren
es: Ignorar la colocación de objetos en el esquema de partición
it: Ignora posizione oggetto nello schema di partizione
ja: パーティション構成でのオブジェクトの位置を無視する
ko: 파티션 구성표에서 개체 배치 무시
pt_br: Ignorar o Posicionamento de Objeto no Esquema de Partição
ru: Пропускать размещение объекта в схеме секционирования
zh_hans: 忽略分区方案中的对象放置
zh_hant: 忽略磁碟分割配置上的物件放置

# SchemaCompare.IgnoreNotForReplication
source: Ignore Not For Replication
de: "Nicht zur Replikation" ignorieren
es: Ignorar no disponible para replicación
it: Ignora non per la replica
ja: レプリケーション用以外を無視する
ko: 복제용 아님 무시
pt_br: Ignorar os que Não São para Replicação
ru: Игнорировать указание "Не для репликации"
zh_hans: 忽略“不用于复制”
zh_hant: 忽略不可複寫

# SchemaCompare.IgnoreLoginSids
source: Ignore Login Sids
de: Anmelde-SIDs ignorieren
es: Ignorar SID de inicio de sesión
it: Ignora SID di accesso
ja: ログイン SID を無視する
ko: 로그인 SID 무시
pt_br: Ignorar os SIDs de Logon
ru: Игнорировать идентификаторы SID имени входа
zh_hans: 忽略登录 SID
zh_hant: 忽略登入 Sid

# SchemaCompare.IgnoreLockHintsOnIndexes
source: Ignore Lock Hints On Indexes
de: Sperrhinweise für Indizes ignorieren
es: Ignorar sugerencias de bloqueo en índices
it: Ignora hint di blocco in indici
ja: インデックスのロック ヒントを無視する
ko: 인덱스의 잠금 힌트 무시
pt_br: Ignorar Dicas de Bloqueio Em Índices
ru: Игнорировать указания блокировки для индексов
zh_hans: 忽略索引上的锁定提示
zh_hant: 忽略索引的鎖定提示

# SchemaCompare.IgnoreKeywordCasing
source: Ignore Keyword Casing
de: Groß-/Kleinschreibung bei Schlüsselwort ignorieren
es: Ignorar distinción de mayúsculas y minúsculas en palabras clave
it: Ignora maiuscole/minuscole parole chiave
ja: キーワードの大文字/小文字を無視する
ko: 키워드 대/소문자 무시
pt_br: Ignorar o Uso de Maiúsculas e Minúsculas em Palavra-chave
ru: Игнорировать регистр ключевых слов
zh_hans: 忽略关键字大小写
zh_hant: 忽略關鍵字大小寫

# SchemaCompare.IgnoreIndexPadding
source: Ignore Index Padding
de: Indexauffüllung ignorieren
es: Ignorar relleno de índice
it: Ignora riempimento indice
ja: インデックス パディングを無視する
ko: 인덱스 패딩 무시
pt_br: Ignorar o Preenchimento de Índice
ru: Игнорировать заполнение индекса
zh_hans: 忽略索引填充
zh_hant: 忽略索引填補

# SchemaCompare.IgnoreIndexOptions
source: Ignore Index Options
de: Indexoptionen ignorieren
es: Ignorar opciones de índice
it: Ignora opzioni di indice
ja: インデックス オプションを無視する
ko: 인덱스 옵션 무시
pt_br: Ignorar as Opções de Índice
ru: Игнорировать параметры индекса
zh_hans: 忽略索引选项
zh_hant: 忽略索引選項

# SchemaCompare.IgnoreIncrement
source: Ignore Increment
de: Inkrement ignorieren
es: Ignorar incremento
it: Ignora incremento
ja: 増分を無視する
ko: 증분 무시
pt_br: Ignorar Incremento
ru: Игнорировать приращение
zh_hans: 忽略增量
zh_hant: 忽略增量

# SchemaCompare.IgnoreIdentitySeed
source: Ignore Identity Seed
de: ID-Startwert ignorieren
es: Ignorar inicialización de identidad
it: Ignora valore di inizializzazione Identity
ja: ID シードを無視する
ko: ID 시드 무시
pt_br: Ignorar Semente de Identidade
ru: Игнорировать начальное значение IDENTITY
zh_hans: 忽略标识种子
zh_hant: 忽略識別值種子

# SchemaCompare.IgnoreUserSettingsObjects
source: Ignore User Settings Objects
de: Benutzereinstellungsobjekte ignorieren
es: Ignorar objetos de configuración de usuario
it: Ignora oggetti impostazioni utente
ja: ユーザー設定オブジェクトを無視する
ko: 사용자 설정 개체 무시
pt_br: Ignorar os Objetos de Configurações do Usuário
ru: Игнорировать объекты параметров пользователей
zh_hans: 忽略用户设置对象
zh_hant: 忽略使用者設定物件

# SchemaCompare.IgnoreFullTextCatalogFilePath
source: Ignore Full Text Catalog FilePath
de: FilePath für Volltextkatalog ignorieren
es: Ignorar ruta de acceso del archivo de catálogo de texto completo
it: Ignora percorso del file di catalogo full-text
ja: フルテキスト カタログ FilePath を無視する
ko: 전체 텍스트 카탈로그 파일 경로 무시
pt_br: Ignorar o FilePath do Catálogo de Texto Completo
ru: Игнорировать путь к файлу полнотекстового каталога
zh_hans: 忽略全文目录文件路径
zh_hant: 忽略全文檢索目錄 FilePath

# SchemaCompare.IgnoreWhitespace
source: Ignore Whitespace
de: Leerraum ignorieren
es: Ignorar espacio en blanco
it: Ignora spazio vuoto
ja: 空白を無視する
ko: 공백 무시
pt_br: Ignorar Espaço em Branco
ru: Игнорировать пробелы
zh_hans: 忽略空格
zh_hant: 忽略空白

# SchemaCompare.IgnoreWithNocheckOnForeignKeys
source: Ignore With Nocheck On ForeignKeys
de: WITH NOCHECK bei ForeignKeys ignorieren
es: Ignorar WITH NOCHECK en claves externas
it: Ignora WITH NOCHECK in chiavi esterne
ja: 外部キーの With Nocheck を無視する
ko: 외래 키의 WITH NOCHECK 무시
pt_br: Ignorar Com Nocheck Em ForeignKeys
ru: Игнорировать со значением Nocheck для ForeignKeys
zh_hans: 忽略且不检查外键
zh_hant: 忽略 With Nocheck On ForeignKeys

# SchemaCompare.VerifyCollationCompatibility
source: Verify Collation Compatibility
de: Sortierungskompatibilität überprüfen
es: Verificar la compatibilidad de la intercalación
it: Verifica compatibilità regole di confronto
ja: 照合順序の互換性を確認する
ko: 데이터 정렬 호환성 확인
pt_br: Verificar a Compatibilidade da Ordenação
ru: Проверить совместимость параметров сортировки
zh_hans: 验证排序规则兼容性
zh_hant: 驗證定序相容性

# SchemaCompare.UnmodifiableObjectWarnings
source: Unmodifiable Object Warnings
de: Unveränderliche Objektwarnungen
es: Advertencias de objetos no modificables
it: Avvisi per oggetti non modificabili
ja: 変更できないオブジェクトの警告
ko: 수정할 수 없는 개체 경고
pt_br: Avisos de Objeto Não Modificável
ru: Предупреждения о невозможности изменения объекта
zh_hans: 不可修改的对象警告
zh_hant: 無法修改的物件警告

# SchemaCompare.TreatVerificationErrorsAsWarnings
source: Treat Verification Errors As Warnings
de: Überprüfungsfehler als Warnungen behandeln
es: Tratar los errores de verificación como advertencias
it: Considera errori di verifica come avvisi
ja: 検証エラーを警告として扱う
ko: 확인 오류를 경고로 처리
pt_br: Tratar os Erros de Verificação Como Avisos
ru: Рассматривать ошибки проверок как предупреждения
zh_hans: 将验证错误视为警告
zh_hant: 將驗證錯誤視為警告

# SchemaCompare.ScriptRefreshModule
source: Script Refresh Module
de: Skriptaktualisierungsmodul
es: Módulo de actualización de script
it: Crea script per modulo di aggiornamento
ja: スクリプトでの更新モジュール
ko: 스크립트 새로 고침 모듈
pt_br: Módulo de Atualização de Script
ru: Модуль обновления сценария
zh_hans: 脚本刷新模块
zh_hant: 指令碼重新整理模組

# SchemaCompare.ScriptNewConstraintValidation
source: Script New Constraint Validation
de: Überprüfung neuer Einschränkungen per Skript
es: Nueva validación de restricciones de script
it: Crea script per convalida nuovi vincoli
ja: スクリプトでの新しい制約の検証
ko: 스크립트 새 제약 조건 유효성 검사
pt_br: Validação de Nova Restrição de Script
ru: Проверка новых ограничений для сценария
zh_hans: 脚本新约束验证
zh_hant: 指令碼新增條件約束驗證

# SchemaCompare.ScriptFileSize
source: Script File Size
de: Skriptdateigröße
es: Tamaño del archivo de script
it: Crea script per dimensioni file
ja: スクリプト ファイル サイズ
ko: 스크립트 파일 크기
pt_br: Tamanho do Arquivo de Script
ru: Размер файла сценария
zh_hans: 脚本文件大小
zh_hant: 指令碼檔案大小

# SchemaCompare.ScriptDeployStateChecks
source: Script Deploy StateChecks
de: StateChecks per Skript bereitstellen
es: Comprobaciones de estado de la implementación del script
it: Crea script per verifiche stato di distribuzione
ja: スクリプトでのデプロイ状態チェック
ko: 스크립트 배포 StateChecks
pt_br: StateChecks de Implantação de Script
ru: Проверки состояния для развертывания сценария
zh_hans: 脚本部署状态检查
zh_hant: 指令碼部署 StateChecks

# SchemaCompare.ScriptDatabaseOptions
source: Script Database Options
de: Skriptdatenbankoptionen
es: Opciones de base de datos de script
it: Crea script per opzioni database
ja: スクリプトでのデータベース オプション
ko: 스크립트 데이터베이스 옵션
pt_br: Opções de Banco de Dados de Script
ru: Параметры базы данных сценариев
zh_hans: 脚本数据库选项
zh_hant: 指令碼資料庫選項

# SchemaCompare.ScriptDatabaseCompatibility
source: Script Database Compatibility
de: Skriptdatenbankkompatibilität
es: Compatibilidad de bases de datos de script
it: Crea script per compatibilità database
ja: スクリプトでのデータベース互換性
ko: 스크립트 데이터베이스 호환성
pt_br: Compatibilidade do Banco de Dados de Script
ru: Совместимость базы данных сценариев
zh_hans: 脚本数据库兼容性
zh_hant: 指令碼資料庫相容性

# SchemaCompare.ScriptDatabaseCollation
source: Script Database Collation
de: Skriptdatenbanksortierung
es: Intercalación de base de datos de script
it: Crea script per regole di confronto database
ja: スクリプトでのデータベース照合順序
ko: 스크립트 데이터베이스 데이터 정렬
pt_br: Ordenação de Banco de Dados de Script
ru: Параметры сортировки базы данных сценариев
zh_hans: 脚本数据库排序规则
zh_hant: 指令碼資料庫定序

# SchemaCompare.RunDeploymentPlanExecutors
source: Run Deployment Plan Executors
de: Bereitstellungsplan-Executors ausführen
es: Ejecutar ejecutores del plan de implementación
it: Esegui executor di piani di distribuzione
ja: デプロイ計画 Executor の実行
ko: 배포 계획 실행기 실행
pt_br: Executar Executores do Plano de Implantação
ru: Запустить исполнители плана развертывания
zh_hans: 运行部署计划执行器
zh_hant: 執行部署計劃執行程式

# SchemaCompare.RegisterDataTierApplication
source: Register DataTier Application
de: Datenschichtanwendung registrieren
es: Registrar la aplicación de DataTier
it: Registra applicazione del livello dati
ja: データ層アプリケーションの登録
ko: DataTier 애플리케이션 등록
pt_br: Registrar o Aplicativo DataTier
ru: Регистрация приложения DataTier
zh_hans: 注册数据层应用程序
zh_hant: 註冊 DataTier 應用程式

# SchemaCompare.PopulateFilesOnFileGroups
source: Populate Files On File Groups
de: Dateien in Dateigruppen auffüllen
es: Rellenar archivos en grupos de archivos
it: Popola file in gruppi di file
ja: ファイル グループに対してファイルを作成する
ko: 파일 그룹에 파일 채우기
pt_br: Popular Arquivos em Grupos de Arquivos
ru: Заполнить файл в группах файлов
zh_hans: 在文件组上填充文件
zh_hant: 填入檔案群組上的檔案

# SchemaCompare.NoAlterStatementsToChangeClrTypes
source: No Alter Statements To Change Clr Types
de: Keine ALTER-Anweisungen zum Ändern von CLR-Typen
es: No hay instrucciones de modificación para cambiar los tipos CLR
it: Non modificare istruzioni per cambiare i tipi CLR
ja: CLR 型を変更する ALTER ステートメントがない
ko: CLR 유형을 변경하기 위한 Alter 문 사용 안 함
pt_br: Sem instruções Alter para alterar tipos Clr
ru: Не использовать инструкции ALTER для изменения типов CLR
zh_hans: 没有 Alter 语句来更改 Clr 类型
zh_hant: 不更改陳述式以變更 Cir 類型

# SchemaCompare.IncludeTransactionalScripts
source: Include Transactional Scripts
de: Transaktionsskripts einschließen
es: Incluir scripts transaccionales
it: Includi script transazionali
ja: トランザクション スクリプトを含める
ko: 트랜잭션 스크립트 포함
pt_br: Incluir Scripts Transacionais
ru: Включить транзакционные сценарии
zh_hans: 包括事务脚本
zh_hant: 包含交易指令碼

# SchemaCompare.IncludeCompositeObjects
source: Include Composite Objects
de: Zusammengesetzte Objekte einschließen
es: Incluir objetos compuestos
it: Includi oggetti compositi
ja: 複合オブジェクトを含める
ko: 복합 개체 포함
pt_br: Incluir Objetos Compostos
ru: Включить составные объекты
zh_hans: 包括复合对象
zh_hant: 包含複合物件

# SchemaCompare.AllowUnsafeRowLevelSecurityDataMovement
source: Allow Unsafe Row Level Security Data Movement
de: Unsichere Datenverschiebung bei Sicherheit auf Zeilenebene zulassen
es: Permitir el movimiento de datos de seguridad de nivel de fila no seguro
it: Consenti spostamento dati con Sicurezza a livello di riga non sicuro
ja: 安全でない行レベル セキュリティ データ移動を許可する
ko: 안전하지 않은 행 수준 보안 데이터 이동 허용
pt_br: Permitir a Movimentação Não Segura de Dados de Segurança em Nível de Linha
ru: Разрешить небезопасное перемещение данных безопасности на уровне строк
zh_hans: 允许不安全行级安全性数据移动
zh_hant: 允許不安全的資料列層級安全性資料移動

# SchemaCompare.IgnoreWithNocheckOnCheckConstraints
source: Ignore With No check On Check Constraints
de: WITH NOCHECK bei CHECK CONSTRAINT ignorieren
es: Omitir cláusula WITH NOCHECK en restricciones CHECK
it: Ignora WITH NOCHECK in vincoli CHECK
ja: CHECK 制約の With No check を無視する
ko: CHECK 제약 조건의 WITH NOCHECK 무시
pt_br: Ignorar Sem Nenhuma Verificação nas Restrições de Verificação
ru: Игнорировать со значением "Без проверки" для параметра "Проверочные ограничения"
zh_hans: 忽略而不检查检查约束
zh_hant: 忽略 With No check On Check 條件約束

# SchemaCompare.IgnoreFillFactor
source: Ignore Fill Factor
de: Füllfaktor ignorieren
es: Ignorar factor de relleno
it: Ignora fattore di riempimento
ja: FILL FACTOR を無視する
ko: 채우기 비율 무시
pt_br: Ignorar Fator de Preenchimento
ru: Игнорировать коэффициент заполнения
zh_hans: 忽略填充因子
zh_hant: 忽略填滿因數

# SchemaCompare.IgnoreFileSize
source: Ignore File Size
de: Dateigröße ignorieren
es: Ignorar tamaño de archivo
it: Ignora dimensioni file
ja: ファイル サイズを無視する
ko: 파일 크기 무시
pt_br: Ignorar o Tamanho do Arquivo
ru: Игнорировать размер файла
zh_hans: 忽略文件大小
zh_hant: 忽略檔案大小

# SchemaCompare.IgnoreFilegroupPlacement
source: Ignore Filegroup Placement
de: Dateigruppenplatzierung ignorieren
es: Ignorar la colocación del grupo de archivos
it: Ignora posizione filegroup
ja: ファイル グループの配置を無視する
ko: 파일 그룹 배치 무시
pt_br: Ignorar o Posicionamento do Grupo de Arquivos
ru: Игнорировать размещение файловой группы
zh_hans: 忽略文件组放置
zh_hant: 忽略檔案群組放置

# SchemaCompare.DoNotAlterReplicatedObjects
source: Do Not Alter Replicated Objects
de: Replizierte Objekte nicht ändern
es: No modificar objetos replicados
it: Non modificare oggetti replicati
ja: レプリケートされたオブジェクトを変更しない
ko: 복제된 개체 변경 안 함
pt_br: Não Alterar os Objetos Replicados
ru: Не изменяйте реплицированные объекты
zh_hans: 不更改复制的对象
zh_hant: 不要改變已複寫物件

# SchemaCompare.DoNotAlterChangeDataCaptureObjects
source: Do Not Alter Change Data Capture Objects
de: Change Data Capture-Objekte nicht ändern
es: No modificar los objetos de captura de datos modificados
it: Non modificare oggetti Change Data Capture
ja: 変更データ キャプチャ オブジェクトを変更しない
ko: 변경 데이터 캡처 개체 변경 안 함
pt_br: Não Alterar os Objetos de Captura de Dados de Alterações
ru: Не выполнять операцию ALTER для объектов отслеживания измененных данных
zh_hans: 不更改变更数据捕获对象
zh_hant: 不要更改異動資料擷取物件

# SchemaCompare.DisableAndReenableDdlTriggers
source: Disable And Reenable Ddl Triggers
de: DDL-Trigger deaktivieren und erneut aktivieren
es: Deshabilitar y volver a habilitar los desencadenadores de ddl
it: Disabilita e riabilita trigger DDL
ja: DDL トリガーを無効にし、再び有効にする
ko: DDL 트리거를 해제한 후 다시 설정
pt_br: Desabilitar e Reabilitar os Gatilhos DDL
ru: Отключить и снова включить триггеры DDL
zh_hans: 禁用并重新启用 DDL 触发器
zh_hant: 停用再重新啟用 Ddl 觸發程序

# SchemaCompare.DeployDatabaseInSingleUserMode
source: Deploy Database In Single User Mode
de: Datenbank im Einzelbenutzermodus bereitstellen
es: Implementar base de datos en modo de usuario único
it: Distribuisci database in modalità utente singolo
ja: シングル ユーザー モードでデータベースをデプロイする
ko: 단일 사용자 모드에서 데이터베이스 배포
pt_br: Implantar o Banco de Dados no Modo de Usuário Único
ru: Развернуть базу данных в однопользовательском режиме
zh_hans: 在单用户模式下部署数据库
zh_hant: 在單一使用者模式中部署資料庫

# SchemaCompare.CreateNewDatabase
source: Create New Database
de: Neue Datenbank erstellen
es: Crear nueva base de datos
it: Crea nuovo database
ja: 新しいデータベースの作成
ko: 새 데이터베이스 만들기
pt_br: Criar Banco de Dados
ru: Создать базу данных
zh_hans: 新建数据库
zh_hant: 建立新的資料庫

# SchemaCompare.CompareUsingTargetCollation
source: Compare Using Target Collation
de: Unter Verwendung der Zielsortierung vergleichen
es: Comparar con la intercalación de destino
it: Confronta usando regole di confronto di destinazione
ja: ターゲットの照合順序を使用して比較する
ko: 대상 데이터 정렬을 사용하여 비교
pt_br: Comparar Usando a Ordenação de Destino
ru: Сравнивать с помощью параметров сортировки целевого объекта
zh_hans: 使用目标排序规则进行比较
zh_hant: 使用目標定序進行比較

# SchemaCompare.CommentOutSetVarDeclarations
source: Comment Out Set Var Declarations
de: SetVar-Deklarationen auskommentieren
es: Convertir en comentario las declaraciones de var establecidas
it: Imposta come commento le dichiarazioni SetVar
ja: コメント アウト セット変数宣言
ko: Set Var 선언을 주석으로 처리
pt_br: Comentário nas Declarações de Definição de Var
ru: Закомментировать объявления заданных переменных
zh_hans: 注释掉 Set Var 声明
zh_hant: Comment Out Set Var 宣告

# SchemaCompare.BlockWhenDriftDetected
source: Block When Drift Detected
de: Bei erkannter Abweichung blockieren
es: Bloquear cuando se detecte una desviación
it: Blocca se viene rilevata una deviazione
ja: ドリフトが検出されたときにブロックする
ko: 드리프트 검색 시 차단
pt_br: Bloquear Quando For Detectado Descompasso
ru: Блокировать при обнаружении смещения
zh_hans: 检测到偏移时阻止
zh_hant: 當偵測到飄移時封鎖

# SchemaCompare.BlockOnPossibleDataLoss
source: Block On Possible Data Loss
de: Bei möglichem Datenverlust blockieren
es: Bloquear ante una posible pérdida de datos
it: Blocca in caso di possibile perdita di dati
ja: データ損失の可能性がある場合にブロックする
ko: 데이터 손실 가능성이 있는 경우 차단
pt_br: Bloquear Em Uma Possível Perda de Dados
ru: Блокировать при возможной потере данных
zh_hans: 在可能发生数据丢失时阻止
zh_hant: 於可能遺失資料時封鎖

# SchemaCompare.BackupDatabaseBeforeChanges
source: Backup Database Before Changes
de: Datenbank vor Änderungen sichern
es: Copia de seguridad de la base de datos antes de los cambios
it: Esegui backup del database prima delle modifiche
ja: 変更前にデータベースをバックアップする
ko: 변경하기 전에 데이터베이스 백업
pt_br: Fazer Backup do Banco de Dados Antes das Alterações
ru: Создать резервную копию базы данных перед изменением
zh_hans: 在更改前备份数据库
zh_hant: 在變更前備份資料庫

# SchemaCompare.AllowIncompatiblePlatform
source: Allow Incompatible Platform
de: Inkompatible Plattform zulassen
es: Permitir plataforma no compatible
it: Consenti piattaforma incompatibile
ja: 互換性のないプラットフォームを許可する
ko: 호환되지 않는 플랫폼 허용
pt_br: Permitir Plataforma Incompatível
ru: Разрешить несовместимые платформы
zh_hans: 允许不兼容的平台
zh_hant: 允許不相容的平台

# SchemaCompare.AllowDropBlockingAssemblies
source: Allow Drop Blocking Assemblies
de: Löschen von Blockierungsassemblys zulassen
es: Permitir quitar los ensamblados de bloqueo
it: Consenti rimozione assembly di blocco
ja: ブロックしているアセンブリの削除を許可する
ko: 차단 어셈블리 삭제 허용
pt_br: Permitir a Remoção de Assemblies de Bloqueio
ru: Разрешить удаление блокирующих сборок
zh_hans: 允许删除阻止程序集
zh_hant: 允許捨棄封鎖的組件

# SchemaCompare.DropConstraintsNotInSource
source: Drop Constraints Not In Source
de: Nicht in der Quelle enthaltene Einschränkungen löschen
es: Quitar limitaciones que no estén en el origen
it: Rimuovi vincoli non nell'origine
ja: ソース内にない制約を削除する
ko: 원본에 없는 제약 조건 삭제
pt_br: Remover as Restrições que Não Estão na Origem
ru: Удалить ограничения, отсутствующие в источнике
zh_hans: 删除不在源中的约束
zh_hant: 捨棄不在來源中的條件約束

# SchemaCompare.DropDmlTriggersNotInSource
source: Drop Dml Triggers Not In Source
de: Nicht in der Quelle enthaltene DML-Trigger löschen
es: Quitar desencadenadores DML que no estén en el origen
it: Rimuovi trigger DML non nell'origine
ja: ソース内にない DML トリガーを削除する
ko: 원본에 없는 DML 트리거 삭제
pt_br: Remover os Gatilhos DML que Não Estão na Origem
ru: Удалить триггеры DML, отсутствующие в источнике
zh_hans: 删除未在源中的 DML 触发器
zh_hant: 捨棄不在來源中的 Dml 觸發程序

# SchemaCompare.DropExtendedPropertiesNotInSource
source: Drop Extended Properties Not In Source
de: Nicht in der Quelle enthaltene erweiterte Eigenschaften löschen
es: Quitar las propiedades extendidas que no estén en el origen
it: Rimuovi proprietà estese non nell'origine
ja: ソース内にない拡張プロパティを削除する
ko: 원본에 없는 확장 속성 삭제
pt_br: Remover as Propriedades Estendidas que Não Estão na Origem
ru: Удалить расширенные свойства, отсутствующие в источнике
zh_hans: 删除不在源中的扩展属性
zh_hant: 捨棄不在來源中的擴充屬性

# SchemaCompare.DropIndexesNotInSource
source: Drop Indexes Not In Source
de: Nicht in der Quelle enthaltene Indizes löschen
es: Quitar los índices que no estén en el origen
it: Rimuovi indici non nell'origine
ja: ソース内にないインデックスを削除する
ko: 원본에 없는 인덱스 삭제
pt_br: Remover os Índices que Não Estão na Origem
ru: Удалить индексы, отсутствующие в источнике
zh_hans: 删除不在源中的索引
zh_hant: 捨棄不在來源中的索引

# SchemaCompare.IgnoreFileAndLogFilePath
source: Ignore File And Log File Path
de: Datei- und Protokolldateipfad ignorieren
es: Ignorar archivo y ruta del archivo de registro
it: Ignora percorso di file e file di log
ja: ファイルおよびログ ファイル パスを無視する
ko: 파일 및 로그 파일 경로 무시
pt_br: Ignorar o Arquivo e o Caminho do Arquivo de Log
ru: Игнорировать путь к файлу и файлу журнала
zh_hans: 忽略文件和日志文件路径
zh_hant: 忽略檔案和記錄檔路徑

# SchemaCompare.IgnoreExtendedProperties
source: Ignore Extended Properties
de: Erweiterte Eigenschaften ignorieren
es: Ignorar propiedades extendidas
it: Ignora proprietà estese
ja: 拡張プロパティを無視する
ko: 확장 속성 무시
pt_br: Ignorar as Propriedades Estendidas
ru: Игнорировать расширенные свойства
zh_hans: 忽略扩展属性
zh_hant: 忽略擴充屬性
