Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SchemaCompare.IgnoreDmlTriggerState
source: Ignore Dml Trigger State
de: DML-Triggerstatus ignorieren
es: Ignorar el estado del desencadenador de DML
it: Ignora stato trigger DML
ja: DML トリガーの状態を無視する
ko: DML 트리거 상태 무시
pt_br: Ignorar o Estado do Gatilho DML
ru: Игнорировать состояние триггеров DML
zh_hans: 忽略 DML 触发状态
zh_hant: 忽略 Dml 觸發程序狀態

# SchemaCompare.IgnoreDmlTriggerOrder
source: Ignore Dml Trigger Order
de: DML-Triggerreihenfolge ignorieren
es: Ignorar el orden del desencadenador de DML
it: Ignora ordine trigger DML
ja: DML トリガーの順序を無視する
ko: DML 트리거 순서 무시
pt_br: Ignorar a Ordem do Gatilho DML
ru: Игнорировать порядок триггеров DML
zh_hans: 忽略 DML 触发顺序
zh_hant: 忽略 Dml 觸發程序順序

# SchemaCompare.IgnoreDefaultSchema
source: Ignore Default Schema
de: Standardschema ignorieren
es: Ignorar el esquema predeterminado
it: Ignora schema predefinito
ja: 既定のスキーマを無視する
ko: 기본 스키마 무시
pt_br: Ignorar o Esquema Padrão
ru: Игнорировать схему по умолчанию
zh_hans: 忽略默认架构
zh_hant: 忽略預設結構描述

# SchemaCompare.IgnoreDdlTriggerState
source: Ignore Ddl Trigger State
de: DDL-Triggerstatus ignorieren
es: Ignorar el estado del desencadenador de DDL
it: Ignora stato trigger DDL
ja: DDL トリガーの状態を無視する
ko: DDL 트리거 상태 무시
pt_br: Ignorar o Estado do Gatilho DDL
ru: Игнорировать состояние триггеров DDL
zh_hans: 忽略 DDL 触发状态
zh_hant: 忽略 Ddl 觸發程序狀態

# SchemaCompare.IgnoreDdlTriggerOrder
source: Ignore Ddl Trigger Order
de: DDL-Triggerreihenfolge ignorieren
es: Ignorar el orden del desencadenador de DDL
it: Ignora ordine trigger DDL
ja: DDL トリガーの順序を無視する
ko: Ddl 트리거 순서 무시
pt_br: Ignorar a Ordem do Gatilho DDL
ru: Игнорировать порядок триггеров DDL
zh_hans: 忽略 DDL 触发顺序
zh_hant: 忽略 Ddl 觸發程序順序

# SchemaCompare.IgnoreCryptographicProviderFilePath
source: Ignore Cryptographic Provider FilePath
de: Dateipfad für Kryptografieanbieter ignorieren
es: Ignorar ruta de archivos del proveedor de cifrado
it: Ignora percorso file del provider del servizio di crittografia
ja: 暗号化プロバイダーのファイル パスを無視する
ko: 암호화 공급자 파일 경로 무시
pt_br: Ignorar o FilePath do Provedor de Criptografia
ru: Игнорировать путь к файлу поставщика служб шифрования
zh_hans: 忽略加密提供程序文件路径
zh_hant: 忽略密碼編譯提供者 FilePath

# SchemaCompare.VerifyDeployment
source: Verify Deployment
de: Bereitstellung überprüfen
es: Verificar la implementación
it: Verifica distribuzione
ja: デプロイを確認する
ko: 배포 확인
pt_br: Verificar a Implantação
ru: Проверить развертывание
zh_hans: 验证部署
zh_hant: 驗證部署

# SchemaCompare.IgnoreComments
source: Ignore Comments
de: Kommentare ignorieren
es: Ignorar comentarios
it: Ignora commenti
ja: コメントを無視する
ko: 주석 무시
pt_br: Ignorar Comentários
ru: Игнорировать комментарии
zh_hans: 忽略注释
zh_hant: 忽略註解

# SchemaCompare.IgnoreColumnCollation
source: Ignore Column Collation
de: Spaltensortierung ignorieren
es: Ignorar intercalación de columnas
it: Ignora regole di confronto delle colonne
ja: 列の照合順序を無視する
ko: 열 데이터 정렬 무시
pt_br: Ignorar a Ordenação de Colunas
ru: Игнорировать параметры сортировки столбцов
zh_hans: 忽略列排序规则
zh_hant: 忽略資料行定序

# SchemaCompare.IgnoreAuthorizer
source: Ignore Authorizer
de: Autorisierer ignorieren
es: Ignorar autorizador
it: Ignora provider di autorizzazioni
ja: 承認者を無視する
ko: 권한 부여자 무시
pt_br: Ignorar o Autorizador
ru: Игнорировать операции авторизации
zh_hans: 忽略授权者
zh_hant: 忽略授權者

# SchemaCompare.IgnoreAnsiNulls
source: Ignore AnsiNulls
de: ANSI NULLS-Einstellung ignorieren
es: Ignorar AnsiNulls
it: Ignora ANSI NULLS
ja: AnsiNulls を無視する
ko: AnsiNulls 무시
pt_br: Ignorar AnsiNulls
ru: Игнорировать AnsiNulls
zh_hans: 忽略 AnsiNulls
zh_hant: 忽略 AnsiNulls

# SchemaCompare.GenerateSmartDefaults
source: Generate SmartDefaults
de: Intelligente Standardwerte generieren
es: Generar SmartDefaults
it: Genera impostazioni predefinite intelligenti
ja: SmartDefaults の生成
ko: SmartDefaults 생성
pt_br: Gerar SmartDefaults
ru: Создание интеллектуальных умолчаний
zh_hans: 生成智能默认值
zh_hant: 產生 SmartDefaults

# SchemaCompare.DropStatisticsNotInSource
source: Drop Statistics Not In Source
de: Nicht in der Quelle enthaltene Statistiken löschen
es: Quitar las estadísticas que no estén en origen
it: Rimuovi statistiche non nell'origine
ja: ソース内にない統計をドロップする
ko: 원본에 없는 통계 삭제
pt_br: Remover as Estatísticas que Não Estão na Origem
ru: Удалить статистику, отсутствующую в источнике
zh_hans: 删除不在源中的统计信息
zh_hant: 捨棄不在來源中的統計資料

# SchemaCompare.DropRoleMembersNotInSource
source: Drop Role Members Not In Source
de: Nicht in der Quelle enthaltene Rollenmitglieder löschen
es: Quitar miembros de rol que no estén en el origen
it: Rimuovi membri del ruolo non nell'origine
ja: ソースに含まれないロール メンバーをドロップする
ko: 원본에 없는 역할 멤버 삭제
pt_br: Remover os Membros da Função que Não Estão na Origem
ru: Удалить члены ролей, отсутствующие в источнике
zh_hans: 删除不在源中的角色成员
zh_hant: 捨棄不在來源中的角色成員

# SchemaCompare.DropPermissionsNotInSource
source: Drop Permissions Not In Source
de: Nicht in der Quelle enthaltene Berechtigungen löschen
es: Quitar permisos que no estén en el origen
it: Rimuovi autorizzazioni non nell'origine
ja: ソース内にないアクセス許可をドロップする
ko: 원본에 없는 사용 권한 삭제
pt_br: Remover as Permissões que Não Estão na Origem
ru: Удалить разрешения, отсутствующие в источнике
zh_hans: 删除未在源中的权限
zh_hant: 捨棄不在來源中的權限

# SchemaCompare.DropObjectsNotInSource
source: Drop Objects Not In Source
de: Nicht in der Quelle enthaltene Objekte löschen
es: Quitar objetos que no estén en el origen
it: Rimuovi oggetti non nell'origine
ja: ソース内にないオブジェクトをドロップする
ko: 원본에 없는 개체 삭제
pt_br: Remover os Objetos que Não Estão na Origem
ru: Удалить объекты, отсутствующие в источнике
zh_hans: 删除未在源中的对象
zh_hant: 捨棄不在來源中的物件

# SchemaCompare.IgnoreColumnOrder
source: Ignore Column Order
de: Spaltenreihenfolge ignorieren
es: Ignorar el orden de las columnas
it: Ignora ordine delle colonne
ja: 列の順序を無視する
ko: 열 순서 무시
pt_br: Ignorar a Ordem de Colunas
ru: Игнорировать порядок столбцов
zh_hans: 忽略列顺序
zh_hant: 忽略資料行順序

# SchemaCompare.Aggregates
source: Aggregates
de: Aggregate
es: Agregados
it: Aggregati
ja: 集約
ko: 집계
pt_br: Agregações
ru: Статистические выражения
zh_hans: 聚合
zh_hant: 彙總

# SchemaCompare.ApplicationRoles
source: Application Roles
de: Anwendungsrollen
es: Roles de aplicación
it: Ruoli applicazione
ja: アプリケーション ロール
ko: 애플리케이션 역할
pt_br: Funções de Aplicativo
ru: Роли приложений
zh_hans: 应用程序角色
zh_hant: 應用程式角色

# SchemaCompare.Assemblies
source: Assemblies
de: Assemblys
es: Ensamblados
it: Assembly
ja: アセンブリ
ko: 어셈블리
ru: Сборки
zh_hans: 程序集
zh_hant: 組件

# SchemaCompare.AssemblyFiles
source: Assembly Files
de: Assemblydateien
es: Archivos de ensamblado
it: File di assembly
ja: アセンブリ ファイル
ko: 어셈블리 파일
pt_br: Arquivos do Assembly
ru: Файлы сборки
zh_hans: 程序集文件
zh_hant: 組件檔

# SchemaCompare.AsymmetricKeys
source: Asymmetric Keys
de: Asymmetrische Schlüssel
es: Claves asimétricas
it: Chiavi asimmetriche
ja: 非対称キー
ko: 비대칭 키
pt_br: Chaves Assimétricas
ru: Асимметричные ключи
zh_hans: 非对称密钥
zh_hant: 非對稱金鑰

# SchemaCompare.BrokerPriorities
source: Broker Priorities
de: Brokerprioritäten
es: Prioridades de Broker
it: Priorità di Service Broker
ja: ブローカーの優先度
ko: Broker 우선 순위
pt_br: Prioridades do Agente
ru: Приоритеты компонента Service Broker
zh_hans: 中转站优先级
zh_hant: Broker 優先權

# SchemaCompare.Certificates
source: Certificates
de: Zertifikate
es: Certificados
it: Certificati
ja: 証明書
ko: 인증서
pt_br: Certificados
ru: Сертификаты
zh_hans: 证书
zh_hant: 憑證

# SchemaCompare.ColumnEncryptionKeys
source: Column Encryption Keys
de: Spaltenverschlüsselungsschlüssel
es: Claves de cifrado de columna
it: Chiavi di crittografia della colonna
ja: 列暗号化キー
ko: 열 암호화 키
pt_br: Chaves de Criptografia de Coluna
ru: Ключи шифрования столбца
zh_hans: 列加密密钥
zh_hant: 資料行加密金鑰

# SchemaCompare.ColumnMasterKeys
source: Column Master Keys
de: Spaltenhauptschlüssel
es: Claves maestras de columna
it: Chiavi master della colonna
ja: 列マスター キー
ko: 열 마스터 키
pt_br: Chaves Mestras de Coluna
ru: Главные ключи столбцов
zh_hans: 列主密钥
zh_hant: 資料行主要金鑰

# SchemaCompare.Contracts
source: Contracts
de: Verträge
es: Contratos
it: Contratti
ja: コントラクト
ko: 계약
pt_br: Contratos
ru: Контракты
zh_hans: 协定
zh_hant: 合約

# SchemaCompare.DatabaseOptions
source: Database Options
de: Datenbankoptionen
es: Opciones de base de datos
it: Opzioni database
ja: データベース オプション
ko: 데이터베이스 옵션
pt_br: Opções de Banco de Dados
ru: Параметры базы данных
zh_hans: 数据库选项
zh_hant: 資料庫選項

# SchemaCompare.DatabaseRoles
source: Database Roles
de: Datenbankrollen
es: Roles de base de datos
it: Ruoli database
ja: データベース ロール
ko: 데이터베이스 역할
pt_br: Funções de Banco de Dados
ru: Роли базы данных
zh_hans: 数据库角色
zh_hant: 資料庫角色

# SchemaCompare.DatabaseTriggers
source: Database Triggers
de: Datenbanktrigger
es: Desencadenadores de bases de datos
it: Trigger database
ja: データベース トリガー
ko: 데이터베이스 트리거
pt_br: Gatilhos de Banco de Dados
ru: Триггеры базы данных
zh_hans: 数据库触发器
zh_hant: 資料庫觸發程序

# SchemaCompare.Defaults
source: Defaults
de: Standardwerte
es: Valores predeterminados
it: Impostazioni predefinite
ja: 既定値
ko: 기본값
pt_br: Padrões
ru: Значения по умолчанию
zh_hans: 默认值
zh_hant: 預設

# SchemaCompare.ExtendedProperties
source: Extended Properties
de: Erweiterte Eigenschaften
es: Propiedades extendidas
it: Proprietà estese
ja: 拡張プロパティ
ko: 확장 속성
pt_br: Propriedades Estendidas
ru: Расширенные свойства
zh_hans: 扩展属性
zh_hant: 擴充屬性

# SchemaCompare.ExternalDataSources
source: External Data Sources
de: Externe Datenquellen
es: Orígenes de datos externos
it: Origini dati esterne
ja: 外部データ ソース
ko: 외부 데이터 원본
pt_br: Fontes de Dados Externas
ru: Источники внешних данных
zh_hans: 外部数据源
zh_hant: 外部資料來源

# SchemaCompare.ExternalFileFormats
source: External File Formats
de: Externe Dateiformate
es: Formatos de archivo externos
it: Formati di file esterni
ja: 外部ファイル形式
ko: 외부 파일 형식
pt_br: Formatos de Arquivo Externos
ru: Форматы внешних файлов
zh_hans: 外部文件格式
zh_hant: 外部檔案格式

# SchemaCompare.ExternalStreams
source: External Streams
de: Externe Streams
es: Flujos externos
it: Flussi esterni
ja: 外部ストリーム
ko: 외부 스트림
pt_br: Fluxos Externos
ru: Внешние потоки
zh_hans: 外部流
zh_hant: 外部資料流

# SchemaCompare.ExternalStreamingJobs
source: External Streaming Jobs
de: Externe Streamingaufträge
es: Trabajos de streaming externos
it: Processi di streaming esterni
ja: 外部ストリーミング ジョブ
ko: 외부 스트리밍 작업
pt_br: Trabalhos de Streaming Externos
ru: Задания внешней потоковой передачи
zh_hans: 外部流式处理作业
zh_hant: 外部串流作業

# SchemaCompare.ExternalTables
source: External Tables
de: Externe Tabellen
es: Tablas externas
it: Tabelle esterne
ja: 外部テーブル
ko: 외부 테이블
pt_br: Tabelas Externas
ru: Внешние таблицы
zh_hans: 外部表
zh_hant: 外部資料表

# SchemaCompare.Filegroups
source: Filegroups
de: Dateigruppen
es: Grupos de archivos
it: Filegroup
ja: ファイル グループ
ko: 파일 그룹
pt_br: Grupos de Arquivos
ru: Файловые группы
zh_hans: 文件组
zh_hant: 檔案群組

# SchemaCompare.Files
source: Files
de: Dateien
es: Archivos
it: File
ja: ファイル
ko: 파일
pt_br: Arquivos
ru: Файлы
zh_hans: 文件
zh_hant: 檔案

# SchemaCompare.FileTables
source: File Tables
de: Dateitabellen
es: Tablas de archivos
it: Tabelle file
ja: ファイル テーブル
ko: 파일 테이블
pt_br: Tabelas de Arquivos
ru: Таблицы файлов
zh_hans: 文件表
zh_hant: 檔案資料表

# SchemaCompare.FullTextCatalogs
source: Full Text Catalogs
de: Volltextkataloge
es: Catálogos de texto completo
it: Cataloghi full-text
ja: フルテキスト カタログ
ko: 전체 텍스트 카탈로그
pt_br: Catálogos de Texto Completo
ru: Полнотекстовые каталоги
zh_hans: 全文目录
zh_hant: 全文檢索目錄

# SchemaCompare.FullTextStoplists
source: Full Text Stoplists
de: Volltextstopplisten
es: Listas de palabras irrelevantes de texto completo
it: Elenchi di parole non significative full-text
ja: フルテキスト ストップリスト
ko: 전체 텍스트 중지 목록
pt_br: Listas de Palavras Irrelevantes de Texto Completo
ru: Полнотекстовые списки стоп-слов
zh_hans: 全文非索引字表
zh_hant: 全文檢索停用字詞表

# SchemaCompare.MessageTypes
source: Message Types
de: Nachrichtentypen
es: Tipos de mensaje
it: Tipi di messaggio
ja: メッセージ型
ko: 메시지 유형
pt_br: Tipos de Mensagem
ru: Типы сообщений
zh_hans: 消息类型
zh_hant: 訊息類型

# SchemaCompare.PartitionFunctions
source: Partition Functions
de: Partitionsfunktionen
es: Funciones de partición
it: Funzioni di partizione
ja: パーティション関数
ko: 파티션 함수
pt_br: Funções de Partição
ru: Функции секционирования
zh_hans: 分区功能
zh_hant: 資料分割函式

# SchemaCompare.PartitionSchemes
source: Partition Schemes
de: Partitionsschemas
es: Esquemas de partición
it: Schemi di partizione
ja: パーティション構成
ko: 파티션 구성표
pt_br: Esquemas de Partição
ru: Схемы секционирования
zh_hans: 分区方案
zh_hant: 資料分割配置

# SchemaCompare.Permissions
source: Permissions
de: Berechtigungen
es: Permisos
it: Autorizzazioni
ja: アクセス許可
ko: 권한
pt_br: Permissões
ru: Разрешения
zh_hans: 权限
zh_hant: 權限

# SchemaCompare.Queues
source: Queues
de: Warteschlangen
es: Colas
it: Code
ja: キュー
ko: 큐
pt_br: Filas
ru: Очереди
zh_hans: 队列
zh_hant: 佇列

# SchemaCompare.RemoteServiceBindings
source: Remote Service Bindings
de: Remotedienstbindungen
es: Enlaces de servicio remoto
it: Associazioni al servizio remoto
ja: リモート サービス バインド
ko: 원격 서비스 바인딩
pt_br: Associações de Serviço Remoto
ru: Привязки удаленных служб
zh_hans: 远程服务绑定
zh_hant: 遠端服務繫結

# SchemaCompare.RoleMembership
source: Role Membership
de: Rollenmitgliedschaft
es: Pertenencia a roles
it: Appartenenza al ruolo
ja: ロール メンバーシップ
ko: 역할 멤버 자격
pt_br: Associação de Função
ru: Членство в роли
zh_hans: 角色成员身份
zh_hant: 角色成員資格

# SchemaCompare.Rules
source: Rules
de: Regeln
es: Reglas
it: Regole
ja: ルール
ko: 규칙
pt_br: Regras
ru: Правила
zh_hans: 规则
zh_hant: 規則

# SchemaCompare.ScalarValuedFunctions
source: Scalar Valued Functions
de: Skalarwertfunktionen
es: Funciones escalares con valor
it: Funzioni a valori scalari
ja: スカラー値関数
ko: 스칼라 반환 함수
pt_br: Funções de Valor Escalar
ru: Скалярные функции
zh_hans: 标量值函数
zh_hant: 純量值函式

# SchemaCompare.SearchPropertyLists
source: Search Property Lists
de: Sucheigenschaftenlisten
es: Listas de propiedades de búsqueda
it: Elenchi delle proprietà di ricerca
ja: 検索プロパティ リスト
ko: 검색 속성 목록
pt_br: Listas de Propriedades de Pesquisa
ru: Списки свойств поиска
zh_hans: 搜索属性列表
zh_hant: 搜尋屬性清單

# SchemaCompare.SecurityPolicies
source: Security Policies
de: Sicherheitsrichtlinien
es: Directivas de seguridad
it: Criteri di sicurezza
ja: セキュリティ ポリシー
ko: 보안 정책
pt_br: Políticas de Segurança
ru: Политики безопасности
zh_hans: 安全策略
zh_hant: 安全性原則

# SchemaCompare.Sequences
source: Sequences
de: Sequenzen
es: Secuencias
it: Sequenze
ja: シーケンス
ko: 시퀀스
pt_br: Sequências
ru: Последовательности
zh_hans: 序列
zh_hant: 序列

# SchemaCompare.Services
source: Services
de: Dienste
es: Servicios
it: Servizi
ja: サービス
ko: 서비스
pt_br: Serviços
ru: Службы
zh_hans: 服务
zh_hant: 服務

# SchemaCompare.Signatures
source: Signatures
de: Signaturen
es: Firmas
it: Firme
ja: 署名
ko: 시그니처
pt_br: Assinaturas
ru: Подписи
zh_hans: 签名
zh_hant: 簽章

# SchemaCompare.StoredProcedures
source: Stored Procedures
de: Gespeicherte Prozeduren
es: Procedimientos almacenados
it: Stored procedure
ja: ストアド プロシージャ
ko: 저장 프로시저
pt_br: Procedimentos Armazenados
ru: Хранимые процедуры
zh_hans: 存储过程
zh_hant: 預存程序

# SchemaCompare.SymmetricKeys
source: Symmetric Keys
de: Symmetrische Schlüssel
es: Claves simétricas
it: Chiavi simmetriche
ja: 対称キー
ko: 대칭 키
pt_br: Chaves Simétricas
ru: Симметричные ключи
zh_hans: 对称密钥
zh_hant: 對稱金鑰

# SchemaCompare.Synonyms
source: Synonyms
de: Synonyme
es: Sinónimos
it: Sinonimi
ja: シノニム
ko: 동의어
pt_br: Sinônimos
ru: Синонимы
zh_hans: 同义词
zh_hant: 同義資料表

# SchemaCompare.Tables
source: Tables
de: Tabellen
es: Tablas
it: Tabelle
ja: テーブル
ko: 테이블
pt_br: Tabelas
ru: Таблицы
zh_hans: 表
zh_hant: 資料表

# SchemaCompare.TableValuedFunctions
source: Table Valued Functions
de: Tabellenwertfunktionen
es: Funciones con valores de tabla
it: Funzioni con valori di tabella
ja: テーブル値関数
ko: 테이블 반환 함수
pt_br: Funções com Valor de Tabela
ru: Функции с табличным значением
zh_hans: 表值函数
zh_hant: 資料表值函式

# SchemaCompare.UserDefinedDataTypes
source: User Defined Data Types
de: Benutzerdefinierte Datentypen
es: Tipos de datos definidos por el usuario
it: Tipi di dati definiti dall'utente
ja: ユーザー定義データ型
ko: 사용자 정의 데이터 형식
pt_br: Tipos de Dados Definidos pelo Usuário
ru: Определяемые пользователем типы данных
zh_hans: 用户定义的数据类型
zh_hant: 使用者定義的資料類型

# SchemaCompare.UserDefinedTableTypes
source: User Defined Table Types
de: Benutzerdefinierte Tabellentypen
es: Tipos de tablas definidos por el usuario
it: Tipi di tabella definiti dall'utente
ja: ユーザー定義テーブル型
ko: 사용자 정의 테이블 형식
pt_br: Tipos de Tabela Definidos pelo Usuário
ru: Определяемые пользователем табличные типы
zh_hans: 用户定义的表类型
zh_hant: 使用者定義的資料表類型

# SchemaCompare.ClrUserDefinedTypes
source: Clr User Defined Types
de: Benutzerdefinierte CLR-Typen
es: Tipos definidos del usuario de CLR
it: Tipi CLR definiti dall'utente
ja: Clr ユーザー定義型
ko: CLR 사용자 정의 형식
pt_br: Tipos Definidos pelo Usuário CLR
ru: Определяемые пользователем типы данных CLR
zh_hans: Clr 用户定义的类型
zh_hant: Clr 使用者定義的類型

# SchemaCompare.Users
source: Users
de: Benutzer
es: Usuarios
it: Utenti
ja: ユーザー
ko: 사용자
pt_br: Usuários
ru: Пользователи
zh_hans: 用户
zh_hant: 使用者

# SchemaCompare.Views
source: Views
de: Sichten
es: Vistas
it: Visualizzazioni
ja: ビュー
ko: 뷰
pt_br: Exibições
ru: Представления
zh_hans: 视图
zh_hant: 檢視

# SchemaCompare.XmlSchemaCollections
source: Xml Schema Collections
de: XML-Schemaauflistungen
es: Colecciones de esquemas XML
it: Raccolte XML Schema
ja: XML スキーマ コレクション
ko: XML 스키마 컬렉션
pt_br: Coleções de Esquema XML
ru: Коллекции схем XML
zh_hans: XML 架构集合
zh_hant: XML 結構描述集合

# SchemaCompare.Audits
source: Audits
de: Überwachungen
es: Auditorías
it: Controlli
ja: 監査
ko: 감사
pt_br: Auditorias
ru: Аудиты
zh_hans: 审核
zh_hant: 稽核

# SchemaCompare.Credentials
source: Credentials
de: Anmeldeinformationen
es: Credenciales
it: Credenziali
ja: 資格情報
ko: 자격 증명
pt_br: Credenciais
ru: Учетные данные
zh_hans: 凭据
zh_hant: 認證

# SchemaCompare.CryptographicProviders
source: Cryptographic Providers
de: Kryptografieanbieter
es: Proveedores de servicios criptográficos
it: Provider del servizio di crittografia
ja: 暗号化プロバイダー
ko: 암호화 공급자
pt_br: Provedores Criptográficos
ru: Поставщики служб шифрования
zh_hans: 加密提供程序
zh_hant: 密碼編譯提供者

# SchemaCompare.DatabaseAuditSpecifications
source: Database Audit Specifications
de: Spezifikationen für Datenbanküberwachung
es: Especificaciones de auditoría de base de datos
it: Specifiche di controllo database
ja: データベース監査の仕様
ko: 데이터베이스 감사 사양
pt_br: Especificações de Auditoria de Banco de Dados
ru: Спецификации аудита базы данных
zh_hans: 数据库审核规范
zh_hant: 資料庫稽核規格

# SchemaCompare.DatabaseEncryptionKeys
source: Database Encryption Keys
de: Verschlüsselungsschlüssel für Datenbank
es: Claves de cifrado de base de datos
it: Chiavi di crittografia del database
ja: データベース暗号化キー
ko: 데이터베이스 암호화 키
pt_br: Chaves de Criptografia de Banco de Dados
ru: Ключи шифрования базы данных
zh_hans: 数据库加密密钥
zh_hant: 資料庫加密金鑰

# SchemaCompare.DatabaseScopedCredentials
source: Database Scoped Credentials
de: Datenbankweit gültige Anmeldeinformationen
es: Credenciales de ámbito de base de datos
it: Credenziali con ambito database
ja: データベース スコープ資格情報
ko: 데이터베이스 범위 자격 증명
pt_br: Credenciais no Escopo do Banco de Dados
ru: Учетные данные для базы данных
zh_hans: 数据库范围的凭据
zh_hant: 資料庫範圍認證

# SchemaCompare.Endpoints
source: Endpoints
de: Endpunkte
es: Puntos de conexión
it: Endpoint
ja: エンドポイント
ko: 엔드포인트
pt_br: Pontos de Extremidade
ru: Конечные точки
zh_hans: 终结点
zh_hant: 端點

# SchemaCompare.ErrorMessages
source: Error Messages
de: Fehlermeldungen
es: Mensajes de error
it: Messaggi di errore
ja: エラー メッセージ
ko: 오류 메시지
pt_br: Mensagens de Erro
ru: Сообщения об ошибках
zh_hans: 错误消息
zh_hant: 錯誤訊息

# SchemaCompare.EventNotifications
source: Event Notifications
de: Ereignisbenachrichtigungen
es: Notificaciones de eventos
it: Notifiche degli eventi
ja: イベント通知
ko: 이벤트 알림
pt_br: Notificações de Evento
ru: Уведомления о событиях
zh_hans: 事件通知
zh_hant: 事件通知

# SchemaCompare.EventSessions
source: Event Sessions
de: Ereignissitzungen
es: Sesiones de eventos
it: Sessioni eventi
ja: イベント セッション
ko: 이벤트 세션
pt_br: Sessões de Evento
ru: Сеансы событий
zh_hans: 事件会话
zh_hant: 事件工作階段

# SchemaCompare.LinkedServerLogins
source: Linked Server Logins
de: Anmeldungen für Verbindungsserver
es: Inicios de sesión de servidor vinculado
it: Accessi server collegato
ja: リンク サーバー ログイン
ko: 연결된 서버 로그인
pt_br: Logons de Servidor Vinculado
ru: Имена входа на связанный сервер
zh_hans: 链接服务器登录名
zh_hant: 連結的伺服器登入

# SchemaCompare.LinkedServers
source: Linked Servers
de: Verbindungsserver
es: Servidores vinculados
it: Server collegati
ja: リンク サーバー
ko: 연결된 서버
pt_br: Servidores Vinculados
ru: Связанные серверы
zh_hans: 链接服务器
zh_hant: 連結的伺服器

# SchemaCompare.Logins
source: Logins
de: Anmeldungen
es: Inicios de sesión
it: Account di accesso
ja: ログイン
ko: 로그인
pt_br: Logons
ru: Имена для входа
zh_hans: 登录名
zh_hant: 登入

# SchemaCompare.MasterKeys
source: Master Keys
de: Hauptschlüssel
es: Claves maestras
it: Chiavi master
ja: マスター キー
ko: 마스터 키
pt_br: Chaves Mestras
ru: Главные ключи
zh_hans: 主密钥
zh_hant: 主要金鑰

# SchemaCompare.Routes
source: Routes
de: Routen
es: Rutas
it: Route
ja: ルート
ko: 경로
pt_br: Rotas
ru: Маршруты
zh_hans: 路由
zh_hant: 路由

# SchemaCompare.ServerAuditSpecifications
source: Server Audit Specifications
de: Spezifikationen für Serverüberwachungen
es: Especificaciones de auditoría de servidor
it: Specifiche di controllo server
ja: サーバー監査の仕様
ko: 서버 감사 사양
pt_br: Especificações de Auditoria de Servidor
ru: Спецификации аудита сервера
zh_hans: 服务器审核规范
zh_hant: 伺服器稽核規格

# SchemaCompare.ServerRoleMembership
source: Server Role Membership
de: Serverrollenmitgliedschaft
es: Pertenencia a rol de servidor
it: Appartenenze al ruolo del server
ja: サーバー ロール メンバーシップ
ko: 서버 역할 멤버 자격
pt_br: Associação de Função de Servidor
ru: Участие в роли сервера
zh_hans: 服务器角色成员身份
zh_hant: 伺服器角色成員資格

# SchemaCompare.ServerRoles
source: Server Roles
de: Serverrollen
es: Roles de servidor
it: Ruoli del server
ja: サーバー ロール
ko: 서버 역할
pt_br: Funções de Servidor
ru: Роли сервера
zh_hans: 服务器角色
zh_hant: 伺服器角色

# SchemaCompare.ServerTriggers
source: Server Triggers
de: Servertrigger
es: Desencadenadores de servidor
it: Trigger server
ja: サーバー トリガー
ko: 서버 트리거
pt_br: Gatilhos de Servidor
ru: Триггеры сервера
zh_hans: 服务器触发器
zh_hant: 伺服器觸發程序

# SchemaCompare.Description.IgnoreTableOptions
source: Specifies whether differences in the table options will be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Tabellenoptionen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en las opciones de tabla se ignorarán o se actualizarán al publicar en una base de datos.
it: Specifica se le differenze nelle opzioni di tabella devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、テーブル オプションの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 테이블 옵션의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nas opções de tabela serão ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в параметрах таблиц при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新表选项差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新資料表選項的差異。
