Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SchemaCompare.Description.IgnoreSemicolonBetweenStatements
source: Specifies whether differences in the semi-colons between T-SQL statements will be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Semikolons zwischen T-SQL-Anweisungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en los caracteres de punto y coma entre las instrucciones T-SQL se ignorarán o se actualizarán al publicar en una base de datos.
it: Specifica se le differenze nei punti e virgola tra le istruzioni T-SQL verranno ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、T-SQL ステートメント間のセミコロンの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 T-SQL 문 사이의 세미콜론 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nos pontos e vírgulas entre instruções T-SQL serão ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в точках с запятой между инструкциями T-SQL при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新 T-SQL 语句间的分号差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新 T-SQL 陳述式間之分號的差異。

# SchemaCompare.Description.IgnoreRouteLifetime
source: Specifies whether differences in the amount of time that SQL Server retains the route in the routing table should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede bei dem Zeitraum, über den SQL Server die Route in der Routingtabelle beibehält, beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el tiempo durante el cual SQL Server conserva la ruta en la tabla de enrutamiento se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nel tempo di conservazione in SQL Server della route nella tabella di routing devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、SQL Server がルーティング テーブルにルートを保持する時間の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 SQL Server가 라우팅 테이블에 경로를 유지하는 기간 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na quantidade de tempo que o SQL Server retém a rota na tabela de roteamento deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в продолжительности периода, в течение которого SQL Server сохраняет маршрут в таблице маршрутизации, при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新 SQL Server 保留路由表中的路由时间量差异。
zh_hant: 指定當您發行至資料庫時，應該忽略或更新 SQL Server 將路由保留在路由表中之時間長短的差異。

# SchemaCompare.Description.IgnoreRoleMembership
source: Specifies whether differences in the role membership of logins should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Rollenmitgliedschaften von Anmeldungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en la pertenencia a roles de inicios de sesión se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nelle appartenenze al ruolo degli account di accesso devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、ログインのロール メンバーシップの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 로그인의 역할 멤버 자격 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na associação de funções de logons deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в членстве в ролях для имен входа при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新登录名的角色成员身份差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新登入之角色成員資格的差異。

# SchemaCompare.Description.IgnoreQuotedIdentifiers
source: Specifies whether differences in the quoted identifiers setting should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Einstellung für Bezeichner in Anführungszeichen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en la configuración de identificadores entre comillas se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nell'impostazione degli identificatori delimitati devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、引用符で囲まれた識別子の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 따옴표 붙은 식별자 설정 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na configuração de identificadores entre aspas deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в параметре заключенных в кавычки идентификаторов при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新带引号的标识符设置差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新引號識別碼設定的差異。

# SchemaCompare.Description.IgnorePermissions
source: Specifies whether permissions should be ignored.
de: Gibt an, ob Berechtigungen ignoriert werden sollen.
es: Especifica si se deben ignorar los permisos.
it: Specifica se le autorizzazioni devono essere ignorate.
ja: 権限を無視するかを指定します。
ko: 사용 권한을 무시할지 여부를 지정합니다.
pt_br: Especifica se as permissões deverão ser ignoradas.
ru: Указывает, следует ли игнорировать разрешения.
zh_hans: 指定是否应忽略权限。
zh_hant: 指定是否應該忽略權限。

# SchemaCompare.Description.IgnorePartitionSchemes
source: Specifies whether differences in partition schemes and functions should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Partitionsschemas und -funktionen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en las funciones y los esquemas de particiones se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze negli schemi di partizione e nelle funzioni devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、パーティション構成と関数の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 파티션 구성표와 함수의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças em esquemas de partição e funções deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в схемах и функциях секционирования при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新分区方案和功能差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新資料分割配置和函數的差異。

# SchemaCompare.Description.IgnoreObjectPlacementOnPartitionScheme
source: Specifies whether an object's placement on a partition scheme should be ignored or updated when you publish to a database.
de: Gibt an, ob die Platzierung eines Objekts in einem Partitionsschema beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden soll.
es: Especifica si la colocación de un objeto en un esquema de partición se debe ignorar o actualizar al publicar en una base de datos.
it: Specifica se la posizione di un oggetto in uno schema di partizione deve essere ignorata o aggiornata quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、パーティション構成でのオブジェクトの位置を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 파티션 구성표의 개체 배치를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se o posicionamento de um objeto em um esquema de partição deverá ser ignorado ou atualizado quando você publicar em um banco de dados.
ru: Определяет, пропускается или обновляется размещение объекта в схеме секционирования при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新对象在分区方案中的位置。
zh_hant: 指定當您發行至資料庫時，應該忽略或更新物件在資料分割配置上的位置。

# SchemaCompare.Description.IgnoreNotForReplication
source: Specifies whether the not for replication settings should be ignored or updated when you publish to a database.
de: Gibt an, ob die Einstellungen für "Nicht zur Replikation" beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si la configuración de no replicación se debe ignorar o actualizar al publicar en una base de datos.
it: Specifica se le impostazioni Non per la replica devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、レプリケーションでは使わない設定を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 복제용 아님 설정을 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se as configurações que não sejam para replicação deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются параметры "не для репликации" при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新“不用于复制”设置。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新不可複寫設定。

# SchemaCompare.Description.IgnoreLoginSids
source: Specifies whether differences in the security identification number (SID) should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Sicherheits-ID (SID) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el número de identificación de seguridad (SID) se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nell'ID di sicurezza (SID) devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、セキュリティ ID 番号 (SID) の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 SID(보안 ID)의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no SID (número de identificação de segurança) deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в идентификаторе безопасности (SID) при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新安全标识号(SID)差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新安全性識別碼 (SID) 的差異。

# SchemaCompare.Description.IgnoreLockHintsOnIndexes
source: Specifies whether differences in the lock hints on indexes should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Sperrhinweisen für Indizes beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en las sugerencias de bloqueo en los índices se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze negli hint di blocco negli indici devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、インデックスのロック ヒントの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 인덱스의 잠금 힌트 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nas dicas de bloqueio em índices deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в указаниях блокировки для индексов при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新索引锁定提示差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新索引之鎖定提示的差異。

# SchemaCompare.Description.IgnoreKeywordCasing
source: Specifies whether differences in the casing of keywords should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Groß-/Kleinschreibung von Schlüsselwörtern beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el uso de mayúsculas y minúsculas en palabras clave se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nell'uso di maiuscole e minuscole delle parole chiave devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、キーワードの大文字と小文字の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 키워드의 대/소문자 구분 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças de uso de maiúsculas em palavras-chave deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в регистре ключевых слов при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新关键字大小写差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新關鍵字之大小寫的差異。

# SchemaCompare.Description.IgnoreIndexPadding
source: Specifies whether differences in the index padding should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Indexauffüllung beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el relleno de índice se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nel riempimento indice devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、インデックス パディングの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 인덱스 패딩 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no preenchimento de índices deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в заполнении индекса при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新索引填充差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新索引填補的差異。

# SchemaCompare.Description.IgnoreIndexOptions
source: Specifies whether differences in the index options should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Indexoptionen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en las opciones de índice se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nelle opzioni di indice devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、インデックス オプションの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 인덱스 옵션 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nas opções de índice deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в параметрах индексов при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新索引选项差异。
zh_hant: 指定當您發佈至資料庫時，是否要忽略或更新索引選項的差異。

# SchemaCompare.Description.IgnoreIncrement
source: Specifies whether differences in the increment for an identity column should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede im Inkrement für eine Identitätsspalte beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el incremento de una columna de identidad se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nell'incremento per una colonna Identity devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、ID 列のインクリメントの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 ID 열의 증분 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no incremento de uma coluna de identidade deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в шаге приращения для столбца идентификаторов при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新标识列增量差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新識別欄位之增量的差異。

# SchemaCompare.Description.IgnoreIdentitySeed
source: Specifies whether differences in the seed for an identity column should be ignored or updated when you publish updates to a database.
de: Gibt an, ob Unterschiede im Startwert für eine Identitätsspalte beim Veröffentlichen von Updates für eine Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el valor de inicialización de una columna de identidad se deben ignorar o actualizar al publicar actualizaciones en una base de datos.
it: Specifica se le differenze nel valore di inizializzazione per una colonna Identity devono essere ignorate o aggiornate quando si pubblicano aggiornamenti in un database.
ja: データベースに公開するとき、ID 列のシードの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 ID 열의 시드 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na semente de uma coluna de identidade deverão ser ignoradas ou atualizadas quando você publicar atualizações em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в начальном значении для столбца идентификаторов при публикации обновлений в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新标识列种子差异。
zh_hant: 指定當您發佈更新至資料庫時，應該忽略或更新識別欄位之種子的差異。

# SchemaCompare.Description.IgnoreUserSettingsObjects
source: Specifies whether differences in the user settings objects will be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Benutzereinstellungsobjekten beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en los objetos de configuración de usuario se ignorarán o se actualizarán al publicar en una base de datos.
it: Specifica se le differenze negli oggetti impostazioni utente devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、ユーザー設定オブジェクトの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 사용자 설정 개체의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nos objetos de configuração de usuário serão ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в объектах параметров пользователя при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新用户设置对象差异。
zh_hant: 指定當您發佈至資料庫時，是否要忽略或更新使用者設定物件的差異。

# SchemaCompare.Description.IgnoreFullTextCatalogFilePath
source: Specifies whether differences in the file path for the full-text catalog should be ignored or whether a warning should be issued when you publish to a database.
de: Gibt an, ob Unterschiede beim Dateipfad für den Volltextkatalog beim Veröffentlichen in einer Datenbank ignoriert werden sollen oder ob eine Warnung ausgegeben werden soll.
es: Especifica si las diferencias en la ruta de acceso al archivo del catálogo de texto completo se deben ignorar o si debe generarse una advertencia al publicar en una base de datos.
it: Specifica se le differenze nel percorso file per il catalogo full-text devono essere ignorate o se viene inviato un avviso quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、フルテキスト カタログのファイル パスの相違を無視するか、または警告を発するかを指定します。
ko: 데이터베이스에 게시할 때 전체 텍스트 카탈로그의 파일 경로 차이를 무시할지 또는 경고가 발생하도록 할지를 지정합니다.
pt_br: Especifica se diferenças no caminho do arquivo do catálogo de texto completo deverão ser ignoradas ou se um aviso deverá ser emitido quando você publicar em um banco de dados.
ru: Определяет, создается ли предупреждение о различиях в пути к файлам для полнотекстового каталога при публикации в базе данных.
zh_hans: 指定在发布到数据库时是忽略全文目录的文件路径差异还是发出警告。
zh_hant: 指定當您發行至資料庫時，應該忽略全文檢索目錄之檔案路徑的差異或應該發出警告。

# SchemaCompare.Description.IgnoreWhitespace
source: Specifies whether differences in white space will be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Leerstellen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en los espacios en blanco se ignorarán o se actualizarán al publicar en una base de datos.
it: Specifica se le differenze nello spazio vuoto devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、空白の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 공백의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças de espaço em branco serão ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в пробелах при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新空白差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新空白字元的差異。

# SchemaCompare.Description.IgnoreWithNocheckOnForeignKeys
source: Specifies whether differences in the value of the WITH NOCHECK clause for foreign keys will be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede im Wert der WITH NOCHECK-Klausel für Fremdschlüssel beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el valor de la cláusula WITH NOCHECK para las claves externas se ignorarán o se actualizarán al publicar en una base de datos.
it: Specifica se le differenze nel valore della clausola WITH NOCHECK per chiavi esterne devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、外部キーの WITH NOCHECK 句の値の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 외래 키의 WITH NOCHECK 절 값 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no valor da cláusula WITH NOCHECK para chaves estrangeiras serão ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в значении предложения WITH NOCHECK для внешних ключей при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新外键 WITH NOCHECK 子句值差异。
zh_hant: 指定當您發行至資料庫時，將忽略或更新外部索引鍵之 WITH NOCHECK 子句值的差異。

# SchemaCompare.Description.VerifyCollationCompatibility
source: Specifies whether collation compatibility is verified.
de: Gibt an, ob die Sortierungskompatibilität überprüft wird.
es: Especifica si se comprueba la compatibilidad de la intercalación.
it: Specifica se la compatibilità delle regole di confronto viene verificata.
ja: 照合順序の互換性を確認するかを指定します。
ko: 데이터 정렬 호환성을 확인할지 여부를 지정합니다.
pt_br: Especifica se a compatibilidade do agrupamento é verificada.
ru: Указывает, проверяется ли совместимость параметров сортировки.
zh_hans: 指定是否验证排序规则兼容性。
zh_hant: 指定是否驗證定序相容性。

# SchemaCompare.Description.UnmodifiableObjectWarnings
source: Specifies whether warnings should be generated when differences are found in objects that cannot be modified, for example, if the file size or file paths were different for a file.
de: Gibt an, ob Warnungen generiert werden sollen, wenn nicht änderbare Unterschiede in Objekten gefunden werden, z. B. wenn die Dateigröße oder die Dateipfade für eine Datei unterschiedlich sind.
es: Especifica si deben generarse advertencias cuando se encuentran diferencias en objetos que no se pueden modificar, como el caso en que el tamaño o las rutas de acceso son diferentes para un archivo.
it: Specifica se devono essere generati avvisi quando vengono rilevate differenze negli oggetti che non possono essere modificati, ad esempio quando le dimensioni o i percorsi di file risultano diversi.
ja: ファイルのサイズまたはパスが異なるなど、変更できない相違がオブジェクトに見つかった場合に、警告を生成するかを指定します。
ko: 예를 들어, 한 파일의 파일 크기나 파일 경로가 다른 경우처럼 수정할 수 없는 개체에서 차이가 발견될 경우 경고를 생성할지 여부를 지정합니다.
pt_br: Especifica se avisos deverão ser gerados quando diferenças forem encontradas em objetos que não podem ser modificados, por exemplo, se o tamanho de arquivo ou caminho de arquivo for diferente para um arquivo.
ru: Определяет, должны ли формироваться предупреждения в тех случаях, когда обнаруживаются различия в объектах, которые нельзя изменить, например в размерах файлов или в том случае, когда к файлу указаны разные пути.
zh_hans: 指定在无法修改的对象中发现差异时(例如，当某个文件的文件大小或文件路径不同时)，是否应生成警告。
zh_hant: 指定在無法修改的物件中發現差異時 (例如檔案的檔案大小或檔案路徑不同) 是否應該產生警告。
