Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SchemaCompare.Description.IgnoreFileAndLogFilePath
source: Specifies whether differences in the paths for files and log files should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Pfaden für Dateien und Protokolldateien beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en las rutas de acceso de los archivos y archivos de registro se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nel percorso dei file e dei file di log devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、ファイルおよびログ ファイルのパスの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 파일 및 로그 파일에 대한 경로 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nos caminhos para arquivos e arquivos de log deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в путях к файлам и файлам журнала при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新文件路径和日志文件路差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新檔案和記錄檔之路徑的差異。

# SchemaCompare.Description.IgnoreExtendedProperties
source: Specifies whether extended properties should be ignored.
de: Gibt an, ob erweiterte Eigenschaften ignoriert werden sollen.
es: Especifica si se deben omitir las propiedades extendidas.
it: Specifica se le proprietà estese devono essere ignorate.
ja: 拡張プロパティを無視するかを指定します。
ko: 확장 속성을 무시할지 여부를 지정합니다.
pt_br: Especifica se as propriedades estendidas devem ser ignoradas.
ru: Указывает, следует ли игнорировать расширенные свойства.
zh_hans: 指定是否应忽略扩展属性。
zh_hant: 指定是否應該忽略擴充屬性。

# SchemaCompare.Description.IgnoreDmlTriggerState
source: Specifies whether differences in the enabled or disabled state of DML triggers should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in Bezug auf den Status (aktiviert bzw. deaktiviert) von DML-Triggern (Data Manipulation Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el estado habilitado o deshabilitado de los desencadenadores DML se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nello stato abilitato o disabilitato dei trigger DML devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、DML トリガーの有効または無効にされた状態の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 DML 트리거 사용/사용 안 함 상태의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no estado habilitado ou desabilitado de gatilhos DML deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в состоянии (включен-выключен) триггеров DML при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新 DML 触发器启用或禁用状态差异。
zh_hant: 指定當您發行至資料庫時，應該忽略或更新 DML 觸發程序之啟用或停用狀態的差異。

# SchemaCompare.Description.IgnoreDmlTriggerOrder
source: Specifies whether differences in the order of Data Manipulation Language (DML) triggers should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der Reihenfolge von DML-Triggern (Data Manipulation Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el orden de los desencadenadores del lenguaje de manipulación de datos (DML) se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nell'ordine dei trigger DML (Data Manipulation Language) triggers devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データ操作言語 (DML) トリガーの順序の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 DML(데이터 조작 언어) 트리거 순서의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na ordem de gatilhos DML (linguagem de manipulação de dados) deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в порядке триггеров языка обработки данных Data Manipulation Language (DML) при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新数据操作语言(DML)触发器中的顺序差异。
zh_hant: 指定當您發行至資料庫時，應該忽略或更新 Data Manipulation Language (DML) triggers 的順序差異。

# SchemaCompare.Description.IgnoreDefaultSchema
source: Specifies whether differences in the default schema should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede im Standardschema beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el esquema predeterminado se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nello schema predefinito devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、既定のスキーマの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 기본 스키마의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no esquema padrão deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в схеме по умолчанию при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新默认架构差异。
zh_hant: 指定當您發佈至資料庫時，是否應忽略或更新預設結構描述中的差異。

# SchemaCompare.Description.IgnoreDdlTriggerState
source: Specifies whether differences in the enabled or disabled state of Data Definition Language (DDL) triggers should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in Bezug auf den Status (aktiviert bzw. deaktiviert) von DDL-Triggern (Data Definition Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el estado habilitado o deshabilitado de los desencadenadores del lenguaje de definición de datos (DDL) se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nello stato abilitato o disabilitato dei trigger DDL (Data Definition Language) devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データ定義言語 (DDL) トリガーの有効または無効にされた状態の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 DDL(데이터 정의 언어) 트리거 사용/사용 안 함 상태의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no estado habilitado ou desabilitado de gatilhos DDL (linguagem de definição de dados) deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в состоянии (включен-выключен) триггеров языка описания данных DDL при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新数据定义语言(DDL)触发器的启用或禁用状态差异。
zh_hant: 指定當您發行至資料庫時，應該忽略或更新 Data Definition Language (DDL) triggers 之啟用或停用狀態的差異。

# SchemaCompare.Description.IgnoreDdlTriggerOrder
source: Specifies whether differences in the order of Data Definition Language (DDL) triggers should be ignored or updated when you publish to a database or server.
de: Gibt an, ob Unterschiede in der Reihenfolge von DDL-Triggern (Data Definition Language) beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el orden de los desencadenadores del lenguaje de definición de datos (DDL) se deben ignorar o actualizar al publicar en una base de datos o en un servidor.
it: Specifica se le differenze nell'ordine dei trigger DDL (Data Definition Language) devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database o in un server.
ja: データベースまたはサーバーに公開するとき、データ定義言語 (DDL) トリガーの順序の相違を無視するか、更新するかを指定します。
ko: 데이터베이스 또는 서버에 게시할 때 DDL(데이터 정의 언어) 트리거 순서의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na ordem de gatilhos DDL (linguagem de definição de dados) deverão ser ignoradas ou atualizadas quando você publicar em um servidor ou banco de dados.
ru: Определяет, пропускаются или обновляются различия в порядке триггеров языка описания данных DDL при публикации в базе данных или на сервере.
zh_hans: 指定在发布到数据库或服务器时忽略还是更新数据定义语言(DDL)触发器中的顺序差异。
zh_hant: 指定當您發行至資料庫或伺服器時，應該忽略或更新 Data Definition Language (DDL) triggers 的順序差異。

# SchemaCompare.Description.IgnoreCryptographicProviderFilePath
source: Specifies whether differences in the file path for the cryptographic provider should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede im Dateipfad für den Kryptografieanbieter beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en la ruta de acceso del archivo del proveedor de servicios de cifrado se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nel percorso file del provider del servizio di crittografia devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、暗号化プロバイダーのファイル パスの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 암호화 공급자에 대한 파일 경로의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se as diferenças no caminho do arquivo para o provedor de criptografia deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в пути к файлам для поставщика служб шифрования при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新加密提供程序的文件路径差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新密碼編譯提供者之檔案路徑的差異。

# SchemaCompare.Description.VerifyDeployment
source: Specifies whether checks should be performed before publishing that will stop the publish action if issues are present that might block successful publishing. For example, your publish action might stop if you have foreign keys on the target database that do not exist in the database project, and that will cause errors when you publish.
de: Gibt an, ob vor der Veröffentlichung Überprüfungen ausgeführt werden sollen, um eine Beendigung des Veröffentlichungsvorgangs durch vorhandene Fehler zu verhindern. Der Veröffentlichungsvorgang wird möglicherweise beendet, wenn in der Zieldatenbank Fremdschlüssel vorhanden sind, die im Datenbankprojekt nicht enthalten sind und bei der Veröffentlichung zu Fehlern führen.
es: Especifica si las comprobaciones deben realizarse antes de la publicación para que esta no se detenga en caso de que haya problemas que impidan realizar la publicación correctamente. Por ejemplo, la acción de publicación podría detenerse si hay claves externas en la base de datos de destino que no existen en el proyecto de base de datos, lo que causará errores durante la publicación.
it: Specifica se prima della pubblicazione devono essere eseguiti i controlli che arrestano l'azione di distribuzione quando vengono rilevati problemi che potrebbero impedire la corretta pubblicazione. Ad esempio, l'azione di pubblicazione potrebbe essere arrestata se le chiavi esterne presenti nel database di destinazione non esistono nel progetto di database e questa situazione genera errori durante la pubblicazione.
ja: 公開の成功を妨げるような問題が生じた場合に、公開操作を停止する前にチェックを実行するかを指定します。たとえば、データベース プロジェクトに存在しない外部キーがターゲット データベースにあって、公開時にエラーが発生すると、公開操作が停止することがあります。
ko: 게시 전에 검사를 수행할지 여부를 지정합니다. 검사 중 성공적인 게시를 차단할 수 있는 문제가 발생하면 게시 작업이 중지될 수 있습니다. 예를 들어 데이터베이스 프로젝트에 없고 게시할 때 오류를 발생시키는 외래 키가 대상 데이터베이스에 있을 경우 게시 작업이 중지될 수 있습니다.
pt_br: Especifica se, antes da publicação, deverão ser executadas verificações, que interromperão a ação de publicação se houver problemas presentes que possam impedir uma publicação bem-sucedida. Por exemplo, a ação de publicação poderá ser interrompida se houver chaves estrangeiras no banco de dados de destino que não existam no projeto de banco de dados e que causarão erros na publicação.
ru: Определяет, должны ли перед публикацией выполняться проверки, останавливающие действие публикации, если обнаружатся проблемы, которые могут помешать успешной публикации. Например, действие публикации может остановиться, если в целевой базе данных существуют внешние ключи, которые не существуют в проекте базы данных (это вызовет ошибки при публикации).
zh_hans: 指定是否应在发布之前执行检查，以发现可能会阻止成功发布的问题，从而避免发生停止发布操作的情况。例如，如果目标数据库上的外键在数据库项目中并不存在，则发布操作可能停止，在发布时这种情况将导致错误。
zh_hant: 指定是否應該先執行檢查，以防止發行因為出現阻止發行成功的問題而停止發行動作。例如，如果目標資料庫有不存在資料庫專案中的外部索引鍵，該外部索引鍵會在發行時造成錯誤，則您的發行動作就可能會停止。

# SchemaCompare.Description.IgnoreComments
source: Specifies whether differences in the comments should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Kommentaren beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en los comentarios se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nei commenti devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、コメントの相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 주석의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nos comentários deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в комментариях при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新注释差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新註解的差異。

# SchemaCompare.Description.IgnoreColumnCollation
source: Specifies whether differences in the column collations should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in den Spaltensortierungen beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en las intercalaciones de columnas se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nelle regole di confronto colonna devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、列の照合順序の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 열 데이터 정렬의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças nos agrupamentos de colunas deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в параметрах сортировки столбцов при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新列排序规则差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新資料行定序的差異。

# SchemaCompare.Description.IgnoreAuthorizer
source: Specifies whether differences in the Authorizer should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede im Autorisierer beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en el autorizador se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nel provider di autorizzazioni devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、Authorizer の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 권한 부여자의 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no Autorizador deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в Authorizer при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新授权者差异。
zh_hant: 指定當您發佈至資料庫時，要忽略或更新授權者的差異。

# SchemaCompare.Description.IgnoreAnsiNulls
source: Specifies whether differences in the ANSI NULLS setting should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede in der ANSI NULLS-Einstellung beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en la configuración ANSI NULLS se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nell'impostazione ANSI NULLS devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、ANSI NULLS 設定の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 ANSI NULLS 설정 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças na configuração ANSI NULLS deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в параметре ANSI NULLS при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新 ANSI NULLS 设置差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新 ANSI NULLS 設定的差異。

# SchemaCompare.Description.GenerateSmartDefaults
source: Automatically provides a default value when updating a table that contains data with a column that does not allow null values.
de: Hiermit wird automatisch ein Standardwert bereitgestellt, wenn eine Tabelle mit Daten in einer Spalte aktualisiert wird, die keine NULL-Werte zulässt.
es: Proporciona automáticamente un valor predeterminado cuando se actualiza una tabla que contiene datos con una columna que no admite valores NULL.
it: Fornisce automaticamente un valore predefinito quando si aggiorna una tabella contenente dati con una colonna che non consente valori Null.
ja: NULL 値を許可しない列を使用してデータが含まれるテーブルを更新するときに、自動的に既定値を指定します。
ko: Null 값을 허용하지 않는 열이 있는 데이터 테이블을 업데이트할 때 기본값을 자동으로 제공합니다.
pt_br: Automaticamente fornece um valor padrão ao atualizar uma tabela que contém dados com uma coluna que não permite valores nulos.
ru: Автоматически предоставляет значение по умолчанию при обновлении таблицы данных со столбцом, который не допускает значения NULL.
zh_hans: 更新包含数据的表且该表中具有不允许 Null 值的列时，自动提供默认值。
zh_hant: 在更新含有資料且資料行不允許 null 值的資料表時，自動提供預設值。

# SchemaCompare.Description.DropStatisticsNotInSource
source: Specifies whether statistics that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Statistiken aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.
es: Especifica si las estadísticas que no existen en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar en una base de datos.
it: Specifica se le statistiche che non esistono nel file snapshot del database (con estensione dacpac) vengono rimosse dal database di destinazione quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データベース スナップショット (.dacpac) ファイルに存在しない統計をターゲット データベースから削除するかを指定します。
ko: 데이터베이스에 게시할 때 데이터베이스 스냅샷(.dacpac) 파일에 없는 통계를 대상 데이터베이스에서 삭제할지 여부를 지정합니다.
pt_br: Especifica se as estatísticas que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar em um banco de dados.
ru: Указывает, будет ли статистика, которая не существует в файле моментального снимка базы данных (DACPAC), удалена из целевой базы данных при выполнении публикации в нее.
zh_hans: 指定在发布到数据库时是否从目标数据库中删除数据库快照(.dacpac)文件中不存在的统计信息。
zh_hant: 指定當您發行至資料庫時，是否要從目標資料庫卸除不存在資料庫快照集 (.dacpac) 檔案中的統計資料。

# SchemaCompare.Description.DropRoleMembersNotInSource
source: Specifies whether role members that are not defined in the database snapshot (.dacpac) file will be dropped from the target database when you publish updates to a database.</
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Rollenmitglieder aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.
es: Especifica si los miembros de rol que no están definidos en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar actualizaciones en una base de datos.</
it: Specifica se i membri del ruolo non distribuiti nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si pubblicano aggiornamenti in un database.</
ja: データベースに更新を公開するとき、データベース スナップショット (.dacpac) ファイルで定義されていないロール メンバーをターゲット データベースから削除するかを指定します。</
ko: 데이터베이스에 업데이트를 게시할 때 데이터베이스 스냅샷(.dacpac) 파일에 정의되지 않은 역할 멤버가 대상 데이터베이스에서 삭제되는지 여부를 지정합니다.</
pt_br: Especifica se os membros da função que não estão definidos no arquivo de instantâneo (.dacpac) do banco de dados serão removidos do banco de dados de destino quando você publicar as atualizações em um banco de dados.</
ru: Определяет, будут ли члены ролей, которые не определены в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации обновлений в базе данных.</
zh_hans: 指定在将更新发布到数据库时是否从目标数据库删除未在数据库快照(.dacpac)文件中定义的角色成员。</
zh_hant: 指定是否要在您對資料庫發佈更新時，將未於資料庫快照集 (.dacpac) 檔案中定義的角色成員從目標資料庫捨棄。</

# SchemaCompare.Description.DropPermissionsNotInSource
source: Specifies whether permissions that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish updates to a database.
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Berechtigungen aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.
es: Especifica si los permisos que no existen en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar actualizaciones en una base de datos.
it: Specifica se le autorizzazioni che non esistono nel file snapshot del database (con estensione dacpac) vengono rimosse dal database di destinazione quando si esegue la pubblicazione in un database.
ja: データベースに更新を公開するとき、データベース スナップショット (.dacpac) ファイルに存在しない権限をターゲット データベースから削除するかを指定します。
ko: 데이터베이스에 업데이트를 게시할 때 데이터베이스 스냅샷(.dacpac) 파일에 없는 사용 권한을 대상 데이터베이스에서 삭제할지 여부를 지정합니다.
pt_br: Especifica se as permissões que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar atualizações em um banco de dados.
ru: Определяет, будут ли разрешения, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации обновлений в базе данных.
zh_hans: 指定在将更新发布到数据库时是否从目标数据库删除数据库快照(.dacpac)文件中不存在的权限。
zh_hant: 指定當您發行更新至資料庫時，是否要從目標資料庫中卸除不存在資料庫快照集 (.dacpac) 檔案中的權限。

# SchemaCompare.Description.DropObjectsNotInSource
source: Specifies whether objects that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database. This value takes precedence over DropExtendedProperties.
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Objekte aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.Dieser Wert hat Vorrang vor "DropExtendedProperties".
es: Especifica si los objetos que no existen en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar en una base de datos. Este valor tiene prioridad sobre DropExtendedProperties.
it: Specifica se oggetti che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database. Questo valore ha precedenza su DropExtendedProperties.
ja: データベースに公開するとき、データベース スナップショット (.dacpac) ファイルに存在しないオブジェクトをターゲット データベースから削除するかを指定します。この値は DropExtendedProperties よりも優先されます。
ko: 데이터베이스에 게시할 때 데이터베이스 스냅샷 파일(.dacpac)에 없는 개체를 대상 데이터베이스에서 삭제할지 여부를 지정합니다. 이 값이 DropExtendedProperties보다 우선합니다.
pt_br: Especifica se objetos que não existem no arquivo de instantâneo de banco de dados (.dacpac) serão removidos do banco de dados de destino quando você publicar em um banco de dados. Esse valor prevalece sobre DropExtendedProperties.
ru: Указывает, будут ли объекты, которые отсутствуют в файле моментального снимка базы данных (DACPAC), удалены из целевой базы данных при публикации в базе данных. Данное значение имеет приоритет над DropExtendedProperties.
zh_hans: 指定在发布到数据库时是否从目标数据库中删除数据库快照(.dacpac)文件中不存在的对象。此值优先于 DropExtendedProperties。
zh_hant: 指定當您發行至資料庫時，是否要從目標資料庫卸除不存在於資料庫快照集 (.dacpac) 檔案中的物件。這個值的優先順序高過 DropExtendedProperties。
