Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/schema-compare.*.xlf
Languages: de, es, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# SchemaCompare.Description.IgnoreFileSize
source: Specifies whether differences in the file sizes should be ignored or whether a warning should be issued when you publish to a database.
de: Gibt an, ob Unterschiede in der Dateigröße beim Veröffentlichen in einer Datenbank ignoriert werden sollen oder ob eine Warnung ausgegeben werden soll.
es: Especifica si las diferencias en los tamaños de archivo se deben ignorar o si debe generarse una advertencia al publicar en una base de datos.
it: Specifica se le differenze nelle dimensioni dei file devono essere ignorate o se viene inviato un avviso quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、ファイル サイズの相違を無視するか、または警告を発するかを指定します。
ko: 데이터베이스에 게시할 때 파일 크기 차이를 무시할지 또는 경고를 발생시킬지를 지정합니다.
pt_br: Especifica se diferenças nos tamanhos de arquivos deverão ser ignoradas ou se um aviso deverá ser emitido quando você publicar em um banco de dados.
ru: Определяет, создается ли предупреждение о различиях в размерах файлов при публикации в базе данных.
zh_hans: 指定在发布到数据库时是忽略文件的大小差异还是发出警告。
zh_hant: 指定當您發行至資料庫時，應該忽略檔案大小的差異或應該發出警告。

# SchemaCompare.Description.IgnoreFilegroupPlacement
source: Specifies whether differences in the placement of objects in FILEGROUPs should be ignored or updated when you publish to a database.
de: Gibt an, ob Unterschiede bei der Platzierung von Objekten in FILEGROUPs beim Veröffentlichen in einer Datenbank ignoriert oder aktualisiert werden sollen.
es: Especifica si las diferencias en la colocación de objetos en grupos de archivos se deben ignorar o actualizar al publicar en una base de datos.
it: Specifica se le differenze nella posizione degli oggetti in FILEGROUP devono essere ignorate o aggiornate quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、FILEGROUP 内のオブジェクトの配置の相違を無視するか、更新するかを指定します。
ko: 데이터베이스에 게시할 때 FILEGROUP에서의 개체 배치 차이를 무시할지 또는 업데이트할지를 지정합니다.
pt_br: Especifica se diferenças no posicionamento de objetos em FILEGROUPs deverão ser ignoradas ou atualizadas quando você publicar em um banco de dados.
ru: Определяет, пропускаются или обновляются различия в размещении объектов в файловых группах FILEGROUP при публикации в базе данных.
zh_hans: 指定在发布到数据库时忽略还是更新 FILEGROUP 中对象位置差异。
zh_hant: 指定當您發佈至資料庫時，應該忽略或更新 FILEGROUP 中物件位置的差異。

# SchemaCompare.Description.DoNotAlterReplicatedObjects
source: Specifies whether objects that are replicated are identified during verification.
de: Gibt an, ob replizierte Objekte während der Überprüfung identifiziert werden.
es: Especifica si los objetos que se replican se identifican durante la verificación.
it: Specifica se gli oggetti replicati vengono identificati durante la verifica.
ja: 検証中に、レプリケートされるオブジェクトを特定するかを指定します。
ko: 확인하는 동안 복제된 개체를 식별할지 여부를 지정합니다.
pt_br: Especifica se os objetos replicados são identificados durante a verificação.
ru: Указывает, определяются ли во время проверки реплицируемые объекты.
zh_hans: 指定在验证期间是否标识已复制的对象。
zh_hant: 指定驗證期間是否識別有複寫的物件。

# SchemaCompare.Description.DoNotAlterChangeDataCaptureObjects
source: If true, Change Data Capture objects are not altered.
de: Bei Festlegung auf TRUE werden Change Data Capture-Objekte nicht geändert.
es: Si es true, los objetos de captura de datos modificados no se modifican.
it: Se è true, gli oggetti Change Data Capture non vengono modificati.
ja: true の場合、Change Data Capture オブジェクトは変更されません。
ko: true이면 변경 데이터 캡처 개체가 변경되지 않습니다.
pt_br: Se true, os objetos do Change Data Capture não serão alterados.
ru: Если этот параметр имеет значение TRUE, объекты отслеживания измененных данных не изменяются.
zh_hans: 如果为 true，则不更改变更数据捕获对象。
zh_hant: 如果為 True，則不會改變變更資料擷取物件。

# SchemaCompare.Description.DisableAndReenableDdlTriggers
source: Specifies whether Data Definition Language (DDL) triggers are disabled at the beginning of the publish process and re-enabled at the end of the publish action.
de: Gibt an, ob DDL-Trigger (Data Definition Language) zu Beginn des Veröffentlichungsprozesses deaktiviert und am Ende des Veröffentlichungsvorgangs wieder aktiviert werden.
es: Especifica si los desencadenadores del lenguaje de descripción de datos se deshabilitan al principio del proceso de publicación y se habilitan de nuevo al final de la acción de publicación.
it: Specifica se i trigger Data Definition Language (DDL) vengono disabilitati all'inizio del processo di pubblicazione e riabilitati alla fine del processo di pubblicazione.
ja: Data Definition Language (DDL) トリガーを公開プロセスの開始時点で無効にし、公開操作の終了時点で再び有効にするかを指定します。
ko: 게시 프로세스가 시작될 때 DDL(데이터 정의 언어) 트리거를 해제하고 게시 작업이 끝날 때 다시 설정할지 여부를 지정합니다.
pt_br: Especifica se os gatilhos DDL (Data Definition Language) são desabilitados no início do processo de publicação e reabilitados ao final da ação de publicação.
ru: Определяет, отключаются ли триггеры языка описания данных DDL в начале процесса публикации с повторным включением по завершении действия публикации.
zh_hans: 指定是否在发布过程开始时禁用数据描述语言(DDL)触发器并在发布操作结束时重新启用。
zh_hant: 指定是否在發行程序開始時停用 Data Definition Language (DDL) 觸發程序，並在發行動作結束時重新啟用。

# SchemaCompare.Description.DeployDatabaseInSingleUserMode
source: If true, the database is set to Single User Mode before deploying.
de: Bei Festlegung auf TRUE wird die Datenbank vor der Bereitstellung auf den Einzelbenutzermodus festgelegt.
es: Si es true, la base de datos se establece en modo de usuario único antes de implementar.
it: Se è true, il database viene impostato sulla modalità utente singolo prima della distribuzione.
ja: true の場合、データベースはデプロイ前にシングル ユーザー モードに設定されます。
ko: true이면 배포하기 전에 데이터베이스가 단일 사용자 모드로 설정됩니다.
pt_br: Se true, o banco de dados será definido para o Modo de Usuário Único antes da implantação.
ru: Если задано значение TRUE, то перед развертыванием база данных переводится в однопользовательский режим.
zh_hans: 如果为 true，则在部署之前将数据库设置为“单用户模式”。
zh_hant: 若為 True，則會在部署前將資料庫設為單一使用者模式。

# SchemaCompare.Description.CreateNewDatabase
source: Specifies whether the target database should be updated or whether it should be dropped and re-created when you publish to a database.
de: Gibt an, ob die Zieldatenbank beim Veröffentlichen einer Datenbank aktualisiert oder aber gelöscht und erneut erstellt werden soll.
es: Especifica si se debe actualizar la base de datos de destino o si se debe quitar y volver a crear cuando publique en una base de datos.
it: Specifica se il database di destinazione deve essere aggiornato oppure rimosso e ricreato quando si esegue la pubblicazione in un database.
ja: データベースに公開するときに、ターゲット データベースを更新するか、削除して作成し直すかを指定します。
ko: 데이터베이스에 게시할 때 대상 데이터베이스를 업데이트할지 또는 삭제한 후 다시 만들지를 지정합니다.
pt_br: Especifica se o banco de dados de destino deverá ser atualizado ou removido e recriado quando você publicar em um banco de dados.
ru: Определяет, должна ли целевая база обновляться или удаляться и создаваться повторно при публикации в базе данных.
zh_hans: 指定在发布到某个数据库时是应该更新目标数据库还是删除并重新创建目标数据库。
zh_hant: 指定當您發行至資料庫時，應該更新目標資料庫或應該卸除並重新建立目標資料庫。

# SchemaCompare.Description.CompareUsingTargetCollation
source: This setting dictates how the database's collation is handled during deployment; by default the target database's collation will be updated if it does not match the collation specified by the source. When this option is set, the target database's (or server's) collation should be used.
de: Diese Einstellung legt fest, wie die Sortierung der Datenbank während der Bereitstellung verarbeitet wird. Standardmäßig wird die Sortierung der Zieldatenbank aktualisiert, wenn sie nicht mit der von der Quelle angegebenen Sortierung übereinstimmt. Wenn diese Option festgelegt ist, muss die Sortierung der Zieldatenbank (oder des Servers) verwendet werden.
es: Esta configuración determina cómo se controla la intercalación de la base de datos durante la implementación; de forma predeterminada, la intercalación de la base de datos de destino se actualizará si no coincide con la intercalación especificada por el origen. Cuando se establece esta opción, se debe usar la intercalación de la base de datos de destino (o el servidor).
it: Questa impostazione indica come vengono gestite le regole di confronto del database durante la distribuzione. Per impostazione predefinita, le regole di confronto del database di destinazione verranno aggiornate se non corrispondono alle regole di confronto specificate dall'origine. Quando questa opzione è impostata, è necessario usare le regole di confronto del server o del database di destinazione.
ja: この設定は、デプロイの際にデータベースの照合順序を処理する方法を決定します。既定では、ターゲット データベースの照合順序がソースによって指定された照合順序と一致しない場合は更新されます。このオプションを設定すると、ターゲット データベース (またはサーバー) の照合順序を使用する必要があります。
ko: 이 설정은 배포하는 동안 데이터베이스의 데이터 정렬을 처리하는 방법을 지정합니다. 기본적으로 대상 데이터베이스의 데이터 정렬이 원본에서 지정한 데이터 정렬과 일치하지 않으면 업데이트됩니다. 이 옵션을 설정하면 대상 데이터베이스(또는 서버) 데이터 정렬을 사용해야 합니다.
pt_br: Essa configuração determina como a ordenação do banco de dados é manipulada durante a implantação. Por padrão, a ordenação do banco de dados de destino será atualizada se não corresponder à ordenação especificada pela origem. Quando essa opção estiver definida, a ordenação do banco de dados de destino (ou do servidor) deverá ser usada.
ru: Этот параметр указывает, как обрабатывать параметры сортировки базы данных при развертывании. По умолчанию параметры сортировки целевой базы данных будут обновлены, если они не соответствуют аналогичным параметрам, указанным в источнике. Когда этот параметр задан, требуется использовать параметры сортировки целевой базы данных (или сервера).
zh_hans: 此设置指示在部署期间如何处理数据库的排序规则；默认情况下，如果目标数据库的排序规则与源指定的排序规则不匹配，将更新该数据库的排序规则。设置此选项后，应使用目标数据库(或服务器)的排序规则。
zh_hant: 這項設定會指出部署期間的資料庫定序處理方式；根據預設，如果目標資料庫的定序與來源所指定的定序不相符，就會受到更新。設定此選項時，應使用目標資料庫 (或伺服器) 的定序。

# SchemaCompare.Description.CommentOutSetVarDeclarations
source: Specifies whether the declaration of SETVAR variables should be commented out in the generated publish script. You might choose to do this if you plan to specify the values on the command line when you publish by using a tool such as SQLCMD.EXE.
de: Gibt an, ob die Deklaration von SETVAR-Variablen im generierten Veröffentlichungsskript auskommentiert werden soll. Sie können diese Option verwenden, wenn Sie bei der Veröffentlichung mit einem Tool wie SQLCMD.EXE die Werte in der Befehlszeile angeben möchten.
es: Especifica si la declaración de variables SETVAR se debe convertir en comentario en el script de publicación generado. Puede elegir esta opción si piensa especificar los valores en la línea de comandos cuando publique usando una herramienta como SQLCMD.EXE.
it: Specifica se la dichiarazione delle variabili SETVAR verrà impostata come commento nello script di pubblicazione generato. È possibile scegliere questa opzione se si intende specificare i valori nella riga di comando usando uno strumento quale SQLCMD.EXE.
ja: 生成された公開スクリプトで SETVAR 変数の宣言をコメントにするかを指定します。SQLCMD.EXE などのツールを使用して公開するときにコマンド ラインに値を指定する場合は、このオプションを選択することをお勧めします。
ko: 생성된 게시 스크립트에서 SETVAR 변수 선언을 주석으로 처리할지 여부를 지정합니다. SQLCMD.EXE와 같은 도구를 사용하여 게시할 때 명령줄에서 해당 값을 지정하려는 경우 이렇게 하도록 선택할 수 있습니다.
pt_br: Especifica se a declaração de variáveis SETVAR deve ser comentada no script de publicação gerado. Convém fazer isso se você pretende especificar os valores na linha de comando ao publicar usando uma ferramenta, como SQLCMD.EXE.
ru: Указывает, нужно ли заключать в комментарий объявление переменных SETVAR в формируемом скрипте публикации. Так можно делать, если эти значения планируется указывать в командной строке при публикации с помощью программы, подобной SQLCMD.EXE.
zh_hans: 指定是否应在生成的发布脚本中注释掉 SETVAR 变量的声明。如果打算使用 SQLCMD.EXE 等工具在发布时在命令行中指定这些值，可以选择这样做。
zh_hant: 指定在產生的發行指令碼中是否應該將 SETVAR 變數的宣告標記為註解。如果您計畫在使用 SQLCMD.EXE 一類工具進行發行時在命令列指定值，就可以選擇這種作法。

# SchemaCompare.Description.BlockWhenDriftDetected
source: Specifies whether to block updating a database whose schema no longer matches its registration or is unregistered.
de: Gibt an, ob die Aktualisierung einer Datenbank blockiert wird, deren Schema nicht mehr mit der Registrierung übereinstimmt bzw. nicht registriert ist.
es: Especifica si hay que bloquear la actualización de una base de datos cuyo esquema ya no coincide con su registro o no está registrado.
it: Specifica se bloccare l'aggiornamento di un database il cui schema non corrisponde più alla registrazione o la cui registrazione è stata annullata.
ja: スキーマがその登録内容と一致しなくなったか、登録が解除されているデータベースの更新を、ブロックするかを指定します。
ko: 데이터베이스 스키마가 해당 등록과 더 이상 일치하지 않거나 등록 취소된 경우 이 데이터베이스 업데이트를 차단할지 여부를 지정합니다.
pt_br: Especifica se a atualização de um banco de dados cujo esquema não corresponde mais a seu registro ou que não está registrado deverá ser bloqueada.
ru: Указывает, блокировать ли обновление базы данных, схема которой больше не соответствует ее регистрации или является незарегистрированной.
zh_hans: 指定是否阻止更新其架构不再与其注册匹配或未进行注册的数据库。
zh_hant: 指定是否封鎖更新結構描述不再符合註冊或已取消註冊的資料庫。

# SchemaCompare.Description.BlockOnPossibleDataLoss
source: Specifies that the publish episode should be terminated if there is a possibility of data loss resulting from the publish operation.
de: Gibt an, dass der Veröffentlichungszeitraum beendet werden soll, wenn aufgrund des Veröffentlichungsvorgangs die Möglichkeit eines Datenverlusts besteht.
es: Especifica que el episodio de publicación se debe terminar ante la posibilidad de que se pierdan datos como consecuencia de la operación de publicación.
it: Specifica che, se esiste la possibilità di perdita di dati derivante dall'operazione di pubblicazione, l'episodio di pubblicazione deve essere interrotto.
ja: 公開操作によるデータ損失の可能性がある場合に、今回の公開を終了するかを指定します。
ko: 게시 작업으로 인한 데이터 손실 가능성이 있는 경우 게시 에피소드를 종료할지 여부를 지정합니다.
pt_br: Especifica se o episódio de publicação deve ser terminado na possibilidade de perda de dados resultante da operação de publicação.
ru: Указывает, что следует завершать эпизод публикации, если есть возможность потери данных в результате операции публикации.
zh_hans: 指定当发布操作可能导致数据丢失时终止发布事件。
zh_hant: 指定如果發佈作業可能導致資料遺失，就應該終止發佈事件。

# SchemaCompare.Description.BackupDatabaseBeforeChanges
source: Backups the database before deploying any changes.
de: Hiermit wird die Datenbank gesichert, bevor Änderungen bereitgestellt werden.
es: Hace una copia de seguridad de la base de datos antes de implementar ningún cambio.
it: Esegue il backup del database prima di distribuire eventuali modifiche.
ja: 変更をデプロイする前にデータベースをバックアップします。
ko: 변경 내용을 배포하기 전에 데이터베이스를 백업합니다.
pt_br: Faz backups do banco de dados antes de implantar alterações.
ru: Создает резервную копию базы данных перед развертыванием любых изменений.
zh_hans: 在部署任何更改之前备份数据库。
zh_hant: 在部署任何變更之前，先備份資料庫。

# SchemaCompare.Description.AllowIncompatiblePlatform
source: Specifies whether to attempt the action despite incompatible SQL Server platforms.
de: Gibt an, ob die Aktion trotz inkompatibler SQL Server-Plattformen versucht werden soll.
es: Especifica si se va a intentar la acción a pesar de que haya plataformas incompatibles de SQL Server.
it: Specifica se provare a eseguire l'azione nonostante sia incompatibile con le piattaforme di SQL Server.
ja: 互換性のない SQL Server プラットフォームであっても操作を行うかを指定します。
ko: SQL Server 플랫폼이 호환되지 않아도 동작을 시도할지 여부를 지정합니다.
pt_br: Especifica se a ação deve ser tentada apesar de plataformas SQL Server incompatíveis.
ru: Определяет, будет ли выполняться действие в случае несовместимости платформ SQL Server.
zh_hans: 指定是否在 SQL Server 平台不兼容的情况下也尝试该操作。
zh_hant: 指定儘管 SQL Server 平台不相容，是否仍要嘗試動作。

# SchemaCompare.Description.AllowDropBlockingAssemblies
source: This property is used by SqlClr deployment to cause any blocking assemblies to be dropped as part of the deployment plan. By default, any blocking/referencing assemblies will block an assembly update if the referencing assembly needs to be dropped.
de: Diese Eigenschaft wird von der SqlClr-Bereitstellung verwendet, um sämtliche Blockierungsassemblys im Rahmen des Bereitstellungsplans zu löschen. Standardmäßig blockieren Blockierungs-/Verweisassemblys Assemblyupdates, wenn die Verweisassembly gelöscht werden muss.
es: La implementación de SqlClr usa esta propiedad para que se quiten los ensamblados de bloqueo como parte del plan de implementación. De forma predeterminada, cualquier ensamblado de bloqueo o referencia bloqueará una actualización de ensamblado si se debe quitar el ensamblado de referencia.
it: Questa proprietà viene usata dalla distribuzione SqlClr per causare la rimozione degli assembly di blocco come parte del piano di distribuzione. Per impostazione predefinita, gli assembly di blocco/riferimento bloccheranno un aggiornamento degli assembly se l'assembly a cui viene fatto riferimento deve essere rimosso.
ja: このプロパティは、デプロイ計画の一部として、ブロックしているアセンブリを削除するために、SqlClr デプロイによって使用されます。既定では、参照しているアセンブリを削除する必要がある場合、ブロックまたは参照しているアセンブリは、アセンブリの更新をブロックします。
ko: 이 속성은 SqlClr 배포 시 배포 계획의 일부로 차단 어셈블리를 삭제하기 위해 사용됩니다. 기본적으로 참조 어셈블리를 삭제해야 하는 경우 모든 차단/참조 어셈블리는 어셈블리 업데이트를 차단합니다.
pt_br: Esta propriedade é usada pela implantação de SqlClr para que todos os assemblies de bloqueio sejam removidos como parte do plano de implantação. Por padrão, todos os assemblies de bloqueio/referência bloquearão uma atualização de assembly se o assembly de referência precisar ser removido.
ru: Это свойство используется развертыванием SqlClr, чтобы выполнять удаление блокирующих сборок в рамках плана развертывания. По умолчанию любая блокирующая/ссылающаяся сборка блокирует обновление сборки, если ссылающуюся сборку необходимо удалить.
zh_hans: SqlClr 部署使用此属性会导致在执行部署计划时删除任何阻止程序集。默认情况下，如果需要删除引用程序集，任何阻止/引用程序集都将阻止程序集更新。
zh_hant: 這個屬性是供 SqlClr 部署用來使任何封鎖的組件會在部署計畫中卸除。根據預設，如果必須卸除任何參考組件，則該封鎖/參考組件將會封鎖組件更新。

# SchemaCompare.Description.DropConstraintsNotInSource
source: Specifies whether constraints that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Einschränkungen aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.
es: Especifica si las restricciones que no existen en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar en una base de datos.
it: Specifica se i vincoli che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データベース スナップショット (.dacpac) ファイルに存在しない制約をターゲット データベースから削除するかを指定します。
ko: 데이터베이스에 게시할 때 데이터베이스 스냅샷(.dacpac) 파일에 없는 제약 조건을 대상 데이터베이스에서 삭제할지 여부를 지정합니다.
pt_br: Especifica se restrições que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar em um banco de dados.
ru: Определяет, будут ли ограничения, которые не существуют в моментальном снимке базы данных (.dacpac), удаляться из целевой базы данных при публикации в базе данных.
zh_hans: 指定在发布到数据库时是否从目标数据库删除数据库快照(.dacpac)文件中不存在的约束。
zh_hant: 指定當您發行至資料庫時，是否要從目標資料庫中卸除不存在資料庫快照集 (.dacpac) 檔案中的條件約束。

# SchemaCompare.Description.DropDmlTriggersNotInSource
source: Specifies whether DML triggers that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene DML-Trigger aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.
es: Especifica si los desencadenadores DML que no existen en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar en una base de datos.
it: Specifica se i trigger DML che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データベース スナップショット (.dacpac) ファイルに存在しない DML トリガーが、ターゲット データベースから削除されるかを指定します。
ko: 데이터베이스에 게시할 때 데이터베이스 스냅샷(.dacpac) 파일에 없는 DML 트리거를 대상 데이터베이스에서 삭제할지 여부를 지정합니다.
pt_br: Especifica se gatilhos DML que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidos do banco de dados de destino quando você publicar em um banco de dados.
ru: Определяет, будут ли триггеры DML, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации в базе данных.
zh_hans: 指定在发布到数据库时是否从目标数据库删除数据库快照(.dacpac)文件中不存在的 DML 触发器。
zh_hant: 指定當您發行至資料庫時，是否要從目標資料庫中卸除不存在資料庫快照集 (.dacpac) 檔案中的 DML 觸發程序。

# SchemaCompare.Description.DropExtendedPropertiesNotInSource
source: Specifies whether extended properties that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene erweiterte Eigenschaften aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.
es: Especifica si las propiedades extendidas que no existen en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar en una base de datos.
it: Specifica se le proprietà estese che non esistono nel file snapshot del database (con estensione dacpac) vengono rimosse dal database di destinazione quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データベース スナップショット (.dacpac) ファイルに存在しない拡張プロパティをターゲット データベースから削除するかを指定します。
ko: 데이터베이스에 게시할 때 데이터베이스 스냅샷(.dacpac) 파일에 없는 확장 속성을 대상 데이터베이스에서 삭제할지 여부를 지정합니다.
pt_br: Especifica se as propriedades estendidas que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidas do banco de dados de destino quando você publicar em um banco de dados.
ru: Определяет, будут ли расширенные свойства, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации в базе данных.
zh_hans: 指定在发布到数据库时是否从目标数据库删除数据库快照(.dacpac)文件中不存在的扩展属性。
zh_hant: 指定當您發行至資料庫時，是否要從目標資料庫中卸除不存在資料庫快照集 (.dacpac) 檔案中的擴充屬性。

# SchemaCompare.Description.DropIndexesNotInSource
source: Specifies whether indexes that do not exist in the database snapshot (.dacpac) file will be dropped from the target database when you publish to a database.
de: Gibt an, ob nicht in der Datenbankmomentaufnahme-Datei (DACPAC) enthaltene Indizes aus der Zieldatenbank gelöscht werden, wenn Sie eine Veröffentlichung in einer Datenbank durchführen.
es: Especifica si los índices que no existen en el archivo de instantánea de base de datos (.dacpac) se quitarán de la base de datos de destino al publicar en una base de datos.
it: Specifica se gli indici che non esistono nel file snapshot del database (con estensione dacpac) vengono rimossi dal database di destinazione quando si esegue la pubblicazione in un database.
ja: データベースに公開するとき、データベース スナップショット (.dacpac) ファイルに存在しないインデックスをターゲット データベースから削除するかを指定します。
ko: 데이터베이스에 게시할 때 데이터베이스 스냅샷(.dacpac) 파일에 없는 인덱스를 대상 데이터베이스에서 삭제할지 여부를 지정합니다.
pt_br: Especifica se os índices que não existem no arquivo de instantâneo do banco de dados (.dacpac) serão removidos do banco de dados de destino quando você publicar em um banco de dados.
ru: Определяет, будут ли индексы, которые не существуют в моментальном снимке базы данных (DACPAC), удаляться из целевой базы данных при публикации в базе данных.
zh_hans: 指定在发布到数据库时是否从目标数据库删除数据库快照(.dacpac)文件中不存在的索引。
zh_hant: 指定當您發行至資料庫時，是否要從目標資料庫中卸除不存在資料庫快照集 (.dacpac) 檔案中的索引。
