Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# databaseLocation
source: Database location is required for adding a reference to a database
de: Der Datenbankspeicherort ist zum Hinzufügen eines Verweises zu einer Datenbank erforderlich
es: La ubicación de la base de datos es necesaria para agregar una referencia a una base de datos.
fr: L’emplacement de la base de données est requis pour l’ajout d’une référence à une base de données
it: Il percorso del database è necessario per aggiungere un riferimento a un database
ja: データベースへの参照を追加するには、データベースの場所が必要です
ko: 데이터베이스에 대한 참조를 추가하려면 데이터베이스 위치가 필요합니다.
pt_br: A localização do banco de dados é necessária para adicionar uma referência a um banco de dados
ru: Для добавления ссылки на базу данных требуется расположение базы данных
zh_hans: 添加对数据库的引用时需要数据库位置
zh_hant: 需要資料庫位置才能將參考新增到資料庫

source: Database name
de: Datenbankname
es: Nombre de la base de datos
fr: Nom de la base de données
it: Nome del database
ja: データベース名
ko: 데이터베이스 이름
pt_br: Nome do banco de dados
ru: Имя базы данных
zh_hans: 数据库名
zh_hant: 資料庫名稱

# databaseNameLabel
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
ru: База данных
zh_hans: 数据库
zh_hant: 資料庫

# databaseNameRequired
source: Database name is required for adding a reference to a different database
de: Der Datenbankname ist zum Hinzufügen eines Verweises zu einer anderen Datenbank erforderlich
es: El nombre de la base de datos es necesaria para agregar una referencia a otra base de datos.
fr: Le nom de la base de données est requise pour l'ajout d'une référence à une base de données différente.
it: Il nome del database è obbligatorio per l'aggiunta di un riferimento a un database diverso
ja: 異なるデータベースに参照を追加するには、データベース名が必要です
ko: 다른 데이터베이스에 대한 참조를 추가하려면 데이터베이스 이름이 필요합니다.
pt_br: O nome do banco de dados é necessário para adicionar uma referência a um banco de dados diferente
ru: Для добавления ссылки на другую базу данных требуется имя базы данных
zh_hans: 添加对不同数据库的引用时需要数据库名
zh_hant: 必須有資料庫參考類型才能新增資料庫的參考

# databaseNameRequiredVariableOptional
source: A database name is required. The database variable is optional.
de: Ein Datenbankname ist erforderlich. Die Datenbankvariable ist optional.
es: Se requiere un nombre de base de datos. La variable de base de datos es opcional.
fr: Un nom de base de données est requis. La variable de base de données est facultative.
it: Il nome di database è obbligatorio. La variabile di database è facoltativa.
ja: データベース名は必須です。データベース変数は省略可能です。
ko: 데이터베이스 이름이 필요합니다. 데이터베이스 변수는 선택 사항입니다.
pt_br: É necessário um nome de banco de dados. A variável do banco de dados é opcional.
ru: Имя базы данных является обязательным. Переменная базы данных не является обязательной.
zh_hans: 数据库名是必需的。数据库变量是可选的。
zh_hant: 需要資料庫名稱。資料庫變數為選擇性項目。

# databaseNameServerNameVariableRequired
source: A database name, server name, and server variable are required. The database variable is optional
de: Datenbankname, Servername und Servervariable sind erforderlich. Die Datenbankvariable ist optional.
es: Se requiere un nombre de base de datos, un nombre de servidor y una versión de servidor. La variable de base de datos es opcional.
fr: Un nom de base de données, un nom de serveur et une variable de serveur sont requis. La variable de base de données est facultative
it: Nome di database, nome di server e variabile di server sono obbligatori. La variabile database è facoltativa
ja: データベース名、サーバー名、およびサーバー変数は必須です。データベース変数は省略可能です
ko: 데이터베이스 이름, 서버 이름 및 서버 변수가 필요합니다. 데이터베이스 변수는 선택 사항입니다.
pt_br: São necessários um nome de banco de dados, nome de servidor e variável de servidor. A variável do banco de dados é opcional
ru: Требуются имя базы данных, имя сервера и переменная сервера. Переменная базы данных не является обязательной
zh_hans: 需要数据库名、服务器名和服务器变量。数据库变量是可选的。
zh_hant: 需要資料庫名稱、伺服器名稱和伺服器變數。資料庫變數為選擇性項目。

source: Database project
de: Datenbankprojekt
es: Proyecto de base de datos
fr: Projet de base de données
it: Progetto di database
ja: データベース プロジェクト
ko: 데이터베이스 프로젝트
pt_br: Projeto do banco de dados
ru: Проект базы данных
zh_hans: 数据库项目
zh_hant: 資料庫專案

# databaseReferenceAlreadyExists
source: A reference to this database already exists in this project
de: Ein Verweis auf diese Datenbank ist bereits in diesem Projekt vorhanden.
es: Ya existe una referencia a esta base de datos en este proyecto.
fr: Il existe déjà une référence à cette base de données système dans votre projet.
it: Un riferimento a questo database esiste già in questo progetto
ja: このデータベースへの参照は、このプロジェクトに既に存在します
ko: 이 데이터베이스에 대한 참조가 이 프로젝트에 이미 있습니다.
pt_br: Já existe uma referência a esse banco de dados nesse projeto
ru: Ссылка на эту базу данных уже существует в этом проекте
zh_hans: 此项目中已存在对此数据库的引用
zh_hant: 此專案中已經有這個資料庫的參考。

# databaseReferenceTypeRequired
source: Database reference type is required for adding a reference to a database
de: Der Datenbankverweistyp ist zum Hinzufügen eines Verweises zu einer Datenbank erforderlich
es: El tipo de referencia de la base de datos es necesaria para agregar una referencia a una base de datos.
fr: Le type de référence de base de données est requis pour l’ajout d’une référence à une base de données.
it: Il tipo di riferimento del database è necessario per aggiungere un riferimento a un database
ja: データベースに参照を追加するには、データベース参照型が必要です
ko: 데이터베이스에 참조를 추가하려면 데이터베이스 참조 형식이 필요합니다.
pt_br: O tipo de referência de banco de dados é necessário para adicionar uma referência a um banco de dados
ru: Для добавления ссылки на базу данных требуется тип ссылки на базу данных
zh_hans: 添加对数据库的引用时需要数据库引用
zh_hant: 必須有資料庫參考類型才能新增資料庫的參考

# databaseReferencesNodeName
source: Database References
de: Datenbankverweise
es: Referencias de base de datos
fr: Référence de base de données
it: Riferimenti al database
ja: データベース参照
ko: 데이터베이스 참조
pt_br: Referências do banco de dados
ru: Ссылки на базы данных
zh_hans: 数据库引用
zh_hant: 資料庫參考

# databaseSelectionRequired
source: Database selection is required to create a project from a database
de: Zum Erstellen eines Projekts aus einer Datenbank ist eine Datenbankauswahl erforderlich.
es: La selección de base de datos es necesaria para crear un proyecto a partir de una base de datos.
fr: La sélection de base de données est nécessaire pour créer un projet à partir d’une base de données
it: La selezione del database è necessaria per creare un progetto da un database
ja: データベースからプロジェクトを作成するには、データベース選択が必要です
ko: 데이터베이스에서 프로젝트를 만들려면 데이터베이스를 선택해야 합니다.
pt_br: A seleção do banco de dados é necessária para criar um projeto de um banco de dados
ru: Для создания проекта из базы данных требуется выбрать базу данных
zh_hans: 必须选择数据库才能根据数据库创建项目
zh_hant: 必須選取資料庫，才能從資料庫建立專案

source: Database variable
de: Datenbankvariable
es: Variable de base de datos
fr: Variable de base de données
it: Variabile database
ja: データベース変数
ko: 데이터베이스 변수
pt_br: Variável do banco de dados
ru: Переменная базы данных
zh_hans: 数据库变量
zh_hant: 資料庫變數

# dataworkspace.projectDirectoryAlreadyExistError
source: There is already a directory named '{0}' in the selected location: '{1}'.
de: Es ist bereits ein Verzeichnis mit dem Namen "{0}" am ausgewählten Speicherort vorhanden: "{1}".
es: Ya hay un directorio llamado "{0}" en la ubicación seleccionada: "{1}".
fr: Il existe déjà un répertoire nommé « {0} » à l’emplacement sélectionné : « {1} ».
it: Esiste già una directory denominata '{0}' nel percorso selezionato: '{1}'.
ja: 選択された場所 '{1}' には、すでに '{0}' という名前のディレクトリが存在します。
ko: 선택한 위치 '{1}'에 이름이 '{0}'인 디렉터리가 이미 있습니다..
pt_br: Já existe um diretório com o nome '{0}' no local selecionado: '{1}'.
ru: Каталог с именем "{0}" уже существует в выбранном расположении: "{1}".
zh_hans: 所选位置“{1}”中已存在名为“{0}”的目录。
zh_hant: 選取的位置中已有名為 '{0}' 的目錄: '{1}'。

# dataworkspace.projectParentDirectoryNotExistError
source: The selected project location '{0}' does not exist or is not a directory.
de: Der ausgewählte Projektspeicherort "{0}" ist nicht vorhanden oder kein Verzeichnis.
es: La ubicación del proyecto seleccionado, "{0}", no existe o no es un directorio.
fr: L’emplacement de projet sélectionné « {0} » n’existe pas ou n’est pas un répertoire.
it: Il percorso del progetto selezionato '{0}' non esiste o non è una directory.
ja: 選択したプロジェクトの場所 '{0}' は存在しないか、ディレクトリではありません。
ko: 선택한 프로젝트 위치 '{0}'이(가) 없거나 디렉터리가 아닙니다.
pt_br: O local do projeto selecionado '{0}' não existe ou não é um diretório.
ru: Выбранное расположение проекта "{0}" не существует или не является каталогом.
zh_hans: 所选项目位置“{0}”不存在或不是目录。
zh_hant: 選取的專案位置 '{0}' 不存在或不是目錄。

source: default
de: Standardeinstellung
es: Predeterminado
fr: par défaut
it: predefinito
ja: 既定
ko: 기본값
pt_br: padrão
ru: по умолчанию
zh_hans: 默认
zh_hant: 預設

# defaultQuickPickItem
source: Default - image defined as default in the container registry
de: Standard – Image, das in der Containerregistrierung als Standard definiert ist
es: Valor predeterminado: imagen definida como predeterminada en el registro de contenedor
it: Predefinito: immagine definita come predefinita nel registro contenitori
ja: 既定 - コンテナー レジストリで既定として定義されたイメージ
ko: 기본값 - 컨테이너 레지스트리에서 기본값으로 정의된 이미지
pt_br: Padrão - imagem definida como padrão no registro de contêiner
ru: По умолчанию — образ, определенный как используемый по умолчанию в реестре контейнеров
zh_hant: 預設 - 在容器登錄中定義為預設的映射

# deleteAction
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Deletar
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# deleteConfirmation
source: Are you sure you want to delete {0}?
de: Möchten Sie "{0}" wirklich löschen?
es: ¿Está seguro de que desea eliminar {0}?
fr: Voulez-vous vraiment supprimer {0} ?
it: Eliminare {0}?
ja: {0} を削除しますか?
ko: {0}을(를) 삭제하시겠습니까?
pt_br: Tem certeza de que deseja excluir {0}?
ru: Вы действительно хотите удалить {0}?
zh_hans: 是否确实要删除 {0}?
zh_hant: 確定要刪除 {0} 嗎?

# deleteConfirmationContents
source: Are you sure you want to delete {0} and all of its contents?
de: Sollen {0} und alle seine Inhalte wirklich gelöscht werden?
es: ¿Confirma que quiere eliminar {0} y todo su contenido?
fr: Voulez-vous vraiment supprimer {0} et tout son contenu ?
it: Eliminare {0} e tutto il contenuto?
ja: {0} とその内容をすべて削除してもよろしいですか?
ko: {0} 및 모든 내용을 삭제하시겠습니까?
pt_br: Tem certeza de que quer excluir {0} e todos os seus conteúdos?
ru: Действительно удалить {0} и все его содержимое?
zh_hans: 是否确实要删除 {0} 及其所有内容?
zh_hant: 您確定要刪除 {0} 及其所有內容嗎?

# deleteReferenceConfirmation
source: Are you sure you want to delete the reference to {0}?
de: Möchten Sie den Verweis auf {0} löschen?
es: ¿Confirma que quiere eliminar la referencia {0}?
fr: Voulez-vous vraiment supprimer la référence à {0} ?
it: Eliminare il riferimento a {0}?
ja: {0} への参照を削除しますか?
ko: {0}에 대한 참조를 삭제하시겠습니까?
pt_br: Tem certeza de que quer excluir a referência a {0}?
ru: Вы действительно хотите удалить ссылку на {0}?
zh_hans: 是否确定要删除对 {0} 的引用?
zh_hant: 確定要刪除 {0} 的參考嗎?

# deleteSqlCmdVariableConfirmation
source: Are you sure you want to delete the SQLCMD Variable '{0}'?
it: Eliminare la variabile SQLCMD '{0}'?
pt_br: Tem certeza de que deseja excluir a Variável SQLCMD '{0}'?

# deployAppSettingUpdateFailed
source: Failed to update app setting '{0}'
de: Fehler beim Aktualisieren der App-Einstellung "{0}"
es: No se pudo actualizar la configuración de la aplicación "{0}"
fr: Échec de la mise à jour du paramètre d’application «{0}»
it: Non è stato possibile aggiornare l'impostazione dell'app '{0}'
ja: アプリ設定 '{0}' を更新できませんでした
ko: 앱 설정 '{0}'을(를) 업데이트하지 못함
pt_br: Falha ao atualizar a configuração do aplicativo '{0}'
ru: Не удалось обновить параметр приложения "{0}"
zh_hans: 无法更新应用设置 "{0}"
zh_hant: 無法更新應用程式設定 '{0}'

# deployAppSettingUpdating
source: Updating app setting: '{0}'
de: App-Einstellung wird aktualisiert: "{0}"
es: Actualizando la configuración de la aplicación: "{0}"
fr: Mise à jour du paramètre d’application : «{0}»
it: Aggiornamento dell'impostazione dell'app: '{0}'
ja: アプリ設定を更新しています: '{0}'
ko: 앱 설정을 업데이트하는 중: '{0}'
pt_br: Atualizando a configuração do aplicativo: '{0}'
ru: Идет обновление параметра приложения: "{0}"
zh_hans: 正在更新应用设置: "{0}"
zh_hant: 正在更新應用程式設定: '{0}'

# deployDbTaskName
source: Deploying SQL Db Project Locally
de: Lokales Bereitstellen eines SQL-Datenbankprojekts
es: Implementando el proyecto de base de datos SQL localmente
fr: Déploiement d’un projet de base de données SQL localement
it: Distribuzione locale del progetto di database SQL
ja: SQL Db プロジェクトをローカルに展開しています
ko: 로컬로 SQL DB 프로젝트 배포 중
pt_br: Implantando o projeto do Banco de dados SQL localmente
ru: Локальное развертывание проекта базы данных SQL
zh_hans: 正在本地部署 SQL DB 项目
zh_hant: 在本機部署 SQL 資料庫專案

# deployProjectFailedMessage
source: Failed to open a connection to the deployed database'
de: Fehler beim Öffnen einer Verbindung mit der bereitgestellten Datenbank.
es: No se pudo abrir una conexión a la base de datos implementada"
fr: Échec de l’ouverture d’une connexion à la base de données déployée »
it: Non è stato possibile aprire una connessione al database distribuito'
ja: 展開したデータベースへの接続を開けませんでした'
ko: 배포된 데이터베이스’에 대한 연결을 열지 못함
pt_br: Falha ao abrir uma conexão com o banco de dados implantado'
ru: Не удалось открыть подключение к развернутой базе данных
zh_hans: 无法打开与已部署数据库的连接
zh_hant: 無法開啟與已部署資料庫的連線

# deployScriptExists
source: A {0} script already exists. The new script will not be included in build.
de: Ein {0}-Skrip ist bereits vorhanden. Das neue Skript wird nicht im Build enthalten sein.
es: Ya existe un script {0}. El nuevo script no se incluirá en la compilación.
fr: Un script {0} existe déjà. Le nouveau script ne sera pas inclus dans la build.
it: Esiste già uno script {0}. Il nuovo script non verrà incluso nella compilazione.
ja: {0} スクリプトが既に存在します。新しいスクリプトはビルドに含まれません。
ko: {0} 스크립트가 이미 있습니다. 새 스크립트는 빌드에 포함되지 않습니다.
pt_br: Já {0} existe um script. O novo script não será incluído na Compilação.
ru: Сценарий {0} уже существует. Новый сценарий не будет включен в сборку.
zh_hans: 已存在 {0} 脚本。新脚本不会包含在生成中。
zh_hant: {0} 指令碼已存在。新指令碼不會包含在組建中。

# differentDbDifferentServer
source: Different database, different server
de: Andere Datenbank, anderer Server
es: Base de datos diferente, servidor diferente
fr: Autre base de données, autre serveur
it: Database e server diversi
ja: 異なるデータベース、異なるサーバー
ko: 다른 서버의 다른 데이터베이스
pt_br: Banco de dados diferente, servidor diferente
ru: Другая база данных, другой сервер
zh_hans: 不同数据库，不同服务器
zh_hant: 不同資料庫，不同伺服器

# differentDbSameServer
source: Different database, same server
de: Andere Datenbank, derselbe Server
es: Base de datos diferente, mismo servidor
fr: Autre base de données, même serveur
it: Database diverso, stesso server
ja: 異なるデータベース、同じサーバー
ko: 동일한 서버의 다른 데이터베이스
pt_br: Outro banco de dados, mesmo servidor
ru: Другая база данных, тот же сервер
zh_hans: 不同数据库，同一服务器
zh_hant: 不同資料庫，相同伺服器

# dockerContainerCreatedMessage
source: Docker created id: '{0}'
de: Von Docker erstellte ID: "{0}"
es: Identificador creado por el Docker: "{0}"
fr: ID créé par Docker : «{0}»
it: ID creato da Docker: '{0}'
ja: Docker によって作成された ID: '{0}'
ko: Docker 생성 ID: '{0}'
pt_br: ID criada pelo Docker: '{0}'
ru: Создан идентификатор Docker: "{0}"
zh_hans: Docker 创建的 ID: "{0}"
zh_hant: Docker 建立的識別碼: '{0}'

# dockerContainerFailedToRunErrorMessage
source: Failed to run the docker container
de: Fehler beim Ausführen des Docker-Containers.
es: Error al ejecutar el contenedor Docker
fr: Échec de l’exécution du conteneur Docker
it: Non è stato possibile eseguire il contenitore Docker
ja: Docker コンテナーを実行できませんでした
ko: Docker 컨테이너를 실행하지 못함
pt_br: Falha ao executar o contêiner do Docker
ru: Не удалось запустить контейнер Docker
zh_hans: 无法运行 Docker 容器
zh_hant: 無法執行 Docker 容器

# dockerContainerNotRunningErrorMessage
source: Docker container is not running
de: Docker-Container wird nicht ausgeführt
es: El contenedor Docker no se está ejecutando
fr: Le conteneur Docker n’est pas en cours d’exécution
it: Il contenitore Docker non è in esecuzione
ja: Docker コンテナーが実行されていません
ko: Docker 컨테이너가 실행되고 있지 않음
pt_br: O contêiner do Docker não está em execução
ru: Контейнер Docker не запущен
zh_hans: Docker 容器未运行
zh_hant: Docker 容器未執行

# dockerImageEulaMessage
source: License Agreement:
de: Lizenzbedingung:
es: Contrato de licencia:
it: Contratto di licenza:
ja: ライセンス契約:
ko: 라이선스 계약
pt_br: Contrato de Licença:
ru: Лицензионное соглашение:
zh_hans: 许可协议:
zh_hant: 授權合約:

# dockerImageMessage
source: Docker Image:
es: Imagen de Docker:
it: Immagine Docker:
ja: Docker イメージ
ko: Docker 이미지
pt_br: Imagem do Docker:
ru: Образ Docker:
zh_hans: Docker 映像:
zh_hant: Docker 映像:

# dockerImagesPlaceHolder
source: Use {0} on local arm64/Apple Silicon
de: Verwenden Sie {0} auf dem lokalen Arm64/Apple Silicon
es: Usar {0} en arm64/Apple Silicon local
it: Usare {0} su arm64/Apple Silicon locale
ja: ローカル arm64/Apple Silicon で {0} を使用する
ko: 로컬 arm64/Apple Silicon에서 {0} 사용
pt_br: Usar {0} no arm64/Apple Silicon local
ru: Использовать {0} на локальном arm64/Apple Silicon
zh_hant: 在本機 arm64/Apple Silicon 上使用{0}

# dockerLogMessage
source: Docker logs: '{0}'
de: Docker-Protokolle: "{0}"
es: Registros de Docker: "{0}"
fr: Journaux Docker : «{0}»
it: Log di Docker: '{0}'
ja: Docker ログ: '{0}'
ko: Docker 로그: '{0}'
pt_br: Logs do Docker: '{0}'
ru: Журналы Docker: "{0}"
zh_hans: Docker 日志: "{0}"
zh_hant: Docker 記錄檔: '{0}'

# dockerNotRunningError
source: Failed to verify docker. Please make sure docker is installed and running. Error: '{0}'
de: Fehler beim Überprüfen von Docker. Stellen Sie sicher, dass Docker installiert ist und ausgeführt wird. Fehler: "{0}"
es: No se pudo comprobar el Docker. Asegúrese de que el Docker está instalado y se está ejecutando. Error: ' {0} '
fr: Échec de la vérification de l’ancreur. Assurez-vous que l’amarrage est installé et en cours d’exécution. Erreur : « {0} »
it: Non è stato possibile verificare docker. Verificare che Docker sia installato e in esecuzione. Errore: '{0}'
ja: Docker を確認できませんでした。Docker がインストールされ、実行されていることを確認してください。エラー: '{0}'
ko: 도커를 확인하지 못했습니다. 도커가 설치되어 실행 중인지 확인하세요. 오류: '{0}'
pt_br: Falha ao verificar o Docker. Verifique se o Docker está instalado e em execução. Erro: '{0}'
ru: Не удалось проверить Docker. Убедитесь, что инструмент Docker установлен и работает. Ошибка: "{0}"
zh_hans: 验证 docker 失败。请确保 docker 已安装并正在运行。错误:“{0}”
zh_hant: 無法驗證 docker。請確定 docker 已安裝且正在執行。錯誤: '{0}'

source: Done
de: Fertig
es: Hecho
fr: Terminé
it: Fatto
ja: 完了
ko: 완료
pt_br: Concluído
ru: Готово
zh_hans: 完成
zh_hant: 完成

source: Don't use profile
de: Profil nicht verwenden
es: No usar perfil
fr: Ne pas utiliser de profil
it: Non usare il profilo
ja: プロファイルを使用しません
ko: 프로필 사용 안 함
pt_br: Não usar o perfil
ru: Не использовать профиль
zh_hans: 不使用配置文件
zh_hant: 不要使用設定檔

source: Download error
it: Errore di download
pt_br: Erro de download

source: Download progress
it: Stato del download
pt_br: Progresso do download

source: Downloading
it: Download in corso
pt_br: Baixando

# downloadingDacFxDlls
source: Downloading Microsoft.Build.Sql nuget to get build DLLs
it: Download di NuGet Microsoft.Build.Sql per ottenere dll di compilazione
pt_br: Baixando o nuget Microsoft.Build.Sql para obter DLLs de build

# downloadingFromTo
source: Downloading from {0} to {1}
it: Scaricamento da {0} a {1} in corso
pt_br: Baixando de {0} para {1}

# edgeEulaAgreementTitle
source: Microsoft Azure SQL Edge License Agreement
de: Microsoft Azure SQL Edge-Lizenzvertrag
es: Contrato de licencia de Microsoft Azure SQL Edge
it: Contratto di licenza di SQL Edge di Microsoft Azure
ko: Microsoft Azure SQL Edge 사용권 계약
pt_br: Contrato de licença do SQL do Microsoft Azure no Edge
ru: Лицензионное соглашение SQL Microsoft Azure для пограничных вычислений
zh_hans: Microsoft Azure SQL Edge 许可协议
zh_hant: Microsoft Azure SQL Edge 授權合約

# edgeProjectTypeDescription
source: Start with the core pieces to develop and publish schemas for Azure SQL Edge Database
de: Beginnen Sie mit den Kernelementen, um Schemas für Azure SQL Edge-Datenbank zu entwickeln und zu veröffentlichen
es: Comience con las partes principales para desarrollar y publicar esquemas para Azure SQL Edge Database.
it: Iniziare dalle parti core per sviluppare e pubblicare schemi per il data base di SQL Edge di Azure
ja: コア部分を開始し、Azure SQL Edge データベースのスキーマを開発して公開します
ko: Azure SQL Edge Database에 대한 스키마를 개발하고 게시하는 핵심 부분부터 시작합니다.
pt_br: Inicie com as partes principais para desenvolver e publicar esquemas do banco de dados SQL do Azure no Edge
ru: Начните с основных частей, чтобы разработать и опубликовать схемы для базы данных SQL Azure для пограничных вычислений
zh_hant: 從核心元件開始開發及發佈 Azure SQL Edge 資料庫的結構描述

# edgeProjectTypeDisplayName
source: Azure SQL Edge Database
de: Azure SQL Edge-Datenbank
it: Database di SQL Edge di Azure
ja: Azure SQL Edge データベース
pt_br: Banco de dados SQL do Azure no Edge
ru: База данных SQL Azure для пограничных вычислений
zh_hant: Azure SQL Edge 資料庫

# emptyAzureDbProjectTypeDescription
source: Develop and publish schemas for Azure SQL Database starting from an empty project
de: Entwickeln und Veröffentlichen von Schemas für Azure SQL-Datenbanken aus einem leeren Projekt
es: Permite desarrollar y publicar esquemas para Azure SQL Database a partir de un proyecto vacío.
it: Sviluppare e pubblicare schemi per database SQL di Azure a partire da un progetto vuoto
ja: 空のプロジェクトから Azure SQL Database 用のスキーマを開発して公開します
ko: 빈 프로젝트에서 시작하는 Azure SQL Database 대한 스키마 개발 및 게시
pt_br: Desenvolva e publique esquemas para bancos de dados SQL do Azure a partir de um projeto vazio
ru: Разработка и публикация схем для базы данных SQL Azure, начиная с пустого проекта
zh_hant: 為從空白專案開始的 Azure SQL 資料庫開發及發佈結構描述

# emptyAzureDbProjectTypeDisplayName
source: Azure SQL Database
de: Azure SQL-Datenbank
it: Database SQL di Azure
pt_br: Banco de dados SQL do Azure
ru: База данных SQL Azure

# emptyProjectTypeDescription
source: Develop and publish schemas for SQL Server databases starting from an empty project
de: Entwickeln und Veröffentlichen von Schemas für SQL Server-Datenbanken aus einem leeren Projekt
es: Desarrolle y publique esquemas para bases de datos SQL Server a partir de un proyecto vacío.
it: Sviluppare e pubblicare schemi per i database di SQL Edge di Azure a partire da un progetto vuoto
ja: 空のプロジェクトから SQL Server データベース用のスキーマを開発して公開します
ko: 빈 프로젝트에서 시작하는 SQL Server 데이터베이스에 대한 스키마 개발 및 게시
pt_br: Desenvolva e publique esquemas para bancos de dados SQL Server a partir de um projeto vazio
ru: Разработка и публикация схем для баз данных SQL Server, начиная с пустого проекта
zh_hant: 為從空白專案開始的 SQL Server 資料庫開發及發佈結構描述

# emptyProjectTypeDisplayName
source: SQL Server Database
de: SQL Server-Datenbank
es: Base de datos de SQL Server
it: Database di SQL Server
ja: SQL Server データベース
ko: SQL Server 데이터베이스
pt_br: Banco de Dados SQL Server
ru: База данных SQL Server
zh_hant: SQL Server 資料庫
