Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# emptySdkProjectTypeDescription
source: Develop and publish schemas for SQL databases with Microsoft.Build.Sql (preview), starting from an empty SDK-style project.
de: Entwickeln und veröffentlichen Sie Schemas für SQL-Datenbanken mit Microsoft.Build.Sql (Vorschau), beginnend mit einem leeren Projekt im SDK-Format.
es: Desarrolle y publique esquemas para bases de datos SQL con Microsoft.Build.Sql (versión preliminar), a partir de un proyecto vacío de estilo SDK.
it: Sviluppare e pubblicare schemi per database SQL con Microsoft.Build.Sql (anteprima), a partire da un progetto vuoto in stile SDK.
ja: 空の SDK スタイルのプロジェクトから、Microsoft.Build.Sql (プレビュー) を使用して SQL データベースのスキーマを開発して発行します。
ko: 빈 SDK 스타일 프로젝트에서 시작하여 Microsoft.Build.Sql(미리 보기)을 사용하여 SQL 데이터베이스용 스키마를 개발 및 게시합니다.
pt_br: Desenvolva e publique esquemas para bancos de dados SQL com Microsoft.Build.Sql (versão prévia), começando com um projeto vazio no estilo SDK.
ru: Разрабатывайте и публикуйте схемы для баз данных SQL с помощью Microsoft.Build.Sql (предварительная версия), начиная с пустого проекта в стиле SDK.
zh_hant: 從空的 SDK 樣式專案開始，使用 Microsoft.Build.Sql (預覽) 開發及發行 SQL 資料庫架構。

# emptySdkProjectTypeDisplayName
source: SQL Database (SDK)
de: SQL-Datenbank (SDK)
it: Database SQL (SDK)
ko: SQL 데이터베이스(SDK)
pt_br: Banco de Dados SQL (SDK)
ru: База данных SQL (SDK)

# enterConnStringTemplateDescription
source: Enter a template for SQL connection string
de: Vorlage für SQL-Verbindungszeichenfolge eingeben
es: Escriba una plantilla para la cadena de conexión de SQL
fr: Entrer un modèle pour la chaîne de connexion SQL
it: Immettere un modello per la stringa di connessione SQL
ja: SQL 接続文字列のテンプレートを入力してください
ko: SQL 연결 문자열에 대한 템플릿 입력
pt_br: Insira um modelo para a cadeia de conexão do SQL
ru: Введите шаблон для строки подключения SQL
zh_hans: 输入 SQL 连接字符串的模板
zh_hant: 輸入 SQL 連接字串的範本

# enterConnectionStringEnvName
source: Enter connection string environment variable name
de: Geben Sie den Namen der Umgebungsvariablen für die Verbindungszeichenfolge ein.
es: Escriba el nombre de variable de entorno de la cadena de conexión
fr: Entrer le nom de la variable d’environnement de chaîne de connexion
it: Immettere il nome della variabile di ambiente della stringa di connessione
ja: 接続文字列の環境変数名を入力してください
ko: 연결 문자열 환경 변수 이름 입력
pt_br: Insira o nome da variável de ambiente da cadeia de conexão
ru: Введите имя переменной среды для строки подключения
zh_hans: 输入连接字符串环境变量名称
zh_hant: 輸入連接字串環境變數名稱

# enterConnectionStringEnvNameDescription
source: Enter environment variable for SQL connection string
de: Umgebungsvariable für SQL-Verbindungszeichenfolge eingeben
es: Escriba la variable de entorno de la cadena de conexión SQL
fr: Entrer la variable d’environnement pour la chaîne de connexion SQL
it: Immettere la variabile di ambiente per la stringa di connessione SQL
ja: SQL 接続文字列の環境変数を入力してください
ko: SQL 연결 문자열에 대한 환경 변수 입력
pt_br: Inserir variável de ambiente para cadeia de conexão do SQL
ru: Укажите переменную среды для строки подключения SQL
zh_hans: 输入 SQL 连接字符串的环境变量
zh_hant: 輸入 SQL 連接字串的環境變數

source: Enter connection string template
de: Verbindungszeichenfolgenvorlage eingeben
es: Escriba la plantilla de la cadena de conexión.
fr: Entrer un modèle de chaîne de connexion
it: Immettere il modello della stringa di connessione
ja: 接続文字列を入力してください
ko: 연결 문자열 템플릿 입력
pt_br: Inserir modelo de cadeia de conexão
ru: Введите шаблон строки подключения
zh_hans: 输入连接字符串模板
zh_hant: 輸入連接字串範本

source: Enter new database name
de: Neuen Datenbanknamen eingeben
es: Escriba el nombre de la nueva base de datos.
fr: Entrer un nom de base de données
it: Immettere il nuovo nome del database
ja: 新しいデータベース名を入力する
ko: 새 데이터베이스 이름 입력
pt_br: Insira um nome de banco de dados
ru: Введите новое имя базы данных
zh_hans: 输入新数据库名
zh_hant: 輸入新的資料庫名稱

source: Enter new name
it: Immettere il nuovo nome
pt_br: Inserir novo nome

# enterNewSqlCmdVariableDefaultValue
source: Enter default value for SQLCMD variable '{0}'
it: Immettere il valore predefinito per la variabile SQLCMD '{0}'
pt_br: Insira o valor padrão para a variável SQLCMD '{0}'

source: Enter new SQLCMD Variable name
it: Immettere il nuovo nome della variabile SQLCMD
pt_br: Insira o novo nome da Variável SQLCMD

# enterNewValueForVar
source: Enter new default value for variable '{0}'
it: Immettere un valore predefinito per la variabile '{0}'
pt_br: Digite o novo valor padrão para a variável '{0}'

# enterPassword
source: Enter {0} admin password
de: Geben Sie {0} Administratorkennwort ein
es: Escriba la contraseña del administrador {0}
it: Immettere la password {0} dell'amministratore
ja: {0} 管理者パスワードを入力してください
ko: {0} 관리자 암호를 입력합니다.
pt_br: Insira {0} senha de administrador
ru: Введите пароль администратора {0}
zh_hant: 輸入 {0} 系統管理員密碼

# enterPortNumber
source: Enter {0} port number or press enter to use the default value
de: Geben Sie {0} Portnummer ein, oder drücken Sie die Eingabetaste, um den Standardwert zu verwenden
es: Escriba el número de puerto {0} o presione Entrar para usar el valor predeterminado
it: Immettere il numero di porta {0}o premere INVIO per usare il valore predefinito
ja: 既定値を使用するには、{0} ポート番号を入力するか、Enter キーを押してください
ko: {0} 포트 번호를 입력하거나 Enter 키를 눌러 기본값을 사용함
pt_br: Insira {0} número da porta ou pressione Enter para usar o valor padrão
ru: Введите номер порта {0} или нажмите клавишу ВВОД, чтобы использовать значение по умолчанию
zh_hant: 輸入 {0} 連接埠號碼或按 Enter 以使用預設值

# enterSystemDbName
source: Enter a database name for this system database
de: Geben Sie einen Datenbanknamen für diese Systemdatenbank ein.
es: Escriba un nombre para esta base de datos del sistema.
fr: Entrez un nom de base de données pour cette base de données système
it: Immettere un nome di database per il database di sistema
ja: このシステム データベースのデータベース名を入力します
ko: 이 시스템 데이터베이스에 대한 데이터베이스 이름을 입력하십시오.
pt_br: Insira um nome de banco de dados para esse banco de dados do sistema
ru: Введите имя базы данных для этой системной базы данных
zh_hans: 输入此系统数据库的数据库名
zh_hant: 輸入此系統資料庫的資料庫名稱

# enterUser
source: Enter {0} admin user name
de: Administratorbenutzername \"{0}\" eingeben
es: Escriba nombre de usuario del administrador {0}
it: Immettere {0} nome utente amministratore
ja: {0} 管理者ユーザー名を入力
ko: {0} 관리자 사용자 이름 입력
pt_br: Insira o nome de usuário do administrador do {0}
ru: Введите имя администратора {0}
zh_hant: 輸入 {0} 系統管理員使用者名稱

# equalComparison
source: The project is already up to date with the database.
de: Das Projekt ist bereits mit der Datenbank auf dem neuesten Stand.
es: El proyecto ya está actualizado con la base de datos.
it: Il progetto è già aggiornato con il database.
ja: プロジェクトはデータベースと既に最新の状態にあります。
ko: 프로젝트가 데이터베이스를 사용하여 이미 최신 상태입니다.
pt_br: O projeto já está atualizado com o banco de dados.
ru: Проект уже содержит новейшие данные из базы данных.
zh_hant: 專案已經與資料庫一起更新。

# errorAddingDatabaseReference
source: Error adding database reference to {0}. Error: {1}
it: Errore durante l'aggiunta del riferimento al database al {0}. Errore: {1}
pt_br: Erro ao adicionar referência de banco de dados a {0}. Erro: {1}

# errorDownloading
source: Error downloading {0}. Error: {1}
it: Errore durante il download di {0}%1! Errore: {1}
pt_br: Erro ao baixar {0}. Erro: {1}

# errorExtracting
source: Error extracting files from {0}. Error: {1}
it: Errore durante l'estrazione dei file da {0}. Errore: {1}
pt_br: Erro ao extrair arquivos de {0}. Erro: {1}

# errorFindingBuildFilesLocation
source: Error finding build files location: {0}
de: Fehler beim Suchen des Speicherorts der Builddateien: {0}
es: Error al buscar la ubicación de los archivos de compilación: {0}
fr: Erreur lors de la recherche de l’emplacement des fichiers de build : {0}
it: Errore durante la ricerca del percorso dei file di compilazione: {0}
ja: ビルド ファイルの場所の検索中にエラーが発生しました: {0}
ko: 빌드 파일 위치를 찾는 동안 오류 발생: {0}
pt_br: Erro ao localizar o local dos arquivos de build: {0}
ru: Ошибка при поиске расположения файлов сборки: {0}
zh_hans: 查找生成文件位置时出错: {0}
zh_hant: 尋找組建檔案位置時發生錯誤: {0}

# errorMovingFile
source: Error when moving file from {0} to {1}. Error: {2}
it: Errore durante lo spostamento del file da {0} a {1}. Errore: {2}
pt_br: Erro ao mover o arquivo de {0} para {1}. Erro: {2}

# errorNotSupportedInVsCode
source: Error: {0} is not currently supported in SQL Database Projects for VS Code.
it: Errore: {0} non è attualmente supportato in database SQL Projects per VS Code.
pt_br: Erro: {0} atualmente não tem suporte em projetos de Banco de Dados SQL para VS Code.

# errorPrefix
source: Error: {0}
it: Errore: {0}
pt_br: Erro: {0}

# errorReadingProjectGuid
source: Error trying to read {0} of project '{1}'. {2}
it: Errore durante il tentativo di leggere {0} del progetto '{1}'. {2}
pt_br: Erro ao tentar ler {0} do projeto '{1}'. {2}

# errorRenamingFile
source: Error when renaming file from {0} to {1}. Error: {2}
it: Errore durante la ridenominazione del file da {0} a {1}. Errore: {2}
pt_br: Erro ao renomear arquivo de {0} para {1}. Erro: {2}

# errorRetrievingBuildFiles
source: Could not build project. Error retrieving files needed to build.
it: Non è stato possibile compilare il progetto. Errore durante il recupero dei file necessari per la compilazione.
pt_br: Não foi possível criar o projeto. Ocorreu um erro ao recuperar arquivos necessários para compilar.

# eulaAgreementTemplate
source: I accept the {0}.
de: Ich akzeptiere die {0}.
es: Acepto el {0}.
it: Accetto {0}.
ja: {0} に同意します。
ko: {0}을(를) 수락합니다.
pt_br: Eu aceito os {0}.
ru: Я принимаю {0}.
zh_hans: 我接受 {0}。
zh_hant: 我接受 {0}。

# eulaAgreementText
source: I accept the {0}.
de: Ich akzeptiere die {0}.
es: Acepto el {0}.
it: Accetto {0}.
ja: {0} に同意します。
ko: {0}을(를) 수락합니다.
pt_br: Eu aceito os {0}.
ru: Я принимаю {0}.
zh_hans: 我接受 {0}。
zh_hant: 我接受 {0}。

# eulaAgreementTitle
source: Microsoft SQL Server License Agreement
de: Microsoft SQL Server-Lizenzbedingungen
es: Contrato de licencia de Microsoft SQL Server
it: Contratto di licenza di Microsoft SQL Server
ja: Microsoft SQL Server ライセンス契約
ko: Microsoft SQL Server 라이선스 계약
pt_br: Contrato de Licença do Microsoft SQL Server
ru: Лицензионное соглашение Microsoft SQL Server
zh_hans: Microsoft SQL Server 许可协议
zh_hant: Microsoft SQL Server 授權合約

source: Example Usage
de: Beispielverwendung
es: Ejemplo de uso
fr: Exemple d'utilisation
it: Esempio di utilizzo
ja: 使用例
ko: 사용 예제
pt_br: Exemplo de uso
ru: Пример использования
zh_hans: 示例用法
zh_hant: 使用方式範例

# excludeAction
source: Exclude
de: Ausschließen
es: Excluir
fr: Exclure
it: Escludi
ja: 除外
ko: 제외
pt_br: Excluir
ru: Исключить
zh_hans: 不包括
zh_hant: 排除

# excludeFolderNotSupported
source: Excluding folders is not yet supported
it: L'esclusione di cartelle non è ancora supportata
pt_br: Ainda não há suporte para a exclusão de pastas

source: Exclude Object Types
de: Objekttypen ausschließen
es: Excluir tipos de objeto
it: Escludi i tipi di oggetto
ja: オブジェクトの種類を除外する
ko: 개체 형식 제외
pt_br: Excluir os Tipos de Objeto
ru: Исключить типы объектов
zh_hant: 排除物件類型

source: External Stream
de: Externer Stream
es: Flujo externo
fr: Flux externe
it: Flusso esterno
ja: 外部ストリーム
ko: 외부 스트림
pt_br: Fluxo externo
ru: Внешний поток
zh_hans: 外部 Stream
zh_hant: 外部資料流

# externalStreamingJobFriendlyName
source: External Streaming Job
de: Externer Streamingauftrag
es: Trabajo de streaming externo
fr: Travail de streaming externe
it: Processo di streaming esterno
ja: 外部ストリーミング ジョブ
ko: 외부 스트리밍 작업
pt_br: Trabalho de Streaming Externo
ru: Задание внешней потоковой передачи
zh_hans: 外部流式处理作业
zh_hant: 外部資料流作業

# externalStreamingJobValidationPassed
source: Validation of external streaming job passed.
de: Die Überprüfung des externen Streamingauftrags war erfolgreich.
es: Se ha superado la validación del trabajo de streaming externo.
fr: Validation de la tâche de streaming externe réussie.
it: Convalida superata del processo di streaming esterno.
ja: 外部ストリーミングジョブの検証に合格しました。
ko: 외부 스트리밍 작업의 유효성 검사를 통과했습니다.
pt_br: A validação do trabalho de streaming externo foi aprovada.
ru: Проверка задания внешней потоковой передачи успешно пройдена.
zh_hans: 已通过外部流式作业验证。
zh_hant: 外部資料流作業的驗證已通過。

# extractTargetRequired
source: Target information for extract is required to create database project.
de: Zum Erstellen eines Datenbankprojekts sind Zielinformationen zum Extrahieren erforderlich.
es: La información de destino para la extracción es necesaria para crear un proyecto de base de datos.
fr: Les informations cibles pour l’extraction sont nécessaires pour créer un projet de base de données.
it: Le informazioni di destinazione per l'estrazione sono necessarie per creare il progetto di database.
ja: データベース プロジェクトを作成するには、抽出対象の情報が必要です。
ko: 데이터베이스 프로젝트를 만들려면 추출에 대한 대상 정보가 필요합니다.
pt_br: Para criar um projeto de banco de dados são necessárias as informações alvo para realizar a coleta.
ru: Для создания проекта базы данных требуется целевая информация для извлечения.
zh_hans: 必须提供用于提取的目标信息才能创建数据库项目。
zh_hant: 需要供解壓縮的目標資訊才能建立資料庫專案。

# extractingDacFxDlls
source: Extracting DacFx build DLLs to {0}
it: Estrazione delle DLL della build DacFx in {0} in corso
pt_br: Extraindo DLLs de compilação DacFx para {0}

source: File
de: Datei
es: Archivo
fr: Fichier
ja: ファイル
ko: 파일
pt_br: Arquivo
ru: Файл
zh_hans: 文件
zh_hant: 檔案

# fileAlreadyExists
source: A file with the name '{0}' already exists on disk at this location. Please choose another name.
de: Auf dem Datenträger ist an diesem Speicherort bereits eine Datei mit dem Namen "{0}" vorhanden. Wählen Sie einen anderen Namen.
es: Ya existe un archivo con el nombre "{0}" en el disco en esta ubicación. Elija otro nombre.
fr: Il existe déjà un fichier nommé « {0} » à cet emplacement sur le disque. Choisissez un autre nom.
it: Un file con il nome '{0}' esiste già in questa posizione del disco. Scegliere un altro nome.
ja: '{0}' という名前のファイルが、ディスク上のこの場所に既に存在します。別の名前を選択してください。
ko: 이름이 '{0}'인 파일이 이 위치의 디스크에 이미 있습니다. 다른 이름을 선택하세요.
pt_br: Já existe um arquivo com o nome '{0}' no disco neste local. Escolha outro nome.
ru: Файл с именем "{0}" уже существует на диске в данном расположении. Выберите другое имя.
zh_hans: 此位置的磁盘上已经存在名为“{0}”的文件。请选择其他名称。
zh_hant: 磁碟的這個位置已經有名稱為 '{0}' 的檔案存在。請選擇其他名稱。

source: File Format
de: Dateiformat
es: Formato de archivo
fr: Format de fichier
it: Formato di file
ja: ファイル形式
ko: 파일 형식
pt_br: Formato do arquivo
ru: Формат файла
zh_hans: 文件格式
zh_hant: 檔案格式

# fileObject
source: file
de: Datei
es: archivo
fr: fichier
ja: ファイル
ko: 파일
pt_br: arquivo
ru: файл
zh_hans: 文件
zh_hant: 檔案

# fileOrFolderDoesNotExist
source: File or directory '{0}' doesn't exist
de: Datei oder Verzeichnis "{0}" nicht vorhanden
es: El archivo o directorio "{0}" no existe.
fr: Le fichier ou le répertoire « {0} » n'existe pas
it: Il file o la directory '{0}' non esiste
ja: ファイルまたはディレクトリ '{0}' は存在しません
ko: 파일 또는 디렉터리 '{0}'이(가) 없습니다.
pt_br: O arquivo ou diretório '{0}' não existe
ru: Файл или каталог "{0}" не существует
zh_hans: 文件或目录“{0}”不存在
zh_hant: 檔案或目錄 '{0}' 不存在

source: Flat
de: Flach
es: Plano
fr: Plat
it: Semplice
ja: フラット
ko: 플랫
pt_br: Simples
ru: Без иерархии
zh_hans: 平面
zh_hant: 一般

# folderAlreadyExists
source: A folder with the name '{0}' already exists on disk at this location. Please choose another name.
de: Auf dem Datenträger ist an diesem Speicherort bereits ein Ordner mit dem Namen "{0}" vorhanden. Wählen Sie einen anderen Namen.
es: Ya existe una carpeta con el nombre "{0}" en el disco en esta ubicación. Elija otro nombre.
fr: Il existe déjà un dossier nommé « {0} » à cet emplacement sur le disque. Choisissez un autre nom.
it: Una cartella con il nome '{0}' esiste già in questa posizione del disco. Scegliere un altro nome.
ja: '{0}' という名前のフォルダーが、ディスク上のこの場所に既に存在します。別の名前を選択してください。
ko: 이름이 '{0}'인 폴더가 이 위치의 디스크에 이미 있습니다. 다른 이름을 선택하세요.
pt_br: Já existe uma pasta com o nome '{0}' no disco neste local. Escolha outro nome.
ru: Папка с именем "{0}" уже существует на диске в данном расположении. Выберите другое имя.
zh_hans: 此位置的磁盘上已经存在名为“{0}”的文件夹。请选择其他名称。
zh_hant: 磁碟的這個位置已經有名稱為 '{0}' 的資料夾存在。請選擇其他名稱。

# folderAlreadyExistsChooseNewLocation
source: A folder with the name '{0}' already exists on disk at this location. Please choose another location.
de: An diesem Speicherort ist auf dem Datenträger bereits ein Ordner mit dem Namen "{0}" vorhanden. Wählen Sie einen anderen Speicherort aus.
es: Ya existe una carpeta con el nombre "{0}" en el disco en esta ubicación. Elija otra ubicación.
fr: Il existe déjà un dossier nommé « {0} » à cet emplacement sur le disque. Choisissez un autre emplacement.
it: Una cartella con il nome '{0}' esiste già in questa posizione del disco. Scegliere un'altra posizione.
ja: "{0}" という名前のフォルダーが、ディスク上のこの場所に既に存在します。別の場所を選択してください。
ko: 이름이 '{0}'인 폴더가 이 위치의 디스크에 이미 있습니다. 다른 위치를 선택하세요.
pt_br: Uma pasta com o nome '{0}' já existe em disco neste local. Escolha outro local.
ru: Папка с именем "{0}" уже существует на диске в этом расположении. Выберите другое расположение.
zh_hans: 此位置的磁盘上已经存在名为 "{0}" 的文件夹。请选择其他名称。
zh_hant: 磁碟的這個位置已經有名稱為 '{0}' 的資料夾存在。請選擇其他位置。

source: Folder Elements
de: Ordnerelemente
es: Elementos de carpeta
it: Elementi cartella
ja: フォルダー要素
ko: 폴더 요소
pt_br: Elementos da Pasta
ru: Элементы папки
zh_hans: 文件夹元素
zh_hant: 資料夾元素

# folderFriendlyName
source: Folder
de: Ordner
es: Carpeta
fr: Dossier
it: Cartella
ja: フォルダー
ko: 폴더
pt_br: Pasta
ru: Папка
zh_hans: 文件夹
zh_hant: 資料夾

# folderObject
source: folder
de: Ordner
es: carpeta
fr: dossier
it: cartella
ja: フォルダー
ko: 폴더
pt_br: pasta
ru: папка
zh_hans: 文件夹
zh_hant: 資料夾

# folderStructureLabel
source: Folder structure
de: Ordnerstruktur
es: Estructura de carpetas
fr: Structure du dossier
it: Struttura di cartelle
ja: フォルダー構造
ko: 폴더 구조
pt_br: Estrutura de pastas
ru: Структура папок
zh_hans: 文件夹结构
zh_hant: 資料夾結構

# generateScriptButtonText
source: Generate Script
de: Skript generieren
es: Generar script
fr: Générer le script
it: Generare script
ja: スクリプトの生成
ko: 스크립트 생성
pt_br: Gerar script
ru: Создать сценарий
zh_hans: 生成脚本
zh_hant: 產生指令碼

# generatingProjectFailed
source: Generating project via AutoRest failed. Check output pane for more details. Error: {0}
de: Beim Generieren des Projekts über AutoRest ist ein Fehler aufgetreten. Weitere Details finden Sie im Ausgabebereich. Fehler: {0}
es: Error al generar el proyecto a través de AutoRest. Compruebe el panel de salida para obtener más detalles. Error: {0}
it: La generazione del progetto tramite AutoRest non è riuscita. Per altri dettagli, controllare il riquadro di output. Errore: {0}
ja: AutoRest を介したプロジェクトの生成に失敗しました。詳細については、出力ウィンドウを確認してください。エラー: {0}
ko: AutoRest를 통해 프로젝트를 생성하지 못했습니다. 자세한 내용은 출력 창을 확인하세요. 오류: {0}
pt_br: Falha na geração do projeto por meio do AutoRest. Verifique o painel de saída para obter mais detalhes. Erro: {0}
ru: Не удалось создать проект через AutoRest. Дополнительные сведения см. в области вывода. Ошибка: {0}
zh_hans: 通过 AutoRest 生成项目失败。有关更多详细信息，请查看输出窗格。错误: {0}
zh_hant: 透過 AutoRest 產生專案失敗。如需詳細資料，請查看輸出窗格。錯誤: {0}

# generatingProjectFromAutorest
source: Generating new SQL project from {0}... Check output window for details.
de: Über {0} wird ein neues SQL-Projekt generiert... Überprüfen Sie das Ausgabefenster auf Details.
es: Generando nuevo proyecto SQL desde {0}... Compruebe la ventana de resultados para obtener más detalles.
it: Generazione del nuovo progetto SQL da {0}... Eseguire il checkouot della finestra di output per i dettagli.
ja: {0} から新しい SQL プロジェクトを生成しています... 詳細については、出力ウィンドウを確認してください。
ko: {0}에서 새 SQL 프로젝트를 생성하는 중... 자세한 내용은 출력 창을 확인하세요.
pt_br: Gerando novo projeto SQL a partir de {0}... Verifique a janela de saída para obter detalhes.
ru: Создание нового проекта SQL из {0}... См. дополнительную информацию в окне вывода.
zh_hans: 正在从 {0} 生成新的 SQL 项目... 检查输出窗口以了解详细信息。
zh_hant: 正在從 {0} 產生新的 SQL 專案...如需詳細資料，請查看輸出視窗。

source: hr
de: Std.
es: h
fr: h
it: ora
ja: 時間
ko: 시간
pt_br: h
ru: ч
zh_hans: 小时
zh_hant: 小時

source: Image tag
it: Tag dell'immagine
pt_br: Marca de imagem

source: Import Elements
de: Elemente importieren
es: Importar elementos
it: Importa elementi
ja: 要素のインポート
ko: 요소 가져오기
pt_br: Importar Elementos
ru: Импорт элементов
zh_hans: 导入元素
zh_hant: 匯入元素

source: Include
de: Einschließen
es: Incluir
it: Includere
ja: 包含
ko: 포함
pt_br: Incluir
ru: Включить
zh_hant: 包括

source: Include permissions in project
it: Includere autorizzazioni nel progetto
pt_br: Incluir permissões no projeto

# includePermissionsLabel
source: Include permissions
it: Includi autorizzazioni
pt_br: Incluir permissões

source: Install globally
de: Global installieren
es: Instalar globalmente
it: Installa a livello globale
ja: グローバルにインストールする
ko: 전역으로 설치
pt_br: Instale globalmente
ru: Установить глобально
zh_hans: 全局安装
zh_hant: 全域安裝

# invalidDataSchemaProvider
source: Invalid DSP in .sqlproj file
de: Ungültiger DSP in der SQLPROJ-Datei
es: Hay un DSP no válido en el archivo .sqlproj.
fr: DSP non valide dans le fichier .sqlproj
it: DSP non valido nel file con estensione .sqlproj
ja: .sqlproj ファイルにある無効な DSP
ko: .sqlproj 파일의 DSP가 잘못되었습니다.
pt_br: DSP inválido no arquivo. sqlproj
ru: Недопустимый DSP в файле SQLPROJ
zh_hans: .Sqlproj 文件中的 DSP 无效
zh_hant: .sqlproj 檔中的 DSP 無效

# invalidDatabaseReference
source: Invalid database reference in .sqlproj file
de: Ungültiger Datenbankverweis in der SQLPROJ-Datei
es: Hay una referencia de base de datos no válida en el archivo .sqlproj.
fr: Référence de base de données non valide dans le fichier .sqlproj
it: Riferimento al database non valido nel file con estensione .sqlproj
ja: .sqlproj ファイルでの無効なデータベース参照
ko: .sqlproj 파일의 데이터베이스 참조가 잘못되었습니다.
pt_br: Referência de banco de dados inválida no arquivo .sqlproj
ru: Недопустимая ссылка на базу данных в файле SQLPROJ
zh_hans: .Sqlproj 文件中的数据库引用无效
zh_hant: .sqlproj 檔中的資料庫參考無效

# invalidGuid
source: Specified GUID is invalid: {0}
de: Die angegebene GUID ist ungültig: {0}
es: El GUID especificado no es válido: {0}
fr: Le GUID spécifié n’est pas valide : {0}
it: Il GUID specificato non è valido: {0}
ja: 指定された GUID は無効です: {0}
ko: 지정한 GUID가 잘못됨: {0}
pt_br: O GUID especificado é inválido: {0}
ru: Указан недопустимый GUID: {0}
zh_hans: 指定的 GUID 无效: {0}
zh_hant: 指定的 GUID 無效: {0}

# invalidInput
source: Invalid input: {0}
de: Ungültige Eingabe: {0}
es: Entrada no válida: "{0}"
fr: Entrée non valide : {0}
it: L'input non è valido: {0}
ja: 無効な入力: {0}
ko: 잘못된 입력: {0}
pt_br: Entrada inválida: {0}
ru: Недопустимые входные данные: {0}
zh_hans: 无效的输入: {0}
zh_hant: 輸入無效: {0}

# invalidProjectReload
source: Cannot access provided database project. Only valid, open database projects can be reloaded.
de: Auf das angegebene Datenbankprojekt kann nicht zugegriffen werden. Nur gültige, geöffnete Datenbankprojekte können neu geladen werden.
es: No se puede acceder al proyecto de base de datos proporcionado. Solo se pueden volver a cargar los proyectos de base de datos abiertos válidos.
fr: Impossible d'accéder au projet de base de données fourni. Seuls les projets de base de données valides et ouverts peuvent être rechargés.
it: Impossibile accedere al progetto di database specificato. È possibile ricaricare solo progetti di database aperti validi.
ja: 提供されたデータベース プロジェクトにアクセスできません。再読み込みできるのは、有効なオープン データベース プロジェクトのみです。
ko: 제공된 데이터베이스 프로젝트에 액세스할 수 없습니다. 유효한 개방형 데이터베이스 프로젝트만 다시 로드할 수 있습니다.
pt_br: Não é possível acessar o projeto de banco de dados fornecido. Apenas os projetos de banco de dados abertos válidos podem ser recarregados.
ru: Не удается получить доступ к указанному проекту базы данных. Перезагрузить можно только допустимые открытые проекты баз данных.
zh_hans: 无法访问提供的数据库项目。只有有效的开放式数据库项目才可以重新加载。
zh_hant: 無法存取提供的資料庫專案。只能重新載入有效、開啟的資料庫專案。
