Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-migration.*.xlf
Languages: it

# sql.migration.network.share.help.text
source: Provide the network share location where the backups are stored, and the user credentials used to access the share.
it: Specificare il percorso della condivisione di rete in cui sono archiviati i backup e le credenziali utente utilizzate per accedere alla condivisione.

# sql.migration.network.share.location.info
source: Network share path for your database backups. The migration process will automatically retrieve valid backup files from this network share.
it: Percorso della condivisione di rete per i backup del database. Il processo di migrazione recupererà automaticamente i file di backup validi da questa condivisione di rete.

# sql.migration.network.share.location.label
source: Network share location where the backups are stored
it: Percorso di condivisione di rete in cui sono archiviati i backup

# sql.migration.network.share.password.placeholder
source: Enter password.
it: Immetti password.

# sql.migration.network.share.path
source: Network share path
it: Percorso condivisione di rete

# sql.migration.network.share.storage.table.help
source: Enter target database name and network share path information for the selected source databases.
it: Immettere il nome del database di destinazione e le informazioni sul percorso della condivisione di rete per i database di origine selezionati.

# sql.migration.network.share.windows.user.info
source: Windows user account with read access to the network share location.
it: Account utente di Windows con accesso in lettura al percorso di condivisione di rete.

# sql.migration.network.share.windows.user.label
source: Windows user account with read access to the network share location
it: Account utente di Windows con accesso in lettura al percorso di condivisione di rete

# sql.migration.new.resource.group
source: (new) {0}
it: (nuovo) {0}

# sql.migration.newSupportRequest
source: New support request
it: Nuova richiesta di supporto

# sql.migration.no.blobContainers.found
source: No blob containers found.
it: Nessun contenitore BLOB trovato.

# sql.migration.no.blobFiles.found
source: No blob files found.
it: Nessun file BLOB trovato.

# sql.migration.no.fileShares.found
source: No file shares found.
it: Non sono state trovate condivisioni file.

# sql.migration.no.issues.mi
source: No issues found for migrating to Azure SQL Managed Instance.
it: Non sono stati rilevati problemi per la migrazione a Istanza gestita di SQL di Azure.

# sql.migration.no.issues.sqldb
source: No issues found for migrating to Azure SQL Database.
it: Non sono stati rilevati problemi per la migrazione a database SQL di Azure.

# sql.migration.no.issues.vm
source: No issues found for migrating to SQL Server on Azure Virtual Machine.
it: Nono sono stati riscontrati problemi per la migrazione a SQL Server per la macchina virtuale di Azure.

# sql.migration.no.location.found
source: No locations found.
it: Nessuna località trovata.

# sql.migration.no.managedInstance.found
source: No managed instances found.
it: Non sono state trovate istanze gestite.

# sql.migration.no.pending.backups
source: No pending backups. Click refresh to check current status.
it: Nessun backup in sospeso. Fare clic su Aggiorna per controllare lo stato corrente.

# sql.migration.no.results
source: Assessment results are unavailable.
it: I risultati della valutazione non sono disponibili.

# sql.migration.no.sqldatabase.found
source: No Azure SQL databases found.
it: Non sono stati trovati database SQL di Azure.

# sql.migration.no.sqldatabaseserver.found
source: No Azure SQL database servers found.
it: Non sono stati trovati server di database SQL di Azure.

# sql.migration.no.storageAccount.found
source: No storage accounts found.
it: Non sono stati trovati account di archiviazione.

# sql.migration.no.subscription.found
source: No subscriptions found.
it: Non sono state trovate sottoscrizioni.

# sql.migration.no.virtualMachine.found
source: No virtual machines found.
it: Non sono state trovate macchine virtuali.

# sql.migration.notebook.open.error
source: Failed to open the migration notebook.
it: Non è stato possibile aprire il notebook di migrazione.

# sql.migration.number.logins.migrating
source: {0}/{1} migrating logins displayed
it: {0}/{1} la migrazione degli account di accesso è visualizzata

# sql.migration.object.details
source: Object details
it: Dettagli dell'oggetto

# sql.migration.open.migration.destails.error
source: Error opening migration details dialog
it: Errore durante l'apertura della finestra di dialogo dei dettagli della migrazione

# sql.migration.open.migration.service.error
source: Error opening migration service dialog
it: Errore durante l'apertura della finestra di dialogo del servizio di migrazione

# sql.migration.open.migration.target.error
source: Error opening migration target
it: Errore durante l'apertura della destinazione di migrazione

# sql.migration.option
source: Download and install integration runtime
it: Scaricare e installare il runtime di integrazione

# sql.migration.parallel.copy.type.dynamic
source: Dynamic range
it: Intervallo dinamico

# sql.migration.parallel.copy.type.none
source: None
it: Nessuna

# sql.migration.parallel.copy.type.physical
source: Physical partitions
it: Partizioni fisiche

# sql.migration.password.label
source: Target password
it: Password di destinazione

# sql.migration.password.placeholder
source: Enter the target password
it: Immettere la password di destinazione

# sql.migration.path.user.account
source: User account
it: Account utente

# sql.migration.pre.req.1
source: An Azure account (not required for assessment or SKU recommendation functionality)
it: U account Azure (non necessario per la valutazione o la funzionalità di raccomandazione SKU)

# sql.migration.pre.req.2
source: A source SQL Server database(s) running on on-premises, or on SQL Server on Azure Virtual Machine or any virtual machine running in the cloud (private, public).
it: Un database di SQL Server di origine in esecuzione in locale o in SQL Server su macchina virtuale di Azure o su qualsiasi macchina virtuale in esecuzione nel cloud (privato, pubblico).

# sql.migration.pre.req.3
source: An Azure SQL Managed Instance, SQL Server on Azure Virtual Machine, or Azure SQL Database to migrate your database(s) to.
it: Un'Istanza gestita di SQL di Azure, SQL Server per la macchina virtuale di Azure o database SQL di Azure in cui eseguire la migrazione dei database.

# sql.migration.pre.req.4
source: Your database backup location details, either a network file share or an Azure Blob Storage container (not required for Azure SQL Database targets).
it: Dettagli del percorso di backup del database, una condivisione file di rete o un contenitore di Archiviazione BLOB di Azure (non necessario per destinazioni database SQL di Azure).

# sql.migration.pre.req.title
source: Things you need before starting your Azure SQL migration:
it: Elementi necessari prima dell'avvio della migrazione di Azure SQL:

# sql.migration.provide.unique.containers
source: Provide a unique container for each target database. Databases affected:
it: Specificare un contenitore univoco per ogni database di destinazione. Database interessati:

# sql.migration.quick.pick.placeholder
source: Select the operation you'd like to perform.
it: Selezionare l'operazione che si desidera eseguire.

# sql.migration.recommendation
source: Recommendation
it: Raccomandazione

# sql.migration.refresh
source: Refresh
it: Aggiorna

# sql.migration.refresh.assessment.button.label
source: Refresh assessment
it: Aggiornare valutazione

# sql.migration.refresh.key1
source: Refresh key 1
it: Aggiorna chiave 1

# sql.migration.refresh.key2
source: Refresh key 2
it: Aggiorna chiave 2

# sql.migration.refresh.migrations.error.label
source: An error occurred while refreshing the migrations list. Please check your linked Azure connection and click refresh to try again.
it: Si è verificato un errore durante l'aggiornamento dell'elenco delle migrazioni. Controlla la tua connessione di Azure collegata e fai clic su Aggiorna per riprovare.

# sql.migration.refresh.migrations.error.title
source: An error has occured while refreshing the migrations list.
it: Si è verificato un errore durante l'aggiornamento dell'elenco delle migrazioni.

# sql.migration.resource.group.description
source: A resource group is a container that holds related resources for an Azure solution.
it: Un gruppo di risorse è un contenitore che include le risorse correlate per una soluzione di Azure.

# sql.migration.resource.group.not.found
source: No resource groups found.
it: Non sono stati trovati gruppi di risorse.

# sql.migration.resourceGroups
source: Resource group
it: Gruppo di risorse

# sql.migration.resume.session
source: Resume previously saved session
it: Riprendi sessione salvata in precedenza

# sql.migration.resume.title
source: Run migration workflow again
it: Eseguire di nuovo il flusso di lavoro di migrazione

# sql.migration.retry.migration
source: Retry migration
it: Ripeti migrazione

# sql.migration.retry.migration.error
source: An error occurred while retrying the migration.
it: Si è verificato un errore durante il riavvio della migrazione.

# sql.migration.rg.created
source: Resource group created
it: Il gruppo di risorse è stato creato

# sql.migration.run.validation
source: Run validation
it: Esegui convalida

# sql.migration.save.assessment.report
source: Save assessment report
it: Salvare report di valutazione

# sql.migration.save.assessment.report.success
source: Successfully saved assessment report to {0}.
it: Il report di valutazione è stato salvato in {0}.

# sql.migration.save.close
source: Save and close
it: Salva e chiudi

# sql.migration.save.close.popup
source: Configuration saved. Performance data collection will remain running in the background. You can stop the collection when you want to.
it: Configurazione salvata. La raccolta dei dati sulle prestazioni rimarrà in esecuzione in background. È possibile arrestare la raccolta quando si vuole.

# sql.migration.save.recommendation.report
source: Save recommendation report
it: Salvare report delle raccomandazioni

# sql.migration.save.recommendation.report.success
source: Successfully saved recommendation report to {0}.
it: Il report delle raccomandazioni è stato salvato in {0}.

# sql.migration.saved.assessment.cancel
source: Cancel
it: Annulla

# sql.migration.saved.assessment.next
source: Next
it: Avanti

# sql.migration.saved.assessment.result
source: Saved session
it: Sessione salvata

# sql.migration.search
source: Search
it: Cercare

# sql.migration.search.for.migration
source: Filter migration results
it: Filtra i risultati della migrazione

# sql.migration.select.azure.mi
source: Select your target Azure subscription and your target Azure SQL Managed Instance.
it: Selezionare la sottoscrizione di Azure di destinazione e l'Istanza gestita di SQL di Azure di destinazione.

# sql.migration.select.azure.vm
source: Select your target Azure Subscription and your target SQL Server on Azure Virtual Machine for your target.
it: Selezionare la sottoscrizione Azure di destinazione e l'SQL Server di destinazione sulla macchina virtuale di Azure di destinazione.

# sql.migration.select.database.to.continue
source: Please select 1 or more logins for migration
it: Selezionare 1 o più account di accesso per la migrazione

# sql.migration.select.database.to.migrate
source: Select the databases to migrate.
it: Selezionare i database di cui eseguire la migrazione.

# sql.migration.select.prompt
source: Click on SQL Server instance or any of the databases on the left to view its details.
it: Fare clic sull'istanza di SQL Server o su uno dei database a sinistra per visualizzarne i dettagli.

# sql.migration.select.service.apply.label
source: Apply
it: Applica

# sql.migration.select.service.delete.label
source: Clear
it: Cancella

# sql.migration.select.service.heading
source: Filter the migration list by Database Migration Service
it: Filtrare l'elenco di migrazione in base al Servizio Migrazione del database

# sql.migration.select.service.prompt
source: Select a Database Migration Service
it: Selezionare un Servizio Migrazione del database

# sql.migration.select.service.select.a.
source: Sign into Azure and select an account
it: Accedere ad Azure e selezionare un account

# sql.migration.select.service.select.a.location
source: Select a location
it: Selezionare una posizione

# sql.migration.select.service.select.a.resource.group
source: Select a resource group
it: Selezionare un gruppo di risorse

# sql.migration.select.service.select.a.service
source: Select a Database Migration Service
it: Selezionare un Servizio Migrazione del database

# sql.migration.select.service.select.a.subscription
source: Select a subscription
it: Selezionare un abbonamento

# sql.migration.select.service.select.a.tenant
source: Select a tenant
it: Selezionare un tenant

# sql.migration.select.service.select.account.error
source: An error occurred while loading available Azure accounts.
it: Si è verificato un errore durante il caricamento degli account di Azure disponibili.

# sql.migration.select.service.select.location.error
source: An error occurred while loading locations. Please check your Azure connection and try again.
it: Si è verificato un errore durante il caricamento delle posizioni. Controllare la connessione di Azure e riprovare.

# sql.migration.select.service.select.migration.target
source: Select a target server.
it: Selezionare un server di destinazione.

# sql.migration.select.service.select.resource.group.error
source: An error occurred while loading available resource groups. Please check your Azure connection and try again.
it: Si è verificato un errore durante il caricamento dei gruppi di risorse disponibili. Controllare la connessione di Azure e riprovare.

# sql.migration.select.service.select.service.error
source: An error occurred while loading available database migration services. Please check your Azure connection and try again.
it: Si è verificato un errore durante il caricamento dei servizi Migrazione del database disponibili. Controllare la connessione di Azure e riprovare.

# sql.migration.select.service.select.subscription.error
source: An error occurred while loading account subscriptions. Please check your Azure connection and try again.
it: Si è verificato un errore durante il caricamento delle sottoscrizioni account. Controllare la connessione di Azure e riprovare.

# sql.migration.select.service.select.target.type.
source: Select target Azure SQL Type
it: Selezionare il tipo di Azure SQL di destinazione

# sql.migration.select.service.select.tenant.error
source: An error occurred while loading available Azure account tenants.
it: Si è verificato un errore durante il caricamento dei tenant degli account di Azure disponibili.

# sql.migration.select.service.title
source: Select Database Migration Service
it: Seleziona Servizio Migrazione del database

# sql.migration.select.target.to.continue
source: To continue, select a target.
it: Per continuare, selezionare una destinazione.

# sql.migration.service.account.info.text
source: Ensure that the service account running the source SQL Server instance has read privileges on the network share.
it: Assicurarsi che l'account del servizio che esegue l'istanza di SQL Server di origine abbia i privilegi di lettura nella condivisione di rete.

# sql.migration.service.container.container.description1
source: Azure Database Migration Service leverages Azure Data Factory's self-hosted integration runtime to upload backups from on-premises network file share to Azure.
it: Il Servizio Migrazione del database di Azure sfrutta il runtime di integrazione self-hosted di Azure Data Factory per caricare i backup dalla condivisione file di rete locale in Azure.

# sql.migration.service.container.container.description2
source: Follow the instructions below to setup self-hosted integration runtime.
it: Seguire le istruzioni seguenti per configurare il runtime di integrazione self-hosted.

# sql.migration.service.container.heading
source: Setup integration runtime
it: Configurare il runtime di integrazione

# sql.migration.service.container.loading.help
source: Loading Migration Services
it: Caricamento dei servizi di migrazione

# sql.migration.service.details.authKeys.label
source: Authentication keys
it: Chiavi di autenticazione

# sql.migration.service.details.authKeys.title
source: Authentication keys used to connect to the self-hosted integration runtime node
it: Chiavi di autenticazione usate per connettersi al nodo del runtime di integrazione self-hosted

# sql.migration.service.details.button.label
source: Close
it: Chiudi

# sql.migration.service.details.dialog.title
source: Azure Database Migration Service
it: Servizio Migrazione del database di Azure

# sql.migration.service.details.ir.label
source: Self-hosted integration runtime node
it: Nodo del runtime di integrazione self-hosted

# sql.migration.service.details.status.unavailable
source: -- unavailable --
it: -- non disponibile --

# sql.migration.service.header
source: Azure Database Migration Service "{0}" details:`
it: Dettagli sul Servizio Migrazione del database di Azure "{0}":`

# sql.migration.service.not.found
source: No Migration Services found. To continue, create a new one.
it: Non sono stati trovati Servizi Migrazione. Per continuare, crearne uno nuovo.

# sql.migration.service.not.ready
source: Azure Database Migration Service is not registered. Azure Database Migration Service '{0}' needs to be registered with self-hosted integration runtime on any node.
it: Il Servizio Migrazione del database di Azure non è registrato. Il Servizio Migrazione del database di Azure '{0}' deve essere registrato con il runtime di integrazione self-hosted su un nodo.

# sql.migration.service.prompt
source: {0} (change)
it: {0} (modifica)

# sql.migration.service.ready
source: Azure Database Migration Service '{0}' is connected to self-hosted integration runtime running on the node - {1}
it: Il Servizio Migrazione del database di Azure '{0}' è connesso al runtime di integrazione self-hosted in esecuzione sul nodo - {1}

# sql.migration.service.selection.location.msg
source: Please select the location of your database backup files before continuing.
it: Selezionare il percorso dei file di backup del database prima di continuare.

# sql.migration.service.status.refresh.error
source: An error occurred while refreshing the migration service creation status.
it: Si è verificato un errore durante l'aggiornamento dello stato di creazione del servizio di migrazione.

# sql.migration.services.container.description
source: Enter the information below to add a new Azure Database Migration Service.
it: Immettere le informazioni di seguito per aggiungere un nuovo Servizio Migrazione del database di Azure.

# sql.migration.services.dialog.title
source: Create Azure Database Migration Service
it: Creare Servizio Migrazione del database di Azure

# sql.migration.services.location
source: Azure region for your Azure Database Migration Service. This should be the same region as your target Azure SQL.
it: Area di Azure per il Servizio Migrazione del database di Azure. Deve essere la stessa area dell'Azure SQL di destinazione.

# sql.migration.services.name
source: Azure Database Migration Service name.
it: Nome del Servizio Migrazione del database di Azure.

# sql.migration.services.resource.group
source: Resource group for your Azure Database Migration Service.
it: Gruppo di risorse per il Servizio Migrazione del database di Azure.

# sql.migration.services.subscription
source: Subscription name for your Azure Database Migration Service.
it: Gruppo di risorse per il Servizio Migrazione del database di Azure.

# sql.migration.services.target
source: Azure SQL target selected as default.
it: Destinazione Azure SQL selezionata come predefinita.

# sql.migration.shir
source: Self-hosted integration runtime node
it: Nodo del runtime di integrazione self-hosted

# sql.migration.show.status
source: Show status
it: Mostrare stato

# sql.migration.size
source: Size (MB)
it: Dimensioni (MB)

# sql.migration.size.column.header
source: Size
it: Dimensioni

# sql.migration.sku.available.recommendations.many
source: {0} recommendations available
it: {0} raccomandazioni disponibili

# sql.migration.sku.available.recommendations.one
source: {0} recommendation available
it: {0} raccomandazione disponibile

# sql.migration.sku.azureConfiguration
source: Azure configuration
it: Configurazione di Azure

# sql.migration.sku.azureConfiguration.gen5
source: Gen5
it: Generazione5

# sql.migration.sku.azureConfiguration.generalPurpose
source: General purpose
it: Utilizzo generico

# sql.migration.sku.azureConfiguration.premiumSeries
source: Premium-series
it: Serie Premium

# sql.migration.sku.azureConfiguration.premiumSeriesMemoryOptimized
source: Memory optimized premium-series
it: Serie Premium con ottimizzazione per la memoria

# sql.migration.sku.azureConfiguration.vmPreview
source: Data: {0}, Log: {1}, tempdb: {2}
it: Dati: {0}, Log: {1}, tempdb: {2}

# sql.migration.sku.azureRecommendation.chooseMethod.instructions
source: Choose how you want to provide performance data
it: Scegliere come fornire i dati delle prestazioni

# sql.migration.sku.azureRecommendation.collectData.method
source: Collect performance data now
it: Raccogli ora i dati delle prestazioni

# sql.migration.sku.azureRecommendation.collectDataSelectFolder.instructions
source: Select a folder on your local drive where performance data will be saved
it: Selezionare una cartella nell'unità locale in cui verranno salvati i dati sulle prestazioni

# sql.migration.sku.azureRecommendation.description
source: Azure recommendation requires performance data of SQL server instance to provide target recommendation. Enable performance data collection to receive the target recommendation for the databases you want to migrate. The longer this will be enabled the better the recommendation. You can disable performance data collection at any time.
it: La raccomandazione di Azure richiede i dati delle prestazioni dell'istanza di SQL Server per fornire la raccomandazione di destinazione. Abilitare la raccolta dati sulle prestazioni per ricevere la raccomandazione di destinazione per i database di cui eseguire la migrazione. Più a lungo questa opzione verrà abilitata, migliore sarà la raccomandazione. È possibile disabilitare la raccolta dei dati delle prestazioni in qualsiasi momento.

# sql.migration.sku.azureRecommendation.description2
source: You can also choose to select this data from an existing folder, if you have already collected it previously.
it: È anche possibile scegliere di selezionare questi dati da una cartella esistente, se sono già stati raccolti in precedenza.

# sql.migration.sku.azureRecommendation.openExisting.method
source: I already have the performance data
it: I dati sulle prestazioni sono già disponibili

# sql.migration.sku.azureRecommendation.openExistingSelectFolder.instructions
source: Select a folder on your local drive where previously collected performance data was saved
it: Seleziona una cartella nell'unità locale in cui sono stati salvati i dati sulle prestazioni raccolti in precedenza

# sql.migration.sku.azureRecommendation.start
source: Start
it: Avvia

# sql.migration.sku.azureRecommendation.start.popup
source: Starting performance data collection...
it: Avvio della raccolta dei dati delle prestazioni...

# sql.migration.sku.azureRecommendation.status.autoRefreshTimer
source: Initial recommendations will automatically refresh in approximately {0} minute(s).
it: Le raccomandazioni iniziali verranno aggiornate automaticamente tra circa {0} minuto/i.
