Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# sqlDatabaseProjects.addExistingItem
source: Add Existing Item...
de: Vorhandenes Element hinzufügen...
es: Agregar elemento existente...
it: Aggiungi _elemento esistente...
ja: 既存項目の追加...
ko: 기존 항목 추가...
pt_br: Adicionar Item Existente...
ru: Добавить существующий элемент...
zh_hant: 新增現有項目(_I)...

# sqlDatabaseProjects.addSqlCmdVariable
source: Add SQLCMD Variable
it: Aggiungere variabile SQLCMD
pt_br: Adicionar Variável SQLCMD

# sqlDatabaseProjects.autorestSqlVersion
source: Which version of Autorest.Sql to use from NPM. Latest will be used if not set.
de: Welche Version von Autorest.Sql aus NPM verwendet werden soll. Es wird die Neueste verwendet, wenn nicht festgelegt.
es: Qué versión de Autorest.Sql se va a usar desde NPM. Si no se establece, se usará la versión más reciente.
fr: Version d’autorest. SQL à utiliser à partir de NPM. La dernière version sera utilisée si elle n’est pas définie.
it: Versione di autorest. Sql da usare da NPM. Se non è impostata, verrà usata la versione più recente.
ja: NPM から使用する Autorest.Sql のバージョン。設定されていない場合は、最新版が使用されます。
ko: NPM에서 사용할 Autorest.Sql 버전입니다. 설정하지 않으면 최신이 사용됩니다.
pt_br: Qual versão do Autorest.Sql usar do NPM. A mais recente será usada se não estiver definida.
ru: Какую версию Autorest.Sql использовать из NPM. Если значение не задано, будет использоваться последняя версия.
zh_hans: 要从 NPM 使用哪个版本的 Autorest.Sql。如果未设置，则将使用最新版本。
zh_hant: 要從 NPM 使用的 Autorest.Sql 版本。如果未設定，則會使用最新的版本。

# sqlDatabaseProjects.build
source: Build
es: Compilar
ja: ビルド
ko: 빌드
pt_br: Compilar
ru: Сборка
zh_hans: 生成
zh_hant: 組建

# sqlDatabaseProjects.changeTargetPlatform
source: Change Target Platform
de: Zielplattform ändern
es: Cambiar plataforma de destino
fr: Modifier la plateforme cible
it: Modificare la piattaforma di destinazione
ja: ターゲット プラットフォームの変更
ko: 대상 플랫폼 변경
pt_br: Alterar Plataforma de Destino
ru: Изменить целевую платформу
zh_hans: 更新目标平台
zh_hant: 變更目標平台

# sqlDatabaseProjects.close
source: Close Database Project
de: Datenbankprojekt schließen
es: Cerrar proyecto de base de datos
fr: Fermer le projet de base de données
it: Chiudere il progetto di database
ja: データベース プロジェクトを閉じる
ko: 데이터베이스 프로젝트 닫기
pt_br: Fechar Projeto de Banco de Dados
ru: Закрыть проект базы данных
zh_hans: 关闭数据库项目
zh_hant: 關閉資料庫專案

# sqlDatabaseProjects.collapseProjectNodes
source: Whether project nodes start collapsed
de: Gibt an, ob Projektknoten zu Beginn reduziert sind
es: Si los nodos del proyecto se inician contraídos
it: Indica se i nodi del progetto iniziano a essere compressi
ja: プロジェクト ノードが折りたたまれた状態で開始するかどうか
ko: 프로젝트 노드를 축소할지 여부
pt_br: Se os nós do projeto começam recolhidos
ru: Будут ли узлы проекта свернуты
zh_hant: 專案節點是否開始摺疊

# sqlDatabaseProjects.convertToSdkStyleProject
source: Convert to SDK-style project
de: In SDK-Style-Projekt konvertieren
es: Convertir a proyecto de estilo SDK
it: Convertire in progetto di tipo SDK
ja: SDK スタイル プロジェクトに変換する
ko: SDK 스타일 프로젝트로 변환
pt_br: Converter em projeto no estilo SDK
ru: Преобразовать в проект в стиле SDK
zh_hant: 轉換成 SDK 樣式專案

# sqlDatabaseProjects.createProjectFromDatabase
source: Create Project From Database
de: Projekt aus Datenbank erstellen
es: Crear proyecto a partir de base de datos
fr: Créer un projet à partir de la base de données
it: Creare il progetto dal database
ja: データベースからのプロジェクトの作成
ko: 데이터베이스에서 프로젝트 만들기
pt_br: Criar projeto a partir do banco de dados
ru: Создать проект из базы данных
zh_hans: 根据数据库创建项目
zh_hant: 從資料庫建立專案

# sqlDatabaseProjects.delete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Deletar
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# sqlDatabaseProjects.description
source: Design and publish SQL database schemas
de: Entwerfen und Veröffentlichen von SQL-Datenbankschemas
es: Diseñe y publique esquemas de base de datos SQL.
fr: Concevoir et publier des schémas de base de données SQL
it: Progettare e pubblicare schemi di database SQL
ja: SQL データベース スキーマをデザインして発行する
ko: SQL 데이터베이스 스키마 디자인 및 게시
pt_br: Criar e publicar esquemas de banco de dados SQL
ru: Разработка и публикация схем базы данных SQL
zh_hans: 设计和发布 SQL 数据库架构
zh_hant: 設計及發佈 SQL 資料庫結構描述

# sqlDatabaseProjects.displayName
source: Database Projects
de: Datenbankprojekte
es: Proyectos de base de datos
fr: Projets de base de données
it: Progetti di database
ja: データベース プロジェクト
ko: 데이터베이스 프로젝트
pt_br: Projetos de Banco de Dados
ru: Проекты баз данных
zh_hans: 数据库项目
zh_hant: 資料庫專案

# sqlDatabaseProjects.dotnetInstallLocation
source: Full path to .NET SDK on the machine. For example, if dotnet.exe is located at C:\folder1\dotnet\dotnet.exe, set the path for this setting to C:\folder1\dotnet
it: Percorso completo di .NET SDK nel computer. Ad esempio, se dotnet.exe si trova in C:\folder1\dotnet\dotnet.exe, impostare il percorso di questa impostazione su C:\folder1\dotnet
pt_br: Caminho completo para o SDK do .NET no computador. Por exemplo, se o dotnet.exe estiver localizado em C:\folder1\dotnet\dotnet.exe, defina o caminho para essa configuração como C:\folder1\dotnet

# sqlDatabaseProjects.edit
source: Edit
it: Modifica
pt_br: Editar

# sqlDatabaseProjects.editProjectFile
source: Edit .sqlproj File
de: .sqlproj-Datei bearbeiten
es: Editar archivo. sqlproj
fr: Modifier le fichier .sqlproj
ja: .sqlproj ファイルの編集
ko: .sqlproj 파일 편집
pt_br: Editar Arquivo .sqlproj
ru: Изменить файл .sqlproj
zh_hans: 编辑 .sqlproj 文件
zh_hant: 編輯 .sqlproj 檔

# sqlDatabaseProjects.enablePreviewFeatures
source: Enable preview SQL Database Projects features
it: Abilita funzionalità di anteprima di progetti di database SQL
pt_br: Habilitar recursos de projetos de Banco de Dados SQL do Microsoft Azure visualização

# sqlDatabaseProjects.exclude
source: Exclude from project
de: Aus Projekt ausschließen
es: Excluir del proyecto
fr: Exclure du projet
it: Escludere dal progetto
ja: プロジェクトから除外する
ko: 프로젝트에서 제외
pt_br: Excluir do projeto
ru: Исключить из проекта
zh_hans: 从项目中排除
zh_hant: 從專案中排除

# sqlDatabaseProjects.generateProjectFromOpenApiSpec
source: Generate SQL Project from OpenAPI/Swagger spec (Preview)
it: Generare un progetto SQL da specifiche OpenAPI/Swagger (Anteprima)
pt_br: Gerar Projeto SQL a partir da especificação OpenAPI/Swagger (Versão prévia)

# sqlDatabaseProjects.microsoftBuildSqlVersion
source: Which version of Microsoft.Build.Sql SDK to use for building legacy sql projects. Example: 0.1.7-preview
it: Versione di Microsoft.Build.Sql SDK da usare per la compilazione di progetti SQL legacy. Esempio: 0.1.7-preview
pt_br: Qual versão do Microsoft.Build.Sql SDK usar para criar projetos SQL herdados. Exemplo: 0.1.7-visualização

# sqlDatabaseProjects.netCoreDoNotAsk
source: Whether to prompt the user to install .NET SDK when not detected.
it: Indica se richiedere all'utente di installare SDK .NET quando non viene rilevato.
pt_br: Se o usuário deve solicitar a instalação do .NET SDK quando não for detectado.

# sqlDatabaseProjects.new
source: New Database Project
de: Neues Datenbankprojekt
es: Nuevo proyecto de base de datos
fr: Nouveau projet de base de données
it: Nuovo progetto di database
ja: 新しいデータベース プロジェクト
ko: 새 데이터베이스 프로젝트
pt_br: Novo Projeto de Banco de Dados
ru: Новый проект базы данных
zh_hans: 新建数据库项目
zh_hant: 新的資料庫專案

# sqlDatabaseProjects.newExternalStreamingJob
source: Add External Streaming Job
de: Externen Streamingauftrag hinzufügen
es: Agregar trabajo de streaming externo
fr: Ajouter un travail de diffusion en continu externe
it: Aggiungi processo di streaming esterno
ja: 外部ストリーミング ジョブの追加
ko: 외부 스트리밍 작업 추가
pt_br: Adicionar Trabalho de Streaming Externo
ru: Добавить задание внешней потоковой передачи
zh_hans: 添加外部流式处理作业
zh_hant: 新增外部資料流作業

# sqlDatabaseProjects.newFolder
source: Add Folder
de: Ordner hinzufügen
es: Agregar carpeta
fr: Ajouter un dossier
it: Aggiungi cartella
ja: フォルダーの追加
ko: 폴더 추가
pt_br: Adicionar pasta
ru: Добавить папку
zh_hans: 添加文件夹
zh_hant: 新增資料夾

# sqlDatabaseProjects.newItem
source: Add Item...
de: Element hinzufügen...
es: Agregar elemento...
fr: Ajouter un élément...
it: Aggiungi elemento...
ja: 項目の追加...
ko: 항목 추가...
pt_br: Adicionar Trabalho de Streaming Externo...
ru: Добавить элемент...
zh_hans: 添加项...
zh_hant: 新增項目...

# sqlDatabaseProjects.newPostDeploymentScript
source: Add Post-Deployment Script
de: Skript nach der Bereitstellung hinzufügen
es: Agregar script posterior a la implementación
fr: Ajouter un script post-déploiement
it: Aggiungi script post-distribuzione
ja: 配置後スクリプトの追加
ko: 배포 후 스크립트 추가
pt_br: Adicionar Script pós-implantação
ru: Добавить сценарий, выполняемый после развертывания
zh_hans: 添加后期部署脚本
zh_hant: 新增部署後指令碼

# sqlDatabaseProjects.newPreDeploymentScript
source: Add Pre-Deployment Script
de: Skript vor der Bereitstellung hinzufügen
es: Agregar script anterior a la implementación
fr: Ajouter un Script de pré-déploiement
it: Aggiungere script di pre-distribuzione
ja: 配置前スクリプトの追加
ko: 배포 전 스크립트 추가
pt_br: Adicionar script de pré-implantação
ru: Добавить сценарий, выполняемый перед развертыванием
zh_hans: 添加预先部署脚本
zh_hant: 新增預先部署指令碼

# sqlDatabaseProjects.newScript
source: Add Script
de: Skript hinzufügen
es: Agregar script
fr: Ajouter un script
it: Aggiungi script
ja: スクリプトの追加
ko: 스크립트 추가
pt_br: Adicionar Script
ru: Добавить сценарий
zh_hans: 添加脚本
zh_hant: 新增指令碼

# sqlDatabaseProjects.newStoredProcedure
source: Add Stored Procedure
de: Gespeicherte Prozedur hinzufügen
es: Agregar procedimiento almacenado
fr: Ajouter une procédure stockée
it: Aggiungere stored procedure
ja: ストアド プロシージャの追加
ko: 저장 프로시저 추가
pt_br: Adicionar Procedimento Armazenado
ru: Добавить хранимую процедуру
zh_hans: 添加存储过程
zh_hant: 新增預存程序

# sqlDatabaseProjects.newTable
source: Add Table
de: Tabelle hinzufügen
es: Agregar tabla
fr: Ajouter une table
it: Aggiungi tabella
ja: テーブルの追加
ko: 테이블 추가
pt_br: Adicionar Tabela
ru: Добавить таблицу
zh_hans: 添加表
zh_hant: 新增資料表

# sqlDatabaseProjects.newView
source: Add View
de: Ansicht hinzufügen
es: Agregar vista
fr: Ajouter une vue
it: Aggiungi visualizzazione
ja: ビューの追加
ko: 보기 추가
pt_br: Adicionar modo de exibição
ru: Добавить представление
zh_hans: 添加视图
zh_hant: 新增檢視

# sqlDatabaseProjects.nodejsDoNotAsk
source: Whether to prompt the user to install Node.js when not detected.
de: Ob der Benutzer aufgefordert wird, Node.js zu installieren, wenn dieser nicht erkannt wird.
es: Indique si se pide al usuario que instale Node.js cuando no se detecte.
fr: Indique si l’utilisateur doit être invité à installer Node.js quand il n’est pas détecté.
it: Indica se richiedere all'utente di installare Node.js quando non viene rilevato.
ja: 検出されなかった場合に、ユーザーに Node.js のインストールを求めるかどうか。
ko: 검색되지 않는 경우 사용자에게 Node.js를 설치할지 사용자에게 묻는 메시지를 표시할지 여부입니다.
pt_br: Se o usuário deve instalar o Node.js quando não for detectado.
ru: Предлагать ли пользователю установить платформу Node.js, если она не обнаружена.
zh_hans: 是否在未检测到时提示用户安装 Node.js。
zh_hant: 是否在未偵測到 Node.js 時提示使用者加以安裝。

# sqlDatabaseProjects.open
source: Open Database Project
de: Datenbankprojekt öffnen
es: Abrir proyecto de base de datos
fr: Ouvrir le projet de base de données
it: Apri progetto di database
ja: データベース プロジェクトを開く
ko: 데이터베이스 프로젝트 열기
pt_br: Abrir Projeto de Banco de Dados
ru: Открыть проект базы данных
zh_hans: 打开数据库项目
zh_hant: 開啟資料庫專案

# sqlDatabaseProjects.openContainingFolder
source: Open Containing Folder
de: Enthaltenden Ordner öffnen
es: Abrir carpeta contenedora
fr: Ouvrir le dossier contenant
it: Apri cartella superiore
ja: このアイテムのフォルダーを開く
ko: 상위 폴더 열기
pt_br: Abrir Pasta Continente
ru: Открыть содержащую папку
zh_hans: 打开所在的文件夹
zh_hant: 開啟收納資料夾

# sqlDatabaseProjects.openInDesigner
source: Open in Designer
de: Im Designer öffnen
es: Abrir en el Diseñador
it: Aprire in Designer
ja: デザイナーで開く
ko: 디자이너에서 열기
pt_br: Abrir no Designer
ru: Открыть в конструкторе
zh_hant: 在設計工具中開啟

# sqlDatabaseProjects.properties
source: Properties
de: Eigenschaften
es: Propiedades
fr: Propriétés
it: Proprietà
ja: プロパティ
ko: 속성
pt_br: Propriedades
ru: Свойства
zh_hans: 属性
zh_hant: 屬性

# sqlDatabaseProjects.publish
source: Publish
de: Veröffentlichen
es: Publicar
fr: Publier
it: Pubblicare
ja: 公開
ko: 게시
pt_br: Publicar
ru: Опубликовать
zh_hans: 发布
zh_hant: 發佈

# sqlDatabaseProjects.rename
source: Rename
it: Rinominare
pt_br: Renomear

# sqlDatabaseProjects.schemaCompare
source: Schema Compare
de: Schemavergleich
es: Comparar esquemas
fr: Comparer les schémas
it: Confronto schemi
ko: 스키마 비교
pt_br: Comparação de Esquemas
ru: Сравнение схем
zh_hans: 架构比较
zh_hant: 結構描述比較

# sqlDatabaseProjects.updateProjectFromDatabase
source: Update Project From Database
de: Projekt aus Datenbank aktualisieren
es: Actualizar proyecto a partir de base de datos
it: Aggiorna progetto dal database
ja: データベースからプロジェクトを更新する
ko: 데이터베이스에서 프로젝트 만들기
pt_br: Atualizar o Projeto do Banco de Dados
ru: Обновить проект данными из базы данных
zh_hant: 從資料庫更新專案

# sqlDatabaseProjects.validateExternalStreamingJob
source: Validate External Streaming Job
de: Externen Streamingauftrag überprüfen
es: Validar trabajo de streaming externo
fr: Valider le travail de diffusion en continu externe
it: Convalidare processo di streaming esterno
ja: 外部ストリーミング ジョブを検証する
ko: 외부 스트리밍 작업 유효성 검사
pt_br: Validar Trabalho de Streaming Externo
ru: Проверка задания внешней потоковой передачи
zh_hans: 验证外部流式处理作业
zh_hant: 驗證外部串流作業

# sqlDatabaseProjects.welcome
source: No database projects currently open. [New Project](command:sqlDatabaseProjects.new) [Open Project](command:sqlDatabaseProjects.open) [Create Project From Database](command:sqlDatabaseProjects.importDatabase)
de: Derzeit sind keine Datenbankprojekte geöffnet. [New Project](command:sqlDatabaseProjects.new) [Open Project](command:sqlDatabaseProjects.open) [Create Project From Database](command:sqlDatabaseProjects.importDatabase)
es: Actualmente, no hay ningún proyecto de base de datos abierto. [Nuevo proyecto](command:sqlDatabaseProjects.new) [Abrir proyecto](command:sqlDatabaseProjects.open) [Crear proyecto a partir de base de datos](command:sqlDatabaseProjects.importDatabase)
fr: Aucun projet de base de données n’est actuellement ouvert. [New Project] (command:sqlDatabaseProjects.new) [Open Project] (command:sqlDatabaseProjects.open) [Créer un projet à partir de la base de données] (command:sqlDatabaseProjects.importDatabase)
it: Nessun progetto di database attualmente open. [Nuovo progetto](command:sqlDatabaseProjects.new) [Apri progetto](command:sqlDatabaseProjects.open) [Crea progetto dal database](command:sqlDatabaseProjects.importDatabase)
ja: 現在開いているデータベースプロジェクトはありません。 [新しいプロジェクト] (command:sqlDatabaseProjects.new) [プロジェクトを開く] (command:sqlDatabaseProjects.open) [データベースからプロジェクトを作成する] (command:sqlDatabaseProjects. importDatabase)
ko: 현재 열려 있는 데이터베이스 프로젝트가 없습니다. [새 프로젝트] (command: sqlDatabaseProjects.new) [프로젝트 열기] (command: sqlDatabaseProjects) [데이터베이스에서 프로젝트 만들기] (command: sqlDatabaseProjects. importDatabase)
pt_br: Não há projetos de banco de dados abertos no momento. [New Project] (comando: sqlDatabaseProjects.new) [Open Project] (comando: sqlDatabaseProjects.open) [Create Project From Database] (comando: sqlDatabaseProjects.importDatabase)
ru: В настоящее время нет открытых проектов баз данных. [Новый проект](command:sqlDatabaseProjects.new) [Открыть проект](command:sqlDatabaseProjects.open) [Создать проект из базы данных](command:sqlDatabaseProjects.importDatabase)
zh_hans: 当前没有打开数据项目。 [新建项目](command:sqlDatabaseProjects.new) [打开项目](command:sqlDatabaseProjects.open) [根据数据库创建项目](command:sqlDatabaseProjects.importDatabase)
zh_hant: 目前沒有開啟的資料庫專案。 [New Project](command:sqlDatabaseProjects.new) [Open Project](command:sqlDatabaseProjects.open) [Create Project From Database](command:sqlDatabaseProjects.importDatabase)

# title.projectsView
source: Projects
de: Projekte
es: Proyectos
fr: Projets
it: Progetti
ja: プロジェクト
ko: 프로젝트
pt_br: Projetos
ru: Проекты
zh_hans: 项目
zh_hant: 專案

source: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# dacpacNotOnSameDrive
source: Dacpac references need to be located on the same drive as the project file. The project file is located at {0}
de: Dacpac-Verweise müssen sich auf demselben Laufwerk wie die Projektdatei befinden. Die Projektdatei befindet sich unter {0}
es: Las referencias de DACPAC deben encontrarse en la misma unidad de disco que el archivo del proyecto. Este se encuentra en {0}.
fr: Les références dacpac doivent se trouver sur le même lecteur que le fichier projet. Le fichier projet se trouve à {0}
ja: DACPAC 参照は、プロジェクト ファイルと同じドライブに配置されている必要があります。プロジェクト ファイルは {0} に配置されています
ko: Dacpac 참조는 프로젝트 파일과 동일한 드라이브에 있어야 합니다. 프로젝트 파일이 {0}에 있습니다.
ru: Ссылки DACPAC должны располагаться на том же диске, что и файл проекта. Файл проекта расположен в {0}
zh_hans: Dacpac 引用需要位于项目文件所在的同一驱动器上。项目文件位于 {0}
zh_hant: Dacpac 參考必須位於與專案檔相同的磁碟機上。專案檔位於 {0}

# dataSourcesNodeName
source: Data Sources
de: Datenquellen
es: Orígenes de datos
fr: Sources de données
ja: データ ソース
ko: 데이터 원본
ru: Источники данных
zh_hans: 数据源
zh_hant: 資料來源

# enterNewValueForVar
source: Enter new value for variable '{0}'
de: Geben Sie einen neuen Wert für die Variable "{0}" ein
es: Escriba un nuevo valor para la variable "{0}".
fr: Entrer une nouvelle valeur pour la variable « {0} »
ja: 変数 '{0}' の新しい値を入力してください
ko: '{0}' 변수의 새 값을 입력합니다.
ru: Введите новое значение для переменной "{0}"
zh_hans: 输入变量“{0}”的新值
zh_hant: 輸入變數 '{0}' 的新值

# errorReadingProjectGuid
source: Error trying to read {0} of project '{1}'
de: Fehler beim Lesen von {0} des Projekts „{1}“
es: Error al intentar leer {0} del proyecto “{1}”
ja: プロジェクト '{0}' の {1} を読み込もうとしてエラーが発生しました
ko: '{1}' 프로젝트의 {0}을(를) 읽는 동안 오류가 발생했습니다.
ru: Ошибка при попытке чтения {0} проекта "{1}"
zh_hans: 尝试读取项目“{1}”的 {0} 时出错
zh_hant: 嘗試讀取專案 '{1}' 的 {0} 時發生錯誤

source: min
ja: 分
ko: 분
ru: мин
zh_hans: 分钟
zh_hant: 分鐘

# notValidVariableName
source: The variable name '{0}' is not valid.
de: Der Variablenname "{0}" ist ungültig.
es: El nombre de variable '{0}' no es válido.
fr: Le nom de variable '{0}' n'est pas valide.
ja: 変数名 '{0}' は無効です。
ko: '{0}'은(는) 잘못된 변수 이름입니다.
ru: Недопустимое имя переменной "{0}".
zh_hans: 变量名“{0}”无效。
zh_hant: 變數名稱 '{0}' 無效。

# okString
source: Ok
es: Aceptar
ko: 확인
ru: ОК
zh_hans: 确定
zh_hant: 確定

# publishToNewAzureServer
source: Publish to new Azure SQL logical server
de: Auf neuem Azure SQL logischen Server veröffentlichen
es: Publicar en nuevo servidor lógico de Azure SQL
ja: 新しい Azure SQL 論理サーバーに公開
ko: 새 Azure SQL 논리 서버에 게시
ru: Публикация на новом логическом сервере Azure SQL
zh_hant: 發佈到新的 Azure SQL 邏輯伺服器

# reloadValuesFromProjectButtonTitle
source: Reload values from project
de: Werte aus Projekt neu laden
es: Recarga de los valores del proyecto
fr: Recharger les valeurs à partir du projet
ja: プロジェクトから値を再度読み込む
ko: 프로젝트에서 값 다시 로드
ru: Перезагрузить значения из проекта
zh_hans: 从项目中重新加载值
zh_hant: 從專案重新載入值

# scriptFriendlyName
source: Script
de: Skript
ja: スクリプト
ko: 스크립트
ru: Сценарий
zh_hans: 脚本
zh_hant: 指令碼

# sqlDatabaseProjects.DotnetInstallationConfirmation
source: The .NET SDK cannot be located. Project build will not work. Please install .NET Core SDK version 3.1 or higher or update the .NET SDK location in settings if already installed.
de: Das .NET SDK kann nicht gefunden werden. Der Projektbuild funktioniert nicht. Installieren Sie .NET Core SDK Version 3.1 oder höher, oder aktualisieren Sie den Speicherort des .NET SDK in den Einstellungen, sofern bereits installiert.
es: No se encuentra el SDK de .NET. La compilación del proyecto no funcionará. Instale la versión 3.1 o posterior de SDK de .NET Core o actualice la ubicación de SDK de .NET en la configuración si ya está instalada.
ja: .NET SDK が見つかりません。プロジェクトのビルドは機能しません。バージョン 3.1 以降の .NET Core SDK をインストールするか、既にインストールされている場合は、設定で .NET SDK の場所を更新してください。
ko: .NET SDK를 찾을 수 없습니다. 프로젝트 빌드가 작동하지 않습니다. .NET Core SDK 버전 3.1 이상을 설치하거나 이미 설치된 경우 설정에서 .NET SDK 위치를 업데이트하세요.
ru: Не удается найти пакет SDK для .NET. Сборка проекта работать не будет. Установите пакет SDK для .NET версии 3.1 или выше. Если поддерживаемая версия уже установлена, обновите ее расположение в разделе параметров.
zh_hans: 找不到 .NET SDK。项目生成将不起作用。请安装 .NET Core SDK 版本 3.1 或更高版本，或在设置中更新 .Net SDK 位置(如果已安装)。
zh_hant: 找不到 .NET SDK。專案組建將無法運作。請安裝 .NET Core SDK 3.1 版或更新版本，或在設定中更新 .NET SDK 位置 (如果已安裝)。

# sqlDatabaseProjects.NetCoreSupportedVersionInstallationConfirmation
source: Currently installed .NET Core SDK version is {0}, which is not supported. Project build will not work. Please install .NET Core SDK version 3.1 or higher or update the .NET SDK supported version location in settings if already installed.
de: Derzeit ist .NET Core SDK Version {0} installiert, was nicht unterstützt wird. Der Projektbuild funktioniert nicht. Installieren Sie .NET Core SDK Version 3.1, oder aktualisieren Sie den .NET SDK unterstützten Versionsspeicherort in den Einstellungen, sofern bereits installiert.
es: La versión de SDK de .NET Core instalada actualmente es {0}, lo que no se admite. La compilación del proyecto no funcionará. Instale SDK de .NET Core versión 3.1 o posterior o actualice la ubicación de la versión admitida del SDK de .NET en la configuración si ya está instalada.
ja: 現在インストールされている .NET Core SDK バージョンは {0} ですが、これはサポートされていません。プロジェクトのビルドは機能しません。バージョン 3.1 以降の .NET Core SDK をインストールするか、すでにインストールされている場合には、設定で .NET SDK でサポートされているバージョンの場所を更新してください。
ko: 현재 설치된 .NET Core SDK 버전은 지원되지 않는 {0}입니다. 프로젝트 빌드가 작동하지 않습니다. .NET Core SDK 버전 3.1 이상을 설치하거나 이미 설치된 경우 설정에서 .NET SDK 지원 버전 위치를 업데이트하세요.
ru: Установленная сейчас версия пакета SDK для .NET Core {0} не поддерживается. Сборка проекта работать не будет. Установите пакет SDK для .NET Core версии 3.1 или выше. Если поддерживаемая версия уже установлена, обновите ее расположение в разделе параметров.
zh_hans: 当前安装的 .NET Core SDK 版本为 {0}，这是不受支持的。项目生成将不起作用。请安装 .NET Core SDK 版本 3.1 或更高版本，或在设置中更新 .NET SDK 支持的版本位置(如果已安装)。
zh_hant: 目前安裝的 .NET Core SDK 版本是 {0}，但不支援此版本。專案組建將無法運作。請安裝 .NET Core SDK 3.1 版或更新版本，或在設定中更新 .NET SDK 支援的版本位置 (如果已安裝)。

# updateProjectForRoundTrip
source: The targets, references, and system database references need to be updated to build the project '{0}'. If the project was created in SSDT, it will continue to work in both tools. Do you want to update the project?
de: Die Ziele, Verweise und Systemdatenbankverweise müssen aktualisiert werden, um das Projekt „{0}“ zu erstellen. Wenn das Projekt in SSDT erstellt wurde, funktioniert es weiterhin in beiden Tools. Möchten Sie das Projekt aktualisieren?
es: Los objetivos, las referencias y las referencias de base de datos del sistema deben actualizarse para compilar el proyecto “{0}”. Si el proyecto se creó en SSDT, seguirá funcionando en ambas herramientas. ¿Desea actualizar el proyecto?
ja: プロジェクト '{0}' をビルドするには、ターゲット、参照、そしてシステム データベース参照を更新する必要があります。SSDT にプロジェクトが作成された場合、それは両方のツール上で引き続き機能します。プロジェクトを更新しますか?
ko: '{0}' 프로젝트를 빌드하려면 대상, 참조 및 시스템 데이터베이스 참조를 업데이트해야 합니다. 프로젝트가 SSDT에서 생성된 경우 두 도구 모두에서 계속 작동합니다. 프로젝트를 업데이트하시겠습니까?
ru: Для сборки проекта "{0}" необходимо обновить целевые объекты, ссылки и ссылки на системную базу данных. Если проект был создан в SSDT, он продолжит работать в обоих инструментах. Вы хотите обновить проект?
zh_hans: 需要更新目标、引用、系统数据库引用才能生成此项目“{0}”。如果项目是在 SSDT 中创建的，它将继续在这两个工具中工作。是否要更新项目?
zh_hant: 目標、參考和系統資料庫參考需要更新，以建置專案 '{0}'。如果專案是在 SSDT 中建立，它會繼續在這兩個工具中運作。是否要更新專案?

# sqlDatabaseProjects.dotnetInstallLocation
source: Full path to .NET SDK on the machine.
de: Vollständiger Pfad zum .NET SDK auf dem Computer.
es: Ruta de acceso completa al SDK de .NET en la máquina.
ja: コンピューター上の .NET SDK への完全なパス。
ko: 컴퓨터의 .NET SDK에 대한 전체 경로입니다.
ru: Полный путь к пакету SDK для .NET на компьютере.
zh_hans: 计算机上到 .NET SDK 的完整路径。
zh_hant: 電腦上 .NET SDK 的完整路徑。
