Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# sqlDatabaseProjects.generateProjectFromOpenApiSpec
source: Generate SQL Project from OpenAPI/Swagger spec
de: SQL-Projekt aus OpenAPI/Swagger-Spezifikation generieren
es: Generar proyecto de SQL desde las especificaciones de OpenAPI/Swagger
fr: Générer un projet SQL à partir de OpenAPI/Swagger spec
ja: OpenAPI または Swagger 仕様から SQL プロジェクトを生成する
ko: OpenAPI/Swagger 사양에서 SQL 프로젝트 생성
ru: Сформировать проект SQL из спецификации OpenAPI/Swagger
zh_hans: 从 OpenAPI/Swagger 规范生成 SQL 项目
zh_hant: 透過 OpenAPI/Swagger 規格產生 SQL 專案

# sqlDatabaseProjects.netCoreDoNotAsk
source: Whether to prompt the user to install .NET Core when not detected.
de: Gibt an, ob der Benutzer aufgefordert wird, .NET Core zu installieren, wenn keine Installation erkannt wird.
es: Indica si se pide al usuario que instale .NET Core cuando no se detecte.
fr: Indique si l’utilisateur doit être invité à installer .NET Core quand il n’est pas détecté.
ja: 検出されなかった場合に、ユーザーに .NET Core をインストールを求めるかどうか。
ko: 검색되지 않는 경우 사용자에게 .NET Core를 설치할지 사용자에게 묻는 메시지를 표시할지 여부입니다.
ru: Следует ли предлагать пользователю установить .NET Core, если он не будет обнаружен.
zh_hans: 未检测到时是否提示用户安装 .NET Core。
zh_hant: 是否在未偵測到時提示使用者安裝 .NET Core。

# SettingAlreadyExists
source: Local app setting '{0}' already exists. Overwrite?
fr: Le paramètre d’application local « {0} » existe déjà. Voulez-vous le remplacer?
zh_hans: 本地应用设置“{0}”已存在。是否覆盖?

source: Add Package
fr: Ajouter un package
zh_hans: 添加包

# addPackageReferenceMessage
source: To use SQL bindings, ensure your Azure Functions project has a reference to {0}
fr: Pour utiliser des liaisons SQL, vérifiez que votre projet Azure Functions fait référence à {0}.
zh_hans: 若要使用 SQL 绑定，请确保 Azure Functions 项目具有对 {0} 的引用

# addSqlBindingPackageError
source: Error adding Sql Binding extension package to project
zh_hans: 将 SQL 绑定扩展包添加到项目时出错

# baseDockerImage
source: Base SQL Server Docker image
zh_hans: 基本 SQL Server Docker 映像

# confirmPassword
source: Confirm SQL server admin password
fr: Confirmer le mot de passe administrateur du serveur SQL
zh_hans: 确认 SQL Server 管理员密码

# confirmServerPassword
source: Confirm SQL Server admin password
zh_hans: 确认 SQL Server 管理员密码

# connectingToSqlServerOnDockerMessage
source: Connecting to SQL Server on Docker
fr: Connexion à SQL Server sur Docker
zh_hans: 连接到 Docker 上的 SQL Server

# connectionStringSetting
source: Connection string setting name
fr: Nom du paramètre de la chaîne de connexion
zh_hans: 连接字符串设置名称

# connectionStringSettingPlaceholder
source: Connection string setting specified in "local.settings.json"
fr: Paramètre de chaîne de connexion spécifié dans « local.settings.json »
zh_hans: "local.settings.json" 中指定的连接字符串设置

# containerAlreadyExistForProject
source: Other servers on container already exist for the project. Do you want to delete them?
fr: D'autres serveurs sur conteneur existent déjà pour le projet. Voulez-vous les supprimer?
zh_hans: 容器上已存在此项目的其他服务器。是否要删除它们?

source: Create new local app setting
fr: Créer un paramètre d’application locale
zh_hans: 创建新的本地应用设置

# edgeProjectTypeDescription
source: Start with the core pieces to develop and publish schemas for SQL Edge
fr: Commencez par les éléments de base pour développer et publier des schémas pour SQL Edge
zh_hans: 从核心部分开始开发和发布 SQL Edge 的架构

# emptyProjectTypeDescription
source: Develop and publish schemas for SQL databases starting from an empty project
fr: Développer et publier des schémas pour les bases de données SQL à partir d'un projet vide
zh_hans: 从空项目开始开发和发布 SQL 数据库架构

# emptyProjectTypeDisplayName
source: SQL Database
fr: Base de données SQL
zh_hans: SQL 数据库

source: Enter connection string
fr: Entrer une chaîne de connexion
zh_hans: 输入连接字符串

source: Enter connection string setting name
fr: Entrer le nom du paramètre de la chaîne de connexion
zh_hans: 输入连接字符串设置名称

# enterPassword
source: Enter SQL Server admin password
fr: Entrez le mot de passe de l'administrateur de SQL Server
zh_hans: 输入 SQL Server 管理员密码

# enterPortNumber
source: Enter SQL server port number or press enter to use the default value
fr: Entrez le serveur SQL numéro de port ou appuyez sur Entrée pour utiliser la valeur par défaut
zh_hans: 输入 SQL Server 端口号或按 Enter 以使用默认值

# failedToParse
source: Failed to parse "{0}": {1}.
fr: Échec de l'analyse de "{0}" : {1}.
zh_hans: 未能解析“{0}”: {1}。

source: Input
fr: Entrée
zh_hans: 输入

# invalidPropertyValue
source: Invalid value specified for the property '{0}' in .sqlproj file
fr: Valeur non valide spécifiée pour la propriété : « {0} » dans le fichier .sqlproj.
zh_hans: .sqlproj 文件中为属性“{0}”指定的值无效

# invalidSQLPassword
source: SQL Server password doesn't meet the password complexity requirement. For more information see https://docs.microsoft.com/sql/relational-databases/security/password-policy
fr: SQL Server n'est pas conforme aux exigences de complexité de mot de passe. Pour plus d'informations : https://docs.microsoft.com/sql/relational-databases/security/password-policy
zh_hans: SQL Server 密码不符合密码复杂性要求。有关详细信息，请参阅 https://docs.microsoft.com/sql/relational-databases/security/password-policy

# jsonParseError
source: {0} near line "{1}", column "{2}"
fr: {0} près de la ligne "{1}", colonne "{2}"
zh_hans: 第“{1}”行第“{2}”列附近的 {0}。

source: More Information
fr: Complément d’information
zh_hans: 详细信息

# noAzureFunctionsInFile
source: No Azure functions in the current active file
fr: Aucune fonction Azure dans le fichier actif actuel
zh_hans: 当前活动文件中没有 Azure 函数

# noAzureFunctionsProjectsInWorkspace
source: No Azure functions projects found in the workspace
fr: Aucun projet Azure Functions trouvé dans l’espace de travail
zh_hans: 在工作区中找不到 Azure Functions 项目

source: Output
fr: Sortie
zh_hans: 输出

# passwordNotMatch
source: SQL Server password doesn't match the confirmation password
fr: SQL Server mot de passe ne correspond pas au mot de passe de confirmation
zh_hans: SQL Server 密码与确认密码不匹配

# publishToDockerContainer
source: Publish to new server in a container
fr: Publier sur un nouveau serveur dans un conteneur
zh_hans: 发布到容器中的新服务器

source: Publish to existing server
fr: Publier sur un serveur existant
zh_hans: 发布到现有服务器

# retryMessage
source: Operation '{0}' failed. Re-trying... Error: '{1}'
fr: Échec de l’opération «{0}». Nouvelle tentative... Erreur : «{1}»
zh_hans: 操作 "{0}" 失败。正在重试...错误: "{1}"

# runningDockerMessage
source: Building and running the docker container ...
fr: Génération et exécution du conteneur Docker...
zh_hans: 正在生成并运行 Docker 容器...

# saveChangesInFile
source: There are unsaved changes in the current file. Save now?
fr: Il y a des modifications non enregistrées dans le fichier actif. Voulez-vous enregistrer maintenant?
zh_hans: 当前文件中存在未保存的更改。立即保存?

# selectAzureFunction
source: Select an Azure function in the current file to add SQL binding to
fr: Sélectionnez une fonction Azure dans le fichier actif auquel ajouter une liaison SQL
zh_hans: 在当前文件中选择要将 SQL 绑定添加到的 Azure 函数

# selectBaseImage
source: Select the base SQL Server docker image
fr: Sélectionner l’image de l’ancrer SQL Server de base
zh_hans: 选择基本 SQL Server docker 映像

# selectBindingType
source: Select type of binding
fr: Sélectionner le type de liaison
zh_hans: 选择绑定类型

# selectSetting
source: Select SQL connection string setting from local.settings.json
fr: Sélectionnez le paramètre de chaîne de connexion SQL dans local.settings.json
zh_hans: 从 local.settings.json 中选择 SQL 连接字符串设置

# serverPassword
source: SQL Server admin password
zh_hans: 服务器管理员密码

# serverPortNumber
source: SQL server port number
zh_hans: SQL Server 商品号

source: SQL table or view to query
fr: Table ou vue SQL à interroger
zh_hans: 要查询的 SQL 表或视图

# sqlTableToUpsert
source: SQL table to upsert into
fr: Table SQL dans laquelle upsert
zh_hans: 要更新插入到的 SQL 表

source: Value must not be empty
fr: La valeur ne doit pas être vide
zh_hans: 值不能为空

# sqlDatabaseProjects.addSqlBinding
source: Add SQL Binding (preview)
zh_hans: 添加 SQL 绑定(预览)

# generatingProjectFailed
source: Generating project via AutoRest failed: {0}
fr: Échec de la génération du projet via le repos autorest : {0}

# nodeButNotAutorestFound
source: Autorest tool not found in system path, but found Node.js. Running via npx. Please execute 'npm install autorest -g' to install permanently.
fr: L’outil autorest est introuvable dans le chemin d’accès système, mais il a été trouvé Node.js. Exécution via npx. Exécutez « NPM install autorest-g » pour installer définitivement.

# nodeNotFound
source: Neither autorest nor Node.js (npx) found in system path. Please install Node.js for autorest generation to work.
fr: Autorest ou Node.js (npx) introuvable dans le chemin d’accès système. Installez Node.js pour que la génération autorest fonctionne.

# sqlDatabaseProjects.NetCoreInstallationConfirmation
source: The .NET Core SDK cannot be located. Project build will not work. Please install .NET Core SDK version 3.1 or update the .NET Core SDK location in settings if already installed.
fr: Impossible de localiser le kit SDK .NET Core. La génération du projet ne fonctionnera pas. Installez kit SDK .NET Core version 3.1 ou mettez à jour l’emplacement du kit de développement logiciel (SDK) .Net Core dans les paramètres, s’il est déjà installé.

# sqlDatabaseProjects.NetCoreSupportedVersionInstallationConfirmation
source: Currently installed .NET Core SDK version is {0}, which is not supported. Project build will not work. Please install .NET Core SDK version 3.1 or update the .NET Core SDK supported version location in settings if already installed.
fr: La version kit SDK .NET Core installée est {0}, ce qui n’est pas pris en charge. La génération du projet ne fonctionnera pas. Installez kit SDK .NET Core version 3,1 ou mettez à jour l’emplacement de la version prise en charge kit SDK .NET Core dans les paramètres, le cas échéant.

# sqlDatabaseProjects.UpdateNetCoreLocation
source: Update Location
fr: Emplacement de mise à jour

# updateProjectDatabaseReferencesForRoundTrip
source: The system database references need to be updated to build this project. If the project is created in SSDT, it will continue to work in both tools. Do you want to update the project?
fr: Pour générer ce projet, Azure Data Studio doit mettre à jour les références de base de données système. Si le projet est créé dans SSDT, il continuera à fonctionner dans les deux outils. Voulez-vous Azure Data Studio de mettre à jour le projet?

# updateProjectForRoundTrip
source: The targets, references, and system database references need to be updated to build this project. If the project is created in SSDT, it will continue to work in both tools. Do you want to update the project?
fr: Les cibles, les références et les références de la base de données système doivent être mises à jour pour construire ce projet. Si le projet est créé dans SSDT, il continuera à fonctionner dans les deux outils. Voulez-vous mettre à jour le projet?

# sqlDatabaseProjects.addSqlBinding
source: Add SQL Binding
fr: Ajouter une liaison SQL

# sqlDatabaseProjects.netCoreInstallLocation
source: Full path to .NET Core SDK on the machine.
fr: Chemin d’accès complet à kit SDK .NET Core sur l’ordinateur.
