Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

source: Build History
de: Buildverlauf
es: Historial de compilación
fr: Historique de build
it: Cronologia di compilazione
ja: ビルド履歴
ko: 빌드 기록
pt_br: Histórico da compilação
ru: Журнал сборок
zh_hans: 生成历史记录
zh_hant: 組建歷程記錄

source: Date
de: Datum
es: Fecha
it: Data
ja: 日付
ko: 날짜
pt_br: Data
ru: Дата
zh_hans: 日期
zh_hant: 日期

source: Failed
de: Fehlerhaft
es: Error
fr: Échec
it: Non riuscito
ja: 失敗
ko: 실패
pt_br: Ocorreu um erro
ru: Сбой
zh_hans: 已失败
zh_hant: 失敗

source: In progress
de: In Bearbeitung
es: En curso
fr: En cours
it: In corso
ja: 進行中
ko: 진행 중
pt_br: Em andamento
ru: Выполняется
zh_hans: 正在进行
zh_hant: 進行中

source: Move
it: Sposta
pt_br: Mover

source: Publish History
de: Veröffentlichungsverlauf
es: Historial de publicación
fr: Publier l’historique
it: Cronologia di pubblicazione
ja: 公開履歴
ko: 게시 기록
pt_br: Publicar histórico
ru: Журнал публикации
zh_hans: 发布历史记录
zh_hant: 發佈歷程記錄

source: Success
de: Erfolgreich
es: Correcto
fr: Succès
it: Operazione riuscita
ja: 成功
ko: 성공
pt_br: Sucesso
ru: Выполнено
zh_hans: 成功
zh_hant: 成功

source: Target Database
de: Zieldatenbank
es: Base de datos de destino
fr: Base de données cible
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de dados de destino
ru: Целевая база данных
zh_hans: 目标数据库
zh_hant: 目標資料庫

source: Target Platform
de: Zielplattform
es: Plataforma de destino
fr: Plateforme cible
it: Piattaforma di destinazione
ja: ターゲット プラットフォーム
ko: 대상 플랫폼
pt_br: Plataforma de destino
ru: Целевая платформа
zh_hans: 目标平台
zh_hant: 目標平台

source: Target Server
de: Zielserver
es: Servidor de destino
fr: Serveur cible
it: Server di destinazione
ja: ターゲット サーバー
ko: 대상 서버
pt_br: Servidor de destino
ru: Целевой сервер
zh_hans: 目标服务器
zh_hant: 目標伺服器

source: Time
de: Uhrzeit
es: Hora
fr: Heure
it: Ora
ja: 時間
ko: 시간
pt_br: Hora
ru: Время
zh_hans: 时间
zh_hant: 時間

# actionLabel
source: Action
de: Aktion
es: Acción
it: Azione
ja: アクション
ko: 작업
pt_br: Ação
ru: Действие
zh_hant: 動作

# addDatabaseReferenceOkButtonText
source: Add reference
de: Verweis hinzufügen
es: Agregar una referencia
fr: Ajouter une référence
it: Aggiungere riferimento
ja: 参照の追加
ko: 참조 추가
pt_br: Adicionar referência
ru: Добавить ссылку
zh_hans: 添加引用
zh_hant: 新增參考

# addDatabaseReferencedialogName
source: Add database reference
de: Datenbankverweis hinzufügen
es: Agregar referencia de base de datos
fr: Ajouter une référence de base de données
it: Aggiungere riferimento al database
ja: データベース参照の追加
ko: 데이터베이스 참조 추가
pt_br: Adicionar a referência do banco de dados
ru: Добавить ссылку на базу данных
zh_hans: 添加数据库引用
zh_hant: 新增資料庫參考

# addItemAction
source: Add Item
de: Element hinzufügen
es: Agregar elemento
fr: Ajouter un élément
it: Aggiungere elemento
ja: 項目の追加
ko: 항목 추가
pt_br: Adicionar item
ru: Добавить элемент
zh_hans: 添加项
zh_hant: 新增項目

# advancedOptionsButton
source: Advanced...
de: Erweitert...
es: Avanzado...
it: Avanzate...
ja: 詳細...
ko: 고급...
pt_br: Avançado...
ru: Дополнительно…
zh_hant: 進階...

source: Advanced Publish Options
de: Erweiterte Veröffentlichungsoptionen
es: Opciones avanzadas de publicación
it: Opzioni di pubblicazione avanzate
ja: 高度な発行オプション
ko: 고급 게시 옵션
pt_br: Opções Avançadas de Publicação
ru: Дополнительные параметры публикации
zh_hant: 進階發佈選項

# appSettingPrompt
source: Would you like to update Azure Function local.settings.json with the new connection string?
de: Möchten Sie die Datei "local.settings.json" der Azure-Funktion mit der neuen Verbindungszeichenfolge aktualisieren?
es: ¿Desea actualizar la función de Azure local.settings.json con la nueva cadena de conexión?
fr: Voulez-vous mettre à jour Azure Function local.settings.json avec la nouvelle chaîne de connexion ?
it: Aggiornare la funzione di Azure local.settings.json con la nuova stringa di connessione?
ja: Azure Function local.settings.json を新しい接続文字列で更新しますか?
ko: Azure Function local.settings.json을 새 연결 문자열로 업데이트하시겠습니까?
pt_br: Deseja atualizar o arquivo local.settings.json da Função do Azure com a nova cadeia de conexão?
ru: Обновить функцию Azure local.settings.json с помощью новой строки подключения?
zh_hans: 是否要使用新的连接字符串更新 Azure 函数 local.settings.json?
zh_hant: 是否要以新的連接字串更新 Azure Function local.settings.json?

# applyConfirmation
source: Are you sure you want to update the target project?
de: Möchten Sie das Zielprojekt aktualisieren?
es: ¿Está seguro de que desea actualizar el proyecto de destino?
it: Aggiornare il progetto di destinazione?
ja: 対象のプロジェクトを更新しますか?
ko: 대상 프로젝트를 업데이트하시겠습니까?
pt_br: Tem certeza de que deseja atualizar o projeto de destino?
ru: Вы действительно хотите обновить целевой проект?
zh_hant: 確定要更新目標專案嗎?

# applyError
source: There was an error updating the project: {0}
de: Beim Aktualisieren des Projekts: {0} ist ein Fehler aufgetreten
es: Error al actualizar el proyecto: {0}
it: Errore durante l'aggiornamento del progetto: {0}
ja: プロジェクトの更新でエラーが発生しました: {0}
ko: 프로젝트 {0}을(를) 업데이트하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao atualizar o projeto: {0}
ru: При обновлении проекта возникла ошибка: {0}
zh_hant: 更新專案時發生錯誤: {0}

# applySuccess
source: Project was successfully updated.
de: Das Projekt wurde erfolgreich aktualisiert.
es: El proyecto se actualizó correctamente.
it: Aggiornamento del progetto completato.
ja: プロジェクトが正常に更新されました。
ko: 프로젝트를 업데이트했습니다.
pt_br: O projeto foi atualizado com êxito.
ru: Проект успешно обновлен.
zh_hant: 已成功更新專案。

source: at
de: bei
es: en
fr: à
it: in
ja: 場所
ko: 위치
pt_br: em
ru: в
zh_hans: 位于
zh_hant: 於

# autorestProjectName
source: New SQL project name
de: Name des neuen SQL-Projekts
es: Nombre del nuevo proyecto SQL
it: Nuovo nome del progetto SQL
ja: 新しい SQL プロジェクト名
ko: 새 SQL 프로젝트 이름
pt_br: Novo nome do projeto SQL
ru: Имя нового проекта SQL
zh_hans: 新 SQL 项目名称
zh_hant: 新增 SQL 專案名稱

source: Azure accounts
de: Azure-Konten
es: Cuentas de Azure
it: Account Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Contas do Azure
ru: Учетные записи Azure
zh_hant: Azure 帳戶

# azureAddAccount
source: Add an Account...
de: Konto hinzufügen...
es: Agregar una cuenta...
it: Aggiungi un account...
ja: アカウントの追加...
ko: 계정 추가...
pt_br: Adicionar uma Conta...
ru: Добавить учетную запись...
zh_hant: 新增帳戶...

# azureServerName
source: Azure SQL server name
es: Nombre del servidor de Azure SQL
it: Nome del server di Azure SQL
ja: Azure SQL サーバー名
ko: Azure SQL Server 이름
pt_br: Nome do servidor do SQL do Azure
ru: Имя сервера Azure SQL
zh_hant: Azure SQL 伺服器名稱

# azureSqlServerCreated
source: Azure SQL Server '{0}' created
de: Azure SQL Server \"{0}\" erstellt
es: Azure SQL Server \"{0}\" creado
it: Azure SQL Server '{0}' creato
ja: Azure SQL Server '{0}'が作成されました
ko: Azure SQL 서버 '{0}'이(가) 생성됨
pt_br: SQL Server do Azure '{0}' criado
ru: Azure SQL Server ''{0}'' создан
zh_hant: Azure SQL 伺服器 '{0}' 已建立

source: Azure subscription
de: Azure-Abonnement
es: Suscripción a Azure
it: Sottoscrizione di Azure
ja: Azure サブスクリプション
ko: Azure 구독
pt_br: Assinatura do Azure
ru: Подписка Azure
zh_hant: Azure 訂用帳戶

# baseDockerImage
source: Base {0} Docker image
de: Basis- {0} Docker-Image
es: Imagen de Docker base {0}
it: Immagine Docker {0} di base
ja: ベース {0} Docker 画像
ko: 기본 {0} Docker 이미지
pt_br: Imagem base {0} do Docker
ru: Базовый образ Docker {0}
zh_hant: 基底 {0} Docker 映像

# browseButtonText
source: Browse folder
de: Ordner durchsuchen
es: Examinar carpeta
fr: Parcourir le dossier
it: Sfoglia cartella
ja: フォルダーの参照
ko: 폴더 찾아보기
pt_br: Procurar pasta
ru: Поиск папки
zh_hans: 浏览文件夹
zh_hant: 瀏覽資料夾

# browseEllipsis
source: Browse...
de: Durchsuchen...
es: Examine...
fr: Parcourir...
it: Sfoglia...
ja: 参照...
ko: 찾아보기...
pt_br: Procurar...
ru: Обзор...
zh_hans: 浏览...
zh_hant: 瀏覽...

source: Browse for profile
de: Nach Profil suchen
es: Buscar perfil
fr: Rechercher un profil
it: Cercare profilo
ja: プロファイルを参照する
ko: 프로필 찾아보기
pt_br: Procurar perfil
ru: Поиск профиля
zh_hans: 浏览配置文件
zh_hant: 瀏覽設定檔

# buildAction
source: Build
es: Compilar
ja: ビルド
ko: 빌드
pt_br: Compilar
ru: Создать
zh_hans: 生成
zh_hant: 組建

source: Build Elements
de: Elemente erstellen
es: Elementos de compilación
it: Elementi di compilazione
ja: 要素のビルド
ko: 빌드 요소
pt_br: Criar Elementos
ru: Элементы сборки
zh_hans: 生成元素
zh_hant: 組建元素

# buildFailedCannotStartSchemaCompare
source: Schema compare could not start because build failed
de: Der Schemavergleich konnte aufgrund eines Fehlers beim Buildvorgang nicht gestartet werden.
es: No se pudo iniciar la comparación de esquemas debido a un error de compilación.
fr: La comparaison de schémas n’a pas pu démarrer, car la build a échoué
it: Non è stato possibile avviare il confronto dello schema perché la compilazione non è riuscita
ja: ビルドに失敗したため、Schema Compare を開始できませんでした
ko: 빌드 실패로 인해 스키마 비교를 시작할 수 없습니다.
pt_br: Não foi possível iniciar a comparação de esquema pois ocorreu um erro na compilação
ru: Не удалось начать сравнение схем, поскольку произошел сбой сборки
zh_hans: 架构比较无法启动，因为生成失败
zh_hant: 因為組建失敗，所以無法啟動結構描述比較

# cancelButtonText
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# cannotResolvePath
source: Cannot resolve path {0}
de: Der Pfad "{0}" kann nicht aufgelöst werden.
es: No se puede resolver la ruta {0}.
fr: Impossible de résoudre le chemin d'accès {0}.
it: Non è possibile risolvere il percorso {0}
ja: パス {0} を解決できません
ko: 경로 {0}를 확인할 수 없습니다.
pt_br: Não foi possível resolver o caminho {0}
ru: Не удается сопоставить путь {0}
zh_hans: 无法解析路径 {0}
zh_hant: 無法解析路徑 {0}

# cantAddCircularProjectReference
source: A reference to project '{0}' cannot be added. Adding this project as a reference would cause a circular dependency
de: Ein Verweis auf das Projekt "{0}" kann nicht hinzugefügt werden. Das Hinzufügen dieses Projekts als Verweis würde eine Ringabhängigkeit verursachen.
es: No se puede agregar una referencia al proyecto "{0}". Si se agrega este proyecto como una referencia, se dará lugar a una dependencia circular.
fr: Impossible d'ajouter une référence au projet « {0} ». L'ajout de ce projet en tant que référence créerait une dépendance circulaire
it: Impossibile aggiungere un riferimento al progetto '{0}'. L'aggiunta di questo progetto come riferimento genera una dipendenza circolare
ja: プロジェクト '{0}' への参照を追加できません。このプロジェクトを参照として追加すると、循環する依存関係が発生します。
ko: '{0}' 프로젝트에 대한 참조를 추가할 수 없습니다. 이 프로젝트를 참조로 추가하면 순환 종속성이 발생합니다.
pt_br: Não é possível adicionar '{0}' uma referência ao projeto. Adicionar esse projeto como uma referência causaria uma dependência circular
ru: Не удается добавить ссылку на проект "{0}". Добавление этого проекта в виде ссылки может породить циклическую зависимость
zh_hans: 无法添加对项目“{0}”的引用。将此项目添加为引用将导致循环依赖。
zh_hant: 無法新增專案 '{0}' 的參考。以參考方式新增此專案將導致循環相依性

# changeTargetPlatformAction
source: Change Target Platform
de: Zielplattform ändern
es: Cambiar plataforma de destino
fr: Modifier la plateforme cible
it: Modificare la piattaforma di destinazione
ja: ターゲット プラットフォームの変更
ko: 대상 플랫폼 변경
pt_br: Alterar plataforma de destino
ru: Изменить целевую платформу
zh_hans: 更改目标平台
zh_hant: 變更目標平台

# checkoutOutputMessage
source: Check output pane for more details
de: Weitere Details finden Sie im Ausgabebereich
es: Compruebe el panel de salida para obtener más detalles.
fr: Vérifiez le volet de sortie pour plus de détails.
it: Per altri dettagli, controllare il riquadro di output.
ja: 詳細については、出力ペインを確認してください。
ko: 자세한 내용은 출력 창을 확인하세요
pt_br: Verifique o painel de saída para mais detalhes
ru: Дополнительные сведения см. в области вывода
zh_hans: 有关更多详细信息，请查看输出窗格。
zh_hant: 如需詳細資料，請查看輸出窗格

source: Choose action
de: Aktion wählen
es: Elegir acción
fr: Choisissez une action
it: Scegliere un'azione
ja: アクションの選択
ko: 작업 선택
pt_br: Escolher ação
ru: Выберите действие
zh_hans: 选择操作
zh_hant: 選擇動作

# chooseSqlcmdVarsToModify
source: Choose SQLCMD variables to modify
de: Zu ändernde SQLCMD-Variablen auswählen
es: Elija las variables de SQLCMD que quiere modificar.
fr: Choisir des variables SQLCMD à modifier
it: Scegliere le variabili SQLCMD da modificare
ja: SQLCMD 変数を選択して変更する
ko: 수정할 SQLCMD 변수 선택
pt_br: Escolha variáveis SQLCMD para modificar
ru: Выберите переменные SQLCMD для изменения
zh_hans: 选择要修改的 SQLCMD 变量
zh_hant: 選擇要修改的 SQLCMD 變數

# cicularProjectReference
source: Circular reference from project {0} to project {1}
de: Zirkelbezug vom Projekt {0} zum Projekt {1}
es: Referencia circular del proyecto {0}al proyecto {1}
fr: Référence circulaire du projet {0} au projet {1}
it: Riferimento circolare dal progetto {0} al progetto {1}
ja: プロジェクト {0} からプロジェクト {1} への循環参照
ko: 프로젝트에서 {0}프로젝트로의{1} 순환 참조
pt_br: Referência circular do projeto {0} para o projeto {1}
ru: Циклическая ссылка из проекта {0} на проект {1}
zh_hans: 从项目 {0} 到项目 {1} 的循环引用
zh_hant: 從專案 {0} 到專案 {1} 的循環參考

# cleaningDockerImagesMessage
source: Cleaning existing deployments...
de: Vorhandene Bereitstellungen werden bereinigt...
es: Limpiando las implementaciones existentes...
fr: Nettoyage des déploiements existants...
it: Pulizia delle distribuzioni esistenti in corso...
ja: 既存の展開をクリーンにしています...
ko: 기존 배포를 정리하는 중...
pt_br: Limpando implantações existentes...
ru: Очистка существующих развертываний...
zh_hans: 正在清理现有部署...
zh_hant: 正在清除現有的部署...

# compareActionRadiButtonLabel
source: View changes in Schema Compare
de: Änderungen in Schemavergleich anzeigen
es: Ver cambios en Comparación de esquemas
it: Visualizza modifiche in Confronto schemi
ja: Schema Compare で変更を表示する
ko: 스키마 비교의 변경 내용 보기
pt_br: Exibir as alterações na Comparação de Esquemas
ru: Просмотреть изменения в средстве сравнения схем
zh_hant: 在結構描述比較中檢視變更

# confirmPassword
source: Confirm {0} admin password
de: Bestätigen Sie das {0} -Administratorkennwort
es: Confirmar la contraseña de administrador de {0}
it: Confermare password amministratore {0}
ja: {0} 管理者パスワードの確認
ko: {0} 관리자 암호 확인
pt_br: Confirme {0} senha de administrador
ru: Подтвердить пароль администратора {0}
zh_hant: 確認 {0} 系統管理員密碼

# confirmServerPassword
source: Confirm {0} admin password
de: Bestätigen Sie das {0} -Administratorkennwort
es: Confirmar la contraseña de administrador de {0}
it: Confermare password amministratore {0}
ja: {0} 管理者パスワードの確認
ko: {0} 관리자 암호 확인
pt_br: Confirme {0} senha de administrador
ru: Подтвердить пароль администратора {0}
zh_hant: 確認 {0} 系統管理員密碼

# connectingToSqlServerMessage
source: Connecting to SQL Server
de: Eine Verbindung mit SQL Server wird hergestellt
es: Conexión a SQL Server
it: Connessione a SQL Server
ja: SQL Server に接続しています
ko: SQL Server에 연결하는 중입니다.
pt_br: Conectando ao SQL Server
ru: Подключение к SQL Server.
zh_hant: 連接到 SQL Server

# connectionFailedError
source: Connection failed error: '{0}'
de: Verbindungsfehler: "{0}"
es: Error en la conexión: "{0}"
fr: Erreur d’échec de la connexion : «{0}»
it: Errore di connessione non riuscita: '{0}'
ja: 接続に失敗しました。エラー: '{0}'
ko: 연결 실패 오류: '{0}'
pt_br: Erro de falha na conexão: '{0}'
ru: Ошибка подключения: "{0}"
zh_hans: 连接失败错误: "{0}"
zh_hant: 連線失敗。錯誤: '{0}'

# connectionRadioButtonLabel
source: Connections
de: Verbindungen
es: Conexiones
fr: Connexions
it: Connessioni
ja: 接続
ko: 연결
pt_br: Conexões
ru: Подключения
zh_hans: 连接
zh_hant: 連線

# containerAlreadyExistForProject
source: Containers already exist for this project. Do you want to delete them before deploying a new one?
de: Für dieses Projekt sind bereits Container vorhanden. Möchten Sie diese löschen, bevor Sie einen neuen bereitstellen?
es: Ya existen contenedores para este proyecto. ¿Quiere eliminarlos antes de implementar uno nuevo?
it: I contenitori esistono già per questo progetto. Eliminarli prima di distribuirne uno nuovo?
ja: このプロジェクト用のコンテナーは既に存在します。新しい展開を行う前に削除しますか?
ko: 이 프로젝트에 대한 컨테이너가 이미 있습니다. 새 항목을 배포하기 전에 삭제하시겠습니까?
pt_br: Já existem contêineres para este projeto. Deseja excluí-los antes de implantar um novo?
ru: Контейнеры для этого проекта уже существуют. Вы хотите удалить их перед развертыванием нового?
zh_hant: 此專案的容器已存在。您要先刪除這些檔案再部署新的嗎?

# convertToSdkStyleConfirmation
source: The project '{0}' will not be fully compatible with SSDT after conversion. A backup copy of the project file will be created in the project folder prior to conversion. More information is available at https://aka.ms/sqlprojsdk. Continue with converting to SDK-style project?
de: Das Projekt „{0}“ wird nach der Konvertierung nicht vollständig mit SSDT kompatibel sein. Vor der Konvertierung wird eine Sicherungskopie der Projektdatei im Projektordner erstellt. Weitere Informationen sind unter https://aka.ms/sqlprojsdk verfügbar. Wollen Sie mit der Konvertierung in ein Projekt im SDK-Stil fortfahren?
es: El proyecto '{0}' no será totalmente compatible con SSDT después de la conversión. Se creará una copia de seguridad del archivo de proyecto en la carpeta del proyecto antes de la conversión. Hay más información disponible en https://aka.ms/sqlprojsdk. ¿Desea continuar con la conversión al proyecto de estilo SDK?
it: Il progetto '{0}' non sarà completamente compatibile con SSDT dopo la conversione. Prima della conversione, nella cartella del progetto verrà creata una copia di backup del file di progetto. Altre informazioni sono disponibili in https://aka.ms/sqlprojsdk. Continuare con la conversione in un progetto di tipo SDK?
ja: 変換後、プロジェクト '{0}' は SSDT と完全には互換性がありません。プロジェクト ファイルのバックアップ コピーは、変換前にプロジェクト フォルダーに作成されます。詳細については、https://aka.ms/sqlprojsdk を参照してください。SDK スタイルのプロジェクトへの変換を続行しますか?
ko: 프로젝트 '{0}'은(는) 변환 후 SSDT와 완전히 호환되지 않습니다. 변환하기 전에 프로젝트 폴더에 프로젝트 파일의 백업 복사본이 생성됩니다. 자세한 내용은 https://aka.ms/sqlprojsdk에서 확인할 수 있습니다. SDK 스타일 프로젝트로 계속 변환하시겠습니까?
pt_br: O projeto '{0}' não será totalmente compatível com SSDT após a conversão. Uma cópia de backup do arquivo do projeto será criada na pasta do projeto antes da conversão. Mais informações estão disponíveis em https://aka.ms/sqlprojsdk. Continuar com a conversão para o projeto no estilo SDK?
ru: Проект '{0}' не будет полностью совместим с SSDT после преобразования. Перед преобразованием в папке проекта будет создана резервная копия файла проекта. Дополнительные сведения см. по ссылке https://aka.ms/sqlprojsdk. Продолжить преобразование в проект в стиле SDK?
zh_hant: 轉換後，專案 '{0}' 將不會與 SSDT 完全相容。轉換之前，專案檔案備份會先在專案資料夾中建立。有關詳細資訊，可參閱: https://aka.ms/sqlprojsdk。要繼續轉換成 SDK 樣式的專案嗎?

source: Create New
de: Neu erstellen
es: Crear nuevo
fr: Créer un nouveau
it: Crea nuovo
ja: 新規作成
ko: 새로 만들기
pt_br: Criar Novo
ru: Создать
zh_hans: 新建
zh_hant: 新建立

# createProjectDialogOkButtonText
source: Create
de: Erstellen
es: Crear
fr: Créer
it: Crea
ja: 作成
ko: 만들기
pt_br: Criar
ru: Создать
zh_hans: 创建
zh_hant: 建立

# createProjectFromDatabaseDialogName
source: Create project from database
de: Projekt aus Datenbank erstellen
es: Creación de un proyecto a partir de una base de datos
fr: Créer un projet à partir de la base de données
it: Creare un progetto dal database
ja: データベースからのプロジェクトの作成
ko: 데이터베이스에서 프로젝트 만들기
pt_br: Criar projeto pelo banco de dados
ru: Создать проект из базы данных
zh_hans: 根据数据库创建项目
zh_hant: 從資料庫建立專案

# createProjectSettings
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
ko: 설정
pt_br: Configurações
ru: Параметры
zh_hans: 设置
zh_hant: 設定

# creatingAzureSqlServer
source: Creating Azure SQL Server '{0}' ...
de: Azure SQL Server \"{0}\" wird erstellt ...
es: Creando Azure SQL Server \"{0}\"...
it: Creazione del server Azure SQL '{0}' in corso...
ja: Azure SQL Server '{0}' を作成しています...
ko: Azure SQL Server '{0}'을(를) 만드는 중...
pt_br: Criando SQL Server do Azure '{0}'...
ru: Создание Azure SQL Server \"{0}\"...
zh_hant: 正在建立 Azure SQL 伺服器 '{0}'...

# creatingDeploymentSettingsMessage
source: Creating deployment settings ...
de: Bereitstellungseinstellungen werden erstellt...
es: Creando la configuración de implementación...
fr: Création des paramètres de déploiement...
it: Creazione delle impostazioni di distribuzione in corso...
ja: 展開設定を読み込んでいます...
ko: 배포 설정을 만드는 중...
pt_br: Criando configurações de implantação...
ru: Создание параметров развертывания...
zh_hans: 正在创建部署设置...
zh_hant: 正在建立部署設定...

# currentTargetPlatform
source: Target platform of the project {0} is now {1}
de: Die Zielplattform des Projekts "{0}" ist jetzt "{1}"
es: La plataforma de destino del proyecto {0} ahora es {1}.
fr: La plateforme cible du projet {0} est désormais {1}
it: La piattaforma di destinazione del progetto {0} è ora {1}
ja: {0} プロジェクトのターゲットプラットフォームは現在 {1}
ko: 이제 프로젝트 {0}의 대상 플랫폼이 {1}입니다.
pt_br: A plataforma de destino do projeto {0} agora é {1}
ru: Текущая целевая платформа проекта {0}: {1}
zh_hans: 项目 {0} 的目标平台现已 {1}
zh_hant: 專案 {0} 的目標平台現在已{1}

# dacpacFileLocationRequired
source: Dacpac file location is required for adding a reference to a database
de: Der Speicherort der DACPAC-Datei ist zum Hinzufügen eines Verweises zu einer Datenbank erforderlich
es: La ubicación del archivo .dacpac es necesaria para agregar una referencia a una base de datos
fr: L’emplacement du fichier dacpac est requis pour l’ajout d’une référence à une base de données
it: Il percorso del file Dacpac è necessario per aggiungere un riferimento a un database
ja: データベースに参照を追加するには DACPAC ファイルの場所が必要です
ko: 데이터베이스에 대한 참조를 추가하려면 Dacpac 파일 위치가 필요합니다.
pt_br: O local do arquivo Dacpac é necessário para adicionar uma referência a um banco de dados
ru: Для добавления ссылки на базу данных требуется расположение файла DACPAC
zh_hans: 添加对数据库的引用时需要 Dacpac 文件位置
zh_hant: 需要 Dacpac 檔案位置才能將參考新增到資料庫

source: dacpac Files
de: DACPAC-Dateien
es: Archivos .dacpac
fr: Fichiers dacpac
it: File dacpac
ja: DACPAC ファイル
ko: DACPAC 파일
pt_br: Arquivos dacpac
ru: Файлы DACPAC
zh_hans: dacpac 文件
zh_hant: dacpac 檔案

# dacpacNotOnSameDrive
source: Dacpac references need to be located on the same drive as the project file.
it: I riferimenti dacpac devono trovarsi nella stessa unità del file di progetto.
pt_br: As referências do Dacpac precisam estar localizadas na mesma unidade que o arquivo de projeto.

# dacpacReferenceElement
source: Dacpac reference
de: Dacpac-Referenz
es: Referencia DACPAC
it: Dizionari ed enciclopedie Dacpac
ja: Dacpac 参照
ko: Dacpac 참조
pt_br: Referência Dacpac
ru: Ссылка на DACPAC
zh_hans: Dacpac 引用
zh_hant: Dacpac 参考

# dacpacText
source: Data-tier application (.dacpac)
de: Datenebenenanwendung (.dacpac)
es: Aplicación de capa de datos (.dacpac)
fr: Application de la couche Données (.dacpac)
it: Applicazione livello dati (.dacpac)
ja: データ層アプリケーション (.dacpac)
ko: 데이터 계층 애플리케이션(.dacpac)
pt_br: Aplicativo da camada de dados (.dacpac)
ru: Приложение уровня данных (.dacpac)
zh_hans: 数据层应用程序(.dacpac)
zh_hant: 資料層應用程式 (.dacpac)

source: Data Source
de: Datenquelle
es: Origen de datos
fr: Source de données
it: Origine dati
ja: データ ソース
ko: 데이터 원본
pt_br: Fonte de dados
ru: Источник данных
zh_hans: 数据源
zh_hant: 資料來源

# dataSourceDropdownTitle
source: Data source
de: Datenquelle
es: Origen de datos
fr: Source de données
it: Origine dati
ja: データ ソース
ko: 데이터 원본
pt_br: Fonte de dados
ru: Источник данных
zh_hans: 数据源
zh_hant: 資料來源

# dataSourceRadioButtonLabel
source: Data sources
de: Datenquellen
es: Orígenes de datos
fr: Sources de données
it: Origini dati
ja: データ ソース
ko: 데이터 원본
pt_br: Fontes de dados
ru: Источники данных
zh_hans: 数据源
zh_hant: 資料來源
