Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# selectString
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
ru: Выбрать
zh_hans: 选择
zh_hant: 選取

# selectTargetPlatform
source: Current target platform: {0}. Select new target platform
de: Aktuelle Zielplattform: {0}. Neue Zielplattform auswählen
es: Plataforma de destino actual: {0}. Seleccione una nueva plataforma de destino.
fr: Plateforme cible actuelle : {0}. Sélectionner une nouvelle plateforme cible
it: Piattaforma di destinazione corrente: {0}. Selezionare una nuova piattaforma di destinazione
ja: 現在のターゲットプラットフォーム: {0}。新しいターゲット プラットフォームを選択します
ko: 현재 대상 플랫폼: {0}입니다. 새 대상 플랫폼 선택
pt_br: Plataforma de destino atual: {0}. Selecionar a nova plataforma de destino
ru: Текущая целевая платформа: {0}. Выберите новую целевую платформу
zh_hans: 当前目标平台: {0}。请选择新目标平台
zh_hant: 目前的目標平台: {0}。請選取新的目標平台

source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 服务器
zh_hant: 伺服器​

source: Server created
de: Server erstellt
es: Servidor creado
it: Server creato
ja: サーバーが作成されました
ko: 서버 생성됨
pt_br: Servidor criado
ru: Сервер создан
zh_hant: 伺服器已建立

source: Server name
es: Nombre del servidor
fr: Nom du serveur
it: Nome del server
ja: サーバー名
ko: 서버 이름
pt_br: Nome do servidor
ru: Имя сервера
zh_hans: 服务器名
zh_hant: 伺服器名稱

# serverPassword
source: {0} admin password
de: {0} Administratorkennwort
es: Contraseña de administrador {0}
it: Password amministratore {0}
ja: {0} 管理者パスワード
ko: {0} 관리자 암호
pt_br: {0} senha de administrador
ru: Пароль администратора {0}
zh_hant: {0} 系統管理員密碼

# serverPortNumber
source: {0} port number
de: {0} Portnummer
es: Número de puerto {0}
it: Numero di porta {0}
ja: {0} ポート番号
ko: {0} 포트 번호
pt_br: {0} número da porta
ru: {0} номер порта
zh_hant: {0} 連接埠號碼

source: Server variable
es: Variable de servidor
fr: Variable serveur
it: Variabile server
ja: サーバー変数
ko: 서버 변수
pt_br: Variável de servidor
ru: Переменная сервера
zh_hans: 服务器变量
zh_hant: 伺服器變數

source: Source database
de: Quelldatenbank
es: Base de datos de origen
fr: Base de données source
it: Database di origine
ja: ソース データベース
ko: 원본 데이터베이스
pt_br: Banco de dados de origem
ru: База данных-источник
zh_hans: 源数据库
zh_hant: 來源資料庫

# specSelectionText
source: OpenAPI/Swagger spec
de: OpenAPI/Swagger-Spezifikation
es: Especificación de OpenAPI/Swagger
fr: Spécification OpenAPI/Swagger
it: Specifics OpenAPI/Swagger
ja: OpenAPI または Swagger 仕様
ko: OpenAPI/Swagger 사양
pt_br: Especificação de OpenAPI/Swagger
ru: Спецификация OpenAPI/Swagger
zh_hans: OpenAPI/Swagger 规范
zh_hant: OpenAPI/Swagger 規格

# sqlCmdTableLabel
source: SQLCMD Variables
de: SQLCMD-Variablen
es: Variables SQLCMD
fr: Variables SQLCMD
it: Variabili SQLCMD
ja: SQLCMD 変数
ko: SQLCMD 변수
pt_br: Variáveis SQLCMD
ru: Переменные SQLCMD
zh_hans: SQLCMD 变量
zh_hant: SQLCMD 變數

# sqlCmdValueColumn
source: Value
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
ko: 값
pt_br: Valor
ru: Значение
zh_hans: 值
zh_hant: 值

# sqlCmdVariableColumn
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# sqlConnectionStringFriendly
source: SQL connection string
de: SQL-Verbindungszeichenfolge
es: Cadena de conexión SQL
fr: Chaîne de connexion SQL
it: Stringa di connessione SQL
ja: SQL 接続文字列
ko: SQL 연결 문자열
pt_br: Cadeia de conexão SQL
ru: Строка подключения SQL
zh_hans: SQL 连接字符串
zh_hant: SQL 連接字串

# sqlDatabaseProjects.DotnetInstallationConfirmation
source: The .NET SDK cannot be located. Project build will not work. Please install .NET 6 SDK or higher or update the .NET SDK location in settings if already installed.
it: Non è possibile individuare SDK .NET. La compilazione del progetto non funzionerà. Installare SDK .NET 6 o versione successiva o aggiornare il percorso di SDK .NET nelle impostazioni, se già installato.
pt_br: O .NET SDK não pode ser localizado. O build do projeto não funcionará. Instale o .NET 6 SDK ou superior ou atualize o local do .NET SDK nas configurações, se já estiver instalado.

# sqlDatabaseProjects.Install
source: Install
de: Installieren
es: Instalar
fr: Installer
it: Installa
ja: インストール
ko: 설치
pt_br: Instalar
ru: Установить
zh_hans: 安装
zh_hant: 安裝

# sqlDatabaseProjects.NetCoreSupportedVersionInstallationConfirmation
source: Currently installed .NET SDK version is {0}, which is not supported. Project build will not work. Please install .NET 6 SDK or higher or update the .NET SDK supported version location in settings if already installed.
it: La versione di SDK .NET attualmente installata è {0}, che non è supportata. La compilazione del progetto non funzionerà. Installare SDK .NET 6 o versione successiva o aggiornare il percorso della versione supportata di SDK .NET nelle impostazioni, se già installato.
pt_br: A versão do .NET SDK instalada no momento é {0}, que não tem suporte. O build do projeto não funcionará. Instale o SDK do .NET 6 ou superior ou atualize o local da versão com suporte do SDK do .NET nas configurações, se já estiver instalado.

# sqlDatabaseProjects.UpdateDotnetLocation
source: Update Location
de: Speicherort für Updates
es: Actualizar ubicación
it: Aggiornare percorso
ja: 場所の更新
ko: 업데이트 위치
pt_br: Atualizar Local
ru: Обновить расположение
zh_hans: 更新位置
zh_hant: 更新位置

# sqlDatabaseProjects.doNotAskAgain
source: Don't Ask Again
de: Nicht mehr fragen
es: No volver a preguntar
fr: Ne plus me poser la question
it: Non chiedere più
ja: 今後このメッセージを表示しない
ko: 다시 묻지 않음
pt_br: Não perguntar novamente
ru: Больше не спрашивать
zh_hans: 不再询问
zh_hant: 不要再詢問

# sqlDatabaseProjects.outputChannel
source: Database Projects
de: Datenbankprojekte
es: Proyecto de base de datos
fr: Projets de base de données
it: Progetti di database
ja: データベース プロジェクト
ko: 데이터베이스 프로젝트
pt_br: Projetos de Banco de Dados
ru: Проекты баз данных
zh_hans: 数据库项目
zh_hant: 資料庫專案

# sqlcmdVariableAlreadyExists
source: A SQLCMD Variable with the same name already exists in this project
it: Nel progetto esiste già una variabile SQLCMD con lo stesso nome
pt_br: Já existe uma Variável SQLCMD com o mesmo nome neste projeto

# sqlcmdVariableNameCannotBeWhitespace
source: SQLCMD variable name '{0}' cannot contain whitespace
it: Il nome della variabile SQLCMD '{0}' non può contenere spazi vuoti
pt_br: O nome da variável SQLCMD '{0}' não pode conter espaços em branco

# sqlcmdVariableNameCannotContainIllegalChars
source: SQLCMD variable name '{0}' cannot contain any of the following characters: {1}
it: Il nome della variabile SQLCMD '{0}' non può contenere i caratteri seguenti: {1}
pt_br: O nome da variável SQLCMD '{0}' não pode conter nenhum dos seguintes caracteres: {1}

# sqlcmdVariablesNodeName
source: SQLCMD Variables
it: Variabili SQLCMD
pt_br: Variáveis SQLCMD

# storedProcedureFriendlyName
source: Stored Procedure
de: Gespeicherte Prozedur
es: Procedimiento almacenado
fr: Procédure stockée
ja: ストアド プロシージャ
ko: 저장 프로시저
pt_br: Procedimento armazenado
ru: Хранимая процедура
zh_hans: 存储过程
zh_hant: 預存程序

# suppressMissingDependenciesErrors
source: Suppress errors caused by unresolved references in the referenced project
de: Fehler unterdrücken, die durch nicht aufgelöste Verweise im Projekt verursacht werden, auf das verwiesen wird.
es: Suprimir errores causados por referencias sin resolver en el proyecto al que se hace referencia
fr: Supprimer les erreurs causées par des références non résolues dans le projet référencé
it: Non visualizzare gli errori provocati da riferimenti non risolti nel progetto a cui si fa riferimento
ja: 参照プロジェクト内の未解決の参照によるエラーを表示しない
ko: 참조 프로젝트의 확인되지 않은 참조로 인한 오류를 표시하지 않습니다.
pt_br: Suprimir erros causados por referências não resolvidas no projeto referenciado
ru: Отключить вывод ошибок, вызванных неразрешенными ссылками в проекте на который имеется ссылка
zh_hans: 禁止显示由引用对象中的未解析引用导致的错误
zh_hant: 隱藏參考的專案中未解析參考造成的錯誤

source: System database
de: Systemdatenbank
es: Base de datos del sistema
fr: Base de données système
it: Database di sistema
ja: システム データベース
ko: 시스템 데이터베이스
pt_br: Bancos de dados do sistema
ru: Системная база данных
zh_hans: 系统数据库
zh_hant: 系統資料庫

# systemDatabaseReferenceRequired
source: System database selection is required for adding a reference to a system database
de: Zum Hinzufügen eines Verweises zu einer Systemdatenbank ist eine Systemdatenbankauswahl erforderlich.
es: La selección de la base de datos del sistema es necesaria para agregar una referencia a una base de datos del sistema.
fr: La sélection de la base de données système est nécessaire pour l’ajout d’une référence à une base de données système
it: La selezione del database di sistema è necessaria per l'aggiunta di un riferimento a un database di sistema
ja: システム データベースへの参照を追加するには、システム データベースの選択が必要です
ko: 시스템 데이터베이스에 대한 참조를 추가하려면 시스템 데이터베이스를 선택해야 합니다.
pt_br: A seleção de banco de dados do sistema é necessária para adicionar uma referência a um banco de dados do sistema
ru: Для добавления ссылки в системную базу данных требуется выбрать системную базу данных
zh_hans: 添加对系统数据库的引用时需要系统数据库选择
zh_hant: 必須有系統資料庫選取項目，才可將參考加入系統資料庫

# tableFriendlyName
source: Table
de: Tabelle
es: Tabla
it: Tabella
ja: テーブル
ko: 테이블
pt_br: Tabela
ru: Таблицы
zh_hans: 表
zh_hant: 資料表

# targetConnectionLabel
source: Connection
de: Verbindung
es: Conexión
fr: Connexion
it: Connessione
ja: 接続
ko: 연결
pt_br: Conexão
ru: Подключение
zh_hans: 连接
zh_hant: 連線

source: Target project
de: Zielprojekt
es: Proyecto de destino
fr: Projet cible
it: Progetto di destinazione
ja: ターゲット プロジェクト
ko: 대상 프로젝트
pt_br: Projeto de destino
ru: Целевой проект
zh_hans: 目标项目
zh_hant: 目標專案

# taskFailedError.error
source: Failed to complete task '{0}'. Error: {1}
de: Fehler beim Abschließen der Aufgabe "{0}". Fehler: {1}
es: No se pudo completar la tarea '{0}'. Error: {1}
fr: Échec de l’exécution de la tâche « {0} ». Erreur : {1}
it: Non è stato possibile completare l'attività “{0}” Errore: {1}
ja: タスク '{0}' を完了できませんでした。エラー: {1}
ko: '{0}' 작업을 완료하지 못했습니다. 오류: {1}
pt_br: Falha ao concluir a tarefa '{0}'. Erro: {1}
ru: Не удалось выполнить задачу "{0}". Ошибка: {1}
zh_hans: 无法完成任务“{0}”。错误: {1}
zh_hant: 無法完成工作 '{0}'。錯誤: {1}

# unableToCreatePublishConnection
source: Unable to construct connection: {0}
de: Verbindung kann nicht hergestellt werden: {0}
es: No se puede construir la conexión: {0}.
fr: Impossible de construire la connexion : {0}
it: Impossibile costruire la connessione: {0}
ja: 接続を構築できません: {0}
ko: 연결을 구성할 수 없음: {0}
pt_br: Não é possível construir a conexão: {0}
ru: Не удалось создать подключение: {0}
zh_hans: 无法构造连接: {0}
zh_hant: 無法建立連線: {0}

# unableToFindFile
source: Unable to find {1} with path '{0}'
de: {1} mit Pfad "{0}" wurde nicht gefunden.
es: No se encuentra {1}con la ruta "{0}".
fr: Impossible de trouver {1} avec le chemin d’accès « {0} »
it: Impossibile trovare {1}con il percorso '{0}'
ja: パス '{0}' の {1} が見つかりません
ko: 경로가 '{0}'인 {1}을(를) 찾을 수 없습니다.
pt_br: Não é possível localizar {1} com o caminho '{0}'
ru: Не удается найти "{1}" с путем "{0}"
zh_hans: 找不到路径为“{0}”的 {1}
zh_hant: 找不到路徑為 '{0}' 的 {1}

# unableToFindReference
source: Unable to find database reference {0}
de: Der Datenbankverweis {0} konnte nicht gefunden werden
es: No se encuentra la referencia de base de datos {0}.
fr: Impossible de trouver la référence de la base de données {0}
it: Impossibile trovare il riferimento al database {0}
ja: データベース参照 {0} が見つかりません
ko: 데이터베이스 참조 {0}를 찾을 수 없습니다.
pt_br: Não é possível localizar o banco de dados de referência {0}
ru: Не удалось найти ссылку на базу данных {0}
zh_hans: 找不到数据库引用 {0}
zh_hant: 找不到資料庫參考 {0}

# unableToFindSqlCmdVariable
source: Unable to find SQLCMD variable '{0}'
de: Die SQLCMD-Variable "{0}" konnte nicht gefunden werden.
es: No se encuentra la variable SQLCMD "{0}".
fr: Impossible de trouver la variable SQLCMD « {0} »
it: Impossibile trovare la variabile SQLCMD '{0}'
ja: SQLCMD 変数 '{0}' が見つかりません
ko: SQLCMD 변수 '{0}'을(를) 찾을 수 없습니다.
pt_br: Não é possível localizar a variável SQLCMD '{0}'
ru: Не удалось найти переменную SQLCMD "{0}"
zh_hans: 找不到 SQLCMD 变量“{0}”
zh_hant: 找不到 SQLCMD 變數 '{0}'

# unableToPerformAction
source: Unable to locate '{0}' target: '{1}'
de: Das Ziel von "{0}" wurde nicht gefunden: "{1}"
es: No se encuentra el destino "{0}": "{1}".
fr: Impossible de localiser la cible « {0} » : « {1} »
it: Non è possibile individuare la destinazione '{0}': '{1}'
ja: '{0}' ターゲットが見つかりません: '{1}'
ko: '{0}' 대상을 찾을 수 없습니다. '{1}'
pt_br: Não é possível localizar '{0}' destino: '{1}'
ru: Не удалось найти "{0}", цель: "{1}"
zh_hans: 无法定位“{0}”目标:“{1}”
zh_hant: 找不到 '{0}' 目標: '{1}'

# unexpectedProjectContext
source: Unable to establish project context. Command invoked from unexpected location: {0}
de: Der Projektkontext kann nicht eingerichtet werden. Der Befehl wurde von einem unerwarteten Speicherort aufgerufen: {0}
es: No se puede establecer el contexto del proyecto. Comando invocado desde una ubicación inesperada: {0}
fr: Impossible d’établir le contexte du projet. Commande appelée à partir d’un emplacement inattendu : {0}
it: Impossibile stabilire il contesto del progetto. Comando richiamato da una posizione imprevista: {0}
ja: プロジェクト コンテキストを確立できません。 コマンドが予期しない場所から呼び出されたコマンド: {0}
ko: 프로젝트 컨텍스트를 설정할 수 없습니다. 예기치 않은 위치에서 호출된 명령: {0}
pt_br: Não é possível estabelecer o contexto do projeto. Comando invocado de um local inesperado: {0}
ru: Не удалось установить контекст проекта. Команда вызвана из неожиданного расположения: {0}
zh_hans: 无法建立项目上下文。从意外位置调用了命令: {0}
zh_hant: 無法建立專案內容。從未預期的位置叫用的命令: {0}

# unhandledDeleteType
source: Unhandled item type during delete: '{0}
it: Tipo di elemento non gestito durante l'eliminazione: '{0}
pt_br: Tipo de item não tratado durante a exclusão: '{0}

# unhandledMoveNode
source: Unhandled node type for move
it: Tipo di nodo non gestito per lo spostamento
pt_br: Tipo de nó não tratado para movimentação

source: Unknown data source type:
de: Unbekannter Datenquellentyp:
es: Tipo de origen de datos desconocido:
fr: Type de source de données inconnu :
it: Il tipo dell'origine dei dati è sconosciuto:
ja: 不明なデータ ソースの種類:
ko: 알 수 없는 데이터 원본 유형:
pt_br: Tipo de fonte de dados desconhecido:
ru: Неизвестный тип источника данных:
zh_hans: 未知的数据源类型:
zh_hant: 不明的資料來源類型:

# unrecognizedDataSourcesVersion
source: Unrecognized version:
de: Unbekannte Version:
es: Versión no reconocida:
fr: Version non reconnue :
it: Versione non riconosciuta:
ja: 認識されていないバージョン:
ko: 인식할 수 없는 버전:
pt_br: Versão não reconhecida:
ru: Нераспознанная версия:
zh_hans: 无法识别的版本:
zh_hant: 無法辨識的版本:

source: Update action
de: Aktualisierungsaktion
es: Acción de actualización
it: Azione di aggiornamento
ja: 更新操作
ko: 업데이트 작업
pt_br: Atualizar Ação
ru: Действие обновления
zh_hant: 更新動作

# updateActionRadiButtonLabel
source: Apply all changes
de: Alle Änderungen anwenden
es: Aplicar todos los cambios
it: Applica tutte le modifiche
ja: すべての変更を適用する
ko: 모든 변경 내용 적용
pt_br: Aplicar Todas Alterações
ru: Применить все изменения
zh_hant: 套用所有變更

# updateProjectDatabaseReferencesForRoundTrip
source: The system database references need to be updated to build the project '{0}'. If the project was created in SSDT, it will continue to work in both tools. Do you want to update the project?
de: Die Systemdatenbankverweise müssen aktualisiert werden, um das Projekt „{0}“ zu erstellen. Wenn das Projekt in SSDT erstellt wurde, funktioniert es weiterhin in beiden Tools. Möchten Sie das Projekt aktualisieren?
es: Las referencias de base de datos del sistema deben actualizarse para compilar el proyecto “{0}”. Si el proyecto se creó en SSDT, seguirá funcionando en ambas herramientas. ¿Desea actualizar el proyecto?
it: Per compilare il progetto, è necessario aggiornare i riferimenti al database di sistema '{0}'. Se il progetto è stato creato in SQL Server Data Tools, continuerà a funzionare in entrambi gli strumenti. Aggiornare il progetto?
ja: プロジェクト '{0}' をビルドするには、システム データベース参照を更新する必要があります。SSDT にプロジェクトが作成された場合、それは両方のツール上で引き続き機能します。プロジェクトを更新しますか?
ko: '{0}' 프로젝트를 빌드하려면 시스템 데이터베이스 참조를 업데이트해야 합니다. 프로젝트가 SSDT에서 생성된 경우 두 도구 모두에서 계속 작동합니다. 프로젝트를 업데이트하시겠습니까?
pt_br: As referências do banco de dados do sistema precisam ser atualizadas para criar o projeto '{0}'. Se o projeto foi criado no SSDT, ele continuará funcionando em ambas as ferramentas. Deseja atualizar o projeto?
ru: Для сборки проекта "{0}" необходимо обновить ссылки на системную базу данных. Если проект был создан в SSDT, он продолжит работать в обоих инструментах. Вы хотите обновить проект?
zh_hans: 需要更新系统数据库引用才能生成此项目“{0}”。如果项目是在 SSDT 中创建的，它将继续在这两个工具中工作。是否要更新项目?
zh_hant: 必須更新系統資料庫參考，以建置專案 '{0}'。如果專案是在 SSDT 中建立，它會繼續在這兩個工具中運作。是否要更新專案?

# updateProjectForCrossPlatform
source: {0} If the project was created in SSDT, it will continue to work in both tools. Do you want to update the project?
it: {0} Se il progetto è stato creato in SQL Server Data Tools, continuerà a funzionare in entrambi gli strumenti. Aggiornare il progetto?
pt_br: {0} Se o projeto foi criado no SSDT, continuará funcionando nas duas ferramentas. Deseja atualizar o projeto?

# updateProjectForCrossPlatformShort
source: Update {0} for cross-platform support?
it: Aggiornare {0} per il supporto multipiattaforma?
pt_br: Atualizar {0} para suporte multiplataforma?

# updateProjectFromDatabaseDialogName
source: Update project from database
de: Projekt aus Datenbank aktualisieren
es: Actualizar proyecto a partir de base de datos
it: Aggiorna progetto dal database
ja: データベースからプロジェクトを更新する
ko: 데이터베이스의 프로젝트 업데이트
pt_br: Atualizar o projeto do banco de dados
ru: Обновить проект из базы данных
zh_hant: 從資料庫更新專案

# updateText
source: Update
de: Aktualisieren
es: Actualizar
it: Aggiorna
ja: 更新
ko: 업데이트
pt_br: Atualizar
ru: Обновить
zh_hant: 更新

# updatedToSdkStyleError
source: Converting the project {0} to SDK-style was unsuccessful. Changes to the .sqlproj have been rolled back.
de: Das Konvertieren des Projekts in {0}das SDK-Format war nicht erfolgreich. Änderungen an .sqlproj wurden rückgängig gemacht.
es: No se pudo convertir el proyecto {0} al estilo SDK. Se han revertido los cambios realizados en .sqlproj.
it: La conversione del progetto {0} in uno stile SDK non è riuscita. È stato eseguito il rollback delle modifiche al file con estensione .sqlproj.
ja: プロジェクト{0} を SDK スタイルに変換できませんでした。.sqlproj への変更がロールバックされました。
ko: {0} 프로젝트에서 SDK 스타일로 변환하지 못했습니다. .sqlproj에 대한 변경 내용이 롤백되었습니다.
pt_br: A conversão do projeto {0} para o estilo SDK não foi bem-sucedida. As alterações no .sqlproj foram revertidas.
ru: Не удалось преобразовать проект {0} в стиль SDK. Выполнен откат в .sqlproj
zh_hant: 將專案 {0} 轉換成 SDK 樣式失敗。已回復對 .sqlproj 所做的變更。

# updatingProjectFromDatabase
source: Updating {0} from {1}...
de: {0} von {1} wird aktualisiert...
es: Actualizando {0} desde {1}...
it: Aggiornamento di {0} da {1}...
ja: {1} から {0} を更新しています...
ko: {1}의 {0}을(를) 업데이트하는 중...
pt_br: Atualizando {0} de {1}...
ru: Идет обновление {0} из {1}...
zh_hant: 正在從 {1} 更新 {0}...

# userSelectionCancelled
source: User has cancelled selection for how to run autorest.
de: Der Benutzer hat die Auswahl zum Ausführen von Autorest abgebrochen.
es: El usuario ha cancelado la selección de cómo ejecutar autorest.
it: L'utente ha annullato la selezione per la modalità di esecuzione dell'autorest.
ja: autorest の実行方法の選択がユーザーによって取り消されました。
ko: 사용자가 autorest 실행 방법에 대한 선택을 취소했습니다.
pt_br: O usuário cancelou a seleção de como executar o autorest.
ru: Пользователь отменил выбор способа выполнения автоматического восстановления.
zh_hans: 用户已取消选择的 autorest 运行方式。
zh_hant: 使用者已取消選取如何執行自動 autorest。

# userSelectionInstallGlobally
source: User selected to install autorest gloablly. Installing now...
de: Der Benutzer hat sich für die globale Installation von Autorest entschieden. Wird jetzt installiert...
es: Usuario seleccionado para instalar autorest de manera global. Instalando ahora...
it: L'utente ha selezionato l'installazione automatica. Installazione in corso...
ja: ユーザーは autorest のグローバル インストールを選択しました。今すぐインストールしています...
ko: autorest를 전역적으로 설치하도록 선택한 사용자입니다. 지금 설치 중입니다...
pt_br: Usuário selecionado para instalar o autorest globalmente. Instalando agora...
ru: Пользователь выбрал глобальное автоматическое восстановление. Идет установка сейчас...
zh_hans: 用户已选择全局安装 autorest。正在安装...
zh_hant: 使用者已選取全域安裝 autorest。正在安裝...

# userSelectionRunNpx
source: User selected to run via npx.
de: Der Benutzer hat die Ausführung über npx ausgewählt.
es: Usuario seleccionado para ejecutarse a través de npx.
it: Utente selezionato per l'esecuzione tramite npx.
ja: ユーザーは、npx 経由での実行を選択しました。
ko: 사용자가 npx를 통해 실행하도록 선택했습니다.
pt_br: Usuário selecionado para ser executado por meio de npx.
ru: Пользователь выбран для запуска через NPX.
zh_hans: 用户已选择通过 npx 运行。
zh_hant: 已選取要透過 npx 執行的使用者。

source: Value cannot be empty
de: Der Wert darf nicht leer sein.
es: El valor no puede estar vacío
fr: La valeur ne peut pas être vide
it: Il valore non può essere vuoto
ja: 値を空にすることはできません
ko: 값을 비워 둘 수 없음
pt_br: O valor não pode estar vazio
ru: Значение не может быть пустым.
zh_hans: 值不能为空
zh_hant: 值不得空白

source: Version
it: Versione
pt_br: Versão

source: Version must not be empty
it: La versione non deve essere vuota
pt_br: A versão não deve estar vazia

# versionPlaceholder
source: NuGet package version
it: Versione del pacchetto NuGet
pt_br: Versão do pacote NuGet

# viewFriendlyName
source: View
de: Anzeigen
es: Ver
fr: Voir
it: Visualizzare
ja: 表示
ko: 보기
pt_br: Exibir
ru: Представление
zh_hans: 查看
zh_hant: 檢視

source: Yes (Recommended)
de: Ja (empfohlen)
es: Sí (recomendado)
it: Sì (Scelta consigliata)
ja: はい (推奨)
ko: 예(권장)
pt_br: Sim (Recomendado)
ru: Да (рекомендуется)
zh_hant: 是 (建議)

# yesString
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
ru: Да
zh_hans: 是
zh_hant: 是

# sqlDatabaseProject.RunCommand.ErroredOut
source: >>> {0} … errored out: {1}
de: >>> {0} … Fehler: {1}
es: >>> {0} … errores: {1}
fr: >>> {0} … a donné une erreur : {1}
it: >>> {0} … ha restituito un errore: {1}
ja: >>> {0} ...エラーが発生しました: {1}
ko: >>> {0} ... 오류가 발생했습니다. {1}
pt_br: >>> {0} … com o erro: {1}
ru: >>> {0} … выдал ошибку: {1}
zh_hans: >>> {0} … 出错: {1}
zh_hant: >>> {0} … 發生錯誤: {1}

# sqlDatabaseProjects.RunStreamedCommand.ExitedWithCode
source: >>> {0} … exited with code: {1}
de: >>> {0} … mit Code beendet: {1}
es: >>> {0} … cerrado con el código {1}
fr: >>> {0} … a quitté avec le code : {1}
it: >>> {0} … terminato con codice: {1}
ja: >>> {0} … コード {1} で終了しました
ko: >>> {0} … 종료됨(코드: {1})
pt_br: >>> {0} … foi encerrado com o código: {1}
ru: >>> {0} … завершил работу с кодом: {1}
zh_hans: >>> {0} … 已退出，代码为: {1}
zh_hant: >>> {0} …已結束。代碼: {1}

# sqlDatabaseProjects.RunStreamedCommand.ExitedWithSignal
source: >>> {0} … exited with signal: {1}
de: >>> {0} … mit Signal beendet: {1}
es: >>> {0} … cerrado con la señal {1}
fr: >>> {0} … a quitté avec le signal : {1}
it: >>> {0} … terminato con segnale: {1}
ja: >>> {0} … シグナル {1} で終了しました
ko: >>> {0} … 종료됨(신호: {1})
pt_br: >>> {0} … foi encerrado com o sinal: {1}
ru: >>> {0} … завершил работу с сигналом: {1}
zh_hans: >>> {0} … 已退出，信号: {1}
zh_hant: >>> {0} …已結束。訊號: {1}

# sqlDatabaseProjects.Settings
source: Database Projects
de: Datenbankprojekte
es: Proyectos de base de datos
fr: Projets de base de données
it: Progetti di database
ja: データベース プロジェクト
ko: 데이터베이스 프로젝트
pt_br: Projetos de Banco de Dados
ru: Проекты баз данных
zh_hans: 数据库项目
zh_hant: 資料庫專案

# sqlDatabaseProjects.addDatabaseReference
source: Add Database Reference
de: Datenbankverweis hinzufügen
es: Agregar referencia de base de datos
fr: Ajouter une référence de base de données
it: Aggiungere riferimento al database
ja: データベース参照の追加
ko: 데이터베이스 참조 추가
pt_br: Adicionar a referência do banco de dados
ru: Добавить ссылку на базу данных
zh_hans: 添加数据库引用
zh_hant: 新增資料庫參考
