Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-migration.*.xlf
Languages: it

# sql.migration.dashboard.help.description.migrateUsingADS
source: The Azure SQL Migration extension for Azure Data Studio provides capabilities to assess, get right-sized Azure recommendations and migrate SQL Server databases to Azure.
it: L'estensione Azure SQL Migration per Azure Data Studio offre funzionalità per valutare, ottenere consigli di Azure di dimensioni corrette ed eseguire la migrazione di database SQL Server in Azure.

# sql.migration.dashboard.help.description.sqldb
source: A step-by-step tutorial to migrate databases from a SQL Server instance (on-premises or Azure Virtual Machines) to Azure SQL Database (PREVIEW).
it: Un'esercitazione dettagliata per eseguire la migrazione di database da un'istanza di SQL Server (locale o macchine virtuali di Azure) a database SQL di Azure (ANTEPRIMA).

# sql.migration.dashboard.help.description.vm
source: A step-by-step tutorial to migrate databases from a SQL Server instance (on-premises) to SQL Server on Azure Virtual Machines with minimal downtime.
it: Esercitazione dettagliata per eseguire la migrazione di database da un'istanza di SQL Server (locale) a SQL server in macchine virtuali di Azure con tempi di inattività minimi.

# sql.migration.dashboard.help.link.dmsGuide
source: Azure Database Migration Guides
it: Guide alla migrazione del database di Azure

# sql.migration.dashboard.help.link.mi
source: Tutorial: Migrate to Azure SQL Managed Instance (online)
it: Esercitazione: Eseguire la migrazione a Istanza gestita di SQL di Azure (online)

# sql.migration.dashboard.help.link.migrateUsingADS
source: Migrate databases using Azure Data Studio
it: Eseguire la migrazione di database tramite Azure Data Studio

# sql.migration.dashboard.help.link.sqldb
source: Tutorial: Migrate to SQL Server on Azure SQL Database (offline) - (PREVIEW)
it: Esercitazione: Eseguire la migrazione a SQL Server nel database SQL di Azure (offline) - (ANTEPRIMA)

# sql.migration.dashboard.help.link.vm
source: Tutorial: Migrate to SQL Server on Azure Virtual Machines (online)
it: Esercitazione: Eseguire la migrazione a SQL Server in Macchine virtuali di Azure (online)

# sql.migration.dashboard.help.title
source: Help articles and video links
it: Articoli della guida e collegamenti video

# sql.migration.dashboard.login.migrate.task.button
source: Migrate logins to Azure SQL
it: Eseguire la migrazione degli account di accesso a Azure SQL

# sql.migration.dashboard.login.migrate.task.button.description
source: Migrate SQL Server logins to Azure SQL.
it: Eseguire la migrazione degli account a Azure SQL.

# sql.migration.dashboard.migrate.task.button
source: Migrate to Azure SQL
it: Eseguire la migrazione a Azure SQL

# sql.migration.dashboard.migrate.task.button.description
source: Migrate a SQL Server instance to Azure SQL.
it: Eseguire la migrazione di un'istanza di SQL Server ad Azure SQL.

# sql.migration.dashboard.title
source: Azure SQL Migration
it: Migrazione di Azure SQL

# sql.migration.data.source.configuration.page.title
source: Data source configuration
it: Configurazione di origine dati

# sql.migration.data.uploaded.info
source: Comparison of the actual amount of data read from the source and the actual amount of data uploaded to the target.
it: Confronto tra la quantità effettiva di dati letti dall'origine e la quantità effettiva di dati caricati nella destinazione.

# sql.migration.data.uploaded.size
source: Data uploaded / size
it: Dati caricati/dimensioni

# sql.migration.database.already.exists
source: Database '{0}' already exists on the target managed instance '{1}'.
it: Il database '{0}' esiste già nell'istanza gestita di destinazione '{1}'.

# sql.migration.database.assessment.description
source: Select the databases that you want to assess for migration to Azure SQL.
it: Selezionare i database da valutare per la migrazione a Azure SQL.

# sql.migration.database.assessment.title
source: Databases for assessment
it: Database per la valutazione

# sql.migration.database.backup.load.error
source: An error occurred while accessing database details.
it: Si è verificato un errore durante l’accesso ai dettagli del database.

# sql.migration.database.connection.error
source: An error occurred while connecting to target migration database.
it: Errore durante la connessione al database di migrazione di destinazione.

# sql.migration.database.connection.error.message
source: Connection error:{0} {1}
it: Errore di connessione:{0} {1}

# sql.migration.database.loading
source: Loading database table list..
it: Caricamento dell'elenco delle tabelle di database in corso..

# sql.migration.database.loading.tables
source: Loading tables list...
it: Caricamento dell'elenco delle tabelle in corso...

# sql.migration.database.migration.mode.description
source: To migrate to the Azure SQL target, choose a migration mode based on your downtime requirements.
it: Per eseguire la migrazione alla destinazione Azure SQL, scegliere una modalità di migrazione in base ai requisiti di inattività.

# sql.migration.database.migration.mode.label
source: Migration mode
it: Modalità di migrazione

# sql.migration.database.migration.mode.offline.description
source: Application downtime will start when the migration starts.
it: Il tempo di inattività dell'applicazione verrà avviato all'avvio della migrazione.

# sql.migration.database.migration.mode.offline.label
source: Offline migration
it: Migrazione offline

# sql.migration.database.migration.mode.online.description
source: Application downtime is limited to cutover at the end of migration.
it: Il tempo di inattività dell'applicazione è limitato al cutover al termine della migrazione.

# sql.migration.database.migration.mode.online.label
source: Online migration
it: Migrazione online

# sql.migration.database.migration.service
source: Database Migration Service
it: Servizio Migrazione del database

# sql.migration.database.migration.service.authentication.keys
source: Database Migration Service authentication keys
it: Chiavi di autenticazione del Servizio Migrazione del database

# sql.migration.database.migration.service.created.successfully
source: Successfully created a Database Migration Service.
it: La creazione di un Servizio Migrazione del database è stata completata.

# sql.migration.database.migration.status
source: Database migration status
it: Stato di migrazione del database

# sql.migration.database.migration.status.label
source: Database migration status: {0}
it: Stato della migrazione del database: {0}

# sql.migration.database.missing.tables
source: 0 tables found.
it: 0 tabelle trovate.

# sql.migration.database.page.description
source: Select the location of the database backups to use during migration.
it: Selezionare il percorso dei backup del database da usare durante la migrazione.

# sql.migration.database.status.column
source: Migration status
it: Stato della migrazione

# sql.migration.database.table.refresh.label
source: Refresh
it: Aggiorna

# sql.migration.database.table.selection.description
source: To migrate to the Azure SQL target, select tables in each database for migration.
it: Per eseguire la migrazione alla destinazione Azure SQL, selezionare le tabelle in ogni database per la migrazione.

# sql.migration.database.table.selection.label
source: Migration table selection
it: Selezione tabella di migrazione

# sql.migration.database.table.source.column.label
source: Source database
it: Database di origine

# sql.migration.database.table.tables.column.label
source: Select tables
it: Selezionare le tabelle

# sql.migration.database.table.target.column.label
source: Target database
it: Database di destinazione

# sql.migration.database.to.be.migrated
source: Database to be migrated
it: Database di cui eseguire la migrazione

# sql.migration.database.validate.selection
source: Please select target database tables to migrate to. At least one database with one table is required.
it: Selezionare le tabelle di database di destinazione in cui eseguire la migrazione. È necessario almeno un database con una tabella.

# sql.migration.databases
source: Databases ({0}/{1})
it: Database ({0}/{1})

# sql.migration.databases.selected
source: {0}/{1} databases selected
it: {0}/{1} database selezionati

# sql.migration.databases.table.title
source: Databases
it: Database

# sql.migration.day
source: {0} day
it: {0} giorni

# sql.migration.days
source: {0} days
it: {0} giorni

# sql.migration.default.database
source: Default database
it: Database predefinito

# sql.migration.description
source: Description
it: Descrizione

# sql.migration.details.breadcrumb.migrations
source: Migrations
it: Migrazioni

# sql.migration.details.copied
source: Details copied
it: Copia dei dettagli completata

# sql.migration.details.refresh
source: Refresh
it: Aggiorna

# sql.migration.details.serverobjects.all.tables.label
source: Total tables
it: Tabelle totali

# sql.migration.details.serverobjects.cancelled.tables.label
source: Cancelled
it: Annullato

# sql.migration.details.serverobjects.failed.tables.label
source: Failed
it: Non riuscita

# sql.migration.details.serverobjects.field.label
source: Server objects
it: Oggetti server

# sql.migration.details.serverobjects.filter.aria.label
source: Filter table migration results using keywords
it: Filtra i risultati della migrazione delle tabelle usando parole chiave

# sql.migration.details.serverobjects.filter.label
source: Filter table migration results
it: Filtra i risultati della migrazione della tabella

# sql.migration.details.serverobjects.inprogress.tables.label
source: In progress
it: In corso

# sql.migration.details.serverobjects.label
source: Server objects
it: Oggetti server

# sql.migration.details.serverobjects.successful.tables.label
source: Successful
it: Riuscita

# sql.migration.dms.location
source: Azure region for your Azure Database Migration Service. Only regions that contain a service will be shown.
it: Area di Azure per il Servizio Migrazione del database di Azure. Verranno visualizzate solo le aree che contengono un servizio.

# sql.migration.dms.provision.failed
source: Failed to provision a Database Migration Service. Wait a few minutes and then try again.
it: Non è stato possibile effettuare il provisioning di un Servizio Migrazione del database. Attendere qualche minuto, quindi riprovare.

# sql.migration.dms.resource
source: Your Azure Database Migration Service resource name
it: Nome della risorsa Servizio Migrazione del database di Azure

# sql.migration.dms.resource_group
source: Resource group for your Azure SQL target. Only resource groups that contain a service will be shown.
it: Gruppo di risorse per la destinazione Azure SQL. Verranno visualizzati solo i gruppi di risorse che contengono un servizio.

# sql.migration.dms.subscription
source: Subscription name for your Azure Database Migration Service
it: Gruppo di risorse per il Servizio Migrazione del database di Azure

# sql.migration.duration
source: Duration
it: Durata

# sql.migration.empty.table.subtext
source: If results were expected, verify the connection to the SQL Server instance.
it: Se sono previsti risultati, verificare la connessione all'istanza di SQL Server.

# sql.migration.empty.table.text
source: No backup files
it: Nessun file di backup

# sql.migration.enter.your.sql.cred
source: Enter the credentials for the source SQL Server instance. These credentials will be used while migrating databases to Azure SQL.
it: Immettere le credenziali per l'istanza di SQL Server di origine. Queste credenziali verranno usate durante la migrazione dei database ad Azure SQL.

# sql.migration.error
source: Error
it: Errore

# sql.migration.error.aria.view.details
source: Click to view error details
it: Fai clic per visualizzare i dettagli dell'errore

# sql.migration.error.details.label
source: Migration error(s))
it: Errore di migrazione:

# sql.migration.error.details.title
source: Migration error details
it: Dettagli sull'errore di migrazione

# sql.migration.error.dialog.clear.button.label
source: Clear
it: Cancella

# sql.migration.error.title
source: Migration status details
it: Dettagli sullo stato della migrazione

# sql.migration.failed
source: Database migrations failed
it: Migrazioni del database non riuscite

# sql.migration.feedback.issue.title
source: Feedback on the migration experience
it: Feedback sull'esperienza di migrazione

# sql.migration.file.name
source: File name
it: Nome file

# sql.migration.finish.time
source: Finish time
it: Ora di fine

# sql.migration.first.lsn
source: First LSN
it: Primo LSN

# sql.migration.full.backup.files
source: Full backup files
it: File di backup completi

# sql.migration.generic.congratulations
source: We have completed the assessment of your SQL Server instance '{0}'.
it: È stata completata la valutazione dell'istanza di SQL Server '{0}'.

# sql.migration.hr
source: {0} hr
it: {0} ora

# sql.migration.hrs
source: {0} hrs
it: {0} ore

# sql.migration.impact
source: Impact
it: Impatto

# sql.migration.impact.object.name
source: Name: {0}
it: Nome: {0}

# sql.migration.impact.object.type
source: Type: {0}
it: Tipo: {0}

# sql.migration.impacted.objects
source: Impacted objects
it: Oggetti interessati

# sql.migration.inline.migration.notebook.title
source: Inline migration
it: Migrazione inline

# sql.migration.inprogress.warning.multiple
source: {0} databases have warnings
it: {0} database presentano avvisi

# sql.migration.inprogress.warning.single
source: {0} database has warnings
it: {0} database presenta avvisi

# sql.migration.instance
source: Instance
it: Istanza

# sql.migration.invalid.account.error
source: To continue, select a valid Azure account.
it: Per continuare, selezionare un account Azure valido.

# sql.migration.invalid.blob.container.error
source: To continue, select a valid blob container for source database '{0}'.
it: Per continuare, selezionare un contenitore BLOB valido per il database di origine '{0}'.

# sql.migration.invalid.blob.lastBackupFile.error
source: To continue, select a valid last backup file for source database '{0}'.
it: Per continuare, selezionare un file di backup recente valido per il database di origine '{0}'.

# sql.migration.invalid.blob.resourceGroup.error
source: To continue, select a valid resource group for source database '{0}'.
it: Per continuare, selezionare un gruppo di risorse valido per il database di origine '{0}'.

# sql.migration.invalid.blob.storageAccount.error
source: To continue, select a valid storage account for source database '{0}'.
it: Per continuare, selezionare un account di archiviazione valido per il database di origine '{0}'.

# sql.migration.invalid.location.error
source: To continue, select a valid location.
it: Per continuare, selezionare una posizione valida.

# sql.migration.invalid.managedInstance.error
source: To continue, select a valid managed instance.
it: Per continuare, selezionare un'istanza gestita valida.

# sql.migration.invalid.migration.service.error
source: Select a valid Database Migration Service.
it: Selezionare un Servizio Migrazione del database valido.

# sql.migration.invalid.migration.service.offline.error
source: Select a Database Migration Service that is connected to a node.
it: Selezionare un Servizio Migrazione del database connesso a un nodo.

# sql.migration.invalid.network.share.location
source: Invalid network share location format. Example: {0}
it: Formato della posizione della condivisione di rete non valido. Esempio: {0}

# sql.migration.invalid.owner.uri.error
source: Cannot connect to the database due to invalid OwnerUri (Parameter 'OwnerUri')
it: Impossibile connettersi al database a causa di un OwnerUri invalido (parametro ‘OwnerUri’)

# sql.migration.invalid.resourceGroup.error
source: To continue, select a valid resource group.
it: Per continuare, selezionare un gruppo di risorse valido.

# sql.migration.invalid.savedInfo
source: Cannot retrieve saved session. Try again by selecting new session.
it: Impossibile recuperare la sessione salvata. Riprovare selezionando una nuova sessione.

# sql.migration.invalid.service.name.error
source: Enter a valid name for the Migration Service.
it: Immettere un nome valido per il Servizio Migrazione.

# sql.migration.invalid.sqldatabase.error
source: To continue, select a valid Azure SQL Database server.
it: Per continuare, selezionare un server di database SQL di Azure valido.

# sql.migration.invalid.storageAccount.error
source: To continue, select a valid storage account.
it: Per continuare, selezionare un account di archiviazione valido.

# sql.migration.invalid.subscription.error
source: To continue, select a valid subscription.
it: Per continuare, selezionare una sottoscrizione valida.

# sql.migration.invalid.target.name.error
source: Enter a valid name for the target database.
it: Immettere un nome valido per il database di destinazione.

# sql.migration.invalid.user.account
source: Invalid user account format. Example: {0}
it: Formato dell'account utente non valido. Esempio: {0}

# sql.migration.invalid.virtualMachine.error
source: To continue, select a valid virtual machine.
it: Per continuare, selezionare una macchina virtuale valida.

# sql.migration.ir.page.description
source: Azure Database Migration Service orchestrates database migration activities and tracks their progress. You can select an existing Database Migration Service if you have created one previously, or create a new one below.
it: Il Servizio Migrazione del database di Azure orchestra le attività di migrazione dei database e tiene traccia dei progressi. È possibile selezionare un Servizio Migrazione del database esistente, se ne è stato creato uno in precedenza, o crearne uno nuovo di seguito.

# sql.migration.ir.page.sql.migration.service.not.found
source: No Database Migration Service found. Create a new one.
it: Non è stato trovato alcun Servizio Migrazione del database. Crearne uno nuovo.

# sql.migration.ir.page.title
source: Azure Database Migration Service
it: Servizio Migrazione del database di Azure

# sql.migration.ir.setup.step1
source: Step 1: {0}
it: Passaggio 1: {0}

# sql.migration.ir.setup.step2
source: Step 2: Use this key to register your integration runtime
it: Passaggio 2: Usare questa chiave per registrare il runtime di integrazione

# sql.migration.ir.setup.step3
source: Step 3: Click on 'Test connection' button to check the connection between Azure Database Migration Service and integration runtime
it: Passaggio 3: Fare clic sul pulsante 'Test connessione' per controllare la connessione tra il Servizio Migrazione del database di Azure e il runtime di integrazione

# sql.migration.issue.aria.label
source: Blocking Issue: {0}
it: Causa del blocco: {0}

# sql.migration.issues
source: Issues
it: Problemi

# sql.migration.issues.count
source: Issues ({0})
it: Problemi ({0})

# sql.migration.issues.details
source: Issue details
it: Dettagli del problema

# sql.migration.key1.copied
source: Key 1 copied
it: Chiave 1 copiata

# sql.migration.key1.label
source: Key 1
it: Chiave 1

# sql.migration.key2.copied
source: Key 2 copied
it: Chiave 2 copiata

# sql.migration.key2.label
source: Key 2
it: Chiave 2

# sql.migration.last.LSN
source: Last LSN
it: Ultimo LSN

# sql.migration.last.applied.backup.files
source: Last applied backup files
it: Ultimi file di backup applicati

# sql.migration.last.applied.files.taken.on
source: Last applied backup files taken on
it: Data ultimi file di backup applicati

# sql.migration.last.applied.lsn
source: Last applied LSN
it: Ultimo LSN applicato

# sql.migration.last.scan.completed
source: Last scan completed: {0}
it: Ultima analisi completata: {0}

# sql.migration.learn.more
source: Learn more
it: Altre informazioni

# sql.migration.learn.more.prerequisites
source: Learn more about things you need before starting a migration.
it: Altre informazioni sulle operazioni necessarie prima di avviare una migrazione.

# sql.migration.load.migration.list.error
source: Error loading migrations list
it: Errore durante il caricamento dell'elenco delle migrazioni

# sql.migration.location
source: Location
it: Percorso

# sql.migration.map.source.column
source: Source database
it: Database di origine

# sql.migration.map.target.column
source: Target database
it: Database di destinazione

# sql.migration.map.target.description
source: Select the target database where you would like to migrate your source database to. You can choose a target database for only one source database.
it: Selezionare il database di destinazione in cui si vuole eseguire la migrazione del database di origine. È possibile scegliere un database di destinazione per un solo database di origine.

# sql.migration.map.target.heading
source: Map selected source databases to target databases for migration
it: Eseguire il mapping dei database di origine selezionati ai database di destinazione per la migrazione

# sql.migration.map.target.placeholder
source: Select a target database
it: Selezionare un database di destinazione

# sql.migration.mi.not.ready
source: The managed instance '{0}' is unavailable for migration because it is currently in the '{1}' state. To continue, select an available managed instance.
it: L'istanza gestita '{0}' non è disponibile per la migrazione perché si trova attualmente nello stato '{1}'. Per continuare, selezionare un'istanza gestita disponibile.

# sql.migration.migration.completed
source: Database migrations completed
it: Migrazioni del database completate

# sql.migration.migration.in.progress
source: Database migrations in progress
it: Migrazioni database in corso

# sql.migration.migration.list.ascending.label
source: Ascending
it: Crescente

# sql.migration.migration.list.sort.label
source: Sort
it: Ordina

# sql.migration.migration.status
source: Migration status
it: Stato di migrazione

# sql.migration.migration.status.filter
source: Migration status filter
it: Filtro dello stato della migrazione

# sql.migration.min
source: {0} min
it: {0} minuto

# sql.migration.mins
source: {0} mins
it: {0} minuti

# sql.migration.missing.targetPassword.error
source: To continue, enter a valid target password.
it: Per continuare, immettere una password di destinazione valida.

# sql.migration.missing.targetUserName.error
source: To continue, enter a valid target user name.
it: Per continuare, immettere un nome utente di destinazione valido.

# sql.migration.mode
source: Mode
it: Modalità

# sql.migration.more.info
source: More info
it: Altre informazioni

# sql.migration.na
source: N/A
it: N/D

# sql.migration.name
source: Name
it: Nome

# sql.migration.name.label
source: Names:
it: Nomi:

# sql.migration.name.of.new.rg
source: Name of new resource group
it: Nome del nuovo gruppo di risorse

# sql.migration.nc.blob.storage.radio.label
source: My database backups are in an Azure Storage Blob Container
it: I backup dei database personali si trovano in un contenitore BLOB del servizio di archiviazione di Azure

# sql.migration.nc.network.share.radio.label
source: My database backups are on a network share
it: I backup del database personale si trovano su una condivisione di rete

# sql.migration.network.share
source: Network share
it: Condivisione di rete

# sql.migration.network.share.azure.header
source: Storage account details
it: Dettagli dell'account di archiviazione

# sql.migration.network.share.azure.help
source: Provide the Azure Storage account where the backups will be uploaded to.
it: Specificare l'account di Archiviazione di Azure in cui verranno caricati i backup.

# sql.migration.network.share.header.text
source: Network share details
it: Dettagli sulla condivisione di rete
