Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# projBuildFailed
source: Build failed. Check output pane for more details. {0}
de: Fehler bei der Erstellung. Weitere Details finden Sie im Ausgabebereich. {0}
es: Error de compilación. Compruebe el panel de salida para obtener más detalles. {0}
fr: Échec de la génération. Vérifiez le volet de sortie pour plus de détails. {0}
it: Compilazione non riuscita. Per altri dettagli, controllare il riquadro di output. {0}
ja: ビルドに失敗しました。詳細については、出力ウィンドウを確認してください。{0}
ko: 빌드하지 못했습니다. 자세한 내용은 출력 창을 확인하세요. {0}
pt_br: Falha na compilação. Verifique o painel de saída para obter mais detalhes. {0}
ru: Ошибка сборки. Дополнительные сведения см. в области вывода. {0}
zh_hans: 生成已失败。有关更多详细信息，请查看输出窗格。{0}
zh_hant: 組建失敗。如需詳細資料，請查看輸出窗格。{0}

# projectAlreadyExists
source: A project named {0} already exists in {1}.
de: Ein Projekt mit dem Namen '{0}' ist bereits vorhanden in {1}.
es: Ya existe un proyecto con el nombre {0} en {1}.
fr: Un projet nommé {0} existe déjà dans {1}.
it: Esiste già un progetto con il nome {0} in {1}.
ja: {0} という名前のプロジェクトは既に {1} に存在します。
ko: 이름이 {0}인 프로젝트가 이미 {1}에 있습니다.
pt_br: Um projeto com nome {0} já existe em {1}.
ru: Проект с именем {0} уже существует в {1}.
zh_hans: 在 {1} 中已存在名为 {0} 的项目。
zh_hant: 名為 {0} 的專案已存在於 {1}。

# projectAlreadyOpened
source: Project '{0}' is already opened.
de: Das Projekt "{0}" ist bereits geöffnet.
es: El proyecto "{0}" ya está abierto.
fr: Le projet « {0} » est déjà ouvert.
it: Il progetto '{0}' è già aperto.
ja: プロジェクト '{0}' は既に開かれています。
ko: 프로젝트 '{0}'이(가) 이미 열려 있습니다.
pt_br: O projeto '{0}' já está aberto.
ru: Проект "{0}" уже открыт.
zh_hans: 已打开项目“{0}”。
zh_hant: 專案 '{0}' 已經開啟。

# projectLocString
source: Project
de: Projekt
es: Proyecto
ja: プロジェクト
pt_br: Projeto
ru: Проект
zh_hans: 项目
zh_hant: 專案

# projectLocationLabel
source: Location
de: Standort
es: Ubicación
it: Percorso
ja: 場所
ko: 위치
pt_br: Localização
ru: Расположение
zh_hant: 位置

# projectLocationPlaceholderText
source: Select location to create project
de: Speicherort zum Erstellen des Projekts auswählen
es: Seleccione la ubicación para crear el proyecto.
fr: Sélectionner l’emplacement de création du projet
it: Selezionare il percorso per creare il progetto
ja: プロジェクトを作成する場所の選択
ko: 프로젝트를 만들 위치 선택
pt_br: Selecione o local para criar o projeto
ru: Выберите расположение для создания проекта
zh_hans: 选择要创建项目的位置
zh_hant: 選取要建立專案的位置

# projectNameLabel
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# projectNamePlaceholderText
source: Enter project name
de: Geben Sie den Projektnamen ein
es: Escriba el nombre del proyecto.
fr: Entrer le nom du projet
it: Immettere il nome del progetto
ja: プロジェクト名を入力してください
ko: 프로젝트 이름 입력
pt_br: Inserir nome do projeto
ru: Введите имя проекта
zh_hans: 输入项目名
zh_hant: 輸入專案名稱

# projectNeedsUpdatingForCrossPlat
source: The targets, references, and system database references need to be updated to build the project '{0}'.
it: I target, i riferimenti e i riferimenti al database di sistema devono essere aggiornati per il progetto '{0}'.
pt_br: Os destinos, referências e referências do banco de dados do sistema precisam ser atualizados para construir o projeto '{0}'.

# projectReferenceElement
source: Project reference
de: Projektverweis
es: Referencia de proyecto
it: Riferimento al progetto
ja: プロジェクト参照
ko: 프로젝트 참조
pt_br: Referência do projeto
ru: Ссылка на проект
zh_hans: 项目引用
zh_hant: 專案參考

source: Project reference name element
de: Element „Projektverweisname“
es: Elemento de nombre de referencia del proyecto
it: Elemento del nome del riferimento al progetto
ja: プロジェクト参照名の要素
ko: 프로젝트 참조 이름 요소
pt_br: Elemento do nome da referência do projeto
ru: Элемент имени ссылки на проект
zh_hans: 项目引用名称元素
zh_hant: 專案參考名稱元素

# projectToUpdatePlaceholderText
source: Select project file
de: Projektdatei auswählen
es: Seleccionar el archivo del proyecto
it: Seleziona file di progetto
ja: プロジェクト ファイルの選択
ko: 프로젝트 파일 선택
pt_br: Selecionar o arquivo do projeto
ru: Выберите файл проекта
zh_hant: 選取專案檔

# projectUpdatedToSdkStyle
source: The project {0} has been updated to be an SDK-style project. Click 'Learn More' for details on the Microsoft.Build.Sql SDK and ways to simplify the project file.
de: Das Projekt {0} wurde nach dem Aktualisieren zu einem SDK-Style-Projekt umgewandelt. Klicken Sie auf \"Weitere Informationen\", um Details zum Microsoft.Build.Sql-SDK und Möglichkeiten zum Vereinfachen der Projektdatei zu erhalten.
es: El proyecto {0} se ha actualizado para que sea un proyecto de estilo SDK. Haga clic en \"Más información\" para obtener detalles sobre el SDK de Microsoft.Build.Sql y las formas de simplificar el archivo de proyecto.
it: Il progetto {0} è stato aggiornato in modo da essere un progetto di tipo SDK. Per informazioni dettagliate su Microsoft.Build.Sql SDK e su come semplificare il file di progetto, fare clic su 'Altre informazioni'.
ja: プロジェクト {0} が SDK スタイル プロジェクトに更新されました。Microsoft.Build.Sql SDK の詳細とプロジェクト ファイルを簡略化する方法については、[詳細情報] をクリックしてください。
ko: 프로젝트 {0}이(가) SDK 스타일 프로젝트로 업데이트되었습니다. Microsoft.Build.Sql SDK에 대한 자세한 내용과 프로젝트 파일을 단순화하는 방법은 '자세한 정보'를 클릭하세요.
pt_br: O projeto {0} foi atualizado para ser um projeto no estilo SDK. Clique em 'Saiba Mais' para obter detalhes sobre o SDK do Microsoft.Build.Sql e maneiras de simplificar o arquivo de projeto.
ru: Проект {0} был обновлен как проект в стиле SDK. Щелкните \"Подробнее\", чтобы получить сведения о пакете SDK для Microsoft.Build.Sql и способах упрощения файла проекта.
zh_hant: 專案 {0} 已更新為 SDK 樣式專案。按一下 [深入了解] 以取得 Microsoft.Build.Sql SDK 的詳細資料，以及簡化專案檔的方式。

source: Publish
de: Veröffentlichen
es: Publicar
fr: Publier
it: Pubblica
ja: 公開
ko: 게시
pt_br: Publicar
ru: Опубликовать
zh_hans: 发布
zh_hant: 發佈

# publishAction
source: Publish
de: Veröffentlichen
es: Publicar
fr: Publier
it: Pubblica
ja: 公開
ko: 게시
pt_br: Publicar
ru: Опубликовать
zh_hans: 发布
zh_hant: 發佈

# publishDialogName
source: Publish project
de: Projekt veröffentlichen
es: Publicación del proyecto
fr: Publier le projet
it: Pubblicare il progetto
ja: プロジェクトの発行
ko: 프로젝트 게시
pt_br: Publicar projeto
ru: Опубликовать проект
zh_hans: 发布项目
zh_hant: 發佈專案

source: Publish Options
de: Veröffentlichung Optionen
es: Opciones de publicación
it: Pubblicare opzioni
ja: 公開オプション
ko: 게시 옵션
pt_br: Opções de Publicação
ru: Параметры публикации
zh_hant: 發佈選項

source: Publish profile elements
it: Elementi del profilo di pubblicazione
pt_br: Publicar elementos de perfil

# publishProjectSucceed
source: Database project published successfully
de: Das Datenbankprojekt wurde erfolgreich veröffentlicht
es: Proyecto de base de datos publicado correctamente
fr: Projet de base de données publié avec succès
it: Il progetto di database è stato pubblicato
ja: データベース プロジェクトが正常に公開されました
ko: 데이터베이스 프로젝트를 게시했습니다.
pt_br: Projeto de banco de dados publicado com êxito
ru: Проект базы данных успешно опубликован
zh_hans: 已成功发布数据库项目
zh_hant: 已成功發佈資料庫專案

# publishSettingsFiles
source: Publish Settings File
de: Einstellungsdatei veröffentlichen
es: Archivo de configuración de publicación
fr: Fichier de paramètres de publication
it: File di impostazioni di pubblicazione
ja: 公開の設定ファイル
ko: 설정 파일 게시
pt_br: Publicar arquivo de configurações
ru: Опубликовать файл параметров
zh_hans: 发布设置文件
zh_hant: 發佈設定檔案

# publishTo
source: Publish Target
de: Ziel veröffentlichen
es: Publicar destino
it: Destinazione di pubblicazione
ja: ターゲットの公開
ko: 대상 게시
pt_br: Destino de Publicação
ru: Опубликовать целевой объект
zh_hans: 发布目标
zh_hant: 發佈目標

# publishToAzureEmulator
source: Publish to new Azure SQL Database emulator
de: In neuem Azure SQL-Datenbank Emulator veröffentlichen
es: Publicar en el nuevo emulador de Azure SQL Database
it: Pubblicare nel nuovo emulatore di database SQL di Azure
ja: 新しい Azure SQL Database エミュレーターに発行する
ko: 새 Azure SQL Database 에뮬레이터에 게시
pt_br: Publicar em um novo emulado do Banco de Dados SQL do Azure
ru: Опубликовать в новом эмуляторе базы данных SQL Azure
zh_hant: 發佈到新的 Azure SQL 資料庫模擬器

# publishToContainerFailed
source: Failed to publish to container. {0}
de: Fehler beim Veröffentlichen im Container. {0}
es: No se pudo publicar en el contenedor. {0}
fr: Échec de la publication dans le conteneur. {0}
it: Pubblicazione nel contenitore non riuscita. {0}
ja: コンテナーを公開できませんでした。{0}
ko: 컨테이너에 게시하지 못했습니다. {0}
pt_br: Falha ao publicar no contêiner. {0}
ru: Не удалось опубликовать в контейнере. {0}
zh_hans: 未能发布到容器。{0}
zh_hant: 無法發佈至容器。{0}

# publishToDockerContainer
source: Publish to new {0} local development container
de: In neuem {0} lokalen Entwicklungscontainer veröffentlichen
es: Publicar en el nuevo contenedor de desarrollo local de {0}
it: Pubblica in un nuovo contenitore di sviluppo locale {0}
ja: 新しい {0} ローカル開発コンテナーに発行します
ko: 새 {0} 로컬 개발 컨테이너에 게시
pt_br: Publicar em um novo {0} contêiner de desenvolvimento local
ru: Опубликовать в новом {0} контейнере локальной разработки
zh_hant: 發佈到新的 {0} 本機開發容器

# publishToDockerContainerPreview
source: Publish to new {0} local development container (Preview)
it: Pubblica nel nuovo contenitore di sviluppo locale {0} (anteprima)
pt_br: Publicar no novo contêiner de desenvolvimento local {0} (Versão prévia)

# publishToExistingServer
source: Publish to an existing {0}
de: In einem vorhandenen {0} veröffentlichen
es: Publicar en un {0} existente
it: Pubblica in un {0} esistente
ja: 既存の {0} に発行します
ko: 기존 {0}에 게시합니다.
pt_br: Publicar em uma {0} existente
ru: Опубликовать в существующем {0}
zh_hant: 發佈到現有的 {0}

# publishToNewAzureServer
source: Publish to new Azure SQL logical server (Preview)
it: Pubblica nel nuovo server logico di Azure SQL (anteprima)
pt_br: Publicar no novo servidor lógico SQL do Azure (visualização)

# publishToNewAzureServerFailed
source: Failed to publish to new Azure SQL server. {0}
de: Fehler beim Veröffentlichen auf dem neuen Azure SQL Server. {0}
es: No se pudo publicar en el nuevo servidor de Azure SQL. {0}
it: Non è stato possibile pubblicare nel nuovo server di Azure SQL. {0}
ja: 新しい Azure SQL サーバーに公開できませんでした。{0}
ko: 새 Azure SQL 서버에 게시하지 못했습니다. {0}
pt_br: Falha ao publicar no novo servidor do SQL do Azure. {0}
ru: Не удалось опубликовать на новом сервере Azure SQL. {0}
zh_hant: 無法發佈到新的 Azure SQL 伺服器。{0}

# publishingProjectMessage
source: Publishing project in a container...
de: Veröffentlicht das Projekt in einem Container...
es: Publicando proyecto en un contenedor...
fr: Projet de publication dans un conteneur...
it: Pubblicazione del progetto in un contenitore...
ja: コンテナーでプロジェクトを公開しています...
ko: 컨테이너에 프로젝트를 게시하는 중...
pt_br: Publicando projeto em um contêiner...
ru: Публикация проекта в контейнере...
zh_hans: 正在容器中发布项目...
zh_hant: 正在發佈容器中的專案...

# referenceRadioButtonsGroupTitle
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
ru: Тип
zh_hans: 类型
zh_hant: 類型

source: Reference type
de: Referenztyp
es: Tipo de referencia
fr: Type référence
it: Tipo riferimento
ja: 参照型
ko: 참조 형식
pt_br: Tipo de referência
ru: Тип ссылки
zh_hans: 引用类型
zh_hant: 參考型別

# reloadProject
source: Would you like to reload your database project?
de: Möchten Sie Ihr Datenbankprojekt neu laden?
es: ¿Quiere volver a cargar el proyecto de base de datos?
fr: Voulez-vous recharger votre projet de base de données ?
it: Ricaricare il progetto di database?
ja: データベース プロジェクトを再読み込みしますか?
ko: 데이터베이스 프로젝트를 다시 로드하시겠습니까?
pt_br: Deseja recarregar seu projeto de banco de dados?
ru: Вы хотите перезагрузить проект базы данных?
zh_hans: 是否希望重新加载数据库项目?
zh_hant: 要重新載入資料庫專案嗎?

source: Reset
de: Zurücksetzen
es: Restablecer
it: Reimpostare
ja: リセット
ko: 다시 설정
pt_br: Redefinir
ru: Сбросить
zh_hant: 重設

# resetAllVars
source: Reset all variables
de: Alle Variablen zurücksetzen
es: Restablecer todas las variables
fr: Réinitialiser toutes les variables
it: Reimpostare tutte le variabili
ja: すべての変数をリセットする
ko: 모든 변수 다시 설정
pt_br: Redefinir todas as variáveis
ru: Сбросить все переменные
zh_hans: 重置所有变量
zh_hant: 重設所有變數

source: Resource group
de: Ressourcengruppe
es: Grupo de recursos
it: Gruppo di risorse
ja: リソース グループ
ko: 리소스 그룹
pt_br: Grupo de recursos
ru: Группа ресурсов
zh_hant: 資源群組

# retryFailedMessage
source: Operation '{0}' failed. Re-trying... Current Result: {1}. Error: '{2}'
de: Fehler beim Vorgang "{0}". Versuchen Sie es erneut... Aktuelles Ergebnis: {1}. Fehler: "{2}"
es: Error en la operación "{0}". Volviendo a intentarlo... Resultado actual: {1}. Error: "{2}"
fr: Échec de l’opération «{0}». Nouvelle tentative... Résultat actuel : {1}. Erreur : «{2}»
it: Operazione '{0}' non riuscita. Nuovo tentativo... Risultato corrente: {1}. Errore: '{2}'
ja: 操作 '{0}' に失敗しました。再試行しています...現在の結果: {1}。エラー: '{2}'
ko: 작업 '{0}'이(가) 실패함. 다시 시도하는 중... 현재 결과: {1}. 오류: '{2}'
pt_br: Falha na operação '{0}'. Tentando novamente... Resultado Atual: {1}. Erro: '{2}'
ru: Не удалось выполнить операцию "{0}". Повторная попытка... Текущий результат: {1}. Ошибка: "{2}"
zh_hans: 操作 "{0}" 失败。正在重试...当前结果: {1}。错误: "{2}"
zh_hant: 作業 '{0}' 失敗。正在重新嘗試... 目前的結果: {1}。錯誤: '{2}'

# retryMessage
source: Operation '{0}' failed. Re-trying... Error: '{1}'
de: Fehler beim Vorgang \"{0}\". Versuchen Sie es erneut... Fehler: \"{1}\"
es: Error en la operación \"{0}\". Volviendo a intentarlo... Error: \"{1}\"
it: Operazione '{0}' non riuscita. Nuovo tentativo... Errore: '{1}'
ja: 操作 '{0}' に失敗しました。再試行しています... エラー: '{1}'
ko: 작업 '{0}'이(가) 실패함. 다시 시도하는 중... 오류: '{1}'
pt_br: Falha na operação '{0}'. Tentando novamente... Erro: '{1}'
ru: Не удалось выполнить операцию \"{0}\". Повторная попытка... Ошибка: \"{1}\"
zh_hant: 作業 '{0}' 失敗。正在重新嘗試...錯誤: '{1}'

# retryRunMessage
source: Running operation '{2}' Attempt {0} of {1}
de: Der Vorgang "{2}" wird ausgeführt. Versuch {0} von {1}
es: Se está ejecutando la operación "{2}". Intento {0} de {1}
fr: Exécution de l’opération «{2}» tentative {0} de {1}
it: Esecuzione dell'operazione '{2}' Tentativo {0} di {1}
ja: 操作 '{2}' を実行しています。{1} の {0} を試みます
ko: 작업 '{2}' 실행 중 {0}/{1} 시도
pt_br: Executando operação '{2}' Tentativa {0} de {1}
ru: Выполнение операции "{2}". Попытка {0} из {1}
zh_hans: 正在运行操作 "{2}"，第 {0} 次尝试(共 {1} 次)
zh_hant: 執行作業 '{2}' 嘗試 {0} / {1}

# retrySucceedMessage
source: Operation '{0}' completed successfully. Result: {1}
de: Der Vorgang "{0}" wurde erfolgreich abgeschlossen. Ergebnis: {1}
es: La operación "{0}" se completó correctamente. Resultado: {1}
fr: L’opération «{0}» s’est terminée correctement. Résultat : {1}
it: Operazione '{0}' completata. Risultato: {1}
ja: 操作 '{0}' が正常に完了しました。結果: {1}
ko: 작업 '{0}'이(가) 완료됨. 결과: {1}
pt_br: Operação '{0}' concluída com êxito. Resultado: {1}
ru: Операция "{0}" успешно завершена. Результат: {1}
zh_hans: 操作 "{0}" 已成功完成。结果: {1}
zh_hant: 作業 '{0}' 已成功完成。結果: {1}

# retryWaitMessage
source: Waiting for {0} seconds before another attempt for operation '{1}'
de: Es wird auf {0} Sekunden gewartet, bevor ein weiterer Versuch für den Vorgang "{1}" ausgeführt wird.
es: Esperando {0} segundos antes de otro intento de la operación "{1}"
fr: En attente de {0} secondes avant une autre tentative d’opération «{1}»
it: Attesa di {0} secondi prima di un altro tentativo di operazione '{1}'
ja: 操作 '{1}' をもう一度実行する前に、{0}秒間待機しています
ko: 작업 '{0}'에 대한 다른 시도 전에 {1}초 동안 대기
pt_br: Aguardando {0} segundos antes de outra tentativa de operação '{1}'
ru: Ожидание {0} сек. до выполнения другой попытки операции "{1}"
zh_hans: 正在等待 {0} 秒，然后再次尝试执行操作 "{1}"
zh_hant: 在另一次嘗試作業 '{0}' 之前等候 {1} 秒

# revertSqlCmdVarsButtonTitle
source: Revert values to project defaults
it: Ripristina valori predefiniti del progetto
pt_br: Reverter valores para os padrões do projeto

source: Run via npx
de: Ausführen über npx
es: Ejecutar mediante npx
it: Esegui tramite npx
ja: npx を介して実行する
ko: npx를 통해 실행
pt_br: Executar por meio de npx
ru: Запустить через npx
zh_hans: 通过 npx 运行
zh_hant: 透過 npx 執行

# runningDockerMessage
source: Running the docker container ...
de: Dockercontainer wird ausgeführt ...
es: Ejecutando el contenedor Docker...
it: Esecuzione del contenitore Docker in corso...
ja: Docker コンテナーを実行しています ...
ko: Docker 컨테이너를 실행하는 중...
pt_br: Executando o contêiner do Docker ...
ru: Запуск контейнера Docker...
zh_hant: 正在執行 Docker 容器...

source: Same database
de: Dieselbe Datenbank
es: Misma base de datos
fr: Même base de données
it: Stesso database
ja: 同じデータベース
ko: 동일한 데이터베이스
pt_br: Mesmo banco de dados
ru: Та же база данных
zh_hans: 同一数据库
zh_hant: 相同資料庫

source: Save
fr: Enregistrer
it: Salva
pt_br: Salvar
zh_hans: 保存

# saveProfileAsButtonText
source: Save As...
it: Salva con nome...
pt_br: Salvar como...

source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
ko: 스키마
pt_br: Esquema
ru: Схема
zh_hans: 架构
zh_hant: 結構描述

# schemaCompare.compareErrorMessage
source: Schema Compare failed: {0}
de: Fehler beim Schemavergleich: {0}
es: Error en la comparación de esquemas: {0}
it: Il confronto schemi non è riuscito: {0}
ja: Schema Compare に失敗しました: {0}
ko: 스키마 비교 실패: {0}
pt_br: Falha na Comparação de Esquemas: {0}
ru: Сбой при сравнении схем: {0}
zh_hant: 結構描述比較失敗: {0}

# schemaCompareAction
source: Schema Compare
de: Schemavergleich
es: Comparar esquemas
fr: Comparer les schémas
it: Confronto schemi
ko: 스키마 비교
pt_br: Comparação de Esquemas
ru: Сравнение схем
zh_hans: 架构比较
zh_hant: 結構描述比較

# schemaCompareNotInstalled
source: Schema compare extension installation is required to run schema compare
de: Es ist erforderlich, die Schemavergleichserweiterung zu installieren, um den Schemavergleich auszuführen.
es: Se requiere la instalación de la extensión de comparación de esquemas para ejecutar la comparación de esquemas.
fr: L'installation de l'extension de comparaison de schémas est nécessaire pour exécuter la comparaison de schémas.
it: Per eseguire il confronto tra schemi, è necessaria l'installazione dell'estensione per il confronto dello schema
ja: スキーマ比較を実行するには、スキーマ比較拡張機能をインストールする必要があります
ko: 스키마 비교를 실행하려면 스키마 비교 확장 설치가 필요합니다.
pt_br: A instalação da extensão de comparação de esquema é necessária para executar a comparação de esquema
ru: Для запуска сравнения схем требуется установка расширения сравнения схемы
zh_hans: 需要安装架构比较扩展才能运行架构比较
zh_hant: 需要安裝結構描述比較延伸模組，才能執行結構描述比較

source: Schema/Object Type
de: Schema/Objekttyp
es: Tipo de esquema u objeto
fr: Schéma\Type d'objet
it: Schema/Tipo di oggetto
ja: スキーマ/オブジェクトの種類
ko: 스키마/개체 형식
pt_br: Tipo de esquema/objeto
ru: Схема или тип объекта
zh_hans: 架构/对象类型
zh_hant: 結構描述/物件類型

# sdkLearnMorePlaceholder
source: Click "Learn More" button for more information about SDK-style projects
de: Klicken Sie auf die Schaltfläche „Weitere Informationen“, um weitere Informationen zu Projekten im SDK-Stil zu erhalten.
es: Haga clic en el botón "Más información" para obtener más información sobre los proyectos de estilo SDK
it: Fare clic sul pulsante "Altre informazioni" per altre informazioni sui progetti in stile SDK
ja: SDK スタイルのプロジェクトの詳細については、[詳細情報] ボタンをクリックしてください
ko: SDK 스타일 프로젝트에 관한 자세한 내용을 보려면 "자세한 정보" 버튼을 클릭합니다.
pt_br: Clique no botão "Saiba mais" para obter mais informações sobre projetos no estilo SDK
ru: Нажмите кнопку "Подробнее", чтобы получить дополнительные сведения о проектах в стиле пакета SDK.
zh_hant: 按一下 [深入了解] 按鈕以深入了解 SDK 樣式專案

# sdkStyleProject
source: SDK-style project (Preview)
de: Projekte im SDK-Stil (Vorschau)
es: Proyecto de estilo SDK (versión preliminar)
it: Progetto in stile SDK (Anteprima)
ja: SDK スタイルのプロジェクト (プレビュー)
ko: SDK 스타일 프로젝트(미리 보기)
pt_br: Projeto no estilo SDK (versão prévia)
ru: Проект в стиле пакета SDK (предварительная версия)
zh_hant: SDK 樣式專案 (預覽)

source: sec
de: Sek.
es: s
fr: s
ja: 秒
ko: 초
pt_br: seg
ru: с
zh_hans: 秒
zh_hant: 秒

# selectBaseImage
source: Select the base {0} docker image
de: Wählen Sie das Basis- {0} Docker-Image aus
es: Seleccionar la imagen base {0} de Docker
it: Selezionare l'immagine Docker {0} di base
ja: 基本の {0} Docker イメージを選択してください
ko: 기본 {0} docker 이미지를 선택합니다.
pt_br: Selecione a imagem base {0} do Docker
ru: Выберите базовый образ Docker {0}
zh_hant: 選取基底 {0} docker 映像

source: Select connection
de: Verbindung auswählen
es: Seleccionar conexión
fr: Sélectionner la connexion
it: Selezionare la connessione
ja: 接続の選択
ko: 연결 선택
pt_br: Selecionar a conexão
ru: Выберите подключение
zh_hans: 选择连接
zh_hant: 選取連線

source: Select .dacpac
de: DACPAC auswählen
es: Seleccione .dacpac.
fr: Sélectionner .dacpac
it: Selezionare .dacpac
ja: .dacpac を選択します
ko: .dacpac 선택
pt_br: Selecione .dacpac
ru: Выберите файл DACPAC
zh_hans: 选择 .dacpac
zh_hant: 選取 .dacpac

source: Select database
de: Datenbank auswählen
es: Seleccionar base de datos
fr: Sélectionner une base de données
it: Selezionare database
ja: データベースを選択してください
ko: 데이터베이스 선택
pt_br: Selecionar o banco de dados
ru: Выберите базу данных.
zh_hans: 选择数据库
zh_hant: 選取資料庫

# selectFileString
source: Select File
de: Datei auswählen
es: Seleccionar archivo
it: Seleziona file
ja: ファイルの選択
ko: 파일 선택
pt_br: Selecionar Arquivo
ru: Выберите файл
zh_hant: 選取檔案

source: Select folder structure
de: Ordnerstruktur auswählen
es: Seleccione la estructura de carpetas
fr: Sélectionner une structure de dossiers
it: Seleziona struttura di cartelle
ja: フォルダー構造の選択
ko: 폴더 구조 선택
pt_br: Selecione a estrutura de pastas
ru: Выбор структуры папок
zh_hans: 选择文件夹结构
zh_hant: 選取資料夾結構

# selectImageTag
source: Select the image tag or press enter to use the default value
de: Wählen Sie das Imagetag aus, oder drücken Sie die EINGABETASTE, um den Standardwert zu verwenden.
es: Seleccione la etiqueta de imagen o presione Entrar para usar el valor predeterminado
it: Selezionare il tag immagine o premere INVIO per usare il valore predefinito
ja: イメージ タグを選択するか、Enter キーを押して既定値を使用します
ko: 이미지 태그를 선택하거나 Enter 키를 눌러 기본값을 사용하세요.
pt_br: Selecione o rótulo da imagem ou pressione Enter para usar o valor padrão
ru: Выберите тег изображения или нажмите клавишу ВВОД, чтобы использовать значение по умолчанию
zh_hant: 選取影像標籤，或按 Enter 以使用預設值

source: Select Profile
de: Profil auswählen
es: Seleccionar perfil
fr: Sélectionner un profil
it: Seleziona profilo
ja: プロファイルの選択
ko: 프로필 선택
pt_br: Selecionar o perfil
ru: Выберите профиль
zh_hans: 选择配置文件
zh_hant: 選取設定檔

# selectProfileToUse
source: Select publish profile to load
de: Wählen Sie ein Veröffentlichungsprofil zum Laden aus
es: Seleccionar el perfil de publicación que se va a cargar.
fr: Sélectionner le profil de publication à charger
it: Selezionare il profilo di pubblicazione da caricare
ja: 読み込む発行プロファイルを選択してください
ko: 로드할 게시 프로필 선택
pt_br: Selecionar perfil de publicação a ser carregado
ru: Выберите профиль публикации для загрузки
zh_hans: 选择要加载的发布配置文件
zh_hant: 選取要載入的發行設定檔

source: Select project location
de: Projektspeicherort auswählen
es: Seleccione la ubicación del proyecto
fr: Sélectionner l’emplacement du projet
it: Seleziona posizione del progetto
ja: プロジェクトの場所を選択
ko: 프로젝트 위치 선택
pt_br: Selecione o local do projeto
ru: Выбрать расположение проекта
zh_hans: 选择项目位置
zh_hant: 選取專案位置

# selectPublishOption
source: Select where to publish the project to
de: Auswählen, wo das Projekt veröffentlicht werden soll
es: Seleccione dónde publicar el proyecto
fr: Sélectionnez l’emplacement de déploiement du projet sur
it: Selezionare la posizione in cui pubblicare il progetto
ja: プロジェクトの公開先を選択します
ko: 프로젝트를 게시할 위치 선택
pt_br: Selecionar onde publicar o projeto
ru: Выберите место публикации проекта.
zh_hans: 选择要将项目发布到的位置
zh_hant: 選取要將專案發佈的位置

# selectSpecFile
source: Select OpenAPI/Swagger spec file
de: OpenAPI/Swagger-Spezifikationsdatei auswählen
es: Seleccionar archivo de especificación de OpenAPI/Swagger
fr: Sélectionner un fichier de spécification OpenAPI/Swagger
it: Selezionare il file delle specifiche OpenAPI/Swagger
ja: OpenAPI または Swagger 仕様ファイルを選択してください
ko: OpenAPI/Swagger 사양 파일 선택
pt_br: Selecione o arquivo de especificação OpenAPI/Swagger
ru: Выберите файл спецификации OpenAPI/Swagger
zh_hans: 选择 OpenAPI/Swagger 规范文件
zh_hant: 選取 OpenAPI/Swagger 規格檔案
