Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-migration.*.xlf
Languages: it

# azure.accounts.accountAccessError
source: An error occurred while accessing the selected account '{0}' and tenant '{1}'. Select 'Link account' and refresh the account, or select a different account. Error '{2}'
it: Si è verificato un errore durante l'accesso all'account selezionato '{0}' e il tenant '{1}'. Selezionare 'Collega account' e aggiornare l'account oppure selezionare un account diverso. Errore: '{2}'

# azure.accounts.accountStaleError
source: The access token for selected account '{0}' and tenant '{1}' is no longer valid. Select 'Link account' and refresh the account, or select a different account.
it: Il token di accesso per l'account selezionato '{0}' e il tenant '{1}' non è più valido. Selezionare 'Collega account' per aggiornare l'account o selezionare un account diverso.

# sql-migration.login.wizard.title
source: Migrate logins from '{0}' to Azure SQL
it: Eseguire la migrazione degli account di accesso da '{0}' a Azure SQL

# sql-migration.wizard.title
source: Migrate '{0}' to Azure SQL
it: Eseguire la migrazione di '{0}' a Azure SQL

# sql.cancel.migration.confirmation
source: Are you sure you want to cancel this migration?
it: Annullare la migrazione?

# sql.login.migration..error
source: Login migration error: {0}
it: Errore di migrazione dell'account di accesso: {0}

# sql.login.migration.complete
source: Completed migrating logins
it: La migrazione degli account di accesso è stata completata

# sql.login.migration.db.title
source: Azure SQL Database
it: Database SQL di Azure

# sql.login.migration.establish.user.mappings
source: Validating and migrating logins completed. Establishing user mappings.
it: Convalida e migrazione degli account di accesso completate. Definizione dei mapping utente.

# sql.login.migration.establish.user.mappings.failed
source: Establishing user mappings failed
it: La definizione dei mapping utente non è riuscita

# sql.login.migration.failed
source: Migrating logins failed
it: La migrazione degli account di accesso non è riuscita

# sql.login.migration.in.progress
source: Login migration in progress
it: Migrazione dell'account di accesso in corso

# sql.login.migration.logins.found
source: Login found
it: Account di accesso trovato

# sql.login.migration.logins.not.found
source: Login not found
it: Account di accesso non trovato

# sql.login.migration.mi.title
source: Azure SQL Managed Instance
it: Istanza gestita di SQL di Azure

# sql.login.migration.migrate.server.roles.and.set.permissions
source: Establishing user mappings completed. Currently, migrating server roles, establishing server mappings and setting permissions. This will take some time.
it: Definizione dei mapping utente completata. È in corso la migrazione dei ruoli del server, la creazione di mapping del server e l'impostazione delle autorizzazioni. L'operazione richiederà qualche minuto.

# sql.login.migration.migrate.server.roles.and.set.permissions.failed
source: Migrating server roles, establishing server mappings and setting permissions failed.
it: La migrazione dei ruoli del server, la creazione di mapping del server e l'impostazione delle autorizzazioni non sono riuscite.

# sql.login.migration.migration.status.column
source: Migration Status
it: Stato di migrazione

# sql.login.migration.refresh.login.data.successful
source: Refreshing login list was successful. Source logins found {0}, Target logins found {1}
it: L'aggiornamento dell'elenco di accesso è riuscito. Account di accesso di origine trovati {0}. Account di accesso di destinazione trovati {1}

# sql.login.migration.refresh.source.login.data.failed
source: Refreshing login list from source failed
it: Aggiornamento dell'elenco di accesso dall'origine non è riuscito

# sql.login.migration.refresh.target.login.data.failed
source: Refreshing login list from target failed
it: L'aggiornamento dell'elenco di accesso dalla destinazione non è riuscito

# sql.login.migration.select.in.progress
source: Refreshing login list from source and target
it: Aggiornamento dell'elenco di accesso dall'origine e dalla destinazione

# sql.login.migration.select.logins.windows.auth.warning
source: Please note that this wizard does not display windows authentication login types because migrating that type is currently not supported. Capability for migrating windows authentication logins is coming soon.
it: Questa procedura guidata non visualizza i tipi di accesso per l'autenticazione di Windows perché la migrazione di questo tipo non è attualmente supportata. La funzionalità per la migrazione degli account di accesso per l'autenticazione di Windows sarà presto disponibile.

# sql.login.migration.select.page.title
source: Select login(s) to migrate
it: Selezionare gli account di accesso di cui eseguire la migrazione

# sql.login.migration.status.column
source: Status
it: Stato

# sql.login.migration.status.failed
source: Failed
it: Non riuscita

# sql.login.migration.status.in.progress
source: In progress
it: In corso

# sql.login.migration.status.page.description
source: Migrating {0} logins to target {1} '{2}'
it: La migrazione degli account di accesso {0} alla destinazione {1} '{2}'

# sql.login.migration.status.page.description.completed
source: Completed migrating {0} logins to {1} '{2}'
it: La migrazione degli account di accesso {0} a {1} '{2}' è stata completata

# sql.login.migration.status.page.description.failed
source: Failed migrating {0} logins to {1} '{2}'
it: La migrazione degli account di accesso {0} a {1} '{2}' non è riuscita

# sql.login.migration.status.page.previous.button.error
source: Login migration has already been initiated and going back to prior page is disabled.
it: La migrazione degli account di accesso è già stata avviata e il ritorno alla pagina precedente è disabilitato.

# sql.login.migration.status.page.previous.button.title
source: Previous (Disabled)
it: Precedente (disabilitato)

# sql.login.migration.status.page.title
source: Migration Status
it: Stato di migrazione

# sql.login.migration.status.succeeded
source: Succeeded
it: Riuscita

# sql.login.migration.target.status.column
source: Target Status
it: Stato di destinazione

# sql.login.migration.target.title
source: Azure SQL target
it: Destinazione di Azure SQL

# sql.login.migration.type
source: Login type
it: Tipo di account di accesso

# sql.login.migration.vm.title
source: SQL Server on Azure Virtual Machine
it: SQL Server per la macchina virtuale di Azure

# sql.login.migration.wizard.target.connection.success
source: Connection was successful.
it: Connessione riuscita.

# sql.login.migration.wizard.target.data.migration.warning
source: Please note that login migration feature is in private preview mode.
it: Si noti che la funzionalità di migrazione degli account di accesso è in modalità di anteprima privata.

# sql.login.migration.wizard.target.description
source: Select the target Azure SQL Managed Instance, Azure SQL VM, or Azure SQL database(s) where you want to migrate your logins.
it: Selezionare l’Istanza gestita di SQL di Azure di destinazione, VM di Azure SQL o Database SQL di Azure o in cui si vuole eseguire la migrazione degli account di accesso.

# sql.login.migration.wizard.target.permission.warning
source: Please ensure that the current user has sysadmin permissions to get all login information for the current instance ({0}).
it: Assicurarsi che l'utente corrente disponga delle autorizzazioni sysadmin per ottenere tutte le informazioni di accesso per l'istanza corrente ({0}).

# sql.login.migration.wizard.target.type.title
source: Azure SQL target type
it: Tipo di destinazione di Azure SQL

# sql.login.migrations.selected
source: {0}/{1} logins selected
it: {0}/{1} account di accesso selezionati

# sql.migrate.text
source: Select the databases that you want to migrate to Azure SQL.
it: Selezionare i database per cui si desidera eseguire la migrazione ad Azure SQL.

# sql.migration.account.credentials.refresh.required
source: {0} (requires credentials refresh)
it: {0} (richiede l'aggiornamento delle credenziali)

# sql.migration.active.backup.files
source: Active backup files
it: File di backup attivi

# sql.migration.active.backup.files.items
source: Active backup files (1 item)
it: File di backup attivi (1 elemento)

# sql.migration.active.backup.files.multiple.items
source: Active backup files ({0} items)
it: File di backup attivi ({0} elementi)

# sql.migration.all.backups.restored
source: All backups restored
it: Tutti i backup sono stati ripristinati

# sql.migration.all.fields.required
source: All fields are required.
it: Tutti i campi sono obbligatori.

# sql.migration.apply
source: Apply
it: Applica

# sql.migration.assessed.databases
source: (for {0} assessed databases)
it: (per {0} database valutati)

# sql.migration.assessment
source: Assessment results for '{0}'
it: Risultati valutazione per '{0}'

# sql.migration.assessment.failed
source: The assessment of your SQL Server instance '{0}' failed.
it: La valutazione dell'istanza di SQL Server '{0}' non è riuscita.

# sql.migration.assessment.in.progress
source: Assessment in progress
it: Valutazione in corso

# sql.migration.assessment.in.progress.content
source: We are assessing the databases in your SQL Server instance {0} to identify the right Azure SQL target. This may take some time.
it: I database nell'istanza di SQL Server vengono valutati {0} per identificare la destinazione Azure SQL corretta. L'operazione potrebbe richiedere qualche minuto.

# sql.migration.assessment.migration.warning
source: Databases that are not ready for migration to Azure SQL Managed Instance or Azure SQL Database can be migrated to SQL Server on Azure Virtual Machines.
it: Per i database non pronti per la migrazione all'Istanza gestita di SQL di Azure, è possibile eseguire la migrazione a SQL Server nelle macchine virtuali di Microsoft Azure.

# sql.migration.assessment.migration.warning.sqldb
source: Databases that are not ready for migration to Azure SQL Database can be migrated to SQL Server on Azure Virtual Machines. Alternatively, review assessment results for Azure SQL Managed Instance migration readiness.
it: I database non pronti per la migrazione a database SQL di Azure possono essere migrati a SQL Server in Macchine virtuali di Azure. In alternativa, esamina i risultati della valutazione per Istanza gestita di SQL di Azure conformità alla migrazione.

# sql.migration.assessment.migration.warning.sqlmi
source: Databases that are not ready for migration to Azure SQL Managed Instance can be migrated to SQL Server on Azure Virtual Machines. Alternatively, review assessment results for Azure SQL Database migration readiness.
it: I database non pronti per la migrazione a Istanza gestita di SQL di Azure possono essere migrati in SQL Server in Macchine virtuali di Azure. In alternativa, esamina i risultati della valutazione per database SQL di Azure idoneità per la migrazione.

# sql.migration.assessment.results
source: Assessment results
it: Risultati valutazione

# sql.migration.assessment.results.and.recommendations.title
source: Assessment results and recommendations
it: Risultati e raccomandazioni della valutazione

# sql.migration.assessments.blocking.issue
source: This is a blocking issue that will prevent the database migration from succeeding.
it: Si tratta di un errore di blocco che impedirà la migrazione del database.

# sql.migration.authKeys.header
source: Authentication key
it: Chiave di autenticazione

# sql.migration.authKeys.refresh.message
source: Authentication key '{0}' has been refreshed.
it: La chiave di autenticazione ' {0}' è stata aggiornata.

# sql.migration.authentication.type
source: Authentication type
it: Tipo di autenticazione

# sql.migration.authentication.types
source: Authentication keys
it: Chiavi di autenticazione

# sql.migration.azure.sql.database
source: Azure SQL Database Server
it: Server di database SQL di Azure

# sql.migration.azure.sql.database.managed.instance
source: Azure SQL Managed Instance
it: Istanza gestita di SQL di Azure

# sql.migration.azure.sql.database.virtual.machine
source: SQL Server on Azure Virtual Machines
it: SQL Server in macchine virtuali di Azure

# sql.migration.azure.sql.database.virtual.machine.short
source: SQL Server on Azure VM
it: SQL Server in macchine virtuali di Azure

# sql.migration.azure.sql.target
source: Target type
it: Tipo di destinazione

# sql.migration.azure.storage.account.to.upload.backups
source: Azure Storage account to upload backups
it: Account di Archiviazione di Azure per il caricamento dei backup

# sql.migration.azure.tenant
source: Azure AD tenant
it: Tenant di Azure AD

# sql.migration.azureRecommendation.browse
source: Browse
it: Sfoglia

# sql.migration.azureRecommendation.folder.name
source: Folder name
it: Nome cartella

# sql.migration.azureRecommendation.open
source: Open
it: Apri

# sql.migration.backup.location
source: Backup location
it: Percorso backup

# sql.migration.backup.start.time
source: Backup start time
it: Ora di inizio backup

# sql.migration.bc.info
source: A SQL Managed Instance migration cutover to the Business Critical service tier can take significantly longer than General Purpose because three secondary replicas have to be seeded for Always On High Availability group. The duration of the operation depends on the size of the data. Seeding speed in 90% of cases is 220 GB/hour or higher.
it: Il cutover della migrazione dell'Istanza gestita di SQL al livello di servizio business critical può richiedere molto più tempo dell'utilizzo generico perché è necessario eseguire il seeding di tre repliche secondarie per il gruppo di disponibilità elevata Always On. La durata di questa operazione dipende dalle dimensioni dei dati. La velocità di seeding nel 90% dei casi è pari a 220 GB/ora o a una velocità superiore.

# sql.migration.blob.container.label
source: Blob container resource group
it: Gruppo di risorse del contenitore BLOB

# sql.migration.blob.container.last.backup.file.label
source: Last backup file
it: Ultimo file di backup

# sql.migration.blob.container.select
source: Select a blob container value first.
it: Selezionare prima un valore del contenitore BLOB.

# sql.migration.blob.container.storage.account.label
source: Blob container storage account
it: Account di archiviazione del contenitore BLOB

# sql.migration.blob.container.title
source: Blob container
it: Contenitore BLOB

# sql.migration.blob.resourceGroup.select
source: Select a resource group.
it: Selezionare un gruppo di risorse.

# sql.migration.blob.resourceGroup.select.prompt
source: Select a resource group value first.
it: Selezionare prima un valore del gruppo di risorse.

# sql.migration.blob.storage.header.text
source: Azure Storage Blob Container details
it: Dettagli del contenitore dell’archiviazione Blob di Azure

# sql.migration.blob.storage.help.text
source: Provide the Azure Storage Blob Container that contains the backups.
it: Specificare il contenitore BLOB del servizio di archiviazione di Azure che contiene i backup.

# sql.migration.blob.storage.subscription.label
source: Subscription
it: Sottoscrizione

# sql.migration.blob.storage.table.help
source: Enter target database name and select resource group, storage account and container for the selected source databases.
it: Immettere il nome del database di destinazione e selezionare il gruppo di risorse, l'account di archiviazione e il contenitore per i database di origine selezionati.

# sql.migration.blob.storageAccount.select
source: Select a storage account value first.
it: Selezionare prima un valore per l'account di archiviazione.

# sql.migration.can.be.migrated
source: {0}/{1} databases can be migrated without issues
it: {0}/{1} i database possono essere migrati senza problemi

# sql.migration.cancel
source: Cancel
it: Annulla

# sql.migration.cancel.error
source: An error occurred while canceling the migration.
it: Si è verificato un errore durante l'annullamento della migrazione.

# sql.migration.cancel.migration
source: Cancel migration
it: Annulla migrazione

# sql.migration.cannot.cancel
source: Migration is not in progress and cannot be canceled.
it: La migrazione non è in corso e non può essere annullata.

# sql.migration.cannot.cutover
source: Migration is not in progress and cannot be cutover.
it: La migrazione non è in corso e non è possibile eseguirne il cutover.

# sql.migration.cannot.retry
source: Migration cannot be retried.
it: Non è possibile ripetere la migrazione.

# sql.migration.cannot.start.cutover.error
source: The cutover process cannot start until all the migrations are done. To return the latest file status, refresh your browser window.
it: Non è possibile avviare il processo di cutover fino a quando non vengono completate tutte le migrazioni. Per restituire lo stato dei file più recente, aggiornare la finestra del browser.

# sql.migration.close
source: Close
it: Chiudi

# sql.migration.complete.cutover
source: Complete cutover
it: Completa cutover

# sql.migration.completing.cutover.warning
source: Completing cutover without restoring all the backups may result in a data loss.
it: Il completamento del cutover senza ripristinare tutti i backup può comportare una perdita di dati.

# sql.migration.confirm.checkbox.message
source: I confirm there are no additional log backups to provide and want to complete cutover.
it: L'utente conferma che non sono presenti altri backup del log da fornire e che desidera completare il cutover.

# sql.migration.connection.label
source: Connect
it: Connetti

# sql.migration.connection.status
source: Connection status
it: Stato connessione

# sql.migration.copy.key1
source: Copy key 1
it: Copia chiave 1

# sql.migration.copy.key2
source: Copy key 2
it: Copia chiave 2

# sql.migration.copy.migration.details
source: Copy migration details
it: Dettagli di Copia migrazione

# sql.migration.copy.status.canceled
source: Canceled
it: Annullata

# sql.migration.copy.status.cancelled
source: Cancelled
it: Annullato

# sql.migration.copy.status.copyfinished
source: Copy finished
it: Copia completata

# sql.migration.copy.status.copying
source: Copying
it: Copia in corso

# sql.migration.copy.status.failed
source: Failed
it: Non riuscita

# sql.migration.copy.status.inprogress
source: In progress
it: In corso

# sql.migration.copy.status.preparingforcopy
source: Preparing
it: Preparazione

# sql.migration.copy.status.queued
source: Queued
it: In coda

# sql.migration.copy.status.rebuildingindexes
source: Rebuilding indexes
it: Ricompilazione degli indici

# sql.migration.copy.status.succeeded
source: Succeeded
it: Riuscita

# sql.migration.copy.throughput
source: Copy throughput (MBPS)
it: Velocità effettiva copia (MBPS)

# sql.migration.copy.throughput.info
source: Data movement throughput achieved during the migration of your database backups to Azure. This is the rate of data transfer, calculated by data read divided by duration of backups migration to Azure.
it: Velocità di spostamento dati raggiunta durante la migrazione dei backup di database ad Azure. Velocità di trasferimento dati, calcolata da dati letti divisi per durata della migrazione dei backup in Azure.

# sql.migration.count.database.multiple
source: {0} databases
it: Database {0}

# sql.migration.count.database.single
source: {0} database
it: Database {0}

# sql.migration.create
source: Create
it: Crea

# sql.migration.create.new
source: Create new
it: Crea nuovo

# sql.migration.create.new.migration.service
source: Create new migration service
it: Crea nuovo servizio di migrazione

# sql.migration.create.new.resource.group
source: Create new resource group
it: Crea nuovo gruppo di risorse

# sql.migration.creating.rg.loading
source: Creating resource group
it: Creazione del gruppo di risorse

# sql.migration.currently.restoring.file
source: Currently restoring file
it: Ripristino del file in corso

# sql.migration.cutover
source: Migration cutover
it: Cutover di migrazione

# sql.migration.cutover.card
source: Database migrations completing cutover
it: Migrazioni del database che completano il cutover

# sql.migration.cutover.error
source: An error occurred while initiating cutover.
it: Si è verificato un errore durante l'avvio del cutover.

# sql.migration.cutover.help.main
source: Perform the following steps before you complete cutover.
it: Prima di completare il cutover, eseguire i passaggi seguenti.

# sql.migration.cutover.in.progress
source: Cutover in progress for database '{0}'
it: Cutover in corso per il database '{0}'

# sql.migration.cutover.last.file.restored
source: Last file restored: {0}
it: Ultimo file ripristinato: {0}

# sql.migration.cutover.pending.backup
source: Log backups pending restore: {0}
it: Backup dei log in attesa di ripristino: {0}

# sql.migration.cutover.status.refresh.error
source: An error occurred while refreshing the migration status.
it: Si è verificato un errore durante l'aggiornamento dello stato di migrazione.

# sql.migration.cutover.step.1
source: 1. Stop all incoming transactions to the source database.
it: 1. Arrestare tutte le transazioni in ingresso nel database di origine.

# sql.migration.cutover.step.2.blob
source: 2. Create a final transaction log differential or backup and store it in the Azure Storage Blob Container.
it: 2. Creare un differenziale o un backup del log finale delle transazioni e archiviarlo nel contenitore del BLOB del servizio di archiviazione di Azure.

# sql.migration.cutover.step.2.network.share
source: 2. Create a final transaction log backup and store it on the network share.
it: 2. Creare un backup del log finale delle transazioni e archiviarlo nella condivisione di rete.

# sql.migration.cutover.step.3.blob
source: 3. Verify that all backups have been restored on the target database. The "Log backups pending restore" value should be zero.
it: 3. Verificare che tutti i backup siano stati ripristinati nel database di destinazione. Il valore "Backup dei log in attesa di ripristino" deve essere zero.

# sql.migration.cutover.step.3.network.share
source: 3. Verify that all log backups have been restored on the target database. The "Log backups pending restore" value should be zero.
it: 3. Verificare che i tutti i backup del log siano stati ripristinati nel database di destinazione. Il valore "Backup dei log in attesa di ripristino" deve essere zero.

# sql.migration.cutover.type
source: Mode
it: Modalità

# sql.migration.dashboard.description
source: Determine the migration readiness of your SQL Server instances, identify a recommended Azure SQL target, and complete the migration of your SQL Server instance to Azure SQL Managed Instance, SQL Server on Azure Virtual Machines or Azure SQL Database.
it: Determinare l'idoneità alla migrazione delle istanze di SQL Server, identificare una destinazione di Azure SQL consigliata e completare la migrazione dell'istanza di SQL Server a Istanza gestita di SQL di Azure, SQL Server in Macchine virtuali di Azure o database SQL di Azure.

# sql.migration.dashboard.help.description.dmsGuide
source: A hub of migration articles that provides step-by-step guidance for migrating and modernizing your data assets in Azure.
it: Un hub di articoli sulla migrazione che fornisce indicazioni dettagliate per la migrazione e la modernizzazione degli asset di dati in Azure.

# sql.migration.dashboard.help.description.mi
source: A step-by-step tutorial to migrate databases from a SQL Server instance (on-premises or Azure Virtual Machines) to Azure SQL Managed Instance with minimal downtime.
it: Esercitazione dettagliata per eseguire la migrazione di database da un'istanza di SQL Server (locale o macchine virtuali di Azure) a Istanza gestita di SQL di Azure con tempi di inattività minimi.
