Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-migration.*.xlf
Languages: it

# sql.migration.sku.azureRecommendation.status.imported
source: Azure recommendation has been applied using the provided data. Import or collect additional data to refine the recommendation.
it: La raccomandazione di Azure è stata applicata usando i dati forniti. Importare o raccogliere dati aggiuntivi per affinare la raccomandazione.

# sql.migration.sku.azureRecommendation.status.inProgress
source: Data collection in progress. Generating initial recommendations...
it: Raccolta dati in corso. Generazione delle raccomandazioni iniziali...

# sql.migration.sku.azureRecommendation.status.manualRefreshTimer
source: Check back periodically for updated recommendations by pressing the 'Refresh recommendation' button.
it: Controllare periodicamente la disponibilità di consigli aggiornati premendo il pulsante “Aggiorna raccomandazione”.

# sql.migration.sku.azureRecommendation.status.notEnabled
source: Azure recommendation collects and analyzes performance data and then recommends an appropriate sized target in Azure for your workload.
it: La raccomandazione di Azure raccoglie e analizza i dati delle prestazioni e quindi consiglia un target di dimensioni appropriate in Azure per il carico di lavoro.

# sql.migration.sku.azureRecommendation.status.refining
source: Data collection still in progress. Refining existing recommendations...
it: Raccolta dati ancora in corso. Affinamento delle raccomandazioni esistenti...

# sql.migration.sku.azureRecommendation.status.stopped
source: Data collection for Azure recommendations has been stopped.
it: La raccolta di dati per le raccomandazioni di Azure è stata arrestata.

# sql.migration.sku.azureRecommendation.stop.popup
source: Stopping performance data collection...
it: Arresto della raccolta dei dati delle prestazioni...

# sql.migration.sku.azureRecommendation.tooltip.inProgress
source: Running the performance collection for a longer period of time helps ensure a more accurate recommendation.
it: L'esecuzione della raccolta delle prestazioni per un periodo di tempo più lungo consente di garantire una raccomandazione più accurata.

# sql.migration.sku.azureRecommendation.tooltip.notStarted
source: Click the button below to import or collect database performance data.
it: Fare clic sul pulsante seguente per importare o raccogliere i dati sulle prestazioni del database.

# sql.migration.sku.card.azureRecommendation.inProgress
source: Azure recommendation will be displayed once data collection is complete.
it: La raccomandazione di Azure verrà visualizzata al termine della raccolta dei dati.

# sql.migration.sku.card.azureRecommendation.notEnabled
source: Azure recommendation is not available. Click “Get Azure recommendation” button below
it: La raccomandazione di Azure non è disponibile. Fare clic sul pulsante \"Ottieni raccomandazione di Azure\" di seguito

# sql.migration.sku.cpu
source: {0} cores
it: {0} core

# sql.migration.sku.cpu.requirement
source: CPU requirement
it: Requisiti CPU

# sql.migration.sku.data.iops.requirement
source: Data IOPS requirement
it: Requisito operazioni di I/O al secondo dati

# sql.migration.sku.data.storage.requirement
source: Data storage requirement
it: Requisito di archiviazione dati

# sql.migration.sku.get.recommendation
source: Get Azure recommendation
it: Ottieni raccomandazione di Azure

# sql.migration.sku.io.memory.requirement
source: IO latency requirement
it: Requisito latenza I/O

# sql.migration.sku.iops
source: {0} IOPS
it: {0} operazioni di I/O al secondo

# sql.migration.sku.location
source: Azure region for your Azure SQL target. Only regions that contain a target eligible for migration will be shown.
it: Area di Azure per la destinazione Azure SQL. Verranno visualizzate solo le aree che contengono una destinazione idonea per la migrazione.

# sql.migration.sku.log.storage.requirement
source: Log storage requirement
it: Requisito di archiviazione log

# sql.migration.sku.logs.iops.requirement
source: Logs IOPS requirement
it: Requisito operazioni di I/O al secondo dei log

# sql.migration.sku.memory.requirement
source: Memory requirement
it: Requisiti memoria

# sql.migration.sku.mi.card.title
source: Azure SQL Managed Instance
it: Istanza gestita di SQL di Azure

# sql.migration.sku.mi.target.title
source: Azure SQL Managed Instance
it: Istanza gestita di SQL di Azure

# sql.migration.sku.parameters
source: Recommendation parameters
it: Parametri raccomandazione

# sql.migration.sku.parameters.edit
source: Edit parameters
it: Modifica parametri

# sql.migration.sku.parameters.edit.title
source: Edit recommendation parameters
it: Modifica parametri raccomandazione

# sql.migration.sku.parameters.enable.elastic
source: Enable elastic recommendation
it: Abilitare la raccomandazione elastica

# sql.migration.sku.parameters.enable.elastic.info
source: Elastic recommendation uses an alternate recommendation model which utilizes personalized price-performance profiling against existing on-cloud customers.
it: La raccomandazione elastica usa un modello di raccomandazione alternativo che usa la profilatura personalizzata dei prezzi e delle prestazioni per i clienti esistenti nel cloud.

# sql.migration.sku.parameters.enable.preview
source: Enable preview features
it: Abilitare le funzionalità di anteprima

# sql.migration.sku.parameters.enable.preview.info
source: Enabling this option will include the latest hardware generations that have significantly improved performance and scalability. These SKUs are currently in Preview and may not yet be available in all regions.
it: L'abilitazione di questa opzione includerà le generazioni hardware più recenti che hanno notevolmente migliorato le prestazioni e la scalabilità. Questi SKU sono attualmente in anteprima e potrebbero non essere ancora disponibili in tutte le aree.

# sql.migration.sku.parameters.percentage.utilization
source: Percentage utilization
it: Percentuale di utilizzo

# sql.migration.sku.parameters.percentage.utilization.tooltip
source: Percentile of data points to be used during aggregation of the performance data.
it: Percentile dei punti dati da utilizzare durante l'aggregazione dei dati sulle prestazioni.

# sql.migration.sku.parameters.scale.factor
source: Scale factor
it: Fattore di scala:

# sql.migration.sku.parameters.scale.factor.invalid
source: Invalid scale factor. Enter a positive integer value.
it: Fattore di scala non valido. Immettere un valore intero positivo.

# sql.migration.sku.parameters.scale.factor.tooltip
source: Change scale factor if you want the Azure recommendation to be a percentage larger or smaller than you current workload.
it: Modificare il fattore di scala se si vuole che la raccomandazione di Azure sia una percentuale maggiore o minore del carico di lavoro corrente.

# sql.migration.sku.parameters.text
source: Enter the information below to edit the recommendation parameters.
it: Immettere le informazioni seguenti per modificare i parametri della raccomandazione.

# sql.migration.sku.parameters.update
source: Update
it: Aggiorna

# sql.migration.sku.percentile
source: {0}th percentile
it: {0}° percentile

# sql.migration.sku.recommendation
source: Azure recommendation (PREVIEW)
it: Consigli di Azure (ANTEPRIMA)

# sql.migration.sku.recommendation.view.assessment.mi
source: To migrate to Azure SQL Managed Instance, view assessment results and select one or more databases.
it: Per eseguire la migrazione all'Istanza gestita di SQL di Azure, visualizzare i risultati della valutazione e selezionare uno o più database.

# sql.migration.sku.recommendation.view.assessment.sqldb
source: To migrate to Azure SQL Database (PREVIEW), view assessment results and select one or more databases.
it: Per eseguire la migrazione al database SQL di Azure (ANTEPRIMA), visualizzare i risultati della valutazione e selezionare uno o più database.

# sql.migration.sku.recommendation.view.assessment.vm
source: To migrate to SQL Server on Azure Virtual Machine, view assessment results and select one or more databases.
it: Per eseguire la migrazione a SQL Server per una macchina virtuale di Azure, visualizzare i risultati della valutazione e selezionare uno o più database.

# sql.migration.sku.recommendationReason
source: Recommendation reason
it: Motivo della raccomandazione

# sql.migration.sku.recommendations
source: Recommendations
it: Indicazioni

# sql.migration.sku.recommendations.lastRefreshed
source: Last refreshed: {0}
it: Ultimo aggiornamento: {0}

# sql.migration.sku.recommendations.loading
source: Loading...
it: Caricamento...

# sql.migration.sku.recommendations.title
source: {0} Recommendations
it: ({0} raccomandazioni)

# sql.migration.sku.recommended.value
source: Value
it: Valore

# sql.migration.sku.recommendedConfiguration
source: Recommended configuration
it: Configurazione consigliata

# sql.migration.sku.refine.recommendation
source: Refine Azure recommendation
it: Affina la raccomandazione di Azure

# sql.migration.sku.refresh.recommendation
source: Refresh recommendation
it: Aggiorna raccomandazione

# sql.migration.sku.resource
source: Your Azure SQL target resource name
it: Nome della risorsa di destinazione Azure SQL

# sql.migration.sku.resource_group
source: Resource group for your Azure SQL target. Only resource groups that contain a target eligible for migration will be shown.
it: Gruppo di risorse per la destinazione Azure SQL. Verranno visualizzati solo i gruppi di risorse che contengono una destinazione idonea per la migrazione.

# sql.migration.sku.restart.performance.collection
source: Restart data collection
it: Riavvia raccolta dati

# sql.migration.sku.sourceProperties
source: Source properties
it: Proprietà origine

# sql.migration.sku.sql.dataDisk
source: SQL data files
it: File di dati DQS

# sql.migration.sku.sql.logDisk
source: SQL log files
it: File di log SQL

# sql.migration.sku.sql.temp
source: SQL tempdb
it: Tempdb SQL

# sql.migration.sku.sqldb.card.title
source: Azure SQL Database (PREVIEW)
it: Database SQL di Azure

# sql.migration.sku.sqldb.target.title
source: Azure SQL Database
it: Database SQL di Azure

# sql.migration.sku.stop.performance.collection
source: Stop data collection
it: Interrompi la raccolta di dati

# sql.migration.sku.storage.dimension
source: Dimension
it: Dimensione

# sql.migration.sku.subscription
source: Subscription name for your Azure SQL target
it: Nome sottoscrizione per l’SQL Azure di destinazione

# sql.migration.sku.targetDeploymentType
source: Target deployment type
it: Tipo di distribuzione di destinazione

# sql.migration.sku.targetStorageConfiguration
source: Recommendation target storage configuration
it: Configurazione dell'archiviazione di destinazione delle raccomandazioni

# sql.migration.sku.targetStorageConfiguration.caching
source: Host caching
it: Memorizzazione nella cache dell'host

# sql.migration.sku.targetStorageConfiguration.caching.na
source: Not applicable
it: Non applicabile

# sql.migration.sku.targetStorageConfiguration.caching.none
source: None
it: Nessuno

# sql.migration.sku.targetStorageConfiguration.caching.readOnly
source: Read-only
it: Sola lettura

# sql.migration.sku.targetStorageConfiguration.caching.readWrite
source: Read/write
it: Lettura/scrittura

# sql.migration.sku.targetStorageConfiguration.ephemeralTempdb
source: Place tempdb on the local ephemeral SSD (default D:\) drive
it: Posiziona tempdb nell'unità SSD temporanea locale (D:\) predefinita

# sql.migration.sku.targetStorageConfiguration.info
source: Below is the target storage configuration required to meet your storage performance needs.
it: Di seguito è riportata la configurazione dell'archiviazione di destinazione necessaria per soddisfare le esigenze di prestazioni di archiviazione.

# sql.migration.sku.targetStorageConfiguration.local.SSD
source: Local SSD
it: SSD locale

# sql.migration.sku.targetStorageConfiguration.recommendedStorageConfiguration
source: Recommended storage configuration
it: Configurazione di archiviazione consigliata

# sql.migration.sku.targetStorageConfiguration.storage
source: Storage
it: Archiviazione

# sql.migration.sku.viewDetails
source: View details
it: Visualizza dettagli

# sql.migration.sku.vm.card.title
source: SQL Server on Azure Virtual Machine
it: SQL Server per la macchina virtuale di Azure

# sql.migration.sku.vm.target.title
source: SQL Server on Azure Virtual Machine
it: SQL Server per la macchina virtuale di Azure

# sql.migration.source.configuration
source: Source configuration
it: Configurazione origine

# sql.migration.source.credentials
source: Source credentials
it: Credenziali origine

# sql.migration.source.database
source: Source database name
it: Nome database di origine

# sql.migration.source.databases
source: Source databases
it: Database di origine

# sql.migration.source.details.sqlAuth
source: Enter the SQL Authentication credentials used to connect to SQL Server instance {0}. These credentials will be used to connect to the SQL Server instance and identify valid backup files.
it: Immettere le credenziali di autenticazione SQL usate per la connessione all'istanza di SQL Server {0}. Queste credenziali verranno usate per connettersi all'istanza di SQL Server e identificare i file di backup validi.

# sql.migration.source.details.windowAuth
source: Enter the Windows Authentication credentials used to connect to SQL Server instance {0}. These credentials will be used to connect to the SQL Server instance and identify valid backup files.
it: Immettere le credenziali di autenticazione di Windows usate per la connessione all'istanza di SQL Server {0}. Queste credenziali verranno usate per connettersi all'istanza di SQL Server e identificare i file di backup validi.

# sql.migration.source.login
source: Source login
it: Accesso di origine

# sql.migration.source.server
source: Source server
it: Server di origine

# sql.migration.source.version
source: Source version
it: Versione di origine

# sql.migration.sql.assessment.notebook.title
source: SQL migration assessment
it: Valutazione della migrazione SQL

# sql.migration.sql.database
source: SQL Database
it: Database SQL

# sql.migration.sql.managed.instance
source: SQL Managed Instance
it: Istanza gestita di SQL

# sql.migration.sql.server.instance
source: SQL Server instance
it: Istanza di SQL Server

# sql.migration.sql.virtual.machine
source: SQL Virtual Machine
it: Macchina virtuale SQL

# sql.migration.sqldb.column.copyduration
source: Copy duration
it: Durata della copia

# sql.migration.sqldb.column.copystart
source: Copy start
it: Inizio copia

# sql.migration.sqldb.column.copythroughput
source: Copy throughput
it: Velocità effettiva di copia

# sql.migration.sqldb.column.dataread
source: Data read
it: Dati letti

# sql.migration.sqldb.column.datawritten
source: Data written
it: Dati scritti

# sql.migration.sqldb.column.parallelcopytype
source: Parallel copy type
it: Tipo di copia parallela

# sql.migration.sqldb.column.rowscopied
source: Rows copied
it: Righe copiate

# sql.migration.sqldb.column.rowsread
source: Rows read
it: Righe lette

# sql.migration.sqldb.column.tablename
source: Table name
it: Nome della tabella

# sql.migration.sqldb.column.usedparallelcopies
source: Used parallel copies
it: Copie parallele usate

# sql.migration.sqldb.not.ready
source: The SQL database server '{0}' is unavailable for migration because it is currently in the '{1}' state. To continue, select an available SQL database server.
it: Il server di database SQL '{0}' non è disponibile per la migrazione perché si trova attualmente nello stato '{1}'. Per continuare, selezionare un server di database SQL disponibile.

# sql.migration.src.database
source: Source database
it: Database di origine

# sql.migration.src.server
source: Source name
it: Nome dell’origine

# sql.migration.start.login.migration.button
source: Migrate
it: Esegui la migrazione

# sql.migration.start.migration.button
source: Start migration
it: Avvia migrazione

# sql.migration.start.session
source: Start a new session
it: Avvia una nuova sessione

# sql.migration.start.time
source: Start time
it: Ora di inizio

# sql.migration.starting.login
source: Validating and migrating logins are in progress
it: La convalida e la migrazione degli account di accesso sono in corso

# sql.migration.starting.login.failed
source: Validating and migrating logins failed
it: Convalida e migrazione degli account di accesso non riuscita

# sql.migration.status
source: Status
it: Stato

# sql.migration.status.add.account
source: Add account
it: Aggiungi account

# sql.migration.status.add.account.MESSAGE
source: Add your Azure account to view existing migrations and their status.
it: Aggiungere l'account Azure per visualizzare le migrazioni esistenti e il relativo stato.

# sql.migration.status.canceled
source: Canceled
it: Annullata

# sql.migration.status.canceling
source: Canceling
it: Annullamento in corso

# sql.migration.status.completing
source: Completing
it: In fase di completamento

# sql.migration.status.creating
source: Creating
it: In fase di creazione

# sql.migration.status.dropdown.all
source: Status: All
it: Stato: Tutti

# sql.migration.status.dropdown.completing
source: Status: Completing
it: Stato: in fase di completamento

# sql.migration.status.dropdown.failed
source: Status: Failed
it: Stato: Non riuscito

# sql.migration.status.dropdown.ongoing
source: Status: Ongoing
it: Stato: in corso

# sql.migration.status.dropdown.succeeded
source: Status: Succeeded
it: Stato: Riuscito

# sql.migration.status.error.count.multiple
source: ({0} errors)
it: ({0} errori)

# sql.migration.status.error.count.single
source: ({0} error)
it: ({0} errore)

# sql.migration.status.failed
source: Failed
it: Non riuscita

# sql.migration.status.inprogress
source: In progress
it: In corso

# sql.migration.status.readyforcutover
source: Ready for cutover
it: Pronto per il cutover

# sql.migration.status.refresh.label
source: Refresh
it: Aggiorna

# sql.migration.status.restoring
source: Restoring
it: Ripristino in corso

# sql.migration.status.retriable
source: Retriable
it: Possibile riprovare

# sql.migration.status.select.service.MESSAGE
source: Select a Database Migration Service to monitor migrations.
it: Selezionare un Servizio di Migrazione del database per monitorare le migrazioni.

# sql.migration.status.status.label
source: Status
it: Stato

# sql.migration.status.succeeded
source: Succeeded
it: Riuscita

# sql.migration.status.uploadingfullbackup
source: Uploading full backup
it: Caricamento del backup completo in corso

# sql.migration.status.uploadinglogbackup
source: Uploading log backup(s)
it: Caricamento dei backup del log in corso

# sql.migration.status.warning.count.multiple
source: ({0} warnings)
it: ({0} avvisi)

# sql.migration.status.warning.count.single
source: ({0} warning)
it: ({0} avviso)

# sql.migration.storage.account
source: Storage account
it: Account di archiviazione

# sql.migration.subscription
source: Subscription
it: Sottoscrizione

# sql.migration.summary.azure.storage
source: Azure storage
it: Archiviazione di Azure

# sql.migration.summary.azure.storage.subscription
source: Azure storage subscription
it: Sottoscrizione di archiviazione di Azure

# sql.migration.summary.database.count
source: Databases for migration
it: Database per la migrazione

# sql.migration.summary.mi.type
source: Azure SQL Managed Instance
it: Istanza gestita di SQL di Azure

# sql.migration.summary.page.title
source: Summary
it: Riepilogo

# sql.migration.summary.sqldb.type
source: Azure SQL Database
it: Database SQL di Azure

# sql.migration.summary.vm.type
source: SQL Server on Azure Virtual Machine
it: SQL Server per la macchina virtuale di Azure

# sql.migration.tab.button.login.migration.description
source: Migrate logins to Azure SQL
it: Eseguire la migrazione degli account di accesso a Azure SQL

# sql.migration.tab.button.login.migration.label
source: New login migration (PREVIEW)
it: Nuova migrazione dell'account di accesso (ANTEPRIMA)

# sql.migration.tab.button.migration.description
source: Migrate to Azure SQL
it: Esegui migrazione ad Azure SQL

# sql.migration.tab.button.migration.label
source: New migration
it: Nuova migrazione

# sql.migration.tab.button.support.description
source: New support request
it: Nuova richiesta di supporto

# sql.migration.tab.button.support.label
source: New support request
it: Nuova richiesta di supporto

# sql.migration.tab.migrations.title
source: Migrations
it: Migrazioni

# sql.migration.table.error.title
source: Table migration status details
it: Dettagli sullo stato della migrazione della tabella

# sql.migration.table.migration.status.label
source: Table migration status: {0}
it: Stato della migrazione della tabella: {0}

# sql.migration.table.missing.count
source: Missing target tables excluded from list: {0}
it: Tabelle di destinazione mancanti escluse dall'elenco: {0}

# sql.migration.table.select.label
source: Select tables for {0}
it: Selezionare le tabelle per {0}

# sql.migration.table.selected.count
source: {0} of {1} tables selected
it: {0} di {1} tabelle selezionate

# sql.migration.table.selection.count
source: {0} of {1}
it: {0} di {1}

# sql.migration.table.selection.edit
source: Edit
it: Modifica

# sql.migration.table.selection.filter
source: Filter tables
it: Filtra tabelle

# sql.migration.table.selection.status.column
source: Has rows
it: Contiene righe

# sql.migration.table.selection.tablename.column
source: Table name
it: Nome della tabella

# sql.migration.table.selection.update.button
source: Update
it: Aggiorna

# sql.migration.table.selection.update.cancel
source: Cancel
it: Annulla

# sql.migration.target
source: Target
it: Destinazione

# sql.migration.target.azure.sql.instance.database.name
source: Target database
it: Database di destinazione

# sql.migration.target.azure.sql.instance.name
source: Target name
it: Nome di destinazione

# sql.migration.target.azure.sql.instance.server.name
source: Target name
it: Nome della destinazione

# sql.migration.target.database.name
source: Target database name
it: Nome del database di destinazione

# sql.migration.target.platform
source: Target platform
it: Piattaforma di destinazione

# sql.migration.target.server
source: Target server
it: Server di destinazione

# sql.migration.target.table.count.name
source: Tables selected
it: Tabelle selezionate

# sql.migration.target.table.missing
source: Target table does not exist
it: La tabella di destinazione non esiste

# sql.migration.target.table.not.empty
source: Target table is not empty.
it: La tabella di destinazione non è vuota.

# sql.migration.target.version
source: Target version
it: Versione di destinazione

# sql.migration.test.connection
source: Test connection
it: Verifica connessione

# sql.migration.type
source: Type
it: Tipo

# sql.migration.type.label
source: Type:
it: Tipo:

# sql.migration.unavailable.target
source: (Unavailable) {0}
it: (Non disponibile) {0}

# sql.migration.unique.name
source: Select a unique name for this target database
it: Selezionare un nome univoco per il database di destinazione

# sql.migration.username
source: User name
it: Nome utente

# sql.migration.username.label
source: Target user name
it: Nome utente di destinazione

# sql.migration.username.placeholder
source: Enter the target user name
it: Immettere il nome utente di destinazione

# sql.migration.validate.ir.column.status
source: Status
it: Stato

# sql.migration.validate.ir.column.validation.steps
source: Validation steps
it: Passaggi di convalida

# sql.migration.validate.ir.completed.errors
source: Validation completed with the following error(s):{0}{1}
it: Convalida completata con gli errori seguenti:{0}{1}

# sql.migration.validate.ir.copy.results
source: Copy validation results
it: Copia risultati di convalida

# sql.migration.validate.ir.done.button
source: Done
it: Fatto
