Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-database-projects.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# invalidPropertyValueInSqlProj
source: Invalid value specified for the property '{0}' in .sqlproj file
de: Für die Eigenschaft „{0}“ in der SQLPROJ-Datei wurde ein ungültiger Wert angegeben.
es: Se ha especificado un valor no válido para la propiedad \"{0}\" en el archivo .sqlproj.
it: Valore non valido specificato per la proprietà '{0}' nel file con estensione .sqlproj
ja: .sqlproj ファイルのプロパティ '{0}' に無効な値が指定されました: '{0}'
ko: .sqlproj 파일의 '{0}' 속성에 잘못된 값이 지정되었습니다.
pt_br: Valor inválido especificado para a propriedade '{0}' no arquivo .sqlproj
ru: Указано недопустимое значение для свойства: \"{0}\" в файле SQLPROJ
zh_hant: 在 .sqlproj 中為屬性 '{0}' 指定的值無效

# invalidPropertyValueProvided
source: Project property value '{0} is invalid
de: Der Eigenschaftswert “{0}” ist ungültig
es: El valor de propiedad de proyecto '{0}' no es válido
it: Il valore '{0} della proprietà del progetto non è valido
ja: プロジェクト プロパティの値 {0} が無効です
ko: 프로젝트 속성 값 '{0}이(가) 잘못되었습니다.
pt_br: O valor da propriedade do projeto '{0} é inválido
ru: Значение свойства Project '{0} недопустимо
zh_hant: 專案屬性值 '{0} 無效

# invalidSQLPassword
source: {0} password doesn't meet the password complexity requirement. For more information see https://docs.microsoft.com/sql/relational-databases/security/password-policy
de: {0} Kennwort erfüllt nicht die Kennwortkomplexitätsanforderung. Weitere Informationen finden Sie unter https://docs.microsoft.com/sql/relational-databases/security/password-policy
es: La contraseña de {0} no cumple el requisito de complejidad de la contraseña. Para obtener más información, consulte https://docs.microsoft.com/sql/relational-databases/security/password-policy
it: La password {0} del SQL server non è conforme al requisito di complessità delle password. Per altre informazioni, vedere: https://docs.microsoft.com/sql/relational-databases/security/password-policy
ja: {0} パスワードがパスワードの複雑さの要件を満たしていません。詳細については、https://docs.microsoft.com/sql/relational-databases/security/password-policy をご覧ください
ko: {0} 암호가 암호 복잡성 요구 사항을 충족하지 않습니다. 자세한 내용은 https://docs.microsoft.com/sql/relational-databases/security/password-policy를 참조하세요.
pt_br: {0} senha não atende ao requisito de complexidade de senha. Para obter mais informações, consulte https://docs.microsoft.com/sql/relational-databases/security/password-policy
ru: Пароль {0} не соответствует требованиям к сложности пароля. Дополнительные сведения см. по адресу https://docs.microsoft.com/sql/relational-databases/security/password-policy
zh_hant: {0} 密碼不符合密碼複雜度要求。如需詳細資訊，請參閱 https://docs.microsoft.com/sql/relational-databases/security/password-policy

source: Invalid SQL connection string
de: Ungültige SQL-Verbindungszeichenfolge
es: Cadena de conexión SQL no válida
fr: Chaîne de connexion SQL non valide
it: Stringa di connessione SQL non valida
ja: 無効な SQL 接続文字列です
ko: 잘못된 SQL 연결 문자열
pt_br: Cadeia de conexão SQL inválida
ru: Недействительная строка подключения SQL
zh_hans: SQL 连接字符串无效
zh_hant: 不正確的 SQL 連接字串

# invalidTargetPlatform
source: Invalid target platform: {0}. Supported target platforms: {1}
de: Ungültige Zielplattform: {0}. Unterstützte Zielplattformen: {1}
es: Plataforma de destino no válida: {0}. Plataformas de destino admitidas: {1}
fr: Plateforme cible non valide : {0}. Plateformes cibles prises en charge : {1}
it: Piattaforma di destinazione non valida: {0}. Piattaforme di destinazione supportate: {1}
ja: ターゲット プラットフォームが無効です: {0}。サポートされているターゲット プラットフォーム: {1}
ko: 잘못된 대상 플랫폼: {0}. 지원되는 대상 플랫폼: {1}
pt_br: Plataforma de destino inválida: {0}. Plataformas de destino suportadas: {1}
ru: Недопустимая целевая платформа: {0}. Поддерживаемые целевые платформы: {1}
zh_hans: 目标平台 {0} 无效。支持的目标平台: {1}
zh_hant: 目標平台無效: {0}。支援的目標平台: {1}

source: Learn More
de: Weitere Informationen
es: Más información
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Saiba Mais
ru: Подробнее
zh_hant: 深入了解

# loadProfilePlaceholderText
source: Load profile...
de: Profil laden...
es: Perfil de carga...
fr: Charger le profil...
it: Caricare profilo...
ja: プロファイルの読み込み...
ko: 프로필 로드...
pt_br: Carregar perfil...
ru: Профиль нагрузки...
zh_hans: 加载配置文件...
zh_hant: 負載設定檔...

source: Location
de: Standort
es: Ubicación
fr: Emplacement
it: Percorso
ja: 場所
ko: 위치
pt_br: Localização
ru: Расположение
zh_hans: 位置
zh_hant: 位置

# missingVersion
source: Missing 'version' entry in {0}
de: Eintrag "version" fehlt in {0}
es: Falta la entrada "version" en {0}.
fr: Entrée 'version' manquante dans {0}.
it: Voce 'version' mancante in {0}
ja: {0} に 'version' エントリがありません。
ko: {0}에 '버전' 항목이 없습니다.
pt_br: Entrada 'version' ausente no {0}
ru: Отсутствует запись "version" в {0}
zh_hans: 在 {0} 中缺少 “version” 条目
zh_hant: 遺漏了 {0} 的 'version' 項目

# moveConfirmationPrompt
source: Are you sure you want to move {0} to {1}?
it: Spostare {0} in {1}?
pt_br: Tem certeza de que deseja mover {0} para {1}?

# movingFilesBetweenProjectsNotSupported
source: Moving files between projects is not supported
it: Lo spostamento di file tra progetti non è supportato
pt_br: Não há suporte para a movimentação de arquivos entre projetos

source: msec
de: ms
es: ms
it: millisecondo
ja: ミリ秒
ko: 밀리초
pt_br: mseg
ru: мс
zh_hans: 毫秒
zh_hant: 毫秒

# multipleMostDeploymentScripts
source: Unexpected number of {0} files: {1}
de: Unerwartete Anzahl von {0} Dateien: {1}
es: Número inesperado de {0} archivos: {1}
fr: Nombre de cellules inattendu {0} fichiers: {1}
it: Numero imprevisto di {0} file: {1}
ja: {0} ファイルの数が予期していたものではありませんでした: {1}
ko: 예기치 않은 {0} 파일 수: {1}
pt_br: Número inesperado de {0} files: {1}
ru: Непредвиденное количество файлов {0}: {1}
zh_hans: {0} 文件数异常: {1}
zh_hant: 非預期的 {0} 檔案數: {1}

# multipleSqlProjFilesSelected
source: Multiple .sqlproj files selected; please select only one.
de: Mehrere SQLPROJ-Dateien ausgewählt; wählen Sie nur eine aus.
es: Se han seleccionado varios archivos .sqlproj; seleccione solo uno.
fr: Plusieurs fichiers. sqlproj sélectionnés ; Sélectionnez un seul.
it: Sono stati selezionati più file con estensione sqlproj; sceglierne solo uno.
ja: 複数の .sqlproj ファイルが選択されています。1 つだけ選択してください。
ko: 여러 .sqlproj 파일이 선택되었습니다. 하나만 선택하세요.
pt_br: Vários arquivos. sqlproj selecionados; selecione apenas um.
ru: Выбрано несколько файлов. sqlproj. Выберите только один файл.
zh_hans: 已选择多个 .sqlproj 文件；请仅选择一个。
zh_hant: 選取了多個 .sqlproj 檔案；請只選取一個。

source: Name must not be empty
de: Der Name darf nicht leer sein.
es: El nombre no puede estar en blanco
fr: Le nom ne doit pas être vide
it: Il nome non deve essere vuoto
ja: 名前を空にすることはできません
ko: 이름은 비워 둘 수 없습니다.
pt_br: O nome não deve estar vazio
ru: Поле имени не может быть пустым.
zh_hans: 名称不得为空
zh_hant: 名稱不得為空白

source: New
de: Neu
es: Nuevo
fr: Nouveau
it: Nuovo
ja: 新規
ko: 새로 만들기
pt_br: Novo
ru: Создать
zh_hans: 新建
zh_hant: 新增

# newObjectNamePrompt
source: New {0} name:
de: Neuer {0}-Name:
es: Nuevo nombre de {0}:
fr: Nouveau nom{0} :
it: Nuovo nome {0}:
ja: 新しい {0} 名:
ko: 새 {0} 이름:
pt_br: Novo nome {0}:
ru: Новое имя {0}:
zh_hans: 新 {0} 名称:
zh_hant: 新的 {0} 名稱:

# noDataSourcesFile
source: No {0} found
de: Keine {0} gefunden
es: No se ha encontrado ningún {0}.
fr: {0} introuvable
it: Non è stato trovato alcun artefatto di tipo {0}
ja: {0} が見つかりません
ko: {0}을(를) 찾을 수 없음
pt_br: Não foi localizado nenhum {0}
ru: Не обнаружено {0}
zh_hans: 找不到 {0}。
zh_hant: 找不到 {0}

# noDataSourcesText
source: No data sources in this project
de: Keine Datenquellen in diesem Projekt
es: No hay ningún origen de datos en este proyecto.
fr: Aucune source de données dans ce projet
it: Nessuna origine dati in questo progetto
ja: このプロジェクトにデータソースがありません
ko: 이 프로젝트에 데이터 원본이 없습니다.
pt_br: Nenhuma fonte de dados neste projeto
ru: В этом проекте нет источников данных
zh_hans: 此项目中没有数据源
zh_hant: 此專案中沒有資料來源

# noFileExist
source: File {0} doesn't exist
de: Die Datei "{0}" ist nicht vorhanden
es: El archivo {0} no existe.
fr: Le fichier {0} n'existe pas
it: Il file {0} non esiste
ja: {0} ファイルは存在しません
ko: 파일 {0}이(가) 존재하지 않습니다.
pt_br: O arquivo {0} não existe
ru: Файл {0} не существует
zh_hans: 文件 {0} 不存在
zh_hant: 檔案 {0} 不存在

# noSchemaCompareExtension
source: The Schema Compare extension must be installed to a update a project from a database.
de: Die Schemavergleich-Erweiterung muss installiert werden, um ein Projekt aus einer Datenbank zu aktualisieren.
es: La extensión Comparación de esquemas debe instalarse en una actualización de un proyecto desde una base de datos.
it: Per aggiornare un progetto da un database, è necessario installare l'estensione Confronto schemi.
ja: データベースからプロジェクトを更新するには、Schema Compare 拡張機能をインストールする必要があります。
ko: 데이터베이스에서 프로젝트를 업데이트하려면 스키마 비교 확장을 설치해야 합니다.
pt_br: A extensão Comparação de Esquemas deve ser instalada para a atualização de um projeto a partir de um banco de dados.
ru: Для обновления проекта из базы данных должно быть установлено расширение "Сравнение схем".
zh_hant: 結構描述比較延伸模組必須安裝至資料庫中的更新專案。

# noSqlFilesGenerated
source: No .sql files were generated by Autorest. Please confirm that your spec contains model definitions, or check the output log for details.
de: Von AutoRest wurden keine SQL-Dateien generiert. Vergewissern Sie sich bitte, dass Ihre Spezifikation Modelldefinitionen enthält, oder überprüfen Sie das Ausgabeprotokoll für Details.
es: Autorest no generó ningún archivo .sql. Confirme que la especificación contiene definiciones de modelo o consulte el registro de salida para más detalles.
it: Nessun file SQL generato da Autorest. Verificare che la specifica contenga definizioni di modello o controllare il log di output per i dettagli.
ja: Autorest で生成された .sql ファイルはありません。仕様にモデル定義が含まれていることを確認するか、または出力ログで詳細を確認してください。
ko: Autorest에서 .sql 파일을 생성하지 않았습니다. 사양에 모델 정의가 포함되어 있는지 확인하거나 출력 로그에서 자세한 내용을 확인하세요.
pt_br: Nenhum arquivo.sql foi gerado pelo Autorest. Confirme se sua especificação contém definições de modelo ou verifique o log de saída para obter detalhes.
ru: Autorest не создал файлов .sql. Подтвердите, что спецификация содержит определения моделей, или см. дополнительные сведения в журнале вывода.
zh_hans: Autorest 未生成任何 .sql 文件。请确认规范包含模型定义，或查看输出日志以了解详细信息。
zh_hant: Autorest 未產生任何 .sql 檔案。請確認您的規格包含模型定義，或檢查輸出記錄以尋找詳細資料。

# noSqlProjFile
source: The selected project file does not exist
de: Die ausgewählte Projektdatei ist nicht vorhanden.
es: El archivo de proyecto seleccionado no existe
it: Il file di progetto selezionato non esiste
ja: 選択したプロジェクト ファイルが存在しません
ko: 선택한 프로젝트 파일이 없습니다.
pt_br: O arquivo de projeto selecionado não existe
ru: Выбранный файл проекта не существует
zh_hant: 選取的專案檔不存在

# noSqlProjFilesSelected
source: No .sqlproj file selected; please select one.
de: Es wurde keine SQLPROJ-Datei ausgewählt. wählen Sie eine aus.
es: No se ha seleccionado ningún archivo .sqlproj; seleccione uno.
fr: Aucun fichier .sqlproj sélectionné ; Sélectionnez-en un.
it: Non è stato selezionato nessun file con estensione sqlproj, selezionarne uno.
ja: .sqlproj ファイルが選択されていません。1 つ選択してください。
ko: Sqlproj 파일을 선택하지 않았습니다. 하나를 선택하세요.
pt_br: Nenhum arquivo. sqlproj selecionado; selecione um.
ru: Файл sqlproj не выбран. Выберите один из них.
zh_hans: 未选择任何 .sqlproj 文件；请选择一个。
zh_hant: 未選取任何 .sqlproj 檔案；請選取一個。

# noString
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
ru: Нет
zh_hans: 否
zh_hant: 否

# noStringDefault
source: No (default)
de: Nein (Standard)
es: No (valor predeterminado)
fr: Non (pas de valeur par défaut)
it: Nessuna (impostazione predefinita)
ja: いいえ (既定値)
ko: (기본값) 없음
pt_br: Não (padrão)
ru: Нет (по умолчанию)
zh_hans: 无(默认)
zh_hant: 無 (預設值)

# nodeButNotAutorestFound
source: Autorest tool not found in system path, but found Node.js. Prompting user for how to proceed. Execute 'npm install autorest -g' to install permanently and avoid this message.
de: Das Autorest-Tool wurde nicht im Systempfad gefunden, aber es wurde Node.js gefunden. Der Benutzer wird aufgefordert, den Vorgang fortzusetzen. Führen Sie „npm install autorest -g“ aus, um die Installation dauerhaft durchzuführen, und vermeiden Sie diese Meldung.
es: No se encontró la herramienta Autorest en la ruta de acceso del sistema, pero se encontró Node.js. Se solicita al usuario cómo continuar. Ejecute "npm install autorest -g" para instalar de forma permanente y evitar este mensaje.
it: Lo strumento autorest non è stato trovato nel percorso di sistema, ma è stato trovato Node.js. Richiesta all'utente di informazioni su come procedere. Eseguire 'npm install autorest -g' per installare in modo permanente ed evitare questo messaggio.
ja: Autorest ツールはシステム パスで見つかりませんでしたが、Node.js が見つかりました。 続行する方法をユーザーに確認しています。完全にインストールしてこのメッセージを回避するには、'npm install autorest -g' を実行します。
ko: Autorest 도구는 시스템 경로에 없지만 Node.js는 찾았습니다. 사용자에게 진행 방법을 묻는 메시지를 표시합니다. 영구적으로 설치하고 이 메시지를 피하려면 'npm install autorest -g'를 실행하세요.
pt_br: A ferramenta Autorest não foi encontrada no caminho do sistema, mas encontrou o Node.js. Solicitando ao usuário como proceder. Execute 'npm install autorest -g' para instalar permanentemente e evitar esta mensagem.
ru: Средство автоматического восстановления не найден в системном пути, но обнаружил Node.js. Запрос пользователя о дальнейших действиях. Выполните "npm install autorest -g", чтобы установить навсегда и избежать появления этого сообщения.
zh_hans: 在系统路径中找不到 Autorest 工具，但发现Node.js。提示用户如何继续。执行“npm install autorest -g”，永久安装并避免此消息。
zh_hant: 在系統路徑中找不到 Autorest 工具，但找到 Node.js。提示使用者如何繼續。執行 'npm install autorest -g' 以永久安裝並避免出現此訊息。

# nodeButNotAutorestFoundPrompt
source: Autorest is not installed. To proceed, choose whether to run Autorest from a temporary location via 'npx' or install Autorest globally then run.
de: AutoRest ist nicht installiert. Um fortzufahren, wählen Sie aus, ob AutoRest von einem temporären Speicherort über „npx“ ausgeführt werden soll, oder installieren Sie AutoRest global und führen Sie es dann aus.
es: Autorest no está instalado. Para continuar, elija si quiere ejecutar Autorest desde una ubicación temporal mediante 'npx' o instalar Autorest globalmente y, después, ejecutarlo.
it: Autorest non installato. Per continuare, scegliere se eseguire Autorest da un percorso temporaneo tramite 'npx' o installare Autorest a livello globale, quindi eseguire.
ja: Autorest がインストールされていません。続行するには、'npx' を介した一時的な場所で Autorest を実行するか、Autorest をグローバルにインストールしてから実行するかを選択します。
ko: 자동 테스트가 설치되어 있지 않습니다. 계속하려면 'npx'를 통해 임시 위치에서 Autorest를 실행할지 아니면 전역으로 Autorest를 설치할지 선택한 다음 실행합니다.
pt_br: O Autorest não está instalado. Para continuar, escolha se deseja executar o Autorest a partir de um local temporário por meio de 'npx' ou instale o Autorest globalmente e depois execute.
ru: Autorest не установлена. Чтобы продолжить, выберите, запускать ли Autorest из временного расположения с помощью "npx" или установить Autorest глобально, а затем запустить.
zh_hans: 未安装 Autorest。若要继续，请选择是通过 “npx” 从临时位置运行 Autorest，还是全局安装 Autorest，然后运行。
zh_hant: 未安裝 Autorest。若要繼續，請選擇是否要透過 'npx' 從暫時位置執行 Autorest，或全域安裝 Autorest 然後執行。

# nodeNotFound
source: Neither Autorest nor Node.js (npx) found in system path. Please install Node.js for Autorest generation to work.
de: Im Systempfad wurden weder AutoRest noch Node.js (npx) gefunden. Installieren Sie bitte Node.js, damit die AutoRest-Generierung funktioniert.
es: No se encontraron Autorest ni Node.js (npx) en la ruta de acceso del sistema. Instale Node.js para que funcione Autorest.
it: Non è stato trovato né autorest né Node.js (NPX) nel percorso di sistema. Installare Node.js per il funzionamento della generazione di autorest.
ja: システム パスで AutoRest と Node.js (npx) のいずれも見つかりませんでした。AutoRest の生成を機能させるには、Node.js をインストールしてください。
ko: 시스템 경로에 Autorest나 Node.js(npx)가 없습니다. Autorest 생성이 작동하려면 Node.js를 설치하세요.
pt_br: Nem o Autorest nem o Node.js (npx) foram encontrados no caminho do sistema. Instale o Node.js para que a geração do Autorest funcione.
ru: В системном пути не найдены Autorest и Node.js (npx). Установите Node.js, чтобы можно было использовать формирование Autorest.
zh_hans: 在系统路径中找不到 autorest 和 Node.js (npx)。请安装 Node.js 以使 Autorest 生成正常工作。
zh_hant: 在系統路徑中找不到 Autorest 和 Node.js (npx)。請安裝 Node.js 以產生 Autorest。

source: None Elements
de: Keine Elemente
es: Ningún elemento
it: Nessuno elemento
ja: 要素なし
ko: 요소 없음
pt_br: Nenhum Elemento
ru: Нет элементов
zh_hans: 无元素
zh_hant: 沒有任何元素

# nupkgNamePlaceholder
source: NuGet package name
it: Nome pacchetto NuGet
pt_br: Nome do pacote NuGet

# nupkgText
source: Published data-tier application (.nupkg)
it: Applicazione livello dati pubblicata (.nupkg)
pt_br: Aplicativo de camada de dados publicado (.nupkg)

source: Object Type
de: Objekttyp
es: Tipo de objeto
fr: Type d'objet
it: Tipo di oggetto
ja: オブジェクトの種類
ko: 개체 형식
pt_br: Tipo de Objeto
ru: Тип объекта
zh_hans: 对象类型
zh_hant: 物件類型

# onlyMoveFilesFoldersSupported
source: Only moving files and folders are supported
it: È supportato solo lo spostamento di file e cartelle
pt_br: Apenas a movimentação de arquivos e pastas é suportada

# openEulaString
source: Open License Agreement
de: Lizenzbedingungen öffnen
es: Abrir contrato de licencia
it: Apri contratto di licenza
ja: ライセンス契約を開く
ko: 라이선스 계약 열기
pt_br: Abrir o Contrato de Licença
ru: Открыть лицензионное соглашение
zh_hans: 打开许可协议
zh_hant: 開啟授權合約

source: Option Description
de: Optionsbeschreibung
es: Descripción de la opción
it: Descrizione opzione
ja: オプションの説明
ko: 옵션 설명
pt_br: Descrição da Opção
ru: Описание параметра
zh_hant: 選項描述

source: Option Name
de: Optionsname
es: Nombre de la opción
it: Nome opzione
ja: オプション名
ko: 옵션 이름
pt_br: Nome da Opção
ru: Имя параметра
zh_hant: 選項名稱

# optionNotFoundWarningMessage
source: label: {0} does not exist in the options value name lookup
de: Bezeichnung: {0} existiert nicht in der Option value name lookup
es: etiqueta: {0} no existe en la búsqueda de nombre de valor de opciones
it: etichetta: {0} non esiste nella ricerca del nome del valore delle opzioni
ja: ラベル: {0} はオプション値の名前参照に存在しません
ko: 레이블: {0}이(가) 옵션 값 이름 조회에 없음
pt_br: rótulo: {0} não existe na pesquisa de nome de valor de opções
ru: метка: {0} не существует в поиске имени значения параметров
zh_hant: 標籤: 選項值名稱查閱中不存在 {0}

# outsideFolderPath
source: Items with absolute path outside project folder are not supported. Please make sure the paths in the project file are relative to project folder.
de: Elemente mit absolutem Pfad außerhalb des Projektordners werden nicht unterstützt. Stellen Sie sicher, dass die Pfade in der Projektdatei relativ zum Projektordner sind.
es: No se admiten elementos con ruta absolutas fuera de la carpeta del proyecto. Asegúrese de que las rutas del archivo de proyecto son relativas a la carpeta del proyecto.
fr: Les éléments avec un chemin d’accès absolu extérieur au dossier du projet ne sont pas pris en charge. Assurez-vous que les chemins d’accès du fichier projet sont relatifs au dossier du projet.
it: Gli elementi con percorso assoluto all'esterno della cartella del progetto non sono supportati. Assicurarsi che i percorsi nel file di progetto siano relativi alla cartella del progetto.
ja: プロジェクト フォルダーの外に絶対パスがある項目はサポートされていません。プロジェクト ファイルのパスがプロジェクト フォルダーへの相対パスであることを確認してください。
ko: 프로젝트 폴더 외부에 절대 경로가 있는 항목은 지원되지 않습니다. 프로젝트 파일의 경로가 프로젝트 폴더에 상대적인지 확인하세요.
pt_br: Não há suporte para itens com caminho absoluto fora da pasta do projeto. Certifique-se de que os caminhos no arquivo de projeto sejam relativos à pasta do projeto.
ru: Элементы с абсолютным путем вне папки проекта не поддерживаются. Убедитесь, что пути в файле проекта указаны относительно папки проекта.
zh_hans: 不支持具有项目文件夹外绝对路径的项。请确保项目文件中的路径与项目文件夹相关。
zh_hant: 不支援在專案資料夾外具有絕對路徑的專案。請確定專案檔中的路徑與專案資料夾相對。

# parentTreeItemUnknown
source: Cannot access parent of provided tree item
de: Auf das übergeordnete Element des bereitgestellten Strukturelements kann nicht zugegriffen werden.
es: No se puede acceder al elemento primario del elemento de árbol proporcionado.
fr: Impossible d’accéder au parent de l’élément d’arborescence fourni
it: Non è possibile accedere all'elemento padre dell'elemento di albero fornito
ja: 指定されたツリー項目の親にアクセスできません
ko: 제공된 트리 항목의 부모에 액세스할 수 없습니다.
pt_br: Não é possível acessar o pai do item de árvore fornecido
ru: Не удается получить доступ к предоставленному родительскому элементу дерева
zh_hans: 无法访问所提供树项的父级
zh_hant: 無法存取提供之樹狀項目的父代

# passwordNotMatch
source: {0} password doesn't match the confirmation password
de: {0} Kennwort stimmt nicht mit dem Bestätigungskennwort überein
es: La contraseña de {0} no coincide con la contraseña de confirmación.
it: La password {0} del SQL Server non corrisponde alla password di conferma
ja: {0} パスワードが確認パスワードと一致しません
ko: {0} 암호가 확인 암호와 일치하지 않습니다.
pt_br: {0} senha não corresponde à senha de confirmação
ru: Пароль {0} не совпадает с подтверждением
zh_hant: {0} 密碼與確認密碼不相符

# portMustNotBeNumber
source: Port must a be number
de: Der Port muss eine Zahl sein.
es: El puerto debe ser un número
fr: Le port doit être un numéro
it: La porta deve essere un numero
ja: ポートは数値である必要があります
ko: 포트는 숫자여야 함
pt_br: A porta deve ser um número
ru: Порт должен быть числом
zh_hans: 端口必须是数字
zh_hant: 連接埠必須是數字

source: PostDeploy Elements
de: PostDeploy-Elemente
es: Elementos posteriores a la implementación
it: Elementi PreDeploy
ja: PostDeploy 要素
ko: 요소 사후 배포
pt_br: Elementos de PostDeploy
ru: Элементы PostDeploy
zh_hans: PostDeploy 元素
zh_hant: PreDeploy 元素

source: PreDeploy Elements
de: PreDeploy-Elemente
es: Elementos anteriores a la implementación
it: Elementi PreDeploy
ja: PreDeploy 要素
ko: 요소 사전 배포
pt_br: Elementos de PreDeploy
ru: Элементы PreDeploy
zh_hans: PreDeploy 元素
zh_hant: PreDeploy 元素

# prePostDeployCount
source: To successfully build, update the project to have one pre-deployment script and/or one post-deployment script
de: Um erfolgreich zu erstellen, aktualisieren Sie das Projekt so, dass es über ein Skript vor der Bereitstellung und/oder ein Skript nach der Bereitstellung verfügt.
es: Para realizar una compilación correcta, actualice el proyecto para que tenga un script anterior a la implementación o un script posterior a la implementación.
fr: Pour créer correctement, mettez à jour le projet avec un script de pré-déploiement et/ou un script de post-déploiement
it: Per eseguire correttamente la compilazione, aggiornare il progetto in modo che abbia uno script di pre-distribuzione e/o uno script di post-distribuzione
ja: ビルドを成功させるには、1 つの配置前スクリプトと 1 つの配置後スクリプトを含むように、プロジェクトを更新します
ko: 성공적으로 빌드하려면 프로젝트를 배포 전 스크립트 하나 및/또는 배포 후 스크립트 하나를 보유하도록 업데이트합니다.
pt_br: Para compilar com êxito, atualize o projeto para ter um script de pré-implantação e/ou um script pós-implantação
ru: Для успешной сборки обновите проект, добавив в него один сценарий перед развертыванием и/или один сценарий после развертывания.
zh_hans: 要成功生成，请更新项目以具有一个预先部署脚本和/或一个后期部署脚本
zh_hant: 若要成功組建，請更新專案以擁有一個預先部署指令碼和/或一個部署後指令碼

source: Profile
de: Profil
es: Perfil
fr: Profil
it: Profilo
ja: プロファイル
ko: 프로필
pt_br: Perfil
ru: Профиль
zh_hans: 配置文件
zh_hant: 設定檔

# profileReadError
source: Error loading the publish profile. {0}
de: Fehler beim Laden des Veröffentlichungsprofils. {0}
es: Error al cargar el perfil de publicación. {0}
fr: Erreur lors du chargement du profil de publication. {0}
it: Errore durante il caricamento del profilo di pubblicazione. {0}
ja: 発行プロファイルの読み込みエラー。{0}
ko: 게시 프로필을 로드하는 동안 오류가 발생했습니다. {0}
pt_br: Erro ao carregar o perfil de publicação. {0}
ru: Ошибка при загрузке профиля публикации. {0}
zh_hans: 加载发布配置文件时出错。{0}
zh_hant: 載入發佈設定檔時發生錯誤。{0}
