Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql-migration.*.xlf
Languages: it

# sql.migration.validate.ir.heading
source: We are validating the following:
it: Stiamo convalidando quanto segue:

# sql.migration.validate.ir.results.heading
source: Validation step details
it: Dettagli passaggio di convalida

# sql.migration.validate.ir.sqldb.validation.result.error
source: Validation check error{0}Source database: {1}{0}Target database: {2}{0}Error: {3} - {4}
it: Errore di controllo di convalida{0}database di origine: {1}{0}Database di destinazione: {2}{0}Errore: {3} - {4}

# sql.migration.validate.ir.start.validation
source: Start validation
it: Avvia convalida

# sql.migration.validate.ir.status
source: Validation status: {0}
it: Stato di convalida: {0}

# sql.migration.validate.ir.status.error.count.many
source: {0} - {1} errors
it: {0} - {1} errori

# sql.migration.validate.ir.status.error.count.one
source: {0} - 1 error
it: {0} - 1 errore

# sql.migration.validate.ir.status.errors
source: Validation status: {0}{1}{2}
it: Stato di convalidas: {0}{1}{2}

# sql.migration.validate.ir.stop.validation
source: Stop validation
it: Interrompi convalida

# sql.migration.validate.ir.validation.camceled
source: Validation check canceled
it: Controllo di convalida annullato

# sql.migration.validate.ir.validation.completed
source: Validation completed successfully.
it: La convalida è stata completata.

# sql.migration.validate.ir.validation.result.api.error
source: Validation check error{0}Database:{1}{0}Error: {2} - {3}
it: Errore di controllo di convalida{0}Database:{1}{0}Errore: {2} - {3}

# sql.migration.validate.ir.validation.result.error
source: Validation check error{0}Source database: {1}{0}File share path: {2}{0}Error: {3} - {4}
it: Errore di controllo di convalida{0}database di origine: {1}{0}Percorso condivisione file: {2}{0}Errore: {3} - {4}

# sql.migration.validate.ir.validation.result.label.networkshare
source: Network share connectivity: '{0}'
it: Connettività condivisione di rete: '{0}'

# sql.migration.validate.ir.validation.result.label.shir
source: Integration runtime connectivity
it: Connettività del runtime di integrazione

# sql.migration.validate.ir.validation.result.label.source.database
source: Source database connectivity: '{0}'
it: Connessione database di origine: '{0}'

# sql.migration.validate.ir.validation.result.label.storage
source: Azure storage connectivity
it: Connettività di Archiviazione di Azure

# sql.migration.validate.ir.validation.result.label.target.database
source: Target database connectivity: '{0}'
it: Connettività del database di destinazione: '{0}'

# sql.migration.validation.canceled
source: Validation was canceled. Please run and validate the migration settings to continue.
it: Convalida annullata. Per continuare, eseguire e convalidare le impostazioni di migrazione.

# sql.migration.validation.canceled.errors
source: Validation was canceled with the following error(s):{0}{1}
it: Convalida annullata con gli errori seguenti: {0}{1}

# sql.migration.validation.dialog.title
source: Running validation
it: Esecuzione della convalida

# sql.migration.validation.not.run
source: Validation has not been run for the current configuration. Please run and validate the migration settings to continue.
it: La convalida non è stata eseguita per la configurazione corrente. Eseguire e convalidare le impostazioni di migrazione per continuare.

# sql.migration.validation.state.canceled
source: Canceled
it: Annullata

# sql.migration.validation.state.failed
source: Failed
it: Non riuscita

# sql.migration.validation.state.pending
source: Pending
it: In sospeso

# sql.migration.validation.state.running
source: Running
it: In esecuzione

# sql.migration.validation.state.succeeded
source: Succeeded
it: Riuscita

# sql.migration.validation.success
source: Validation completed successfully. Please click Next to proceed with the migration.
it: Convalida completata. Fare clic su Avanti per procedere con la migrazione.

# sql.migration.view.all
source: All database migrations
it: Tutte le migrazioni del database

# sql.migration.view.select.button.label
source: View/Select
it: Visualizza/Seleziona

# sql.migration.warning
source: Warning
it: Avviso

# sql.migration.warnings
source: Warnings
it: Avvisi

# sql.migration.warnings.count
source: Warnings ({0})
it: Avvisi ({0})

# sql.migration.warnings.details
source: Warnings details
it: Dettagli sugli avvisi

# sql.migration.windows.user.account
source: Domain\username
it: Dominio\nome utente

# sql.migration.wizard.account.add.button.label
source: Link account
it: Collega account

# sql.migration.wizard.account.count.multiple.message
source: {0} accounts linked
it: {0} account collegati

# sql.migration.wizard.account.count.single.message
source: {0} account linked
it: {0} account collegato

# sql.migration.wizard.account.description
source: Select an Azure account linked to Azure Data Studio, or link one now.
it: Selezionare un account Azure collegato ad Azure Data Studio o collegarne uno adesso.

# sql.migration.wizard.account.noAccount.error
source: Add a linked account and then try again.
it: Aggiungere un account collegato e quindi riprovare.

# sql.migration.wizard.account.title
source: Azure account
it: Account Azure

# sql.migration.wizard.connection.error.title
source: An error occurred while connecting to the target server.
it: Errore durante la connessione al server di destinazione.

# sql.migration.wizard.login.error.title
source: An error occurred while trying to get {0} login information.
it: Si è verificato un errore durante il tentativo di ottenere {0} informazioni di accesso.

# sql.migration.wizard.perfCollection.error
source: Error(s) occurred while collecting performance data for the server '{0}'. If these issues persist, try restarting the data collection process: {1}
it: Si sono verificati errori durante la raccolta dei dati sulle prestazioni per il server '{0}'. Se i problemi persistono, provare a riavviare il processo di raccolta dati: {1}

# sql.migration.wizard.sku.all
source: Based on the assessment results, all {0} of your databases in an online state can be migrated to Azure SQL.
it: In base ai risultati della valutazione, è possibile eseguire la migrazione di tutti e {0} i database in stato online ad Azure SQL.

# sql.migration.wizard.sku.assessment.error
source: An error occurred while assessing the server '{0}'.
it: Si è verificato un errore durante la valutazione del server '{0}'.

# sql.migration.wizard.sku.assessment.error.bypass
source: Check this option to skip assessment and continue the migration.
it: Selezionare questa opzione per ignorare la valutazione e continuare la migrazione.

# sql.migration.wizard.sku.assessment.error.detail
source: [There are no assessment results to validate readiness of your database migration. By checking this box, you acknowledge you want to proceed migrating your database to the desired Azure SQL target.]
it: [Non sono disponibili risultati di valutazione per convalidare l'idoneità della migrazione del database. Selezionando questa casella, si conferma di voler procedere con la migrazione del database alla destinazione Azure SQL desiderata.]

# sql.migration.wizard.sku.assessment.unexpected.error
source: An unexpected error occurred while assessing the server '{0}'.{3}Message: {1}{3}stack: {2}
it: Si è verificato un errore imprevisto durante la valutazione del server ‘{0}’.{3}Messaggio: {1}{3}stack: {2}

# sql.migration.wizard.sku.choose_a_target
source: Choose your Azure SQL target
it: Scegliere la destinazione di Azure SQL

# sql.migration.wizard.sku.error
source: An error occurred while generating SKU recommendations for the server '{0}'.
it: Si è verificato un errore durante la generazione delle raccomandazioni sullo SKU per il server '{0}'.

# sql.migration.wizard.sku.error.noRecommendation
source: No recommendation available
it: Nessuna raccomandazione disponibile

# sql.migration.wizard.sku.error.noRecommendation.reason
source: No SKU recommendations were generated, as there were no SKUs which could satisfy the performance characteristics of your source. Try selecting a different target platform, adjusting recommendation parameters, selecting a different set of databases to assess, or changing the recommendation model.
it: Non sono state generate raccomandazioni sullo SKU perché non sono presenti SKU in grado di soddisfare le caratteristiche di prestazioni dell'origine. Provare a selezionare una piattaforma di destinazione diversa, a modificare i parametri delle raccomandazioni, a selezionare un set diverso di database da valutare o a modificare il modello di raccomandazione.

# sql.migration.wizard.source.missing
source: Connection was successful but did not find any target databases.
it: La connessione è riuscita ma non sono stati trovati database di destinazione.

# sql.migration.wizard.target.connection.error
source: Connection error: {0}
it: Errore di connessione: {0}

# sql.migration.wizard.target.connection.success
source: Connection was successful. Target databases found: {0}
it: Connessione riuscita. Database di destinazione trovati: {0}

# sql.migration.wizard.target.description
source: Select an Azure account and your target {0}.
it: Selezionare un account Azure e {0} di destinazione.

# sql.migration.wizard.target.login.error
source: Error getting login information: {0}
it: Errore durante il recupero delle informazioni di accesso: {0}

# sql.migration.wizard.target.mapping.error.duplicate
source: Database mapping error. Target database '{0}' cannot be selected to as a migration target for database '{1}'. Target database '${targetDatabaseName}' is already selected as a migration target for database '{2}'. Please select a different target database.
it: Errore di mapping del database. Non è possibile selezionare il database di destinazione '{0}' come destinazione di migrazione per il database '{1}'. Il database di destinazione '${targetDatabaseName}' è già selezionato come destinazione di migrazione per il database '{2}'. Selezionare un database di destinazione diverso.

# sql.migration.wizard.target.missing
source: Database mapping error. Missing target databases to migrate. Please configure the target server connection and click connect to collect the list of available database migration targets.
it: Errore di mapping del database. Database di destinazione di cui eseguire la migrazione mancanti. Configurare la connessione al server di destinazione e fare clic su Connetti per raccogliere l'elenco delle destinazioni di migrazione di database disponibili.

# sql.migration.wizard.target.source.mapping.error
source: Database mapping error. Source database '{0}' is not mapped to a target database. Please select a target database to migrate to.
it: Errore di mapping del database. Il database di origine '{0}' non è mappato a un database di destinazione. Selezionare un database di destinazione a cui eseguire la migrazione.

# sql.migration.wizard.target.title
source: Azure SQL target
it: Destinazione di Azure SQL

# sql.migration.yes
source: Yes
it: Sì

# total.databases.selected
source: {0} of {1} databases selected
it: {0} di {1} database selezionati

# total.tables.selected.of.total
source: {0} of {1}
it: {0} di {1}

# sql.migration.starting.migration.error
source: An error occurred while starting the migration: '{0}'
it: Si è verificato un errore durante l'avvio della migrazione: '{0}'

# sql.migration.starting.migration.message
source: Starting migration for database {0} to {1} - {2}
it: Avvio della migrazione per il database {0} a {1} - {2}

# cancel-migration-menu
source: Cancel migration
it: Annulla migrazione

# complete-cutover-menu
source: Complete cutover
it: Completa cutover

# copy-migration-menu
source: Copy migration details
it: Dettagli di Copia migrazione

# database-details-menu
source: Database details
it: Dettagli di Database

# description
source: Azure SQL migration description
it: Descrizione della migrazione di Azure SQL

# displayName
source: Azure SQL Migration
it: Migrazione di Azure SQL

# migration-command-category
source: Azure SQL Migration
it: Migrazione di Azure SQL

# migration-context-menu-category
source: Migration Context Menu
it: Menu di scelta rapida Migrazione

# migration-dashboard-tasks
source: Migration Tasks
it: Attività di migrazione

# migration-dashboard-title
source: Azure SQL Migration
it: Migrazione di Azure SQL

# migration-notebook-command-title
source: Open Azure SQL migration notebooks
it: Apri notebook di migrazione di Azure SQL

# new-support-request-command
source: New support request
it: Nuova richiesta di supporto

# refresh-migrations-command
source: Refresh
it: Aggiorna

# retry-migration-menu
source: Retry migration
it: Ripeti migrazione

# start-migration-command
source: Migrate to Azure SQL
it: Esegui migrazione ad Azure SQL

# view-service-menu
source: Database Migration Service details
it: Dettagli sul Servizio Migrazione del database

# view-target-menu
source: Azure SQL Target details
it: Dettagli di Destinazione di Azure SQL
