Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

source: Saved Connections
de: Gespeicherte Verbindungen
es: Conexiones guardadas
fr: Connexions enregistrées
it: Connessioni salvate
ja: 保存された接続
ko: 저장된 연결
pt_br: Conexões Salvas
zh_hans: 保存的连接

source: Connection error
de: Verbindungsfehler
es: Error de conexión
fr: Erreur de connexion
it: Errore di connessione
ja: 接続エラー
ko: 연결 오류
pt_br: Erro de conexão
zh_hans: 连接错误

# kerberosErrorStart
source: Connection failed due to Kerberos error.
de: Fehler bei Verbindung aufgrund eines Kerberos-Fehlers.
es: Error en la conexión debido a un error de Kerberos.
fr: La connexion a échoué en raison d'une erreur Kerberos.
it: La connessione non è riuscita a causa di un errore di Kerberos.
ja: 接続は、Kerberos エラーのため失敗しました。
ko: Kerberos 오류로 인해 연결이 실패했습니다.
pt_br: A conexão falhou devido a um erro do Kerberos.
zh_hans: 由于 Kerberos 错误，连接失败。

# kerberosHelpLink
source: Help configuring Kerberos is available at {0}
de: Hilfe zum Konfigurieren von Kerberos finden Sie hier: {0}
es: La ayuda para configurar Kerberos está disponible en {0}
fr: L'aide pour configurer Kerberos est disponible sur {0}
it: Le informazioni sulla configurazione di Kerberos sono disponibili all'indirizzo {0}
ja: Kerberos を構成するためのヘルプを {0} で確認できます
ko: Kerberos 구성 도움말이 {0}에 있습니다.
pt_br: Ajuda para configurar o Kerberos está disponível em {0}
zh_hans: 可在 {0} 处获取有关配置 Kerberos 的帮助

# kerberosKinit
source: If you have previously connected you may need to re-run kinit.
de: Wenn Sie zuvor eine Verbindung hergestellt haben, müssen Sie "kinit" möglicherweise erneut ausführen.
es: Si se ha conectado anteriormente puede que necesite volver a ejecutar kinit.
fr: Si vous vous êtes déjà connecté, vous devez peut-être réexécuter kinit.
it: Se si è già eseguita la connessione, può essere necessario eseguire di nuovo kinit.
ja: 以前に接続した場合は、kinit を再実行しなければならない場合があります。
ko: 이전에 연결된 경우 kinit을 다시 실행해야 할 수 있습니다.
pt_br: Se você já se conectou anteriormente, pode ser necessário executar novamente o kinit.
zh_hans: 如果之前已连接，可能需要重新运行 kinit。

# connectType
source: Connection type
de: Verbindungstyp
es: Tipo de conexión
fr: Type de connexion
it: Tipo di connessione
ja: 接続の種類
ko: 연결 형식
pt_br: Tipo de conexão
zh_hans: 连接类型

source: Connecting
de: Verbindung wird hergestellt
es: Conexión en curso
fr: Connexion
it: Connessione
ja: 接続しています
ko: 연결
pt_br: Conectando
zh_hans: 正在连接

# connectionDetailsTitle
source: Connection Details
de: Verbindungsdetails
es: Detalles de conexión
fr: Détails de la connexion
it: Dettagli connessione
ja: 接続の詳細
ko: 연결 세부 정보
pt_br: Detalhes da Conexão
zh_hans: 连接详细信息

# connectionDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# connectionDialog.connect
source: Connect
de: Verbinden
es: Conectar
fr: Connecter
it: Connetti
ja: 接続
ko: 연결
pt_br: Conectar
zh_hans: 连接

# connectionDialog.recentConnections
source: Recent Connections
de: Letzte Verbindungen
es: Conexiones recientes
fr: Connexions récentes
it: Connessioni recenti
ja: 最近の接続
ko: 최근 연결
pt_br: Conexões Recentes
zh_hans: 最近的连接

# noRecentConnections
source: No recent connection
de: Keine aktuelle Verbindung
es: Ninguna conexión reciente
fr: Aucune connexion récente
it: Non ci sono connessioni recenti
ja: 最近の接続はありません
ko: 최근 연결 없음
pt_br: Nenhuma conexão recente
zh_hans: 没有最近的连接

# recentConnectionTitle
source: Recent
de: Zuletzt verwendet
es: Reciente
fr: Récent
it: Recenti
ja: 最近
ko: 최근 항목
pt_br: Recente
zh_hans: 最近

# cancelConnectionConfirmation
source: Are you sure you want to cancel this connection?
de: Möchten Sie diese Verbindung abbrechen?
es: ¿Seguro que desea cancelar esta conexión?
fr: Voulez-vous vraiment annuler cette connexion ?
it: Annullare questa connessione?
ja: この接続をキャンセルしてもよろしいですか?
ko: 이 연결을 취소하시겠습니까?
pt_br: Tem certeza de que deseja cancelar esta conexão?
zh_hans: 确定要取消此连接吗?

# connection.invalidConnectionResult
source: Connection result is invalid
de: Das Verbindungsergebnis ist ungültig.
es: El resultado de la conexión no es válido
fr: Le résultat de la connexion n'est pas valide.
it: Risultato connessione non valido
ja: 接続結果が無効です
ko: 연결 결과가 잘못되었습니다.
pt_br: O resultado da conexão é inválido
zh_hans: 连接结果无效

# connection.neverShowUnsupportedVersionWarning
source: Don't show again
de: Nicht mehr anzeigen
es: No volver a mostrar
fr: Ne plus afficher
it: Non visualizzare più
ja: 今後は表示しない
ko: 다시 표시 안 함
pt_br: Não mostrar novamente
zh_hans: 不再显示

# connection.noAzureAccount
source: Failed to get Azure account token for connection
de: Fehler beim Abrufen des Azure-Kontotokens für die Verbindung.
es: Error al obtener el token de cuenta de Azure para conexión
fr: L'obtention d'un jeton de compte Azure pour la connexion a échoué
it: Non è stato possibile recuperare il token dell'account di Azure per la connessione
ja: 接続用の Azure アカウント トークンの取得に失敗しました
ko: 연결을 위한 Azure 계정 토큰을 가져오지 못함
pt_br: Falha ao obter o token de conta do Azure para a conexão
zh_hans: 未能获取 Azure 帐户令牌用于连接

# connection.refreshAzureTokenFailure
source: Failed to refresh Azure account token for connection
de: Fehler beim Aktualisieren des Azure-Kontotokens für die Verbindung.
es: Error al actualizar el token de cuenta de Azure para conexión
fr: L’actualisation d'un jeton de compte Azure pour la connexion a échoué.
it: Non è stato possibile aggiornare il token dell'account di Azure per la connessione
ja: 接続用の Azure アカウント トークンの更新に失敗しました
ko: 연결을 위한 Azure 계정 토큰을 새로 고침하지 못함
pt_br: Falha ao obter o token de conta do Azure para a conexão
zh_hans: 未能刷新用于连接的 Azure 帐户令牌

# connection.unsupportedServerVersionWarning
source: The server version is not supported by Azure Data Studio, you may still connect to it but some features in Azure Data Studio might not work as expected.
de: Die Serverversion wird von Azure Data Studio nicht unterstützt. Sie können dennoch eine Verbindung damit herstellen, aber einige Features in Azure Data Studio funktionieren möglicherweise nicht wie erwartet.
es: La versión del servidor no es compatible con Azure Data Studio, es posible que aún pueda conectarse a ella, pero puede que algunas características de Azure Data Studio no funcionen de la forma esperada.
fr: La version du serveur n’est pas prise en charge par Azure Data Studio, vous pouvez toujours vous y connecter mais certaines fonctionnalités de Azure Data Studio peuvent ne pas fonctionner comme prévu.
it: La versione del server non è supportata da Azure Data Studio, è possibile comunque connettersi ad esso, ma alcune funzionalità di Azure Data Studio potrebbero non funzionare come previsto.
ja: サーバー バージョンが Azure Data Studio でサポートされていません。接続できますが、Azure Data Studio の一部の機能が適切に機能しない可能性があります。
ko: 서버 버전은 Azure Data Studio에서 지원되지 않으므로 계속 연결할 수 있지만 Azure Data Studio의 일부 기능이 예상대로 작동하지 않을 수 있습니다.
pt_br: A versão do servidor não é compatível com Azure Data Studio, você ainda pode se conectar a ela, mas alguns recursos no Azure Data Studio podem não funcionar conforme o esperado.
zh_hans: Azure Data Studio 不支持此服务器版本，你仍然可以连接到它，但 Azure Data Studio 中的某些功能可能无法按预期工作。

# connectionManagementService.noProviderForUri
source: Could not find provider for uri: {0}
de: Der Anbieter für URI konnte nicht gefunden werden: {0}
es: No se encontró ningún proveedor para el URI: {0}
fr: Impossible de trouver le fournisseur pour l’uri : {0}
it: Non è stato possibile trovare il provider per l'URI: {0}
ja: URI のプロバイダーが見つかりませんでした:{0}
ko: {0} URI에 대한 공급자를 찾을 수 없습니다.
pt_br: Não foi possível encontrar o provedor para o uri: {0}
zh_hans: 找不到此 URI 的提供程序: {0}

# connectionNotAcceptedError
source: Connection Not Accepted
de: Verbindung nicht akzeptiert.
es: Conexión no aceptada
fr: Connexion non acceptée
it: Connessione non accettata
ja: 接続が承認されていません
ko: 연결이 허용되지 않음
pt_br: Conexão não aceita
zh_hans: 连接未被接受

# connectionService.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否

# connectionService.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
zh_hans: 是

# addNewServerGroup
source: Add new group...
de: Neue Gruppe hinzufügen...
es: Agregar nuevo grupo...
fr: Ajouter un nouveau groupe...
it: Aggiungi nuovo gruppo...
ja: 新しいグループを追加する...
ko: 새 그룹 추가...
pt_br: Adicionar novo grupo...
zh_hans: 添加新组…

source: Advanced...
de: Erweitert...
es: Avanzado...
fr: Avancé...
it: Avanzate...
ja: 詳細設定...
ko: 고급...
pt_br: Avançado...
zh_hans: 高级…

# connection.azureAccountDropdownLabel
source: Account
de: Konto
es: Cuenta
fr: Compte
ja: アカウント
ko: 계정
pt_br: Conta
zh_hans: 帐户

# connection.azureTenantDropdownLabel
source: Azure AD tenant
de: Azure AD-Mandant
es: Inquilino de Azure AD
fr: Locataire Azure AD
it: Tenant di Azure AD
ja: Azure AD テナント
ko: Azure AD 테넌트
pt_br: Locatário do Azure AD
zh_hans: Azure AD 租户

# connectionName
source: Name (optional)
es: Nombre (opcional)
fr: Nom (facultatif)
it: Nome (facoltativo)
ja: 名前 (省略可能)
ko: 이름(옵션)
pt_br: Nome (opcional)
zh_hans: 名称(可选)

# connectionWidget.AddAzureAccount
source: Add an account...
de: Konto hinzufügen...
es: Agregar una cuenta...
fr: Ajouter un compte...
it: Aggiungi un account...
ja: アカウントを追加する...
ko: 계정 추가...
pt_br: Adicionar uma conta...
zh_hans: 添加帐户…

# connectionWidget.fieldWillBeTrimmed
source: {0} will be trimmed.
de: "{0}" wird gekürzt.
es: {0} se recortará.
fr: {0} est tronqué.
it: {0} verrà tagliato.
ja: {0} がトリミングされます。
ko: {0}이(가) 잘립니다.
pt_br: {0} será removido.
zh_hans: 将剪裁 {0}。

# connectionWidget.invalidAzureAccount
source: You must select an account
de: Sie müssen ein Konto auswählen.
es: Debe seleccionar una cuenta
fr: Vous devez sélectionner un compte
it: È necessario selezionare un account
ja: アカウントを選択する必要があります
ko: 계정을 선택해야 합니다.
pt_br: Você precisa selecionar uma conta
zh_hans: 必须选择一个帐户

# connectionWidget.missingRequireField
source: {0} is required.
de: "{0}" ist erforderlich.
es: {0} es necesario.
fr: {0} est obligatoire.
it: {0} è obbligatorio.
ja: {0} が必須です。
ko: {0}이(가) 필요합니다.
pt_br: {0} é obrigatório.
zh_hans: {0} 是必需的。

# connectionWidget.refreshAzureCredentials
source: Refresh account credentials
de: Kontoanmeldeinformationen aktualisieren
es: Actualizar credenciales de la cuenta
fr: Actualiser les informations d'identification du compte
it: Aggiorna credenziali dell'account
ja: アカウントの資格情報を更新
ko: 계정 자격 증명 새로 고침
pt_br: Atualizar as credenciais de conta
zh_hans: 刷新帐户凭据

# defaultDatabaseOption
source: <Default>
de: <Standard>
es: <Predeterminado>
fr: <Par défaut>
it: <Predefinito>
ja: <既定>
ko: <기본값>
pt_br: <Padrão>
zh_hans: <默认值>

# defaultServerGroup
source: <Default>
de: <Standard>
es: <Predeterminado>
fr: <Par défaut>
it: <Predefinito>
ja: <既定>
ko: <기본값>
pt_br: <Padrão>
zh_hans: <默认值>

# loadingDatabaseOption
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...
it: Caricamento...
ja: 読み込んでいます...
ko: 로드 중...
pt_br: Carregando...
zh_hans: 正在加载…

# noneServerGroup
source: <Do not save>
de: <Nicht speichern>
es: <No guardar>
fr: <Ne pas enregistrer>
it: <Non salvare>
ja: <保存しない>
ko: <저장 안 함>
pt_br: <Não salvar>
zh_hans: <不保存>

source: Remember password
de: Kennwort speichern
es: Recordar contraseña
fr: Se souvenir du mot de passe
it: Memorizza password
ja: パスワードを記憶する
ko: 암호 저장
pt_br: Lembrar senha
zh_hans: 记住密码

source: Server group
de: Servergruppe
es: Grupo de servidores
fr: Groupe de serveurs
it: Gruppo di server
ja: サーバー グループ
ko: 서버 그룹
pt_br: Grupo de servidores
zh_hans: 服务器组

# onDidConnectMessage
source: Connected to
de: Verbunden mit
es: Se ha conectado a
fr: Connecté à
it: Connesso a
ja: 接続先
ko: 연결 대상
pt_br: Conectado a
zh_hans: 已连接到

# onDidDisconnectMessage
source: Disconnected
de: Getrennt
es: Desconectado
fr: Déconnecté
it: Disconnesso
ja: 切断
ko: 연결 끊김
pt_br: Desconectado
zh_hans: 已断开连接

# unsavedGroupLabel
source: Unsaved Connections
de: Nicht gespeicherte Verbindungen
es: Conexiones sin guardar
fr: Connexions non enregistrées
it: Connessioni non salvate
ja: 保存されていない接続
ko: 저장되지 않은 연결
pt_br: Conexões Não Salvas
zh_hans: 未保存的连接

# newDashboardTab.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# newDashboardTab.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# newDashboardTab.openDashboardExtensions
source: Open dashboard extensions
de: Dashboarderweiterungen öffnen
es: Abrir extensiones de panel
fr: Ouvrir les extensions de tableau de bord
it: Apri le estensioni del dashboard
ja: ダッシュボードの拡張機能を開く
ko: 대시보드 확장 열기
pt_br: Abrir extensões do painel
zh_hans: 打开仪表板扩展

# newdashboardTabDialog.noExtensionLabel
source: No dashboard extensions are installed at this time. Go to Extension Manager to explore recommended extensions.
de: Aktuell sind keine Dashboarderweiterungen installiert. Wechseln Sie zum Erweiterungs-Manager, um die empfohlenen Erweiterungen zu erkunden.
es: No hay extensiones de panel instaladas en este momento. Vaya al Administrador de extensiones para explorar las extensiones recomendadas.
fr: Aucune extension de tableau de bord n'est actuellement installée. Accédez au gestionnaire d'extensions pour explorer les extensions recommandées.
it: Al momento non sono installate estensioni del dashboard. Passare a Gestione estensioni per esplorare le estensioni consigliate.
ja: まだダッシュボードの拡張機能がインストールされていません。拡張機能マネージャーに移動し、推奨される拡張機能をご確認ください。
ko: 현재 설치된 대시보드 확장이 없습니다. 확장 관리자로 가서 권장되는 확장을 살펴보세요.
pt_br: Não há extensões de painel para serem instaladas neste momento. Vá para o Gerenciador de Extensões para explorar extensões recomendadas.
zh_hans: 目前尚未安装仪表板扩展。转“到扩展管理器”以浏览推荐的扩展。

# wizardPageNumberDisplayText
source: Step {0}
de: Schritt {0}
es: Paso {0}
fr: Étape {0}
it: Passaggio {0}
ja: ステップ {0}
ko: {0}단계
pt_br: Etapa {0}
zh_hans: 步骤 {0}

# dialogModalCancelButtonLabel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# dialogModalDoneButtonLabel
source: Done
de: Fertig
es: Listo
fr: Terminé
it: Fatto
ja: 完了
ko: 완료
pt_br: Concluído
zh_hans: 完成

# query.initEditExecutionFailed
source: Initialize edit data session failed:
de: Fehler beim Initialisieren der Datenbearbeitungssitzung:
es: Error al inicializar la sesión de edición de datos:
fr: L'initialisation de la session de modification des données a échoué :
it: L'inizializzazione della sessione di modifica dati non è riuscita:
ja: 編集データ セッションを初期化できませんでした:
ko: 편집 데이터 세션 초기화 실패:
pt_br: Falha ao inicializar a sessão de edição de dados:
zh_hans: 初始化编辑数据会话失败:

source: Copy details
de: Details kopieren
es: Copiar detalles
fr: Copier les détails
it: Copia dettagli
ja: コピーの詳細
ko: 세부 정보 복사
pt_br: Copiar detalhes
zh_hans: 复制详细信息

# errorMessageDialog.action
source: Action
de: Aktion
es: Acción
it: Azione
ja: アクション
ko: 작업
pt_br: Ação
zh_hans: 操作

# errorMessageDialog.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# errorMessageDialog.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pt_br: Erro
zh_hans: 错误

source: Ignore
de: Ignorieren
es: Omitir
fr: Ignorer
it: Ignora
ja: 無視する
ko: 무시
pt_br: Ignorar
zh_hans: 忽略

source: Info
es: Información
fr: Informations
it: Informazioni
ja: 情報
ko: 정보
pt_br: Informações
zh_hans: 信息

source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
it: Avviso
ja: 警告
ko: 경고
pt_br: Aviso
zh_hans: 警告

# fileBrowser.discard
source: Discard
de: Verwerfen
es: Descartar
fr: Ignorer
it: Rimuovi
ja: 破棄
ko: 삭제
pt_br: Descartar
zh_hans: 放弃

# fileBrowser.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# fileFilter
source: Files of type
de: Dateien vom Typ
es: Archivos de tipo
fr: Fichiers de type
it: File di tipo
ja: ファイルの種類
ko: 파일 형식
pt_br: Arquivos do tipo
zh_hans: 文件类型

# filebrowser.filepath
source: Selected path
de: Ausgewählter Pfad
es: Ruta seleccionada
fr: Chemin sélectionné
it: Percorso selezionato
ja: 選択されたパス
ko: 선택한 경로
pt_br: Caminho selecionado
zh_hans: 选定的路径

# filebrowser.selectFile
source: Select a file
de: Datei auswählen
es: Seleccione un archivo
fr: Sélectionnez un fichier
it: Seleziona un file
ja: ファイルの選択
ko: 파일 선택
pt_br: Selecionar um arquivo
zh_hans: 选择文件

# fileBrowser.regTreeAriaLabel
source: File browser tree
de: Dateibrowserstruktur
es: Árbol explorador de archivos
fr: Arborescence de l'explorateur de fichiers
it: Albero del visualizzatore file
ja: ファイル ブラウザー ツリー
ko: 파일 브라우저 트리
pt_br: Árvore de navegador de arquivo
zh_hans: 文件浏览器树

# fileBrowserErrorDialogTitle
source: File browser error
de: Fehler beim Dateibrowser
es: Error del explorador de archivos
fr: Erreur de l'explorateur de fichiers
it: Errore del visualizzatore file
ja: ファイル ブラウザーのエラー
ko: 파일 브라우저 오류
pt_br: Erro do navegador de arquivo
zh_hans: 文件浏览器错误

# fileBrowserErrorMessage
source: An error occured while loading the file browser.
de: Fehler beim Laden des Dateibrowsers.
es: Se ha producido un error al cargar el explorador de archivos.
fr: Une erreur s'est produite pendant le chargement de l'explorateur de fichiers.
it: Si è verificato un errore durante il caricamento del visualizzatore file.
ja: ファイル ブラウザーの読み込み中にエラーが発生しました。
ko: 파일 브라우저를 로드하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao carregar o navegador de arquivos.
zh_hans: 加载文件浏览器时出错。

source: All files
de: Alle Dateien
es: Todos los archivos
fr: Tous les fichiers
it: Tutti i file
ja: すべてのファイル
ko: 모든 파일
pt_br: Todos os arquivos
zh_hans: 所有文件

# workbench.action.insights.copySelection
source: Copy Cell
de: Zelle kopieren
es: Copiar celda
fr: Copier la cellule
it: Copia cella
ja: セルをコピー
ko: 셀 복사
pt_br: Copiar Célula
zh_hans: 复制单元格

# insightsConfigError
source: There was an error parsing the insight config; could not find query array/string or queryfile
de: Fehler beim Analysieren der Konfiguration für Erkenntnisse. Das Abfragearray/die Abfragezeichenfolge oder die Abfragedatei wurde nicht gefunden.
es: Error al analizar la configuración de la conclusión; no se pudo encontrar la matriz/cadena de consulta o el archivo de consulta
fr: Une erreur s'est produite à l'analyse de la configuration d'insight. Tableau/chaîne de requête ou fichier de requête introuvable
it: Si è verificato un errore durante l'analisi della configurazione dei dati analitici. Non è stato possibile trovare la matrice/stringa di query o il file di query
ja: 分析情報の構成の解析中にエラーが発生しました。クエリ配列/文字列、またはクエリ ファイルが見つかりませんでした
ko: 인사이트 구성을 구문 분석하는 동안 오류가 발생했습니다. 쿼리 배열/문자열이나 쿼리 파일을 찾을 수 없습니다.
pt_br: Ocorreu um erro ao analisar a configuração do insight. Não foi possível encontrar a matriz/cadeia de caracteres de consulta ou o arquivo de consulta
zh_hans: 分析见解配置时出错；找不到查询数组/字符串或查询文件

source: Insights error
de: Erkenntnisfehler
es: Error de Insights
fr: Erreur d'insights
it: Errore nei dati analitici
ja: 分析情報エラー
ko: 인사이트 오류
pt_br: Erro de insights
zh_hans: 见解错误

# insightsFileError
source: There was an error reading the query file:
de: Fehler beim Lesen der Abfragedatei:
es: Error al leer el archivo de consulta:
fr: Une erreur s'est produite à la lecture du fichier de requête :
it: Si è verificato un errore durante la lettura del file di query:
ja: クエリ ファイルの読み取り中にエラーが発生しました:
ko: 쿼리 파일을 읽는 동안 오류가 발생했습니다.
pt_br: Houve um erro ao ler o arquivo de consulta:
zh_hans: 读取以下查询文件时出错:

# insightsInputError
source: No Connection Profile was passed to insights flyout
de: Es wurde kein Verbindungsprofil an das Flyout mit Erkenntnissen übergeben.
es: No se pasó ningún perfil de conexión al control flotante de información
fr: Aucun profil de connexion n'a été passé au menu volant des insights
it: Non è stato passato alcun profilo di connessione al riquadro a comparsa dei dati analitici
ja: 分析情報ポップアップに渡された接続プロファイルはありませんでした
ko: 인사이트 플라이아웃에 전달된 연결 프로필이 없습니다.
pt_br: Nenhum Perfil de Conexão foi passado para o submenu de insights
zh_hans: 未将连接配置文件传递到见解浮出控件

# InsightsDialogTitle
source: Insights
de: Erkenntnisse
es: Conclusiones
it: Dati analitici
ja: 分析情報
ko: 인사이트
zh_hans: 见解

# insights.dialog.itemDetails
source: Item Details
de: Details zum Element
es: Detalles del artículo
fr: Détails d'élément
it: Dettagli elemento
ja: アイテムの詳細
ko: 항목 세부 정보
pt_br: Detalhes do Item
zh_hans: 项详细信息

# insights.dialog.items
source: Items
de: Elemente
es: Artículos
fr: Éléments
it: Elementi
ja: アイテム
ko: 항목
pt_br: Itens
zh_hans: 项

# insights.item
source: Item
de: Element
es: Artículo
fr: Élément
it: Elemento
ja: アイテム
ko: 항목
zh_hans: 项

# insights.value
source: Value
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
ko: 값
pt_br: Valor
zh_hans: 值

# insightsDetailView.name
source: Insight Details
de: Details zu Erkenntnissen
es: Detalles de la conclusión
fr: Détails de l'insight
it: Dettagli delle informazioni dettagliate
ja: 分析情報の詳細
ko: 인사이트 세부 정보
pt_br: Detalhes do Insight
zh_hans: 见解详细信息

source: Property
de: Eigenschaft
es: Propiedad
fr: Propriété
it: Proprietà
ja: プロパティ
ko: 속성
pt_br: Propriedade
zh_hans: 属性

source: Value
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
ko: 값
pt_br: Valor
zh_hans: 值

# insightsDidNotFindResolvedFile
source: Could not find query file at any of the following paths : {0}
de: Die Abfragedatei wurde in keinem der folgenden Pfade gefunden: {0}
es: No se pudo encontrar el archivo de consulta en ninguna de las siguientes rutas: {0}
fr: Fichier de requête introuvable dans les chemins suivants : {0}
it: Non è stato possibile trovare i file di query nei percorsi seguenti: {0}
ja: クエリ ファイルが、次のどのパスにも見つかりませんでした: {0}
ko: 다음 경로에서 쿼리 파일을 찾을 수 없습니다. {0}
pt_br: Não foi possível encontrar o arquivo de consulta em nenhum dos seguintes caminhos: {0}
zh_hans: 在下述所有路径中都找不到查询文件: {0}

# agentUtilities.betweenRetries
source: Between Retries
de: Zwischen Wiederholungen
es: Entre reintentos
fr: Entre les tentatives
it: Tra tentativi
ja: 再試行の間
ko: 다시 시도 대기 중
pt_br: Entre Tentativas
zh_hans: 重试之间

# agentUtilities.canceled
source: Cancelled
de: Abgebrochen
es: Cancelado
fr: Annulé
it: Annullato
ja: 取り消されました
ko: 취소됨
pt_br: Cancelado
zh_hans: 已取消

# agentUtilities.executing
source: Executing
de: Wird ausgeführt
es: En ejecución
fr: Exécution
it: In esecuzione
ja: 実行中
ko: 실행 중
pt_br: Executando
zh_hans: 正在执行

# agentUtilities.failed
source: Failed
de: Fehlerhaft
es: Error
fr: Échec
it: Non riuscito
ja: 失敗
ko: 실패
pt_br: Com falha
zh_hans: 失败

# agentUtilities.idle
source: Idle
de: Im Leerlauf
es: Inactivo
fr: Inactif
it: Inattivo
ja: アイドル状態
ko: 유휴 상태
pt_br: Ocioso
zh_hans: 空闲

# agentUtilities.inProgress
source: In Progress
de: In Bearbeitung
es: En curso
fr: En cours
it: In corso
ja: 進行中
ko: 진행 중
pt_br: Em Andamento
zh_hans: 正在进行

# agentUtilities.neverRun
source: Never Run
de: Nie ausführen
es: No ejecutar nunca
fr: Ne jamais exécuter
it: Mai eseguito
ja: 実行しない
ko: 실행 안 함
pt_br: Nunca Executar
zh_hans: 从未运行

# agentUtilities.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否

# agentUtilities.notScheduled
source: Not Scheduled
de: Nicht geplant
es: No programado
fr: Non planifié
it: Non pianificato
ja: スケジュールが設定されていません
ko: 예약되지 않음
pt_br: Não Agendado
zh_hans: 未计划

# agentUtilities.obsolete
source: [Obsolete]
de: [Veraltet]
es: [Obsoleto]
fr: [Obsolète]
it: [Obsoleto]
ja: [古い]
ko: [사용되지 않음]
pt_br: [Obsoleto]
zh_hans: [已过时]

# agentUtilities.retry
source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
it: Riprova
ja: 再試行
ko: 다시 시도
pt_br: Tentar Novamente
zh_hans: 重试

# agentUtilities.statusUnknown
source: Status Unknown
de: Status unbekannt
es: Estado desconocido
fr: État inconnu
it: Stato sconosciuto
ja: 不明な状態
ko: 알 수 없는 상태
pt_br: Status Desconhecido
zh_hans: 状态未知

# agentUtilities.succeeded
source: Succeeded
de: Erfolgreich
es: Correcto
fr: Réussite
it: Riuscito
ja: 成功
ko: 성공
pt_br: Com Êxito
zh_hans: 已成功

# agentUtilities.suspended
source: Suspended
de: Angehalten
es: Suspendido
fr: Suspendu
it: Sospeso
ja: 中断中
ko: 일시 중지됨
pt_br: Suspenso
zh_hans: 已暂停

# agentUtilities.waitingForThread
source: Waiting for Thread
de: Warten auf Thread
es: A la espera de un subproceso
fr: En attente de thread
it: In attesa del thread
ja: スレッドを待機しています
ko: 스레드 대기 중
pt_br: Esperando pela Thread
zh_hans: 正在等待线程
