Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# loadingCompletedMessage
source: Loading completed
de: Ladevorgang abgeschlossen
es: Carga completada
fr: Chargement effectué
it: Caricamento completato
ja: 読み込みが完了しました
ko: 로드 완료
pt_br: Carregamento concluído
zh_hans: 加载已完成

# loadingMessage
source: Loading
de: Wird geladen
es: Carga en curso
fr: Chargement
it: Caricamento
ja: 読み込んでいます
ko: 로드 중
pt_br: Carregando
zh_hans: 正在加载

# hideTextLabel
source: Hide text labels
de: Beschriftungen ausblenden
es: Ocultar etiquetas de texto
fr: Masquer les étiquettes de texte
it: Nascondi etichette di testo
ja: テキスト ラベルの非表示
ko: 텍스트 레이블 숨기기
pt_br: Ocultar rótulos de texto
zh_hans: 隐藏文本标签

# showTextLabel
source: Show text labels
de: Beschriftungen anzeigen
es: Mostrar etiquetas de texto
fr: Afficher les étiquettes de texte
it: Mostra etichette di testo
ja: テキスト ラベルの表示
ko: 텍스트 레이블 표시
pt_br: Mostrar rótulos de texto
zh_hans: 显示文本标签

# closeTab
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

source: Hide properties
de: Eigenschaften verbergen
es: Ocultar propiedades
fr: Masquer les propriétés
it: Nascondi proprietà
ja: プロパティの非表示
ko: 속성 숨기기
pt_br: Ocultar propriedades
zh_hans: 隐藏属性

source: Show Properties
de: Eigenschaften anzeigen
es: Mostrar propiedades
fr: Afficher les propriétés
it: Mostra proprietà
ja: プロパティの表示
ko: 속성 표시
pt_br: Mostrar Propriedades
zh_hans: 显示属性

# alertErrorMessage
source: Error: {0}
de: Fehler: {0}
fr: Erreur : {0}
it: Errore: {0}
ja: エラー: {0}
ko: 오류: {0}
pt_br: Erro: {0}
zh_hans: 错误: {0}

# alertInfoMessage
source: Info: {0}
es: Información: {0}
fr: Informations : {0}
it: Informazioni: {0}
ja: 情報: {0}
ko: 정보: {0}
pt_br: Informações: {0}
zh_hans: 信息: {0}

# alertWarningMessage
source: Warning: {0}
de: Warnung: {0}
es: Advertencia: {0}
fr: Avertissement : {0}
it: Avviso: {0}
ja: 警告: {0}
ko: 경고: {0}
pt_br: Aviso: {0}
zh_hans: 警告: {0}

# tableCell.NoDataAvailable
source: no data available
de: Keine Daten verfügbar.
es: no hay datos disponibles
fr: aucune donnée disponible
it: dati non disponibili
ja: 利用できるデータはありません
ko: 데이터를 사용할 수 없음
pt_br: não há dados disponíveis
zh_hans: 无可用数据

source: Select/Deselect All
de: Alles auswählen/Gesamte Auswahl aufheben
es: Seleccionar o deseleccionar todos
fr: Tout sélectionner/désélectionner
it: Seleziona/Deseleziona tutto
ja: すべて選択/選択解除
ko: 모두 선택/모두 선택 취소
pt_br: Selecionar/Desmarcar Tudo
zh_hans: 全选/取消全选

# headerFilter.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# headerFilter.clear
source: Clear
de: Löschen
es: Borrar
fr: Effacer
it: Cancella
ja: クリア
ko: 지우기
pt_br: Limpar
zh_hans: 清除

# headerFilter.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# headerFilter.showFilter
source: Show Filter
de: Filter anzeigen
es: Mostrar filtro
fr: Afficher le filtre
it: Mostra filtro
ja: フィルターの表示
ko: 필터 표시
pt_br: Mostrar Filtro
zh_hans: 显示筛选器

# table.filterOptions
source: Filter Options
de: Filteroptionen
es: Opciones de filtro
fr: Options de filtre
it: Opzioni del filtro
ja: フィルター オプション
ko: 필터 옵션
pt_br: Opções de filtro
zh_hans: 筛选器选项

# table.searchPlaceHolder
source: Search
de: Suchen
es: Buscar
fr: Recherche
it: Cerca
ja: 検索
ko: 검색
pt_br: Pesquisar
zh_hans: 搜索

# table.selectAll
source: Select All
de: Alle auswählen
es: Seleccionar todo
fr: Tout sélectionner
it: Seleziona tutto
ja: すべて選択
ko: 모두 선택
pt_br: Selecionar tudo
zh_hans: 全选

# table.sortAscending
source: Sort Ascending
de: Aufsteigend sortieren
es: Orden ascendente
fr: Tri croissant
it: Ordinamento crescente
ja: 昇順で並べ替え
ko: 오름차순 정렬
pt_br: Classificação Crescente
zh_hans: 升序排序

# table.sortDescending
source: Sort Descending
de: Absteigend sortieren
es: Orden descendente
fr: Tri décroissant
it: Ordinamento decrescente
ja: 降順で並べ替え
ko: 내림차순 정렬
pt_br: Classificação Decrescente
zh_hans: 降序排序

# tableFilter.selectedCount
source: {0} Selected
de: {0} ausgewählt
es: {0} seleccionado
fr: {0} sélectionné(s)
it: {0} selezionati
ja: {0} 件選択済み
ko: {0} 선택됨
pt_br: {0} selecionado(s)
zh_hans: 已选择 {0} 项

# tableFilter.visibleCount
source: {0} Results
de: {0} Ergebnisse
es: {0} resultados
fr: {0} Résultats
it: {0} risultati
ja: {0} 件の結果
ko: {0}개 결과
pt_br: {0} resultados
zh_hans: {0} 个结果

# loadingSpinner.loading
source: Loading
de: Wird geladen
es: Carga en curso
fr: Chargement
it: Caricamento
ja: 読み込み中
ko: 로드
pt_br: Carregando
zh_hans: 正在加载

# rowDetailView.loadError
source: Loading Error...
de: Fehler wird geladen...
es: Error de carga...
fr: Chargement de l'erreur...
it: Errore di caricamento...
ja: 読み込みエラー...
ko: 로드 오류...
pt_br: Erro ao carregar...
zh_hans: 正在加载错误…

source: Toggle More
de: Weitere ein-/ausblenden
es: Alternar más
fr: Afficher/masquer plus
it: Attiva/Disattiva altro
ja: 詳細の切り替え
ko: 자세히 전환
pt_br: Alternar Mais
zh_hans: 切换更多

# InstallVSIXAction.allowNone
source: Your extension policy does not allow installing extensions. Please change your extension policy and try again.
de: Die Erweiterungsrichtlinie lässt die Installation von Erweiterungen nicht zu. Ändern Sie Ihre Erweiterungsrichtlinie und versuchen Sie es noch mal.
es: La directiva de extensión no permite instalar extensiones. Cambie la directiva de extensión e inténtelo de nuevo.
fr: Votre stratégie d’extension ne permet pas d’installer des extensions. Modifiez votre stratégie d’extension et recommencez.
it: I criteri di estensione non consentono l'installazione delle estensioni. Modificare i criteri per l'estensione e riprovare.
ja: 拡張機能のポリシーでは、拡張機能のインストールは許可されていません。拡張機能ポリシーを変更して、もう一度お試しください。
ko: 확장 정책에서 확장 설치를 허용하지 않습니다. 확장 정책을 변경하고 다시 시도하세요.
pt_br: A política de extensão não permite a instalação de extensões. Altere sua política de extensão e tente novamente.
zh_hans: 扩展策略不允许安装扩展。请更改扩展策略，然后重试。

# InstallVSIXAction.successReload
source: Completed installing {0} extension from VSIX. Please reload Azure Data Studio to enable it.
de: Die Installation der Erweiterung "{0}" aus VSIX wurde abgeschlossen. Laden Sie Azure Data Studio neu, um sie zu aktivieren.
es: Se ha completado la instalación de la extensión {0} de VSIX. Recargue Azure Data Studio para habilitarla.
fr: Installation terminée de l’extension {0} à partir de VSIX. Rechargez Azure Data Studio pour l’activer.
it: L'installazione dell'estensione {0} da VSIX è stata completata. Ricaricare Azure Data Studio per abilitarla.
ja: VSIX からの {0} 拡張機能のインストールが完了しました。有効にするには、Azure Data Studio を再度読み込んでください。
ko: VSIX의 {0} 확장 설치가 완료되었습니다. Azure Data Studio를 다시 로드하여 사용하도록 설정하세요.
pt_br: A instalação da extensão {0} foi concluída do VSIX. Recarregue o Azure Data Studio para habilitá-la.
zh_hans: 已完成从 VSIX 安装 {0} 扩展的过程。请重新加载 Azure Data Studio 以启用它。

# ReinstallAction.successReload
source: Please reload Azure Data Studio to complete reinstalling the extension {0}.
de: Laden Sie Azure Data Studio neu, um die Neuinstallation der Erweiterung {0} abzuschließen.
es: Vuelva a cargar Azure Data Studio para completar la reinstalación de la extensión {0}.
fr: Rechargez Azure Data Studio pour terminer la réinstallation de l'extension {0}.
it: Ricaricare reload Azure Data Studio per completare la reinstallazione dell'estensione {0}.
ja: 拡張機能 {0}の再インストールを完了するには、Azure Data Studio を再度読み込んでください。
ko: Azure Data Studio를 다시 로드하고 {0} 확장의 재설치를 완료하세요.
pt_br: Recarregue o Azure Data Studio para concluir a reinstalação da extensão {0}.
zh_hans: 请重新加载 Azure Data Studio 以完成扩展 {0} 的重新安装。

# activateLanguagePack
source: In order to use Azure Data Studio in {0}, Azure Data Studio needs to restart.
de: Um Azure Data Studio in {0} zu verwenden, muss Azure Data Studio neu gestartet werden.
es: Para poder usar Azure Data Studio en {0}, Azure Data Studio debe reiniciarse.
fr: Pour utiliser Azure Data Studio dans {0}, Azure Data Studio doit redémarrer.
it: Per usare Azure Data Studio in {0}, Azure Data Studio deve essere riavviato.
ja: {0}で Azure Data Studio を使用するには、Azure Data Studio を再起動する必要があります。
ko: {0}에서 Azure Data Studio를 사용하려면 Azure Data Studio를 다시 시작해야 합니다.
pt_br: Para usar o Azure Data Studio em {0}, o Azure Data Studio precisa ser reiniciado.
zh_hans: 若要在 {0} 中使用 Azure Data Studio，Azure Data Studio需要重启。

# connectionDialogBrowseTree.context
source: The connection dialog's browse tree context menu
de: Kontextmenü zum Durchsuchen der Struktur des Verbindungsdialogfelds
es: Menú contextual del árbol de búsqueda del cuadro de diálogo de conexión
fr: Menu contextuel de l’arborescence de navigation de la boîte de dialogue de connexion
it: Menu di scelta rapida dell'albero di visualizzazione della finestra di connessione
ja: 接続ダイアログの閲覧ツリーのコンテキスト メニュー
ko: 연결 대화 상자의 찾아보기 트리 상황에 맞는 메뉴
pt_br: O menu de contexto da árvore de navegação da caixa de diálogo de conexão
zh_hans: 连接对话框的浏览树上下文菜单

# dashboard.toolbar
source: The dashboard toolbar action menu
de: Das Aktionsmenü für die Dashboard-Symbolleiste
es: Menú de acción de la barra de herramientas del panel
fr: Menu action de la barre d’outils tableau de bord
it: Menu azione barra degli strumenti del dashboard
ja: ダッシュボード ツールバーのアクション メニュー
ko: 대시보드 도구 모음 작업 메뉴
pt_br: O menu de ação da barra de ferramentas do painel
zh_hans: 仪表板工具栏操作菜单

# dataExplorer.action
source: The dataexplorer view container title action menu
de: Das Aktionsmenü für den Container-Titel der Dataexplorer-Ansicht
es: Menú de acción del título del contenedor de la vista dataexplorer
fr: Menu d’action du conteneur d’affichage DataExplorer
it: Menu azione titolo contenitore vista dataexplorer
ja: dataexplorer ビュー コンテナーのタイトル アクション メニュー
ko: dataexplorer 뷰 컨테이너 제목 작업 메뉴
pt_br: O menu de ação do título do contêiner de exibição dataexplorer
zh_hans: dataexplorer 视图容器标题操作菜单

# dataExplorer.context
source: The dataexplorer item context menu
de: Kontextmenü des Dataexplorer-Elements
es: Menú contextual del elemento dataexplorer
fr: Menu contextuel de l’élément dataexplorer
it: Menu di scelta rapida della voce dataexplorer
ja: データエクスプローラー項目のコンテキスト メニュー
ko: dataexplorer 항목 상황에 맞는 메뉴
pt_br: O menu de contexto do item dataexplorer
zh_hans: dataexplorer 项上下文菜单

# dataGrid.context
source: The data grid item context menu
de: Kontextmenü des Datenrasterelements
es: Menú contextual del elemento de cuadrícula de datos
fr: Menu contextuel de l’élément de grille de données
it: Menu di scelta rapida elemento griglia dati
ja: データ グリッド項目のコンテキスト メニュー
ko: 데이터 약식 표 항목 상황에 맞는 메뉴
pt_br: O menu de contexto do item da grade de dados
zh_hans: 数据网格项上下文菜单

# default
source: Enable automatic update checks. Azure Data Studio will check for updates automatically and periodically.
de: Automatische Prüfung auf Aktualisierungen aktivieren. Azure Data Studio prüft automatisch und regelmäßig auf Aktualisierungen.
es: Habilitar la comprobación automática de actualizaciones. Azure Data Studio comprobará las actualizaciones de manera automática y periódica.
fr: Activez la recherche de mises à jour automatique pour que Azure Data Studio recherche les mises à jour automatiquement et régulièrement.
it: Abilita il controllo automatico degli aggiornamenti. Azure Data Studio controlla periodicamente la disponibilità di aggiornamenti in modo automatico.
ja: 自動更新チェックを有効にします。Azure Data Studio は、更新プログラムを自動的かつ定期的に確認します。
ko: 자동 업데이트 확인을 사용하도록 설정합니다. Azure Data Studio에서 정기적으로 업데이트를 자동 확인합니다.
pt_br: Habilitar verificações de atualização automática. O Azure Data Studio verificará se há atualizações automaticamente e periodicamente.
zh_hans: 启用自动更新检查。Azure Data Studio 将定期自动检查更新。

# enable locally
source: Please reload Azure Data Studio to enable this extension locally.
de: Laden Sie Azure Data Studio erneut, um diese Erweiterung lokal zu aktivieren.
es: Vuelva a cargar Azure Data Studio para habilitar esta extensión localmente.
fr: Rechargez Azure Data Studio pour activer cette extension localement.
it: Ricaricare Azure Data Studio per abilitare l'estensione in locale.
ja: この拡張機能をローカルで有効にするには、Azure Data Studio を再度読み込んでください。
ko: 이 확장을 로컬에서 사용하려면 Azure Data Studio를 다시 로드하세요.
pt_br: Recarregue o Azure Data Studio para habilitar essa extensão localmente.
zh_hans: 请重新加载 Azure Data Studio 以在本地启用此扩展。

# enable remote
source: Please reload Azure Data Studio to enable this extension in {0}.
de: Laden Sie Azure Data Studio erneut, um diese Erweiterung in {0} zu aktivieren.
es: Vuelva a cargar Azure Data Studio para habilitar esta extensión en {0}.
fr: Rechargez Azure Data Studio pour activer cette extension dans {0}
it: Ricaricare Azure Data Studio per abilitare l'estensione in {0}.
ja: この拡張機能を {0} で有効にするには、Azure Data Studio を再度読み込んでください。
ko: {0}에서 이 확장을 사용하도록 설정하려면 Azure Data Studio를 다시 로드하세요.
pt_br: Recarregue o Azure Data Studio para habilitar essa extensão em {0}.
zh_hans: 请重新加载 Azure Data Studio 以在 {0} 中启用此扩展。

# enableWindowsBackgroundUpdates
source: Enable to download and install new Azure Data Studio Versions in the background on Windows
de: Aktivieren Sie diese Option, um neue Azure Data Studio-Versionen im Hintergrund unter Windows herunterzuladen und zu installieren.
es: Habilitar para descargar e instalar nuevas versiones de Azure Data Studio en segundo plano en Windows
fr: Activer pour télécharger et installer les nouvelles versions de Azure Data Studio en arrière-plan sur Windows
it: Abilitare questa opzione per scaricare e installare le nuove versioni di Azure Data Studio in background in Windows
ja: Windows で新しい Azure Data Studio バージョンをバックグラウンドでダウンロードしてインストールできるようにする
ko: 새로운 Azure Data Studio 버전을 Windows 백그라운드에 다운로드 및 설치하려면 사용하도록 설정
pt_br: Habilitar o download e a instalação de novas versões do Azure Data Studio no segundo plano no Windows
zh_hans: 启用在 Windows 上后台下载和安装新的 Azure Data Studio 版本

# extensionsPolicy
source: Sets the security policy for downloading extensions.
de: Legt die Sicherheitsrichtlinie für das Herunterladen von Erweiterungen fest.
es: Establece la directiva de seguridad para descargar extensiones.
fr: Définit la stratégie de sécurité pour le téléchargement des extensions.
it: Impostare i criteri di sicurezza per il download delle estensioni.
ja: 拡張機能をダウンロードするためのセキュリティ ポリシーを設定します。
ko: 확장을 다운로드하기 위한 보안 정책을 설정합니다.
pt_br: Define a política de segurança para baixar extensões.
zh_hans: 设置用于下载扩展的安全策略。

# incompatible
source: Unable to install extension '{0}' as it is not compatible with Azure Data Studio '{1}'.
de: Die Erweiterung '{0}' mit Version '{1}' konnte nicht installiert werden, da sie nicht mit Azure Data Studio kompatibel ist.
es: No se puede instalar la extensión "{0}" debido a que no es compatible con Azure Data Studio "{1}".
fr: Impossible d'installer l'extension '{0}', car elle n'est pas compatible avec Azure Data Studio '{1}'.
it: Non è possibile installare l'estensione '{0}' perché non è compatibile con Azure Data Studio '{1}'.
ja: Azure Data Studio '{1}' と互換性がないため、拡張機能 '{0}' をインストールできません。
ko: 'Azure Data Studio '{1}'과(와) 호환되지 않으므로 확장 '{0}'을(를) 설치할 수 없습니다.
pt_br: Não é possível instalar a extensão '{0}' porque ela não é compatível com o Azure Data Studio '{1}'.
zh_hans: 无法安装扩展名 '{0}'，因为它不兼容 Azure Data Studio '{1}'。

# installExtensionCompletedAndReloadRequired
source: Installing extension {0} is completed. Please reload Azure Data Studio to enable it.
de: Die Installation der Erweiterung "{0}" wurde abgeschlossen. Laden Sie Azure Data Studio neu, um sie zu aktivieren.
es: Se ha completado la instalación de la extensión {0}. Vuelva a cargar Azure Data Studio para habilitarlo.
fr: L'installation de l'extension {0} a été effectuée. Rechargez Azure Data Studio pour l'activer.
it: L'installazione dell'estensione {0} è stata completata. Ricaricare Azure Data Studio per abilitarla.
ja: 拡張機能 {0} のインストールが完了しました。これを有効にするには、Azure Data Studio を再度読み込んでください。
ko: {0} 확장 설치가 완료되었습니다. Azure Data Studio를 다시 로드하여 사용하도록 설정하세요.
pt_br: A instalação da extensão {0} foi concluída. Recarregue o Azure Data Studio para habilitá-la.
zh_hans: 安装扩展 {0} 已完成。请重新加载 Azure Data Studio 以启用它。

# maxMemoryForLargeFilesMB
source: Controls the memory available to Azure Data Studio after restart when trying to open large files. Same effect as specifying `--max-memory=NEWSIZE` on the command line.
de: Steuert den für Azure Data Studio verfügbaren Arbeitsspeicher nach einem Neustart bei dem Versuch, große Dateien zu öffnen. Dies hat die gleiche Auswirkung wie das Festlegen von `--max-memory=NEWSIZE` über die Befehlszeile.
es: Controla la memoria disponible para Azure Data Studio después de reiniciar cuando se intentan abrir archivos grandes. Tiene el mismo efecto que si se especifica "--max-memory=NEWSIZE" en la línea de comandos.
fr: Contrôle la mémoire disponible pour Azure Data Studio après le redémarrage en cas de tentative d'ouverture de fichiers volumineux. Même effet que de spécifier '--max-memory=NEWSIZE' sur la ligne de commande.
it: Controlla la memoria disponibile per Azure Data Studio dopo il riavvio durante il tentativo di aprire file di grandi dimensioni. Il risultato è uguale a quando si specifica `--max-memory=NEWSIZE` sulla riga di comando.
ja: 大きなファイルを開こうとすると再起動後に Azure Data Studio に対して使用できるメモリを制御します。コマンド ラインで '--max-memory=NEWSIZE' を指定する場合と同じ効果があります。
ko: 큰 파일을 열려고 할 때 다시 시작한 후 Azure Data Studio에 사용 가능한 메모리를 제어합니다. 명령줄에 '--max-memory=NEWSIZE'를 지정하는 것과 결과가 같습니다.
pt_br: Controla a memória disponível para o Azure Data Studio após a reinicialização ao tentar abrir arquivos grandes. O mesmo efeito que especificar `--max-memory=NEWSIZE` na linha de comando.
zh_hans: 在打开大型文件时，控制 Azure Data Studio 可在重启后使用的内存。在命令行中指定 `--max-memory=新的大小` 参数可达到相同效果。

# miNewNotebook
source: &&New Notebook
de: &&Neues Notizbuch
es: &&Nuevo cuaderno
fr: &&Nouveau notebook
it: &&Nuovo notebook
ja: 新しいノートブック(&N)
ko: 새 Notebook(&&N)
pt_br: &&Novo Bloco de anotações
zh_hans: 新建笔记本(&&N)

# miNewQuery
source: New &&Query
de: Neue &&Abfrage
es: Nueva &&consulta
fr: Nouvelle &&requête
it: Nuova &&query
ja: 新しいクエリ(&Q)
ko: 새 쿼리(&&Q)
pt_br: Nova &&consulta
zh_hans: 新建查询(&&Q)

# miinstallVsix
source: Install Extension from VSIX Package
de: Erweiterung aus VSIX-Paket installieren
es: Instalar extensión desde el paquete VSIX
fr: Installer l’extension à partir du package VSIX
it: Installare l'estensione dal pacchetto VSIX
ja: VSIX パッケージから拡張機能をインストールする
ko: VSIX 패키지에서 확장 설치
pt_br: Instalar extensão do pacote VSIX
zh_hans: 从 VSIX 包安装扩展

source: New Query
de: Neue Abfrage
es: Nueva consulta
fr: Nouvelle requête
it: Nuova query
ja: 新しいクエリ
ko: 새 쿼리
pt_br: Nova consulta
zh_hans: 新建查询

# notebook.cellTitle
source: The notebook cell title menu
de: Titelmenü der Notizbuchzelle
es: El menú de título de la celda del cuaderno
fr: Menu titre de la cellule du bloc-notes
it: Menu del titolo della cella del notebook
ja: ノートブックのセル タイトル メニュー
ko: 전자 필기장 셀 제목 메뉴
pt_br: O menu de título da célula do bloco de anotações
zh_hans: 笔记本单元格标题菜单

# notebook.title
source: The notebook title menu
de: Titelmenü des Notizbuchs
es: El menú de título del cuaderno
fr: Menu titre du bloc-notes
it: Menu del titolo del notebook
ja: ノートブックのタイトル メニュー
ko: 전자 필기장 제목 메뉴
pt_br: O menu de título do bloco de anotações
zh_hans: 笔记本标题菜单

# notebook.toolbar
source: The notebook toolbar menu
de: Symbolleistenmenü des Notizbuchs
es: Menú de la barra de herramientas del cuaderno
fr: Menu de la barre d’outils du bloc-notes
it: Menu della barra degli strumenti del notebook
ja: ノートブックのツール バー メニュー
ko: 전자 필기장 도구 모음 메뉴
pt_br: O menu da barra de ferramentas do bloco de anotações.
zh_hans: 笔记本工具栏菜单

# objectExplorer.context
source: The object explorer item context menu
de: Kontextmenü des Objekt-Explorer-Elements
es: Menú contextual del elemento del explorador de objetos
fr: Menu contextuel de l’élément de l’Explorateur d’objets
it: Menu di scelta rapida elemento Esplora oggetti
ja: オブジェクト エクスプローラー項目のコンテキスト メニュー
ko: 개체 탐색기 항목 상황에 맞는 메뉴
pt_br: O menu de contexto do item do explorador de objetos
zh_hans: 对象资源管理器项上下文菜单

# postDisableTooltip
source: Please reload Azure Data Studio to disable this extension.
de: Laden Sie Azure Data Studio erneut, um diese Erweiterung zu deaktivieren.
es: Vuelva a cargar Azure Data Studio para deshabilitar esta extensión.
fr: Rechargez Azure Data Studio pour désactiver cette extension.
it: Ricaricare Azure Data Studio per disabilitare l'estensione.
ja: 更新された拡張機能を無効にするには、Azure Data Studio を再度読み込んでください。
ko: 이 확장을 사용하지 않으려면 Azure Data Studio를 다시 로드하세요.
pt_br: Recarregue o Azure Data Studio para desabilitar essa extensão.
zh_hans: 请重新加载 Azure Data Studio 以禁用此扩展。

# postEnableTooltip
source: Please reload Azure Data Studio to enable this extension.
de: Laden Sie Azure Data Studio erneut, um diese Erweiterung zu aktivieren.
es: Vuelva a cargar Azure Data Studio para habilitar esta extensión.
fr: Rechargez Azure Data Studio pour activer cette extension.
it: Ricaricare Azure Data Studio per abilitare l'estensione.
ja: この拡張機能を有効にするには、Azure Data Studio を再度読み込んでください。
ko: 이 확장을 사용하려면 Azure Data Studio를 다시 로드하세요.
pt_br: Recarregue o Azure Data Studio para habilitar essa extensão.
zh_hans: 请重新加载 Azure Data Studio 以启用此扩展。

# postUninstallTooltip
source: Please reload Azure Data Studio to complete the uninstallation of this extension.
de: Laden Sie Azure Data Studio erneut, um die Deinstallation dieser Erweiterung abzuschließen.
es: Vuelva a cargar Azure Data Studio para completar la desinstalación de esta extensión.
fr: Rechargez Azure Data Studio pour désinstaller cette extension.
it: Ricaricare Azure Data Studio per completare la disinstallazione di questa estensione.
ja: この拡張機能のアンインストールを完了するには、Azure Data Studio を再度読み込んでください。
ko: Azure Data Studio를 다시 로드하여 이 확장의 제거를 완료하세요.
pt_br: Recarregue o Azure Data Studio para concluir a desinstalação dessa extensão.
zh_hans: 请重新加载 Azure Data Studio 以完成此扩展的卸载。

# postUpdateTooltip
source: Please reload Azure Data Studio to enable the updated extension.
de: Laden Sie Azure Data Studio erneut, um die Aktualisierung dieser Erweiterung abzuschließen.
es: Vuelva a cargar Azure Data Studio para habilitar la extensión actualizada.
fr: Rechargez Azure Data Studio pour activer l'extension mise à jour.
it: Ricaricare Azure Data Studio per abilitare l'estensione aggiornata.
ja: 更新された拡張機能を有効にするには、Azure Data Studio を再度読み込んでください。
ko: 업데이트된 확장을 사용하도록 설정하려면 Azure Data Studio를 다시 로드하세요.
pt_br: Recarregue o Azure Data Studio para habilitar a extensão atualizada.
zh_hans: 请重新加载 Azure Data Studio 以启用更新的扩展。

# scenarioTypeUndefined
source: The scenario type for extension recommendations must be provided.
de: Der Szenariotyp für Erweiterungsempfehlungen muss angegeben werden.
es: Es necesario proporcionar el tipo de escenario para recibir recomendaciones de extensiones.
fr: Le type de scénario pour les recommandations d'extension doit être fourni.
it: È necessario specificare il tipo di scenario per le estensioni consigliate.
ja: 拡張機能の推奨事項のシナリオの種類を指定する必要があります。
ko: 확장 권장 사항의 시나리오 유형을 제공해야 합니다.
pt_br: O tipo de cenário para as recomendações de extensão precisa ser fornecido.
zh_hans: 必须提供扩展建议的方案类型。

# showReleaseNotes
source: Show Release Notes after an update. The Release Notes are opened in a new web browser window.
de: Versionshinweise nach einem Update anzeigen. Die Versionshinweise werden in einem neuen Webbrowserfenster geöffnet.
es: Mostrar notas de la versión después de una actualización. Las notas de la versión se abren en una nueva ventana del explorador web.
fr: Afficher les notes de publication après une mise à jour. Les notes de publication sont ouvertes dans une nouvelle fenêtre de navigateur web.
it: Mostra le note sulla versione dopo un aggiornamento. Le note sulla versione vengono aperte in una nuova finestra del Web browser.
ja: 更新後にリリース ノートを表示します。リリース ノートが新しい Web ブラウザー ウィンドウで開きます。
ko: 업데이트 후 릴리스 정보를 표시합니다. 릴리스 정보는 새 웹 브라우저 창에서 열립니다.
pt_br: Mostrar notas de versão após uma atualização. As notas de versão são abertas em uma nova janela do navegador da Web.
zh_hans: 更新后显示发行说明。发行说明会在新的 Web 浏览器窗口中打开。
