Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# viewCategory
source: View
de: Sicht
es: Vista
fr: Voir
it: Visualizza
ja: 表示
ko: 보기
pt_br: Exibir
zh_hans: 查看

# queryPlanTitle
source: Query Plan
de: Abfrageplan
es: Plan de consulta
fr: Plan de requête
it: Piano di query
ja: クエリ プラン
ko: 쿼리 계획
pt_br: Plano de Consulta
zh_hans: 查询计划

source: Query Plan Editor
de: Abfrageplan-Editor
es: Editor de planes de consulta
fr: Éditeur du plan de requête
it: Editor piano di query
ja: クエリ プラン エディター
ko: 쿼리 플랜 편집기
pt_br: Editor de Plano de Consulta
zh_hans: 查询计划编辑器

# topOperations.actualExecutions
source: Actual Executions
de: Tatsächliche Ausführungen
es: Ejecuciones reales
fr: Exécutions réelles
it: Esecuzioni effettive
ja: 実際の実行
ko: 실제 실행 수
pt_br: Execuções Reais
zh_hans: 实际执行次数

# topOperations.actualRebinds
source: Actual Rebinds
de: Tatsächliche erneute Bindungen
es: Reenlaces reales
fr: Reliaisons réelles
it: Riassociazioni effettive
ja: 実際の再バインド数
ko: 실제 다시 바인딩 횟수
pt_br: Reassociações Reais
zh_hans: 实际重新绑定次数

# topOperations.actualRewinds
source: Actual Rewinds
de: Tatsächliche Rückläufe
es: Rebobinados reales
fr: Rembobinages réels
it: Ripristini effettivi
ja: 実際の巻き戻し数
ko: 실제 되감기 횟수
pt_br: Rebobinações Reais
zh_hans: 实际后退次数

# topOperations.actualRows
source: Actual Rows
de: Tatsächliche Zeilen
es: Filas reales
fr: Lignes réelles
it: Righe effettive
ja: 実際の行数
ko: 실제 행 수
pt_br: Linhas Atuais
zh_hans: 实际行数

# topOperations.estCPUCost
source: Est CPU Cost
de: Geschätzte CPU-Kosten
es: Costo de CPU estimado
fr: Coût estimé du processeur
it: Costo CPU stimato
ja: 推定 CPU コスト
ko: 예상 CPU 비용
pt_br: Custo Est. de CPU
zh_hans: 预计 CPU 成本

# topOperations.estCost
source: Est Cost
de: Geschätzte Kosten
es: Costo estimado
fr: Coût estimé
it: Costo stimato
ja: 推定コスト
ko: 예상 비용
pt_br: Custo Est.
zh_hans: 预计成本

# topOperations.estIOCost
source: Est IO Cost
de: Geschätzte E/A-Kosten
es: Costo de E/S estimado
fr: Coût estimé des E/S
it: Costo IO stimato
ja: 推定 IO コスト
ko: 예상 입출력 비용
pt_br: Custo Est. de E/S
zh_hans: 预计 IO 成本

# topOperations.estRebinds
source: Est Rebinds
de: Geschätzte erneute Bindungen
es: Reenlaces estimados
fr: Reliaisons estimées
it: Riassociazioni stimate
ja: 再バインドの推定数
ko: 예상 다시 바인딩 횟수
pt_br: Reassociações Est.
zh_hans: 预计重新绑定次数

# topOperations.estRewinds
source: Est Rewinds
de: Geschätzte Rückläufe
es: Rebobinados estimados
fr: Rembobinages estimés
it: Ripristini stimati
ja: 巻き戻しの推定数
ko: 예상 되감기 횟수
pt_br: Rebobinações Est.
zh_hans: 预计后退次数

# topOperations.estRows
source: Est Rows
de: Geschätzte Zeilen
es: Filas estimadas
fr: Lignes estimées
it: Righe stimate
ja: 推定行数
ko: 예상 행 수
pt_br: Linhas Est.
zh_hans: 预计行数

# topOperations.estSubtreeCost
source: Est Subtree Cost
de: Geschätzte Kosten für Unterstruktur
es: Coste del subárbol estimado
fr: Coût estimé de la sous-arborescence
it: Costo sottoalbero stimato
ja: サブ ツリーの推定コスト
ko: 예상 하위 트리 비용
pt_br: Custo Est. da Subárvore
zh_hans: 预计子树成本

# topOperations.object
source: Object
de: Objekt
es: Objeto
fr: Objet
it: Oggetto
ja: オブジェクト
ko: 개체
pt_br: Objeto
zh_hans: 对象

# topOperations.operation
source: Operation
de: Vorgang
es: Operación
fr: Opération
it: Operazione
ja: 操作
ko: 작업
pt_br: Operação
zh_hans: 操作

# topOperations.parallel
source: Parallel
es: Paralelo
fr: Parallèle
it: In parallelo
ja: 並列
ko: 병렬
pt_br: Paralelo
zh_hans: 并行

# topOperations.partitioned
source: Partitioned
de: Partitioniert
es: Particionado
fr: Partitionné
it: Partizionato
ja: パーティション分割
ko: 분할됨
pt_br: Particionado
zh_hans: 分区

# topOperationsTitle
source: Top Operations
de: Wichtigste Vorgänge
es: Operaciones principales
fr: Principales opérations
it: Operazioni più frequenti
ja: 上位操作
ko: 상위 작업
pt_br: Operações Principais
zh_hans: 热门的操作

# deployment.title
source: New Deployment...
de: Neue Bereitstellung…
es: Nueva implementación...
fr: Nouveau déploiement...
it: Nuova distribuzione...
ja: 新しい展開...
ko: 새 배포...
pt_br: Nova Implantação...
zh_hans: 新建部署...

source: Resource Viewer
de: Ressourcen-Viewer
es: Visor de recursos
fr: Visionneuse de ressources
it: Visualizzatore risorse
ja: リソース ビューアー
ko: 리소스 뷰어
pt_br: Visualizador de Recursos
zh_hans: 资源查看器

# resourceViewer.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
zh_hans: 刷新

# resourceViewerTable.commandError
source: Error executing command '{0}' : {1}
de: Fehler beim Ausführen des Befehls "{0}": {1}
es: Error al ejecutar el comando "{0}": {1}.
fr: Erreur durant l'exécution de la commande « {0} » : {1}
it: Errore durante l'esecuzione del comando '{0}': {1}
ja: コマンド '{0}' の実行でエラーが発生しました: {1}
ko: '{0}' 명령을 실행하는 동안 오류 발생: {1}
pt_br: Erro ao executar o comando '{0}' : {1}
zh_hans: 执行命令“{0}”时出错: {1}

# resourceViewerTable.openError
source: Error opening link : {0}
de: Fehler beim Öffnen des Links: {0}
es: Error al abrir el vínculo: {0}.
fr: Erreur d'ouverture du lien : {0}
it: Errore durante l'apertura del collegamento: {0}
ja: リンクを開いているときにエラーが発生しました: {0}
ko: 링크를 여는 동안 오류 발생: {0}
pt_br: Erro ao abrir o link: {0}
zh_hans: 打开链接时出错: {0}

# resourceViewer.ariaLabel
source: Resource Viewer Tree
de: Ressourcen-Viewer-Struktur
es: Árbol del visor de recursos
fr: Arborescence de la visionneuse de ressources
it: Albero del visualizzatore risorse
ja: リソース ビューアー ツリー
ko: 리소스 뷰어 트리
pt_br: Árvore do Visualizador de Recursos
zh_hans: 资源查看器树

# extension.contributes.resourceView.resource.icon
source: Path to the resource icon.
de: Pfad zum Ressourcensymbol.
es: Ruta de acceso al icono del recurso.
fr: Chemin de l'icône de ressource.
it: Percorso dell'icona della risorsa.
ja: リソース アイコンへのパス。
ko: 리소스 아이콘의 경로입니다.
pt_br: Caminho para o ícone de recurso.
zh_hans: 资源图标的路径。

# extension.contributes.resourceView.resource.id
source: Identifier of the resource.
de: Bezeichner der Ressource.
es: Identificador del recurso.
fr: Identificateur de la ressource.
it: Identificatore della risorsa.
ja: リソースの識別子。
ko: 리소스 식별자입니다.
pt_br: Identificador do recurso.
zh_hans: 资源的标识符。

# extension.contributes.resourceView.resource.name
source: The human-readable name of the view. Will be shown
de: Der lesbare Name der Sicht. Dieser wird angezeigt.
es: Nombre de la vista en lenguaje natural. Se mostrará
fr: Nom de la vue, contrôlable de visu. À afficher
it: Nome leggibile della visualizzazione. Verrà visualizzato
ja: ビューの判読できる名前。これが表示されます
ko: 사용자가 읽을 수 있는 뷰 이름입니다. 표시됩니다.
pt_br: O nome legível para humanos da exibição. Será mostrado
zh_hans: 用户可读的视图名称。将显示它

# extension.contributes.resourceViewResources
source: Contributes resource to the resource view
de: Trägt die Ressource zur Ressourcenansicht bei.
es: Aporta recursos a la vista de recursos.
fr: Fournit une ressource dans la vue des ressources
it: Fornisce una risorsa alla visualizzazione risorse
ja: リソースをリソース ビューに提供します
ko: 리소스 뷰에 리소스 제공
pt_br: Contribui o recurso para o modo de exibição de recursos
zh_hans: 将资源分配给资源视图

# backup
source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
it: Ripristina
ja: 復元
ko: 복원
pt_br: Restaurar
zh_hans: 还原

# restore.commandNotSupported
source: Restore command is not supported for Azure SQL databases.
de: Der Wiederherstellungsbefehl wird für Azure SQL-Datenbank-Instanzen nicht unterstützt.
es: No se admite el comando de restauración para bases de datos de Azure SQL.
fr: La commande de restauration n'est pas prise en charge pour les bases de données Azure SQL.
it: Il comando di ripristino non è supportato per i database SQL di Azure.
ja: Azure SQL データベースでは、復元コマンドはサポートされていません。
ko: Azure SQL Database에 대해 복원 명령이 지원되지 않습니다.
pt_br: O comando Restore não é compatível com bancos de dados SQL do Azure.
zh_hans: Azure SQL 数据库不支持还原命令。

# restore.commandNotSupportedOutsideContext
source: Restore command is not supported outside of a server context. Please select a server or database and try again.
de: Der Wiederherstellungsbefehl wird außerhalb eines Serverkontexts nicht unterstützt. Wählen Sie einen Server oder eine Datenbank aus, und versuchen Sie es noch mal.
es: No se admite el comando de copia de seguridad en el contexto del servidor. Seleccione un servidor o base de datos y vuelva a intentarlo.
fr: La commande de Restaurer n'est pas prise en charge en dehors d’un contexte du serveur. Sélectionnez un serveur ou une base de données et réessayez.
it: Il comando Ripristina non è supportato all'esterno di un contesto del server. Selezionare un server o un database e riprovare.
ja: 復元コマンドは、サーバー コンテキストの外ではサポートされていません。サーバーまたはデータベースを選択して、もう一度お試しください。
ko: 복원 명령은 서버 컨텍스트 외부에서 지원되지 않습니다. 서버 또는 데이터베이스를 선택하고 다시 시도하세요.
pt_br: O comando Restaurar não tem suporte fora de um contexto de servidor. Selecione um servidor ou banco de dados e tente novamente.
zh_hans: 服务器上下文外不支持还原命令，请选择服务器或数据库并重试。

# restore.isPreviewFeature
source: You must enable preview features in order to use restore
de: Sie müssen die Vorschaufeatures aktivieren, um die Wiederherstellung zu verwenden.
es: Debe habilitar las características en versión preliminar para utilizar la restauración
fr: Vous devez activer les fonctionnalités en préversion pour utiliser la restauration
it: Per usare il ripristino, è necessario abilitare le funzionalità di anteprima
ja: 復元を使用するには、プレビュー機能を有効にする必要があります
ko: 복원을 사용하려면 미리 보기 기능을 사용하도록 설정해야 합니다.
pt_br: Você precisa habilitar as versões prévias dos recursos para poder utilizar a restauração
zh_hans: 必须启用预览功能才能使用还原

# restoreAction.restore
source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
it: Ripristina
ja: 復元
ko: 복원
pt_br: Restaurar
zh_hans: 还原

# refreshNode
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
zh_hans: 刷新

source: Script as Alter
de: Skripterstellung als ALTER
es: Script como modificar
fr: Script de modification
it: Genera script come ALTER
ja: 変更としてのスクリプト
ko: Alter로 스크립트
pt_br: Script como Alterar
zh_hans: 执行 Alter 脚本

source: Script as Create
de: Skripterstellung als CREATE
es: Script como crear
fr: Script de création
it: Genera script come CREATE
ja: 作成としてのスクリプト
ko: Create로 스크립트
pt_br: Script como Criar
zh_hans: 执行 Create 脚本

# scriptAsDelete
source: Script as Drop
de: Skripterstellung als DROP
es: Script como borrar
fr: Script de suppression
it: Genera script come DROP
ja: ドロップとしてのスクリプト
ko: Drop으로 스크립트
pt_br: Script como Soltar
zh_hans: 执行 Drop 脚本

source: Script as Execute
de: Skripterstellung als EXECUTE
es: Script como ejecutar
fr: Script d'exécution
it: Genera script come EXECUTE
ja: 実行としてのスクリプト
ko: Execute로 스크립트
pt_br: Script como Executar
zh_hans: 执行 Execute 脚本

# scriptAsSelect
source: Select Top 1000
de: Oberste 1000 auswählen
es: Seleccionar el top 1000
fr: Sélectionnez les 1000 premiers
it: Genera script come SELECT TOP 1000
ja: 上位 1000 を選択する
ko: 상위 1,000개 선택
pt_br: Selecione Top 1000
zh_hans: 选择前 1000 项

# refreshError
source: An error occurred refreshing node '{0}': {1}
de: Fehler beim Aktualisieren des Knotens "{0}": {1}
es: Error al actualizar el nodo "{0}"; {1}.
fr: Erreur pendant l'actualisation du nœud « {0} » : {1}
it: Si è verificato un errore durante l'aggiornamento del nodo '{0}': {1}
ja: ノード '{0}' の更新でエラーが発生しました: {1}
ko: '{0}' 노드를 새로 고치는 동안 오류가 발생했습니다. {1}
pt_br: Ocorreu um erro ao atualizar o nó '{0}': {1}
zh_hans: 刷新节点“{0}”时出错: {1}

# tableDesigner.saveTableChanges
source: Save Changes
de: Änderungen speichern
it: Salva modifiche
ja: 変更内容を保存
ko: 변경 내용 저장

# tableDesigner.configTitle
source: Table Designer
de: Tabellen-Designer
it: Progettazione tabelle
ja: テーブル デザイナー
ko: 테이블 디자이너

# tableDesigner.featureEnabledDescription
source: Controls whether the table designer feature is enabled. Default value is false.
de: Steuert, ob das Tabellen-Designer-Feature aktiviert ist. Der Standardwert ist „FALSE“.
it: Controllare se la funzionalità Progettazione tabelle è abilitata. Il valore predefinito è false.
ja: テーブル デザイナー機能を有効にするかどうかを制御します。既定値は false です。
ko: 테이블 디자이너 기능의 사용 여부를 제어합니다. 기본값은 false입니다.

# inProgressTasksChangesBadge
source: {0} in progress tasks
de: {0} Aufgaben werden ausgeführt
es: {0} tareas en curso
fr: {0} tâches en cours
it: {0} attività in corso
ja: {0} 個のタスクが進行中です
ko: 진행 중인 작업 {0}개
pt_br: {0} tarefas em andamento
zh_hans: {0} 个正在执行的任务

# miViewTasks
source: &&Tasks
de: &&Aufgaben
es: &&Tareas
fr: &&Tâches
it: &&Attività
ja: タスク(&&T)
ko: 작업(&T)
pt_br: &&Tarefas
zh_hans: 任务(&&T)

source: Tasks
de: Aufgaben
es: Tareas
fr: Tâches
it: Attività
ja: タスク
ko: 작업
pt_br: Tarefas
zh_hans: 任务

source: Toggle Tasks
de: Aufgaben umschalten
es: Alternar tareas
fr: Activer/désactiver des tâches
it: Attiva/Disattiva attività
ja: タスクの切り替え
ko: 작업 토글
pt_br: Alternar Tarefas
zh_hans: 切换任务

source: canceled
de: Abgebrochen
es: cancelado
fr: annulé
it: annullato
ja: キャンセル済み
ko: 취소됨
pt_br: cancelado
zh_hans: 已取消

source: canceling
de: Wird abgebrochen
es: cancelando
fr: annulation
it: in fase di annullamento
ja: キャンセル中
ko: 취소 중
pt_br: cancelando
zh_hans: 正在取消

source: in progress
de: In Bearbeitung
es: en curso
fr: en cours
it: in corso
ja: 進行中
ko: 진행 중
pt_br: em andamento
zh_hans: 正在进行

source: not started
de: Nicht gestartet
es: no iniciado
fr: non démarré
it: non avviato
ja: 未開始
ko: 시작되지 않음
pt_br: não iniciado
zh_hans: 尚未开始

# noTaskMessage
source: No task history to display.
de: Kein Aufgabenverlauf zur Anzeige vorhanden.
es: No hay un historial de tareas para mostrar.
fr: Aucun historique des tâches à afficher.
it: Non è disponibile alcuna cronologia attività da visualizzare.
ja: 表示するタスク履歴がありません。
ko: 표시할 작업 기록이 없습니다.
pt_br: Nenhum histórico de tarefas a ser exibido.
zh_hans: 没有可显示的任务历史记录。

source: Task error
de: Aufgabenfehler
es: Error de la tarea
fr: Erreur de tâche
it: Errore attività
ja: タスク エラー
ko: 작업 오류
pt_br: Erro de tarefa
zh_hans: 任务错误

# taskHistory.regTreeAriaLabel
source: Task history
de: Aufgabenverlauf
es: Historial de tareas
fr: Historique des tâches
it: Cronologia attività
ja: タスク履歴
ko: 작업 기록
pt_br: Histórico de tarefa
zh_hans: 任务历史记录

# cancelTask.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# errorMsgFromCancelTask
source: The task failed to cancel.
de: Der Task konnte nicht abgebrochen werden.
es: No se ha podido ejecutar la tarea.
fr: Échec de l’annulation de la tâche.
it: Impossibile annullare l'attività.
ja: タスクを取り消せませんでした。
ko: 작업을 취소하지 못했습니다.
pt_br: Falha ao cancelar a tarefa.
zh_hans: 任务取消失败。

# taskAction.script
source: Script
de: Skript
ja: スクリプト
ko: 스크립트
zh_hans: 脚本

source: Collapse All
de: Alle reduzieren
es: Contraer todo
fr: Tout réduire
it: Comprimi tutto
ja: すべて折りたたむ
ko: 모두 축소
pt_br: Recolher Tudo
zh_hans: 全部折叠

# command-error
source: Error running command {1}: {0}. This is likely caused by the extension that contributes {1}.
de: Fehler beim Ausführen des Befehls {1}: {0}. Dies wird vermutlich durch die Erweiterung verursacht, die {1} beiträgt.
es: Error al ejecutar el comando {1}: {0}. Probablemente esté provocado por la extensión que contribuye a {1}.
fr: Erreur pendant l'exécution de la commande {1} : {0}. Probablement due à l'extension qui contribue à {1}.
it: Si è verificato un errore durante l'esecuzione del comando {1}: {0}. Il problema può dipendere dall'estensione che aggiunge come contributo {1}.
ja: コマンド {1} の実行中にエラー {0} が発生しました。{1} を提供する拡張機能が原因である可能性があります。
ko: 오류 실행 명령 {1}: {0}. 이는 {1}을(를) 제공하는 확장으로 인해 발생할 수 있습니다.
pt_br: Erro ao executar o comando {1}: {0}. Isso provavelmente é causado pela extensão que contribui com {1}.
zh_hans: 运行命令 {1} 错误: {0}。这可能是由提交 {1} 的扩展引起的。

# no-dataprovider
source: There is no data provider registered that can provide view data.
de: Es ist kein Datenanbieter registriert, der Sichtdaten bereitstellen kann.
es: No hay ningún proveedor de datos registrado que pueda proporcionar datos de la vista.
fr: Aucun fournisseur de données inscrit pouvant fournir des données de vue.
it: Non ci sono provider di dati registrati che possono fornire i dati della visualizzazione.
ja: ビュー データを提供できるデータ プロバイダーが登録されていません。
ko: 보기 데이터를 제공할 수 있는 등록된 데이터 공급자가 없습니다.
pt_br: Não há nenhum provedor de dados registrado que possa fornecer dados de exibição.
zh_hans: 没有可提供视图数据的已注册数据提供程序。

# webViewDialog.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# webViewDialog.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# enablePreviewFeatures.never
source: No, don't show again
de: Nein, nicht mehr anzeigen
es: No, no volver a mostrar
fr: Non, ne plus afficher
it: Non visualizzare più questo messaggio
ja: いいえ、今後は表示しない
ko: 아니요, 다시 표시 안 함
pt_br: Não, não mostrar novamente
zh_hans: 否，不再显示

# enablePreviewFeatures.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否

# enablePreviewFeatures.notice
source: Preview features enhance your experience in Azure Data Studio by giving you full access to new features and improvements. You can learn more about preview features [here]({0}). Would you like to enable preview features?
de: Vorschaufeatures verbessern die Benutzerfreundlichkeit von Azure Data Studio, indem sie Ihnen Vollzugriff auf neue Features und Verbesserungen ermöglichen. Weitere Informationen zu Vorschaufeatures finden Sie [hier]({0}). Möchten Sie Vorschaufeatures aktivieren?
es: Las características en versión preliminar mejoran la experiencia en Azure Data Studio, ya que ofrecen acceso completo a nuevas funciones y mejoras. Puede obtener más información sobre las características en versión preliminar [aquí]({0}). ¿Quiere habilitar las características en versión preliminar?
fr: Les fonctionnalités en préversion améliorent votre expérience dans Azure Data Studio en vous donnant un accès total aux nouvelles fonctionnalités et améliorations. Vous pouvez en savoir plus sur les fonctionnalités en préversion [ici] ({0}). Voulez-vous activer les fonctionnalités en préversion ?
it: Le funzionalità in anteprima consentono di migliorare l'esperienza in Azure Data Studio offrendo accesso completo a nuove funzionalità e miglioramenti. Per altre informazioni sulle funzionalità in anteprima, vedere [qui] ({0}). Abilitare le funzionalità in anteprima?
ja: プレビュー機能により、新機能と機能改善にフル アクセスできることで、Azure Data Studio のエクスペリエンスが拡張されます。プレビュー機能の詳細については、[ここ] ({0}) を参照してください。プレビュー機能を有効にしますか?
ko: 미리 보기 기능을 사용하면 새로운 기능 및 개선 사항에 대한 모든 권한을 제공함으로써 Azure Data Studio에서 환경이 개선됩니다. [여기]({0})에서 미리 보기 기능에 관해 자세히 알아볼 수 있습니다. 미리 보기 기능을 사용하시겠습니까?
pt_br: Os recursos de versão prévia aprimoram a sua experiência no Azure Data Studio oferecendo a você acesso completo a novos recursos e melhorias. Saiba mais sobre os recursos de versão prévia [aqui]({0}). Deseja habilitar os recursos de versão prévia?
zh_hans: 预览功能可让你全面访问新功能和改进功能，从而提升你在 Azure Data Studio 中的体验。有关预览功能的详细信息，请访问[此处]({0})。是否要启用预览功能?

# enablePreviewFeatures.yes
source: Yes (recommended)
de: Ja (empfohlen)
es: Sí (opción recomendada)
fr: Oui (recommandé)
it: Sì (scelta consigliata)
ja: はい (推奨)
ko: 예(추천)
pt_br: Sim (recomendado)
zh_hans: 是(推荐)

# welcomePage.createConnection
source: Create a connection
de: Verbindung erstellen
es: Crear una conexión
fr: Créer une connexion
it: Crea una connessione
ja: 接続の作成
ko: 연결 만들기
pt_br: Criar uma conexão
zh_hans: 创建连接

# welcomePage.createConnectionBody
source: Connect to a database instance through the connection dialog.
de: Stellen Sie über das Verbindungsdialogfeld eine Verbindung mit einer Datenbankinstanz her.
es: Conéctese a una instancia de una base de datos por medio del cuadro de diálogo de conexión.
fr: Connectez-vous à une instance de base de données en utilisant la boîte de dialogue de connexion.
it: Connettersi a un'istanza di database tramite la finestra di dialogo di connessione.
ja: 接続ダイアログを使用してデータベース インスタンスに接続します。
ko: 연결 대화 상자를 통해 데이터베이스 인스턴스에 연결합니다.
pt_br: Conectar a uma instância do banco de dados por meio da caixa de diálogo de conexão.
zh_hans: 通过连接对话连接到数据库实例。

# welcomePage.createNotebook
source: Create a notebook
de: Notebook erstellen
es: Crear un cuaderno
fr: Créer un notebook
it: Crea un notebook
ja: ノートブックの作成
ko: Notebook 만들기
pt_br: Criar um notebook
zh_hans: 创建笔记本

# welcomePage.createNotebookBody
source: Build a new notebook using a native notebook editor.
de: Erstellen Sie ein neues Notebook mithilfe eines nativen Notebook-Editors.
es: Cree un nuevo cuaderno con un editor de cuadernos nativo.
fr: Générez un nouveau notebook à l'aide d'un éditeur de notebook natif.
it: Creare un nuovo notebook usando un editor di notebook nativo.
ja: ネイティブのノートブック エディターを使用して、新しいノートブックを作成します。
ko: 네이티브 Notebook 편집기를 사용하여 새 Notebook을 빌드합니다.
pt_br: Crie um notebook usando um editor de notebook nativo.
zh_hans: 使用本机笔记本编辑器生成新笔记本。

# welcomePage.deployServer
source: Deploy a server
de: Server bereitstellen
es: Implementar un servidor
fr: Déployer un serveur
it: Distribuisci un server
ja: サーバーのデプロイ
ko: 서버 배포
pt_br: Implantar um servidor
zh_hans: 部署服务器

# welcomePage.deployServerBody
source: Create a new instance of a relational data service on the platform of your choice.
de: Erstellen Sie eine neue Instanz eines relationalen Datendiensts auf der Plattform Ihrer Wahl.
es: Cree una nueva instancia de un servicio de datos relacionales en la plataforma de su elección.
fr: Créez une instance de service de données relationnelles sur la plateforme de votre choix.
it: Crea una nuova istanza di un servizio dati relazionale nella piattaforma scelta.
ja: 選択したプラットフォームでリレーショナル データ サービスの新しいインスタンスを作成します。
ko: 선택한 플랫폼에서 관계형 데이터 서비스의 새 인스턴스를 만듭니다.
pt_br: Crie uma instância de um serviço de dados relacionais na plataforma de sua escolha.
zh_hans: 在所选平台上创建关系数据服务的新实例。

# welcomePage.documentation
source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
ja: ドキュメント
ko: 설명서
pt_br: Documentação
zh_hans: 文档

# welcomePage.documentationBody
source: Visit the documentation center for quickstarts, how-to guides, and references for PowerShell, APIs, etc.
de: Im Dokumentationscenter finden Sie Schnellstarts, Anleitungen und Referenzdokumentation zu PowerShell, APIs usw.
es: Visite el centro de documentación para acceder a guías de inicio rápido y paso a paso, así como consultar referencias para PowerShell, API, etc.
fr: Visitez le centre de documentation pour obtenir des guides de démarrage rapide, des guides pratiques et des références pour PowerShell, les API, etc.
it: Visitare il centro documentazione per guide di avvio rapido, guide pratiche e riferimenti per PowerShell, API e così via.
ja: PowerShell、API などのクイックスタート、攻略ガイド、リファレンスについては、ドキュメント センターを参照してください。
ko: PowerShell, API 등의 빠른 시작, 방법 가이드, 참조 자료를 보려면 설명서 센터를 방문합니다.
pt_br: Visite o centro de documentos para obter guias de início rápido, guias de instruções e referências para o PowerShell, as APIs e outros.
zh_hans: 访问文档中心，以获取快速入门、操作指南以及 PowerShell、API 等的参考。

# welcomePage.extensions
source: Extensions
de: Erweiterungen
es: Extensiones
it: Estensioni
ja: 拡張
ko: 확장
pt_br: Extensões
zh_hans: 扩展

# welcomePage.gettingStarted
source: Getting Started
de: Erste Schritte
es: Introducción
fr: Démarrer
it: Attività iniziali
ja: はじめに
ko: 시작
pt_br: Introdução
zh_hans: 开始使用

# welcomePage.gettingStartedBody
source: Discover the capabilities offered by Azure Data Studio and learn how to make the most of them.
de: Lernen Sie die von Azure Data Studio bereitgestellten Funktionen kennen, und erfahren Sie, wie Sie diese optimal nutzen können.
es: Descubra las funcionalidades que ofrece Azure Data Studio y aprenda a sacarles el máximo partido.
fr: Découvrez les fonctionnalités offertes par Azure Data Studio et comment en tirer le meilleur parti.
it: Scopri le funzionalità offerte da Azure Data Studio e impara a sfruttarle al meglio.
ja: Azure Data Studio によって提供される機能を検出し、それらを最大限に活用する方法について説明します。
ko: Azure Data Studio에서 제공하는 기능을 검색하고 기능을 최대한 활용하는 방법을 알아봅니다.
pt_br: Descubra as funcionalidades oferecidas pelo Azure Data Studio e saiba como aproveitá-las ao máximo.
zh_hans: 发现 Azure Data Studio 所提供的功能，并了解如何充分利用这些功能。
