Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# notebook.maxRichTextUndoHistory
source: The maximum number of changes stored in the undo history for the notebook Rich Text editor.
de: Die maximale Anzahl von Änderungen, die im Verlauf des Rücksetzens für den Notizbuch-Rich-Text-Editor gespeichert sind.
es: Número máximo de cambios almacenados en el historial de deshacer del editor de texto enriquecido del cuaderno
fr: Nombre maximal de modifications stockées dans l’historique des annulations pour l’éditeur de texte enrichi de bloc-notes.
it: Numero massimo di modifiche archiviate nella cronologia di annullamento per l'editor di testo RTF del notebook.
ja: ノートブックのリッチ テキスト エディターを元に戻す操作の履歴に格納される変更の最大数です。
ko: 전자 필기장 서식 있는 텍스트 편집기의 실행 취소 기록에 저장된 최대 변경 내용 수입니다.
pt_br: O número máximo de alterações armazenadas no histórico de desfazer do editor de Rich Text do bloco de anotações.
zh_hans: 笔记本格式文本编辑器的撤消历史记录中存储的最大更改数。

# notebook.richTextModeDescription
source: Text is displayed as Rich Text (also known as WYSIWYG).
de: Text wird als Rich-Text (auch bekannt als WSSIWYG) angezeigt.
es: El texto se muestra como texto enriquecido (también conocido como WYSIWYG).
fr: Le texte est affiché sous forme de texte enrichi (également appelé WYSIWYG).
it: Il testo viene visualizzato come testo RTF, noto anche come WYSIWYG.
ja: テキストはリッチ テキスト (WYSIWYG とも呼ばれる) として表示されます。
ko: 텍스트는 서식 있는 텍스트로 표시됩니다(이 텍스트는 WYSIWYG라고도 함).
pt_br: O texto é exibido como Rich Text (também conhecido como WYSIWYG).
zh_hans: 文本显示为格式文本(也称为 "WSIWYG")。

# notebook.saveConnectionName
source: (Preview) Save connection name in notebook metadata.
de: (Vorschau) Speichern Sie den Verbindungsnamen in den Notebook-Metadaten.
es: (Versión preliminar) Guarde el nombre de la conexión en los metadatos del cuaderno.
fr: (Préversion) Enregistrez le nom de connexion dans les métadonnées du notebook.
it: (Anteprima) Salvare il nome della connessione nei metadati del notebook.
ja: (プレビュー) ノートブック メタデータに接続名を保存します。
ko: (미리 보기) 연결 이름을 Notebook 메타데이터에 저장합니다.
pt_br: (Versão Prévia) Salve o nome da conexão nos metadados do notebook.
zh_hans: (预览)在笔记本元数据中保存连接名称。

# notebook.showAllKernels
source: (Preview) show all kernels for the current notebook provider.
de: (Vorschau) Zeigen Sie alle Kernel für den aktuellen Notebook-Anbieter an.
es: (Versión preliminar) Consulte todos los kernel del proveedor del cuaderno actual.
fr: (Préversion) Affichez tous les noyaux du fournisseur de notebook actuel.
it: (Anteprima) mostrare tutti i kernel per il provider di notebook corrente.
ja: (プレビュー) 現在のノートブック プロバイダーのすべてのカーネルを表示します。
ko: (미리 보기) 현재 Notebook 공급자의 모든 커널을 표시합니다.
pt_br: (Versão Prévia) Mostrar todos os kernels para o provedor do notebook atual.
zh_hans: (预览)显示当前笔记本提供程序的所有内核。

# notebook.showRenderedNotebookinDiffEditor
source: (Preview) Show rendered notebook in diff editor.
de: (Vorschau) Gerendertes Notebook im Diff-Editor anzeigen.
es: (Vista preliminar) Mostrar el bloc de notas representado en el editor.
fr: (Aperçu) Afficher le bloc-notes rendu dans l’éditeur de différences.
it: (Anteprima) Visualizzare il notebook di cui è eseguito il rendering nell'editor diff.
ja: (プレビュー) レンダリングされたノートブックを差分エディターで表示します。
ko: (미리 보기) diff 편집기에서 렌더링된 전자 필기장을 표시합니다.
pt_br: (Visualização) Mostrar bloco de anotações renderizado no editor de dif.
zh_hans: (预览)在差异编辑器中显示呈现的笔记本。

# notebook.splitViewModeDescription
source: Markdown is displayed on the left, with a preview of the rendered text on the right.
de: Auf der linken Seite wird ein Markdown mit einer Vorschau des gerenderten Texts auf der rechten Seite angezeigt.
es: "Markdown" se muestra a la izquierda, con una vista previa del texto representado a la derecha.
fr: Markdown s’affiche à gauche, avec un aperçu du texte rendu à droite.
it: Markdown visualizzato a sinistra, con un'anteprima del testo di cui è stato eseguito il rendering a destra.
ja: マークダウンが左側に表示され、レンダリングされたテキストの右側にプレビューが表示されます。
ko: Markdown은 왼쪽에 표시되고, 오른쪽에는 렌더링된 텍스트의 미리 보기가 표시됩니다.
pt_br: O Markdown é exibido à esquerda, com uma visualização do texto renderizado à direita.
zh_hans: Markdown 显示在左侧，右侧是呈现的文本的预览。

# notebook.sqlStopOnError
source: SQL kernel: stop Notebook execution when error occurs in a cell.
de: SQL-Kernel: Notebook-Ausführung bei Fehler in Zelle beenden
es: Kernel SQL: detenga la ejecución del Notebook cuando se produzca un error en una celda.
fr: Noyau SQL : arrêtez l'exécution du notebook quand l'erreur se produit dans une cellule.
it: Kernel SQL: arresta l'esecuzione di Notebook quando si verifica un errore in una cella.
ja: SQL カーネル: セルでエラーが発生したときに Notebook の実行を停止します。
ko: SQL 커널: 셀에서 오류가 발생하면 Notebook 실행을 중지합니다.
pt_br: Kernel do SQL: parar a execução do Notebook quando ocorrer um erro em uma célula.
zh_hans: SQL 内核: 在单元格中发生错误时停止笔记本执行。

# notebook.useAbsoluteFilePaths
source: Use absolute file paths when linking to other notebooks.
de: Verwenden Sie absolute Dateipfade beim Verknüpfen mit anderen Notebooks.
es: Use rutas a archivos absolutas para la vinculación con otros cuadernos.
fr: Utilisez des chemins d’accès de fichier absolus lors de la liaison à d’autres blocs-notes.
it: Usare percorsi di file assoluti durante il collegamento ad altri notebook.
ja: 他のノートブックにリンクする場合は、絶対ファイル パスを使用します。
ko: 다른 노트북에 연결할 때 절대 파일 경로를 사용하세요.
pt_br: Use caminhos de arquivo absolutos ao vincular a outros blocos de anotações.
zh_hans: 链接到其他笔记本时使用绝对文件路径。

# notebook.useNewMarkdownRenderer
source: Whether to use the newer version of the markdown renderer for Notebooks. This may result in markdown being rendered differently than previous versions.
de: Gibt an, ob die neuere Version des Markdownrenderers für Notebooks verwendet werden soll. Dies kann dazu führen, dass Markdown anders gerendert wird als frühere Versionen.
es: Indica si se debe usar la versión más reciente del representador Markdown para los blocs de notas. Esto puede dar lugar a que Markdown se represente de forma diferente que las versiones anteriores.
fr: Indique s’il faut utiliser la version la plus récente du convertisseur de démarque pour les ordinateurs portables. Cela peut entraîner une démarque différente de celle des versions précédentes.
it: Indica se usare la versione più recente del renderer markdown per blocco appunti. Il rendering di markdown potrebbe quindi essere diverso rispetto alle versioni precedenti.
ja: ノートブック用のマークダウン レンダラーの新しいバージョンを使用するかどうか。これにより、マークダウンが以前のバージョンとは異なる方法でレンダリングされる可能性があります。
ko: 전자 필기장에 최신 버전의 Markdown 렌더러를 사용할지 여부입니다. 이로 인해 Markdown이 이전 버전과 다르게 렌더링될 수 있습니다.
pt_br: Se deseja usar a versão mais recente do renderizador de markdown para Notebooks. Isso pode fazer com que o markdown seja renderizado de forma diferente das versões anteriores.
zh_hans: 是否对 Notebook 使用较新版本的 Markdown 呈现器。这可能会导致 Markdown 的呈现方式与以前的版本不同。

source: Notebook Views
de: Notizbuchansichten
es: Vistas de Bloc de notas
fr: Affichages du bloc-notes
it: Visualizzazioni blocco appunti
ja: ノートブック ビュー
ko: 전자 필기장 보기
pt_br: Exibições do Bloco de Anotações
zh_hans: Notebook 视图

# notebookViews.enabled
source: (Preview) Enable Notebook Views
de: (Vorschau) Notebookansichten aktivieren
es: (Versión preliminar) Habilitar vistas del bloc de notas
fr: (Préversion) Activer les affichages bloc-notes
it: (Anteprima) Abilitare le visualizzazioni blocco appunti
ja: (プレビュー) ノートブック ビューを有効にする
ko: (미리 보기) 전자 필기장 보기 사용
pt_br: (Visualização) Habilitar Modos de Exibição do Bloco de Anota
zh_hans: (预览)启用笔记本视图

# search.actionsPosition
source: Controls the positioning of the actionbar on rows in the search view.
de: Steuert die Positionierung der Aktionsleiste auf Zeilen in der Suchansicht.
es: Controla el posicionamiento de la actionbar en las filas en la vista de búsqueda.
fr: Contrôle le positionnement de la barre d'action sur des lignes dans la vue de recherche.
it: Controlla il posizionamento in righe della barra azioni nella visualizzazione di ricerca.
ja: 検索ビューの行内のアクションバーの位置を制御します。
ko: 검색 보기에서 행의 작업 모음 위치를 제어합니다.
pt_br: Controla o posicionamento do actionbar nas linhas do modo de exibição de pesquisa.
zh_hans: 在搜索视图中控制操作栏的位置。

# search.actionsPositionAuto
source: Position the actionbar to the right when the search view is narrow, and immediately after the content when the search view is wide.
de: Hiermit wird die Aktionsleiste auf der rechten Seite positioniert, wenn die Suchansicht schmal ist, und gleich hinter dem Inhalt, wenn die Suchansicht breit ist.
es: Posicione el actionbar a la derecha cuando la vista de búsqueda es estrecha, e inmediatamente después del contenido cuando la vista de búsqueda es amplia.
fr: Positionnez la barre d'action à droite quand la vue de recherche est étroite et immédiatement après le contenu quand la vue de recherche est large.
it: Posiziona la barra azioni a destra quando la visualizzazione di ricerca è stretta e subito dopo il contenuto quando la visualizzazione di ricerca è ampia.
ja: 検索ビューが狭い場合はアクションバーを右に、検索ビューが広い場合はコンテンツの直後にアクションバーを配置します。
ko: 검색 보기가 좁을 때는 오른쪽에, 그리고 검색 보기가 넓을 때는 콘텐츠 바로 뒤에 작업 모음을 배치합니다.
pt_br: Posicione o actionBar à direita quando o modo de exibição de pesquisa for estreito e imediatamente após o conteúdo quando o modo de exibição de pesquisa for largo.
zh_hans: 当搜索视图较窄时将操作栏置于右侧，当搜索视图较宽时，将它紧接在内容之后。

# search.actionsPositionRight
source: Always position the actionbar to the right.
de: Hiermit wird die Aktionsleiste immer auf der rechten Seite positioniert.
es: Posicionar siempre el actionbar a la derecha.
fr: Positionnez toujours la barre d'action à droite.
it: Posiziona sempre la barra azioni a destra.
ja: アクションバーを常に右側に表示します。
ko: 작업 모음을 항상 오른쪽에 배치합니다.
pt_br: Sempre posicione o actionbar à direita.
zh_hans: 始终将操作栏放置在右侧。

# search.collapseAllResults
source: Controls whether the search results will be collapsed or expanded.
de: Steuert, ob die Suchergebnisse zu- oder aufgeklappt werden.
es: Controla si los resultados de la búsqueda estarán contraídos o expandidos.
fr: Contrôle si les résultats de recherche seront réduits ou développés.
it: Controlla se i risultati della ricerca verranno compressi o espansi.
ja: 検索結果を折りたたむか展開するかどうかを制御します。
ko: 검색 결과를 축소 또는 확장할지 여부를 제어합니다.
pt_br: Controla se os resultados da pesquisa serão recolhidos ou expandidos.
zh_hans: 控制是折叠还是展开搜索结果。

# search.collapseResults.auto
source: Files with less than 10 results are expanded. Others are collapsed.
de: Dateien mit weniger als 10 Ergebnissen werden erweitert. Andere bleiben reduziert.
es: Los archivos con menos de 10 resultados se expanden. El resto están colapsados.
fr: Les fichiers avec moins de 10 résultats sont développés. Les autres sont réduits.
it: I file con meno di 10 risultati vengono espansi. Gli altri vengono compressi.
ja: 結果が 10 件未満のファイルが展開されます。他のファイルは折りたたまれます。
ko: 결과가 10개 미만인 파일이 확장됩니다. 다른 파일은 축소됩니다.
pt_br: Arquivos com menos de 10 resultados são expandidos. Outros são recolhidos.
zh_hans: 结果少于10个的文件将被展开。其他的则被折叠。

# search.followSymlinks
source: Controls whether to follow symlinks while searching.
de: Steuert, ob Symlinks während der Suche gefolgt werden.
es: Controla si debe seguir enlaces simbólicos durante la búsqueda.
fr: Contrôle s'il faut suivre les symlinks pendant la recherche.
it: Controlla se seguire i collegamenti simbolici durante la ricerca.
ja: 検索中にシンボリック リンクをたどるかどうかを制御します。
ko: 검색하는 동안 symlink를 누를지 여부를 제어합니다.
pt_br: Controla se os ciclos de links devem ser seguidos durante a pesquisa.
zh_hans: 控制是否在搜索中跟踪符号链接。

# search.globalFindClipboard
source: Controls whether the search view should read or modify the shared find clipboard on macOS.
de: Steuert, ob die Suchansicht die freigegebene Suchzwischenablage unter macOS lesen oder verändern soll.
es: Controla si la vista de búsqueda debe leer o modificar el portapapeles de búsqueda compartido en macOS.
fr: Contrôle si la vue de recherche doit lire ou modifier le presse-papiers partagé sur macOS.
it: Controlla se il viewlet di ricerca deve leggere o modificare gli appunti di ricerca condivisi in macOS.
ja: macOS で検索ビューが共有の検索クリップボードを読み取りまたは変更するかどうかを制御します。
ko: macOS에서 검색 보기가 공유 클립보드 찾기를 읽거나 수정할지 여부를 제어합니다.
pt_br: Controla se o modo de exibição de pesquisa deve ler ou modificar a área de transferência de localização compartilhada no macOS.
zh_hans: 控制“搜索”视图是否读取或修改 macOS 的共享查找剪贴板。

# search.location
source: Controls whether the search will be shown as a view in the sidebar or as a panel in the panel area for more horizontal space.
de: Steuert, ob die Suche als Ansicht in der Seitenleiste oder als Panel angezeigt wird, damit horizontal mehr Platz verfügbar ist.
es: Controla si la búsqueda se muestra como una vista en la barra lateral o como un panel en el área de paneles para disponer de más espacio horizontal.
fr: Contrôle si la recherche s’affiche comme une vue dans la barre latérale ou comme un panneau dans la zone de panneaux pour plus d'espace horizontal.
it: Controlla se la ricerca verrà mostrata come visualizzazione nella barra laterale o come pannello nell'area pannelli per ottenere più spazio orizzontale.
ja: 検索をサイドバーのビューとして表示するか、より水平方向の空間をとるためにパネル領域のパネルとして表示するかを制御します。
ko: 검색을 사이드바의 보기로 표시할지 또는 가로 간격을 늘리기 위해 패널 영역의 패널로 표시할지를 제어합니다.
pt_br: Controla se a pesquisa será mostrada como um modo de exibição na barra lateral ou como um painel na área do painel para obter mais espaço horizontal.
zh_hans: 控制搜索功能是显示在侧边栏，还是显示在水平空间更大的面板区域。

# search.location.deprecationMessage
source: This setting is deprecated. Please use the search view's context menu instead.
de: Diese Einstellung ist veraltet. Verwenden Sie stattdessen das Kontextmenü der Suchansicht.
es: Esta configuración está en desuso. Utilice el menú contextual de la vista de búsqueda en su lugar.
fr: Ce paramètre est déprécié. Utilisez le menu contextuel de la vue de recherche à la place.
it: Questa impostazione è deprecata. Usare il menu di scelta rapida della visualizzazione di ricerca.
ja: この設定は非推奨です。代わりに検索ビューのコンテキスト メニューをお使いください。
ko: 이 설정은 더 이상 사용되지 않습니다. 대신 검색 보기의 컨텍스트 메뉴를 사용하세요.
pt_br: Esta configuração é preterida. Em vez disso, use o menu de contexto da exibição de pesquisa.
zh_hans: 此设置已弃用。请改用搜索视图的上下文菜单。

# search.maintainFileSearchCache
source: When enabled, the searchService process will be kept alive instead of being shut down after an hour of inactivity. This will keep the file search cache in memory.
de: Wenn diese Option aktiviert ist, bleibt der SearchService-Prozess aktiv, anstatt nach einer Stunde Inaktivität beendet zu werden. Dadurch wird der Cache für Dateisuchen im Arbeitsspeicher beibehalten.
es: Cuando está habilitado, el proceso de servicio de búsqueda se mantendrá habilitado en lugar de cerrarse después de una hora de inactividad. Esto mantendrá la caché de búsqueda de archivos en la memoria.
fr: Si activé, le processus searchService est maintenu actif au lieu d'être arrêté au bout d'une heure d'inactivité. Ce paramètre conserve le cache de recherche de fichier en mémoire.
it: Se abilitato, il processo searchService verrà mantenuto attivo invece di essere arrestato dopo un'ora di inattività. In questo modo la cache di ricerca dei file rimarrà in memoria.
ja: 有効にすると、searchService プロセスは 1 時間操作がない場合でもシャットダウンされず、アクティブな状態に保たれます。これにより、ファイル検索キャッシュがメモリに保持されます。
ko: 사용하도록 설정하면 searchService 프로세스가 1시간의 비활성 상태 이후 종료되지 않고 계속 유지됩니다. 메모리에 파일 검색 캐시가 유지됩니다.
pt_br: Quando habilitado, o processo de searchService será mantido ativo em vez de ser desligado após uma hora de inatividade. Isso manterá o cache de pesquisa de arquivo na memória.
zh_hans: 启用后，搜索服务进程将保持活动状态，而不是在一个小时不活动后关闭。这将使文件搜索缓存保留在内存中。

# search.quickOpen.includeHistory
source: Whether to include results from recently opened files in the file results for Quick Open.
de: Gibt an, ob Ergebnisse aus zuletzt geöffneten Dateien in den Dateiergebnissen für Quick Open aufgeführt werden.
es: Indica si se incluyen resultados de archivos abiertos recientemente en los resultados de archivos de Quick Open.
fr: Indique si vous souhaitez inclure les résultats de fichiers récemment ouverts dans les résultats de fichiers pour Quick Open.
it: Indica se includere i risultati di file aperti di recente nel file dei risultati per Quick Open.
ja: 最近開いたファイルの結果を、Quick Open の結果ファイルに含めるかどうか。
ko: Quick Open에 대한 파일 결과에 최근에 연 파일의 결과를 포함할지 여부입니다.
pt_br: Se deseja incluir os resultados de arquivos abertos recentemente nos resultados do arquivo para Abertura Rápida.
zh_hans: 是否在 Quick Open 的文件结果中包含最近打开的文件。

# search.quickOpen.includeSymbols
source: Whether to include results from a global symbol search in the file results for Quick Open.
de: Konfiguriert, ob Ergebnisse aus einer globalen Symbolsuche in die Dateiergebnisse für Quick Open eingeschlossen werden sollen.
es: Indica si se incluyen resultados de una búsqueda global de símbolos en los resultados de archivos de Quick Open.
fr: Indique s’il faut inclure les résultats d’une recherche de symbole global dans les résultats de fichier pour Quick Open.
it: Indica se includere i risultati di una ricerca di simboli globale nei risultati dei file per Quick Open.
ja: グローバル シンボル検索の結果を、Quick Open の結果ファイルに含めるかどうか。
ko: Quick Open에 대한 파일 결과에 전역 기호 검색 결과를 포함할지 여부입니다.
pt_br: Se deseja incluir os resultados de uma pesquisa de símbolo global nos resultados do arquivo para Abertura Rápida.
zh_hans: 控制 Quick Open 文件结果中是否包括全局符号搜索的结果。

# search.searchEditor.doubleClickBehaviour
source: Configure effect of double clicking a result in a search editor.
de: Konfiguriert den Effekt des Doppelklickens auf ein Ergebnis in einem Such-Editor.
es: Configure el efecto de hacer doble clic en un resultado en un editor de búsqueda.
fr: Configurez ce qui se passe après un double clic sur un résultat dans un éditeur de recherche.
it: Configura l'effetto del doppio clic su un risultato nell'editor della ricerca.
ja: 検索エディターで結果をダブル クリックした場合の効果を構成します。
ko: 검색 편집기에서 결과를 두 번 클릭하는 효과를 구성합니다.
pt_br: Configurar efeito de clicar duas vezes em um resultado em um editor de pesquisas.
zh_hans: 配置在搜索编辑器中双击结果的效果。

# search.searchEditor.doubleClickBehaviour.goToLocation
source: Double clicking opens the result in the active editor group.
de: Durch Doppelklicken wird das Ergebnis in der aktiven Editor-Gruppe geöffnet.
es: Al hacer doble clic, se abre el resultado en el grupo de editor activo.
fr: Double-cliquez sur le résultat pour l'ouvrir dans le groupe d'éditeurs actif.
it: Facendo doppio clic il risultato viene aperto nel gruppo di editor attivo.
ja: ダブルクリックすると、アクティブなエディター グループに結果が開きます。
ko: 두 번 클릭하면 활성 편집기 그룹에 결과가 열립니다.
pt_br: Clicar duas vezes abre o resultado no grupo de editor ativo.
zh_hans: 双击将在活动编辑器组中打开结果。

# search.searchEditor.doubleClickBehaviour.openLocationToSide
source: Double clicking opens the result in the editor group to the side, creating one if it does not yet exist.
de: Durch Doppelklicken wird das Ergebnis in der Editorgruppe an der Seite geöffnet, wodurch ein Ergebnis erstellt wird, wenn noch keines vorhanden ist.
es: Al hacer doble clic se abre el resultado en el grupo del editor a un lado, creando uno si aún no existe.
fr: Double-cliquez pour ouvrir le résultat dans le groupe d'éditeurs ouvert ou dans un nouveau groupe d'éditeurs le cas échéant.
it: Facendo doppio clic il risultato viene aperto nel gruppo di editor laterale e viene creato un gruppo se non esiste ancora.
ja: ダブルクリックすると、結果はエディター グループの横に開かれ、まだ存在しない場合は作成されます。
ko: 두 번 클릭하면 측면의 편집기 그룹에 결과가 열리고, 편집기 그룹이 없으면 새로 만듭니다.
pt_br: Clicar duas vezes abrirá o resultado no grupo editor ao lado, criando um se ele ainda não existir.
zh_hans: 双击将在编辑器组中的结果打开到一边，如果尚不存在，则创建一个结果。

# search.searchEditor.doubleClickBehaviour.selectWord
source: Double clicking selects the word under the cursor.
de: Durch Doppelklicken wird das Wort unter dem Cursor ausgewählt.
es: Al hacer doble clic, se selecciona la palabra bajo el cursor.
fr: Double-cliquez pour sélectionner le mot sous le curseur.
it: Facendo doppio clic viene selezionata la parola sotto il cursore.
ja: ダブルクリックすると、カーソルの下にある単語が選択されます。
ko: 두 번 클릭하면 커서 아래에 있는 단어가 선택됩니다.
pt_br: Clicar duas vezes seleciona a palavra sob o cursor.
zh_hans: 双击选择光标下的单词。

# search.searchOnType
source: Search all files as you type.
de: Alle Dateien während der Eingabe durchsuchen
es: Busque todos los archivos a medida que escribe.
fr: Recherchez dans tous les fichiers à mesure que vous tapez.
it: Cerca in tutti i file durante la digitazione.
ja: 入力中の文字列を全てのファイルから検索する。
ko: 입력할 때 모든 파일을 검색합니다.
pt_br: Pesquisar todos os arquivos enquanto você digita.
zh_hans: 在键入时搜索所有文件。

# search.searchOnTypeDebouncePeriod
source: When `#search.searchOnType#` is enabled, controls the timeout in milliseconds between a character being typed and the search starting. Has no effect when `search.searchOnType` is disabled.
de: Wenn #search.searchOnType aktiviert ist, wird dadurch das Timeout in Millisekunden zwischen einem eingegebenen Zeichen und dem Start der Suche festgelegt. Diese Einstellung keine Auswirkung, wenn search.searchOnType deaktiviert ist.
es: Cuando '#search.searchOnType' está habilitado, controla el tiempo de espera en milisegundos entre un carácter que se escribe y el inicio de la búsqueda. No tiene ningún efecto cuando 'search.searchOnType' está deshabilitado.
fr: Quand '#search.searchOnType' est activé, contrôle le délai d'attente avant expiration en millisecondes entre l'entrée d'un caractère et le démarrage de la recherche. N'a aucun effet quand 'search.searchOnType' est désactivé.
it: Se `#search.searchOnType#` è abilitato, controlla il timeout in millisecondi tra la digitazione di un carattere e l'avvio della ricerca. Non ha effetto quando `search.searchOnType` è disabilitato.
ja: '#search.searchOnType#' を有効にすると、文字が入力されてから検索が開始されるまでのタイムアウト (ミリ秒) が制御されます。'search.searchOnType' が無効になっている場合には影響しません。
ko: '#search.searchOnType#'이 활성화되면 입력되는 문자와 검색 시작 사이의 시간 시간을 밀리초 단위로 제어합니다. 'search.searchOnType'을 사용하지 않도록 설정하면 아무런 효과가 없습니다.
pt_br: Quando `#search.searchOnType#` está habilitado, controla o tempo limite em milissegundos entre um caractere que está sendo digitado e o início da pesquisa. Não tem efeito quando `search.searchOnType` está desabilitado.
zh_hans: 启用"#search.searchOnType"后，控制键入的字符与开始搜索之间的超时(以毫秒为单位)。禁用"搜索.searchOnType"时无效。

# search.seedOnFocus
source: Update workspace search query to the editor's selected text when focusing the search view. This happens either on click or when triggering the `workbench.views.search.focus` command.
de: Hiermit wird die Suchabfrage für den Arbeitsbereich auf den ausgewählten Editor-Text aktualisiert, wenn die Suchansicht den Fokus hat. Dies geschieht entweder per Klick oder durch Auslösen des Befehls "workbench.views.search.focus".
es: Actualiza la consulta de búsqueda del área de trabajo al texto seleccionado del editor al enfocar la vista de búsqueda. Esto ocurre al hacer clic o al desencadenar el comando "workbench.views.search.focus".
fr: Mettez à jour la requête de recherche d'espace de travail en fonction du texte sélectionné de l'éditeur quand vous placez le focus sur la vue de recherche. Cela se produit soit au moment du clic de souris, soit au déclenchement de la commande 'workbench.views.search.focus'.
it: Aggiorna la query di ricerca dell'area di lavoro in base al testo selezionato dell'editor quando lo stato attivo si trova nella visualizzazione di ricerca. Si verifica in caso di clic o quando si attiva il comando `workbench.views.search.focus`.
ja: 検索ビューにフォーカスを置いたときに、ワークスペースの検索クエリが、エディターで選択されているテキストに更新されます。これは、クリックされたときか、'workbench.views.search.focus' コマンドがトリガーされたときに発生します。
ko: 검색 보기에 포커스가 있을 때 작업 영역 검색 쿼리를 편집기의 선택한 텍스트로 업데이트합니다. 이 동작은 클릭 시 또는 `workbench.views.search.focus` 명령을 트리거할 때 발생합니다.
pt_br: Atualizar a consulta de pesquisa do workspace para o texto selecionado do editor ao focar no modo de exibição de pesquisa. Isso acontece ao clicar ou ao disparar o comando `workbench.views.search.focus`.
zh_hans: 聚焦搜索视图时，将工作区搜索查询更新为编辑器的所选文本。单击时或触发 `workbench.views.search.focus` 命令时会发生此情况。
