Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# sql.defaultAuthenticationType.AzureMFAAndUser
source: Azure Active Directory - Password
de: Azure Active Directory: Kennwort
es: Azure Active Directory: contraseña
fr: Azure Active Directory - Mot de passe
ja: Azure Active Directory - パスワード
ko: Azure Active Directory - 암호
pt_br: Azure Active Directory – senha
zh_hans: Azure Active Directory - 密码

# sql.defaultAuthenticationType.Integrated
source: Windows Authentication
de: Windows-Authentifizierung
es: Autenticación de Windows
fr: Authentification Windows
it: Autenticazione di Windows
ja: Windows 認証
ko: Windows 인증
pt_br: Autenticação do Windows
zh_hans: Windows 身份验证

# sql.defaultAuthenticationType.SqlLogin
source: Sql Login
de: SQL-Anmeldung
es: Inicio de sesión de SQL
fr: Connexion SQL
it: Accesso SQL
ja: SQL ログイン
ko: SQL 로그인
pt_br: Login Sql
zh_hans: SQL 登录

# sql.defaultAuthenticationTypeDescription
source: Default authentication type to use when connecting to Azure resources.
de: Standardauthentifizierungstyp, der beim Herstellen einer Verbindung mit Azure-Ressourcen verwendet werden soll.
es: Tipo de autenticación predeterminado que será usado al conectarse a los recursos de Azure.
fr: Type d’authentification par Défaut à utiliser lors de la connexion à des ressources Azure.
it: Tipo di autenticazione predefinito da utilizzare per la connessione alle risorse di Azure.
ja: Azure リソースに接続するときに使用する既定の認証の種類です。
ko: Azure 리소스에 연결할 때 사용할 기본 인증 유형입니다.
pt_br: Tipo de autenticação padrão a ser usado ao se conectar aos recursos do Azure.
zh_hans: 连接到 Azure 资源时要使用的默认身份验证类型。

# sql.defaultEngineDescription
source: Default SQL Engine to use. This drives default language provider in .sql files and the default to use when creating a new connection.
de: Die zu verwendende Standard-SQL-Engine. Diese Einstellung legt den Standardsprachanbieter in SQL-Dateien und die Standardeinstellungen für neue Verbindungen fest.
es: Motor de SQL predeterminado para usar. Esto indica el proveedor de lenguaje predeterminado en los archivos .sql y los valores por defecto que se usarán al crear una nueva conexión.
fr: Moteur SQL par défaut à utiliser. Définit le fournisseur de langage par défaut dans les fichiers .sql et la valeur par défaut quand vous créez une connexion.
it: Motore SQL predefinito da usare. Stabilisce il provider del linguaggio predefinito nei file con estensione sql e il valore predefinito da usare quando si crea una nuova connessione.
ja: 使用する既定の SQL エンジン。.sql ファイル内の既定の言語プロバイダーが駆動され、新しい接続が作成されるときに既定で使用されます。
ko: 사용할 기본 SQL 엔진입니다. 해당 엔진은 .sql 파일의 기본 언어 공급자와 새 연결을 만들 때 사용할 기본 공급자를 구동합니다.
pt_br: Mecanismo SQL padrão a ser usado. Isso direciona o provedor de idioma padrão em arquivos .sql e o padrão a ser usado ao criar uma conexão.
zh_hans: 要使用的默认 SQL 引擎。这将驱动 .sql 文件中的默认语言提供程序，以及创建新连接时使用的默认语言提供程序。

# sql.maxRecentConnectionsDescription
source: The maximum number of recently used connections to store in the connection list.
de: Die maximale Anzahl der zuletzt verwendeten Verbindungen in der Verbindungsliste.
es: Número máximo de conexiones usadas recientemente que se van a almacenar en la lista de conexiones.
fr: Nombre maximal de connexions récemment utilisées à stocker dans la liste de connexions.
it: Numero massimo di connessioni usate di recente da archiviare nell'elenco delle connessioni.
ja: 接続リストに格納する最近使用された接続の最大数。
ko: 연결 목록에 저장할 최근에 사용한 최대 연결 수입니다.
pt_br: O número máximo de conexões usadas recentemente para armazenar na lista de conexão.
zh_hans: 连接列表中保存的最近使用的连接数量上限

# status.connection.status
source: Connection Status
de: Verbindungsstatus
es: Estado de conexión
fr: État de la connexion
it: Stato della connessione
ja: 接続状態
ko: 연결 상태
pt_br: Status da Conexão
zh_hans: 连接状态

# schema.connectionOptions
source: Options for connection
de: Verbindungsoptionen
es: Opciones para la conexión
fr: Options de connexion
it: Opzioni per la connessione
ja: 接続のオプション
ko: 연결 옵션
pt_br: Opções de conexão
zh_hans: 连接选项

# schema.displayName
source: Display Name for the provider
de: Anzeigename für den Anbieter
es: Nombre para mostrar del proveedor
fr: Nom d'affichage du fournisseur
it: Nome visualizzato del provider
ja: プロバイダーの表示名
ko: 공급자의 표시 이름
pt_br: Nome de Exibição do provedor
zh_hans: 提供程序的显示名称

# schema.iconPath
source: Icon path for the server type
de: Symbolpfad für den Servertyp
es: Ruta de acceso al icono para el tipo de servidor
fr: Chemin de l'icône du type de serveur
it: Percorso dell'icona per il tipo di server
ja: サーバーの種類のアイコン パス
ko: 서버 유형의 아이콘 경로
pt_br: Caminho do ícone do tipo de servidor
zh_hans: 服务器类型的图标路径

# schema.isQueryProvider
source: Whether the provider is also a query provider. The default value is true.
de: Gibt an, ob der Anbieter auch ein Abfrageanbieter ist. Der Standardwert ist TRUE.
it: Indica se il provider è anche un provider di query. Il valore predefinito è TRUE.
ja: プロバイダーがクエリ プロバイダーであるかどうか。既定値は true です。
ko: 공급자가 쿼리 공급자에도 해당되는지 여부입니다. 기본값은 true입니다.

# schema.notebookKernelAlias
source: Notebook Kernel Alias for the provider
de: Notebook-Kernelalias für den Anbieter
es: Alias de kernel del cuaderno para el proveedor
fr: Alias du noyau de notebook pour le fournisseur
it: Alias del kernel del notebook per il provider
ja: プロバイダーの Notebook カーネル別名
ko: 공급자의 Notebook 커널 별칭
pt_br: Alias do Kernel do Notebook para o provedor
zh_hans: 提供程序的笔记本内核别名

# schema.providerId
source: Common id for the provider
de: Allgemeine ID für den Anbieter
es: Identificador común para el proveedor
fr: ID courant du fournisseur
it: ID comune del provider
ja: プロバイダーの共通 ID
ko: 공급자의 일반 ID
pt_br: ID comum do provedor
zh_hans: 提供程序的公用 ID

# connectionTreeProvider.schema.id
source: Id for the provider, must be the same as when registering the tree data provider and must start with `connectionDialog/`
de: Die ID für den Anbieter muss mit der ID übereinstimmen, die zur Registrierung des Strukturdatenanbieters verwendet wurde, und mit "connectionDialog/" beginnen.
es: Id. del proveedor; debe ser el mismo que al registrar el proveedor de datos del árbol y debe empezar por "connectionDialog/".
fr: ID du fournisseur, doit être le même que celui utilisé pendant l'inscription du fournisseur de données d'arborescence et doit commencer par « connectionDialog/ »
it: L'ID del provider deve essere lo stesso di quando si registra il provider di dati dell'albero e deve iniziare con 'connectionDialog/'
ja: プロバイダーの ID は、ツリー データ プロバイダーを登録するときと同じである必要があり、'connectionDialog/' で始まる必要があります
ko: 공급자 ID는 트리 데이터 공급자를 등록할 때와 동일해야 하며 'connectionDialog/'로 시작해야 합니다.
pt_br: A ID do provedor precisa ser a mesma usada para registrar o provedor de dados de árvore e precisa começar com `connectionDialog/`
zh_hans: 提供程序的 ID，必须与注册树数据提供程序时的 ID 相同，且必须以 "connectionDialog/" 开头

# connectionTreeProvider.schema.name
source: User visible name for the tree provider
de: Sichtbarer Benutzername für den Strukturanbieter
es: Nombre de usuario visible para el proveedor de árbol
fr: Nom visible de l'utilisateur pour le fournisseur d'arborescence
it: Nome visibile dell'utente per il provider dell'albero
ja: ツリー プロバイダーのユーザー表示名
ko: 트리 공급자의 사용자 표시 이름
pt_br: Nome visível do usuário para o provedor de árvore
zh_hans: 树提供程序的用户可见名称

# azdata.extension.contributes.containers
source: Contributes a single or multiple dashboard containers for users to add to their dashboard.
de: Stellt einen einzelnen oder mehrere Dashboardcontainer zur Verfügung, die Benutzer zu ihrem Dashboard hinzufügen können.
es: Contribuye con uno o varios contenedores de paneles para que los usuarios los agreguen a su propio panel.
fr: Fournit un ou plusieurs conteneurs de tableau de bord que les utilisateurs peuvent ajouter à leur tableau de bord.
it: Aggiunge come contributo uno o più container di dashboard che gli utenti possono aggiungere al proprio dashboard.
ja: 単一または複数のダッシュ ボード コンテナーを提供し、ユーザーが自分のダッシュボードに追加できるようにします。
ko: 사용자가 대시보드 추가할 단일 또는 다중 대시보드 컨테이너를 적용합니다.
pt_br: Contribui com um único ou vários contêineres de painéis para os usuários adicionarem ao painel.
zh_hans: 提供一个或多个仪表板容器，让用户添加其仪表板。

# azdata.extension.contributes.dashboard.container.container
source: The container that will be displayed in the tab.
de: Der Container, der auf der Registerkarte angezeigt wird.
es: El contenedor que se mostrará en la pestaña.
fr: Conteneur à afficher sous l'onglet.
it: Contenitore che verrà visualizzato nella scheda.
ja: タブに表示されるコンテナー。
ko: 탭에 표시될 컨테이너입니다.
pt_br: O contêiner que será exibido na guia.
zh_hans: 将在选项卡中显示的容器。

# azdata.extension.contributes.dashboard.container.id
source: Unique identifier for this container.
de: Eindeutiger Bezeichner für diesen Container.
es: Identificador único para este contenedor.
fr: Identificateur unique de ce conteneur.
it: Identificatore univoco per questo contenitore.
ja: このコンテナーの一意の識別子。
ko: 이 컨테이너의 고유 식별자입니다.
pt_br: Identificador exclusivo para este contêiner.
zh_hans: 此容器的唯一标识符。

# dashboardContainer.contribution.moreThanOneDashboardContainersError
source: Exactly 1 dashboard container must be defined per space.
de: Es muss genau 1 Dashboardcontainer pro Bereich definiert sein.
es: Debe definirse exactamente 1 contenedor de paneles por espacio.
fr: 1 seul conteneur de tableau de bord doit être défini par espace.
it: Per ogni spazio è necessario definire un solo container di dashboard.
ja: 空間ごとにダッシュボード コンテナーを 1 つだけ定義する必要があります。
ko: 공란 1개에 정확히 1개의 대시보드 컨테이너를 정의해야 합니다.
pt_br: Exatamente 1 contêiner de painéis deve ser definido por espaço.
zh_hans: 必须在每个空间定义恰好 1 个仪表板容器。

# dashboardContainer.contribution.noContainerError
source: No container in dashboard container specified for extension.
de: Für die Erweiterung wurde kein Container im Dashboardcontainer angegeben.
es: No se ha especificado ningún contenedor en el contenedor de paneles para la extensión.
fr: Aucun conteneur dans le conteneur de tableau de bord spécifié pour l'extension.
it: Nel container di dashboard non è stato specificato alcun contenitore per l'estensione.
ja: ダッシュボード コンテナーに、拡張用に指定されたコンテナーはありません。
ko: 대시보드 컨테이너에 확장용으로 지정된 컨테이너가 없습니다.
pt_br: Nenhum contêiner no contêiner de painéis especificado para a extensão.
zh_hans: 仪表板容器中未指定用于扩展的容器。

# dashboardContainer.contribution.noIdError
source: No id in dashboard container specified for extension.
de: Im Dashboardcontainer für die Erweiterung wurde keine ID angegeben.
es: No se ha especificado ningún identificador en el contenedor de paneles para la extensión.
fr: Aucun ID de conteneur de tableau de bord spécifié pour l'extension.
it: Nel container di dashboard non è stato specificato alcun ID per l'estensione.
ja: ダッシュボード コンテナーに、拡張用に指定された ID はありません。
ko: 확장용으로 지정된 대시보드 컨테이너에 ID가 없습니다.
pt_br: Nenhuma ID no contêiner de painéis especificada para a extensão.
zh_hans: 仪表板容器中未指定用于扩展的 ID。

# dashboardTab.contribution.unKnownContainerType
source: Unknown container type defines in dashboard container for extension.
de: Im Dashboardcontainer für die Erweiterung wurde ein unbekannter Containertyp definiert.
es: Tipo de contenedor desconocido definido en el contenedor de paneles para la extensión.
fr: Type de conteneur inconnu défini dans le conteneur de tableau de bord pour l'extension.
it: Nel container di dashboard è stato definito un tipo di contenitore sconosciuto per l'estensione.
ja: 拡張用にダッシュボード コンテナーで定義されているコンテナーの種類が不明です。
ko: 확장용 대시보드 컨테이너에 알 수 없는 컨테이너 형식이 정의되었습니다.
pt_br: O tipo de contêiner desconhecido é definido no contêiner de painéis para extensão.
zh_hans: 仪表板容器中为扩展定义了未知的容器类型。

# dashboard.container.controlhost
source: The controlhost that will be displayed in this tab.
de: Der Steuerelementhost, der auf dieser Registerkarte angezeigt wird.
es: El control host que se mostrará en esta pestaña.
fr: Controlhost à afficher sous cet onglet.
it: controlhost che verrà visualizzato in questa scheda.
ja: このタブに表示される controlhost。
ko: 이 탭에 표시할 controlhost입니다.
pt_br: O controlhost que será exibido nesta guia.
zh_hans: 将在此选项卡中显示的 controlhost。

# dashboardNavSection.loadTabError
source: The "{0}" section has invalid content. Please contact extension owner.
de: Der Abschnitt "{0}" umfasst ungültige Inhalte. Kontaktieren Sie den Besitzer der Erweiterung.
es: La sección "{0}" tiene contenido no válido. Póngase en contacto con el propietario de la extensión.
fr: La section "{0}" a un contenu non valide. Contactez le propriétaire de l'extension.
it: Il contenuto della sezione "{0}" non è valido. Contattare il proprietario dell'estensione.
ja: "{0}" セクションに無効なコンテンツがあります。機能拡張の所有者にお問い合わせください。
ko: "{0}" 섹션에 잘못된 내용이 있습니다. 확장 소유자에게 문의하세요.
pt_br: A seção "{0}" tem conteúdo inválido. Entre em contato com o proprietário da extensão.
zh_hans: “{0}”部分具有无效内容。请与扩展所有者联系。

# dashboard.container.gridtab.items
source: The list of widgets or webviews that will be displayed in this tab.
de: Die Liste der Widgets oder Webansichten, die auf dieser Registerkarte angezeigt werden.
es: La lista de widgets o vistas web que se muestran en esta pestaña.
fr: Liste des widgets ou des vues web à afficher sous cet onglet.
it: Elenco dei widget o delle webview che verranno visualizzati in questa scheda.
ja: このタブに表示されるウィジェットまたは Web ビューのリスト。
ko: 이 탭에 표시되는 위젯 또는 웹 보기의 목록입니다.
pt_br: A lista de widgets ou de modos de exibição da Web que serão exibidos nesta guia.
zh_hans: 将在此选项卡中显示的小组件或 Web 视图的列表。

# gridContainer.invalidInputs
source: widgets or webviews are expected inside widgets-container for extension.
de: Widgets oder Webansichten werden im Widgetcontainer für die Erweiterung erwartet.
es: Se esperan widgets o vistas web en el contenedor de widgets para la extensión.
fr: les widgets ou les vues web sont attendus dans un conteneur de widgets pour l'extension.
it: i widget o le webview devono trovarsi nel contenitore dei widget per l'estensione.
ja: ウィジェットや Web ビューが拡張機能用のウィジェット コンテナー内に必要です。
ko: 위젯이나 웹 보기는 확장용 위젯 컨테이너 내부에 있어야 합니다.
pt_br: widgets ou modos de exibição da Web são esperados dentro de contêiner de widgets para a extensão.
zh_hans: 扩展预期小组件容器中存在小组件或 Web 视图。

# dashboard.container.modelview
source: The model-backed view that will be displayed in this tab.
de: Die modellgestützte Ansicht, die auf dieser Registerkarte angezeigt wird.
es: La vista respaldada por el modelo que se visualiza en esta pestaña.
fr: Vue de modèles à afficher sous cet onglet.
it: Visualizzazione basata su modello che verrà visualizzata in questa scheda.
ja: このタブに表示されるモデルに基づくビュー。
ko: 이 탭에 표시할 모델 지원 보기입니다.
pt_br: A visualização com suporte do modelo que será exibida nesta guia.
zh_hans: 将在此选项卡中显示的由模型支持的视图。

# dashboard.container.left-nav-bar
source: The list of dashboard containers that will be displayed in this navigation section.
de: Die Liste der Dashboardcontainer, die in diesem Navigationsabschnitt angezeigt wird.
es: La lista de contenedores de paneles que se mostrará en esta sección de navegación.
fr: Liste des conteneurs de tableau de bord à afficher dans cette section de navigation.
it: Elenco di container di dashboard che verrà visualizzato in questa sezione di spostamento.
ja: このナビゲーション セクションに表示されるダッシュボード コンテナーのリスト。
ko: 이 탐색 섹션에 표시할 대시보드 컨테이너 목록입니다.
pt_br: A lista de contêineres de painéis que será exibida nesta seção de navegação.
zh_hans: 将在此导航部分显示的仪表板容器的列表。

# dashboard.container.left-nav-bar.container
source: The container that will be displayed in this nav section.
de: Der Container, der in diesem Navigationsbereich angezeigt wird.
es: El contenedor que se mostrará en esta sección de navegación.
fr: Conteneur à afficher dans cette section de navigation.
it: Contenitore che verrà visualizzato in questa sezione di spostamento.
ja: このナビゲーション セクションに表示されるコンテナー。
ko: 이 탐색 섹션에 표시할 컨테이너입니다.
pt_br: O contêiner que será exibido nesta seção de navegação.
zh_hans: 将在此导航部分显示的容器。

# dashboard.container.left-nav-bar.icon
source: (Optional) Icon which is used to represent this nav section in the UI. Either a file path or a themeable configuration
de: (Optional) Symbol zur Darstellung dieses Navigationsbereichs in der Benutzeroberfläche. Erfordert einen Dateipfad oder eine Konfiguration, der ein Design zugeordnet werden kann.
es: (opcional) Icono que se utiliza para representar esta sección de navegación en la IU. Una ruta de acceso al archivo o una configuración con temas
fr: (Facultatif) Icône utilisée pour représenter cette section de navigation dans l'interface utilisateur (chemin de fichier ou configuration à thèmes)
it: (Facoltativa) Icona usata per rappresentare la sezione di spostamento nell'interfaccia utente. Percorso di file o configurazione che supporta i temi
ja: (省略可能) UI でこのナビゲーション セクションを表すために使用されるアイコン。ファイル パスまたはテーマを設定可能な構成のいずれかです
ko: (옵션) UI에서 이 탐색 섹션을 나타내는 데 사용되는 아이콘입니다. 파일 경로 또는 테마 지정 가능 구성입니다.
pt_br: (Opcional) Ícone usado para representar essa seção de navegação na interface do usuário. Um caminho de arquivo ou uma configuração com tema
zh_hans: (可选) UI 中用于表示此导航部分的图标。可以是文件路径或可设置主题的配置

# dashboard.container.left-nav-bar.icon.dark
source: Icon path when a dark theme is used
de: Symbolpfad, wenn ein dunkles Design verwendet wird
es: Ruta de icono cuando se usa un tema oscuro
fr: Chemin de l'icône quand un thème foncé est utilisé
it: Percorso dell'icona quando viene usato un tema scuro
ja: 暗いテーマを使用した場合のアイコンのパス
ko: 어두운 테마를 사용하는 경우의 아이콘 경로
pt_br: Caminho de ícone quando um tema escuro é usado
zh_hans: 使用深色主题时的图标路径

# dashboard.container.left-nav-bar.icon.light
source: Icon path when a light theme is used
de: Symbolpfad, wenn ein helles Design verwendet wird
es: Ruta del icono cuando se usa un tema ligero
fr: Chemin de l'icône quand un thème clair est utilisé
it: Percorso dell'icona quando viene usato un tema chiaro
ja: 明るいテーマを使用した場合のアイコンのパス
ko: 밝은 테마를 사용하는 경우의 아이콘 경로
pt_br: Caminho do ícone quando um tema leve é usado
zh_hans: 使用浅色主题时的图标路径

# dashboard.container.left-nav-bar.id
source: Unique identifier for this nav section. Will be passed to the extension for any requests.
de: Eindeutiger Bezeichner für diesen Navigationsbereich. Wird bei allen Anforderungen an die Erweiterung übergeben.
es: Identificador único para esta sección de navegación. Se pasará a la extensión de las solicitudes.
fr: Identificateur unique pour cette section de navigation. Est transmis à l'extension pour toutes les demandes.
it: Identificatore univoco per questa sezione di spostamento. Verrà passato all'estensione per eventuali richieste.
ja: このナビゲーション セクションの一意の識別子。すべての要求で拡張機能に渡されます。
ko: 이 탐색 영역의 고유 식별자입니다. 모든 요청에서 확장으로 전달됩니다.
pt_br: Identificador exclusivo para esta seção de navegação. Será passado para a extensão para quaisquer solicitações.
zh_hans: 此导航部分的唯一标识符。将传递到任何请求的扩展。

# dashboard.container.left-nav-bar.title
source: Title of the nav section to show the user.
de: Der Titel des Navigationsbereichs, der dem Benutzer angezeigt werden soll.
es: Título de la sección de navegación para mostrar al usuario.
fr: Titre de la section de navigation à montrer à l'utilisateur.
it: Titolo della sezione di spostamento da mostrare all'utente.
ja: ユーザーに表示するナビゲーション セクションのタイトル。
ko: 사용자에게 표시할 탐색 섹션의 제목입니다.
pt_br: Título da seção de navegação para mostrar ao usuário.
zh_hans: 要向用户显示的导航部分的标题。

# navSection.invalidContainer.error
source: NAV_SECTION within NAV_SECTION is an invalid container for extension.
de: NAV_SECTION in NAV_SECTION ist ein ungültiger Container für die Erweiterung.
es: NAV_SECTION en NAV_SECTION es un contenedor no válido para la extensión.
fr: NAV_SECTION dans NAV_SECTION est un conteneur non valide pour l'extension.
it: Un elemento NAV_SECTION all'interno di un altro elemento NAV_SECTION non è un contenitore valido per l'estensione.
ja: NAV_SECTION 内の NAV_SECTION は拡張用に無効なコンテナーです。
ko: NAV_SECTION 내의 NAV_SECTION은 확장용으로 유효하지 않은 컨테이너입니다.
pt_br: NAV_SECTION dentro de NAV_SECTION é um contêiner inválido para a extensão.
zh_hans: NAV_SECTION 内的 NAV_SECTION 是一个无效的扩展容器。

# navSection.missingContainer.error
source: No container in nav section specified for extension.
de: Für die Anwendung wurde kein Container im Navigationsbereich angegeben.
es: No hay contenedor en la sección de navegación especificada para la extensión.
fr: Aucun conteneur dans la section de navigation n'a été spécifié pour l'extension.
it: Nella sezione di spostamento non è stato specificato alcun contenitore per l'estensione.
ja: ナビゲーション セクションに、拡張用に指定されたコンテナーはありません。
ko: 탐색 섹션에 확장용으로 지정된 컨테이너가 없습니다.
pt_br: Não foi especificado nenhum contêiner na seção de navegação para a extensão.
zh_hans: 未在导航部分为扩展指定容器。

# navSection.missingTitle.error
source: No title in nav section specified for extension.
de: Für die Erweiterung wurde kein Titel im Navigationsbereich angegeben.
es: No hay título en la sección de navegación especificada para la extensión.
fr: Aucun titre dans la section de navigation n'a été spécifié pour l'extension.
it: Nella sezione di spostamento non è stato specificato alcun titolo per l'estensione.
ja: ナビゲーション セクションに、拡張用に指定されたタイトルはありません。
ko: 탐색 섹션에 확장용으로 지정된 제목이 없습니다.
pt_br: Não foi especificado nenhum título na seção de navegação para a extensão.
zh_hans: 未在导航部分为扩展指定标题。

# navSection.moreThanOneDashboardContainersError
source: Exactly 1 dashboard container must be defined per space.
de: Es muss genau 1 Dashboardcontainer pro Bereich definiert sein.
es: Debe definirse exactamente 1 contenedor de paneles por espacio.
fr: 1 seul conteneur de tableau de bord doit être défini par espace.
it: Per ogni spazio è necessario definire un solo container di dashboard.
ja: 空間ごとにダッシュボード コンテナーを 1 つだけ定義する必要があります。
ko: 공란 1개에 정확히 1개의 대시보드 컨테이너를 정의해야 합니다.
pt_br: Exatamente 1 contêiner de painéis deve ser definido por espaço.
zh_hans: 必须在每个空间定义恰好 1 个仪表板容器。

# dashboard.container.webview
source: The webview that will be displayed in this tab.
de: Die Webansicht, die auf dieser Registerkarte angezeigt wird.
es: La vista web que se mostrará en esta pestaña.
fr: Vue web à afficher sous cet onglet.
it: Webview che verrà visualizzata in questa scheda.
ja: このタブに表示される Web ビュー。
ko: 이 탭에 표시할 웹 보기입니다.
pt_br: O modo de exibição da Web que será exibido nesta guia.
zh_hans: 将在此选项卡中显示的 Web 视图。

# dashboard.container.widgets
source: The list of widgets that will be displayed in this tab.
de: Die Liste der Widgets, die auf dieser Registerkarte angezeigt werden.
es: La lista de widgets que se muestra en esta pestaña.
fr: Liste des widgets à afficher sous cet onglet.
it: Elenco dei widget che verranno visualizzati in questa scheda.
ja: このタブに表示されるウィジェットのリスト。
ko: 이 탭에 표시할 위젯 목록입니다.
pt_br: A lista de widgets que serão exibidos nesta guia.
zh_hans: 将在此选项卡中显示的小组件列表。

# widgetContainer.invalidInputs
source: The list of widgets is expected inside widgets-container for extension.
de: Die Liste der Widgets, die im Widgetcontainer für die Erweiterung erwartet werden.
es: La lista de widgets que se espera dentro del contenedor de widgets para la extensión.
fr: La liste des widgets est attendue à l'intérieur du conteneur de widgets pour l'extension.
it: L'elenco dei widget deve trovarsi all'interno del contenitore dei widget per l'estensione.
ja: 拡張には、ウィジェット コンテナー内にウィジェットのリストが必要です。
ko: 위젯 목록은 확장용 위젯 컨테이너 내에 있어야 합니다.
pt_br: A lista de widgets é esperada dentro de contêiner de widgets para a extensão.
zh_hans: 扩展预期小组件容器中存在控件列表。

# addFeatureAction.openInstalledFeatures
source: Open installed features
de: Installierte Features öffnen
es: Abrir características instaladas
fr: Ouvrir les fonctionnalités installées
it: Apri funzionalità installate
ja: インストールされている機能を開く
ko: 설치된 기능 열기
pt_br: Abrir recursos instalados
zh_hans: 打开已安装的功能

source: Click to pin
de: Zum Anheften klicken
es: Haga clic para anclar
fr: Cliquer pour épingler
it: Fare clic per aggiungere
ja: クリックしてピン留めします
ko: 클릭하여 고정
pt_br: Clique para fixar
zh_hans: 单击以固定

source: Click to unpin
de: Zum Lösen klicken
es: Haga clic para desanclar
fr: Cliquer pour désépingler
it: Fare clic per rimuovere
ja: クリックしてピン留めを外します
ko: 클릭하여 고정 해제
pt_br: Clique para desafixar
zh_hans: 单击以取消固定
