Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# dashboard.properties.serverProperties
source: Properties to show for server page
de: Eigenschaften, die für die Serverseite angezeigt werden sollen
es: Propiedades para mostrar por página de servidor
fr: Propriétés à afficher pour la page de serveur
it: Proprietà da mostrare per la pagina del server
ja: サーバー ページに表示するプロパティ
ko: 표시할 서버 페이지 속성
pt_br: Propriedades a serem exibidas na página do servidor
zh_hans: 服务器页面要显示的属性

# azdata.extension.contributes.dashboardPage.tab.id
source: Unique identifier for this tab. Will be passed to the extension for any requests.
de: Eindeutiger Bezeichner für diese Registerkarte. Wird bei allen Anforderungen an die Erweiterung übergeben.
es: Identificador único para esta pestaña. Se pasará a la extensión para cualquier solicitud.
fr: Identificateur unique pour cet onglet. Est transmis à l'extension pour toutes les demandes.
it: Identificatore univoco per questa scheda. Verrà passato all'estensione per eventuali richieste.
ja: このタブの一意の識別子。すべての要求で拡張機能に渡されます。
ko: 이 탭의 고유 식별자입니다. 모든 요청에서 확장으로 전달됩니다.
pt_br: Identificador exclusivo para esta guia. Será passado para a extensão para quaisquer solicitações.
zh_hans: 此选项卡的唯一标识符。将传递到任何请求的扩展。

# azdata.extension.contributes.widget.hideHeader
source: Whether to hide the header of the widget, default value is false
de: Gibt an, ob die Kopfzeile des Widgets ausgeblendet werden soll. Standardwert: FALSE.
es: Indica se oculta el encabezado del widget; el valor predeterminado es "false".
fr: Indique s'il faut masquer l'en-tête du widget. La valeur par défaut est false
it: Indica se nascondere l'intestazione del widget. Il valore predefinito è false
ja: ウィジェットのヘッダーを非表示にするかどうか。既定値は false です。
ko: 위젯의 헤더를 숨길지 여부를 나타냅니다. 기본값은 false입니다.
pt_br: Opção de ocultar o cabeçalho do widget. O valor padrão é false
zh_hans: 是否隐藏小组件的标题，默认值为 false

# azdata.extension.contributes.widget.when
source: Condition which must be true to show this item
de: Eine Bedingung, die TRUE lauten muss, damit dieses Element angezeigt wird.
es: Condición que se debe cumplir para mostrar este elemento
fr: Condition qui doit être true pour afficher cet élément
it: Condizione che deve essere vera per mostrare questo elemento
ja: この項目を表示するために true にする必要がある条件
ko: 이 항목을 표시하기 위해 true여야 하는 조건
pt_br: A condição deve ser true para mostrar este item
zh_hans: 此条件必须为 true 才能显示此项

# dashboardTabError
source: Extension tab is unknown or not installed.
de: Die Registerkarte "Erweiterung" ist unbekannt oder nicht installiert.
es: La pestaña de extensión es desconocida o no está instalada.
fr: L'onglet d'extension est inconnu ou non installé.
it: La scheda dell'estensione è sconosciuta o non è installata.
ja: 拡張機能タブが不明またはインストールされていません。
ko: 확장 탭을 알 수 없거나 설치하지 않았습니다.
pt_br: A guia Extensão é desconhecida ou não está instalada.
zh_hans: 扩展选项卡未知或未安装。

# dashboardpage.colNumber
source: The column of the component in the grid
de: Die Spalte der Komponente im Raster
es: La columna del componente en la cuadrícula
fr: Colonne du composant dans la grille
it: Colonna del componente nella griglia
ja: グリッド内のコンポーネントの列
ko: 표의 구성 요소 열
pt_br: A coluna do componente na grade
zh_hans: 网格中组件的列

# dashboardpage.colspan
source: The colspan of the component in the grid. Default value is 1. Use '*' to set to number of columns in the grid.
de: Der ColSpan-Wert der Komponente im Raster. Der Standardwert ist 1. Verwenden Sie "*", um die Anzahl von Spalten im Raster festzulegen.
es: El colspan del componente en la cuadrícula. El valor predeterminado es 1. Use "*" para definir el número de columnas en la cuadrícula.
fr: Colspan du composant dans la grille. La valeur par défaut est 1. Utilisez '*' pour le définir sur le nombre de colonnes dans la grille.
it: colspan del componente nella griglia. Il valore predefinito è 1. Usare '*' per impostare sul numero di colonne della griglia.
ja: グリッドのコンポーネントの colspan。既定値は 1 です。グリッドの列数に設定するには '*' を使用します。
ko: 표에 있는 구성 요소의 colspan입니다. 기본값은 1입니다. 표의 열 수로 설정하려면 '*'를 사용합니다.
pt_br: O colspan do component na grade. O valor padrão é 1. Use '*' para definir o número de colunas na grade.
zh_hans: 网格中组件的列跨度。默认值为 1。使用 "*" 设置为网格中的列数。

# dashboardpage.rowNumber
source: The row of the component in the grid
de: Die Zeile der Komponente im Raster
es: La fila del componente en la cuadrícula
fr: Ligne du composant dans la grille
it: Riga del componente nella griglia
ja: グリッド内のコンポーネントの行
ko: 표의 구성 요소 행
pt_br: A linha do componente na grade
zh_hans: 网格中组件的行

# dashboardpage.rowSpan
source: The rowspan of the component in the grid. Default value is 1. Use '*' to set to number of rows in the grid.
de: Die RowSpan-Eigenschaft der Komponente im Raster. Der Standardwert ist 1. Verwenden Sie "*", um die Anzahl von Zeilen im Raster festzulegen.
es: El intervalo de fila del componente en la cuadrícula. El valor predeterminado es 1. Use "*" para establecer el número de filas en la cuadrícula.
fr: Rowspan du composant dans la grille. La valeur par défaut est 1. Utilisez '*' pour le définir sur le nombre de lignes dans la grille.
it: rowspan del componente nella griglia. Il valore predefinito è 1. Usare '*' per impostare sul numero di righe della griglia.
ja: グリッド内のコンポーネントの rowspan。既定値は 1 です。グリッド内の行数に設定するには '*' を使用します。
ko: 표에 있는 구성 요소의 rowspan입니다. 기본값은 1입니다. 표의 행 수로 설정하려면 '*'를 사용합니다.
pt_br: O rowspan do componente na grade. O valor padrão é 1. Use '*' para definir o número de linhas na grade.
zh_hans: 网格中组件的行跨度。默认值为 1。使用 "*" 设置为网格中的行数。

# dashboardpage.tabName
source: The title of the container
de: Der Titel des Containers
es: El título del contenedor
fr: Titre du conteneur
it: Titolo del contenitore
ja: コンテナーのタイトル
ko: 컨테이너의 제목
pt_br: O título do contêiner
zh_hans: 容器的标题

# databasePageName
source: Database Properties
de: Datenbankeigenschaften
es: Propiedades de la base de datos
fr: Propriétés de la base de données
it: Proprietà database
ja: データベースのプロパティ
ko: 데이터베이스 속성
pt_br: Propriedades do Banco de Dados
zh_hans: 数据库属性

source: Compatibility Level
de: Kompatibilitätsgrad
es: Nivel de compatibilidad
fr: Niveau de compatibilité
it: Livello di compatibilità
ja: 互換性レベル
ko: 호환성 수준
pt_br: Nível de Compatibilidade
zh_hans: 兼容级别

# dashboard.databaseproperties
source: Property values to show
de: Anzuzeigende Eigenschaftswerte
es: Valores de la propiedad para mostrar
fr: Valeurs de propriété à afficher
it: Valori di proprietà da mostrare
ja: 表示するプロパティ値
ko: 표시할 속성 값
pt_br: Valores de propriedade para mostrar
zh_hans: 要显示的属性值

# dashboard.databaseproperties.displayName
source: Display name of the property
de: Anzeigename der Eigenschaft
es: Nombre para mostrar de la propiedad
fr: Nom d'affichage de la propriété
it: Nome visualizzato della proprietà
ja: プロパティの表示名
ko: 속성의 표시 이름
pt_br: Nome de exibição da propriedade
zh_hans: 属性的显示名称

# dashboard.databaseproperties.ignore
source: Specify specific values to ignore
de: Spezifische zu ignorierende Werte angeben
es: Especificar valores específicos para ignorar
fr: Spécifiez des valeurs spécifiques à ignorer
it: Specifica i valori da ignorare
ja: 無視する特定の値を指定します
ko: 무시할 특정 값 지정
pt_br: Especificar valores específicos para ignorar
zh_hans: 指定要忽略的特定值

# dashboard.databaseproperties.value
source: Value in the Database Info Object
de: Wert im Objekt mit Datenbankinformationen
es: Valor en el objeto de la información de la base de datos
fr: Valeur de l'objet d'informations de base de données
it: Valore nell'oggetto informazioni database
ja: データベース情報オブジェクトの値
ko: 데이터베이스 정보 개체의 값
pt_br: Valor no objeto de informações do banco de dados
zh_hans: 数据库信息对象中的值

# dashboardDatabase
source: Customizes the database dashboard page
de: Hiermit wird die Dashboardseite für die Datenbank angepasst.
es: Personaliza la página del panel de base de datos
fr: Personnalise la page de tableau de bord de base de données
it: Personalizza la pagina del dashboard del database
ja: データベース ダッシュボード ページをカスタマイズする
ko: 데이터베이스 대시보드 페이지를 사용자 지정합니다.
pt_br: Personaliza a página do painel de banco de dados
zh_hans: 自定义数据库仪表板页面

# dashboardDatabaseProperties
source: Enable or disable the properties widget
de: Eigenschaftswidget aktivieren oder deaktivieren
es: Activar o desactivar el widget de propiedades
fr: Activer ou désactiver le widget de propriétés
it: Abilita o disabilita il widget delle proprietà
ja: プロパティ ウィジェットを有効または無効にする
ko: 속성 위젯 사용 또는 사용 안 함
pt_br: Habilitar ou desabilitar o widget de propriedades
zh_hans: 启用或禁用属性小组件

# dashboardDatabaseTabs
source: Customizes the database dashboard tabs
de: Hiermit werden die Dashboardregisterkarten für die Datenbank angepasst.
es: Personaliza las pestañas de consola de base de datos
fr: Personnalise les onglets de tableau de bord de base de données
it: Personalizza le schede del dashboard del database
ja: データベース ダッシュボード タブをカスタマイズする
ko: 데이터베이스 대시보드 탭을 사용자 지정합니다.
pt_br: Personaliza as guias do painel de banco de dados
zh_hans: 自定义数据库仪表板选项卡

source: Last Database Backup
de: Letzte Datenbanksicherung
es: Última copia de seguridad de la base de datos
fr: Dernière sauvegarde de base de données
it: Ultimo backup del database
ja: 前回のデータベース バックアップ
ko: 마지막 데이터베이스 백업
pt_br: Último Backup de Banco de Dados
zh_hans: 上次数据库备份

source: Last Log Backup
de: Letzte Protokollsicherung
es: Última copia de seguridad de registros
fr: Dernière sauvegarde de journal
it: Ultimo backup del log
ja: 最終ログ バックアップ
ko: 마지막 로그 백업
pt_br: Último Backup de Log
zh_hans: 上次日志备份

# objectsWidgetTitle
source: Search
de: Suchen
es: Búsqueda
fr: Recherche
it: Cerca
ja: 検索
ko: 검색
pt_br: Pesquisar
zh_hans: 搜索

source: Owner
de: Besitzer
es: Propietario
fr: Propriétaire
it: Proprietario
ja: 所有者
ko: 소유자
pt_br: Proprietário
zh_hans: 所有者

source: Recovery Model
de: Wiederherstellungsmodell
es: Modelo de recuperación
fr: Mode de récupération
it: Modello di recupero
ja: 復旧モデル
ko: 복구 모델
pt_br: Modo de Recuperação
zh_hans: 恢复模式

# serverPageName
source: Server Properties
de: Servereigenschaften
es: Propiedades del servidor
fr: Propriétés du serveur
it: Proprietà server
ja: サーバーのプロパティ
ko: 서버 속성
pt_br: Propriedades do Servidor
zh_hans: 服务器属性

source: Computer Name
es: Nombre del equipo
fr: Nom de l'ordinateur
it: Nome del computer
ja: コンピューター名
ko: 컴퓨터 이름
pt_br: Nome do Computador
zh_hans: 计算机名

# dashboard.serverproperties
source: Property values to show
de: Anzuzeigende Eigenschaftswerte
es: Valores de la propiedad para mostrar
fr: Valeurs de propriété à afficher
it: Valori di proprietà da mostrare
ja: 表示するプロパティ値
ko: 표시할 속성 값
pt_br: Valores de propriedade para mostrar
zh_hans: 要显示的属性值

# dashboard.serverproperties.displayName
source: Display name of the property
de: Anzeigename der Eigenschaft
es: Nombre para mostrar de la propiedad
fr: Nom d'affichage de la propriété
it: Nome visualizzato della proprietà
ja: プロパティの表示名
ko: 속성의 표시 이름
pt_br: Nome de exibição da propriedade
zh_hans: 属性的显示名称

# dashboard.serverproperties.value
source: Value in the Server Info Object
de: Wert im Objekt mit Serverinformationen
es: Valor en el objeto de información de servidor
fr: Valeur de l'objet d'informations de serveur
it: Valore nell'oggetto informazioni server
ja: サーバー情報オブジェクトの値
ko: 서버 정보 개체의 값
pt_br: Valor no objeto de informações do servidor
zh_hans: 服务器信息对象中的值

# dashboardServer
source: Customizes the server dashboard page
de: Hiermit wird die Dashboardseite des Servers angepasst.
es: Personaliza la página del panel de servidor
fr: Personnalise la page de tableau de bord de serveur
it: Personalizza la pagina del dashboard del server
ja: サーバー ダッシュ ボード ページをカスタマイズします
ko: 서버 대시보드 페이지를 사용자 지정합니다.
pt_br: Personaliza a página de painel do servidor
zh_hans: 自定义服务器仪表板页面

# dashboardServerProperties
source: Enable or disable the properties widget
de: Eigenschaftswidget aktivieren oder deaktivieren
es: Activar o desactivar el widget de propiedades
fr: Activer ou désactiver le widget de propriétés
it: Abilita o disabilita il widget delle proprietà
ja: プロパティ ウィジェットを有効または無効にする
ko: 속성 위젯 사용 또는 사용 안 함
pt_br: Habilitar ou desabilitar o widget de propriedades
zh_hans: 启用或禁用属性小组件

# dashboardServerTabs
source: Customizes the Server dashboard tabs
de: Hiermit werden die Dashboardregisterkarten des Servers angepasst.
es: Personaliza las pestañas del panel de servidor
fr: Personnalise les onglets de tableau de bord de serveur
it: Personalizza le schede del dashboard del server
ja: サーバー ダッシュボードのタブをカスタマイズします
ko: 서버 대시보드 탭을 사용자 지정합니다.
pt_br: Personaliza as guias de painel do servidor
zh_hans: 自定义服务器仪表板选项卡

source: Edition
es: Edición
fr: Édition
it: Edizione
ja: エディション
ko: 버전
pt_br: Edição
zh_hans: 版本

# explorerWidgetsTitle
source: Search
de: Suchen
es: Búsqueda
fr: Recherche
it: Cerca
ja: 検索
ko: 검색
pt_br: Pesquisar
zh_hans: 搜索

source: OS Version
de: Betriebssystemversion
es: Versión del sistema operativo
fr: Version de système d'exploitation
it: Versione del sistema operativo
ja: OS バージョン
ko: OS 버전
pt_br: Versão do Sistema Operacional
zh_hans: OS 版本

source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pt_br: Versão
zh_hans: 版本

# homeCrumb
source: Home
de: Start
es: Inicio
fr: Accueil
it: Home page
ja: ホーム
ko: 홈
pt_br: Página Inicial
zh_hans: 主页

# dashboard.changeDatabaseFailure
source: Failed to change database
de: Fehler beim Ändern der Datenbank.
es: No se pudo cambiar la base de datos
fr: Le changement de base de données a échoué
it: Non è stato possibile modificare il database
ja: データベースを変更できませんでした
ko: 데이터베이스를 변경하지 못함
pt_br: Falha ao alterar o banco de dados
zh_hans: 未能更改数据库

# dashboard.explorer.actions
source: Show Actions
de: Aktionen anzeigen
es: Mostrar acciones
fr: Afficher les actions
it: Mostra azioni
ja: アクションの表示
ko: 작업 표시
pt_br: Mostrar Ações
zh_hans: 显示操作

# dashboard.explorer.actionsColumn
source: Actions
de: Aktionen
es: Acciones
it: Azioni
ja: アクション
ko: 작업
pt_br: Ações
zh_hans: 操作

# explorerSearchMatchResultMessage
source: Filtered search list to {0} items
de: Die Suchliste wurde auf {0} Elemente gefiltert.
es: La lista de la búsqueda se ha filtrado en {0} elementos.
fr: Liste de recherche filtrée sur {0} éléments
it: Elenco di ricerca filtrato per {0} elementi
ja: 検索一覧が {0} 項目にフィルター処理されました
ko: 검색 목록을 {0}개 항목으로 필터링함
pt_br: Lista de pesquisa filtrada para {0} itens
zh_hans: 已将搜索列表筛选为 {0} 个项

# explorerSearchNoMatchResultMessage
source: No matching item found
de: Kein übereinstimmendes Element gefunden
es: No se encontraron elementos coincidentes
fr: Aucun élément correspondant n'a été trouvé
it: Non sono stati trovati elementi corrispondenti
ja: 一致する項目が見つかりませんでした
ko: 일치하는 항목 없음
pt_br: Não foi encontrado nenhum item correspondente
zh_hans: 未找到匹配项

# explorerSearchSingleMatchResultMessage
source: Filtered search list to 1 item
de: Die Suchliste wurde auf 1 Element gefiltert.
es: La lista de la búsqueda se ha filtrado en un elemento.
fr: Liste de recherche filtrée sur 1 élément
it: Elenco di ricerca filtrato per 1 elemento
ja: 検索一覧が 1 項目にフィルター処理されました
ko: 검색 목록을 1개 항목으로 필터링함
pt_br: Lista de pesquisa filtrada para um item
zh_hans: 已将搜索列表筛选为 1 个项

# dashboard.explorer.namePropertyDisplayValue
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称

# dashboard.explorer.objectTypeDisplayValue
source: Type
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pt_br: Tipo
zh_hans: 类型

# dashboard.explorer.schemaDisplayValue
source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
ko: 스키마
pt_br: Esquema
zh_hans: 架构

# dashboard.explorer.databaseError
source: Unable to load databases
de: Datenbanken können nicht geladen werden.
es: No se pueden cargar las bases de datos
fr: Impossible de charger les bases de données
it: Non è possibile caricare i database
ja: データベースを読み込めません
ko: 데이터베이스를 로드할 수 없습니다.
pt_br: Não é possível carregar bancos de dados
zh_hans: 无法加载数据库

# dashboard.explorer.objectError
source: Unable to load objects
de: Objekte können nicht geladen werden.
es: No se pueden cargar objetos
fr: Impossible de charger les objets
it: Non è possibile caricare gli oggetti
ja: オブジェクトを読み込めません
ko: 개체를 로드할 수 없습니다.
pt_br: Não é possível carregar objetos
zh_hans: 无法加载对象

source: loading databases
de: Datenbanken werden geladen.
es: Carga de las bases de datos en curso
fr: chargement des bases de données
it: caricamento database
ja: データベースを読み込んでいます
ko: 데이터베이스 로드
pt_br: carregando bancos de dados
zh_hans: 正在加载数据库

source: loading databases completed.
de: Datenbanken wurden vollständig geladen.
es: La carga de las bases de datos se ha completado.
fr: les bases de données ont été chargées.
it: caricamento database completato.
ja: データベースの読み込みが完了しました。
ko: 데이터베이스 로드가 완료되었습니다.
pt_br: carregamento dos bancos de dados concluído.
zh_hans: 数据库加载已完成。

source: loading objects
de: Objekte werden geladen.
es: Cargando de los objetos en curso
fr: chargement des objets
it: caricamento oggetti
ja: オブジェクトを読み込んでいます
ko: 개체 로드
pt_br: carregando objetos
zh_hans: 正在加载对象

source: loading objects completed.
de: Objekte wurden vollständig geladen.
es: La carga de los objetos se ha completado.
fr: les objets ont été chargés.
it: caricamento oggetti completato.
ja: オブジェクトの読み込みが完了しました。
ko: 개체 로드가 완료되었습니다.
pt_br: carregamento de objetos concluído.
zh_hans: 对象加载已完成。

# seachObjects
source: Search by name of type (t:, v:, f:, or sp:)
de: Suche nach Namen des Typs (t:, v:, f: oder sp:)
es: Buscar por nombre de tipo (t:, v:, f: o sp:)
fr: Rechercher par nom de type (t:, v:, f:, ou sp:)
it: Ricerca per nome di tipo (t:, v:, f: o sp:)
ja: 型の名前で検索する (t:、v:、f:、sp:)
ko: 형식 이름(t:, v:, f: 또는 sp:)으로 검색
pt_br: Pesquisar pelo nome do tipo (t:, v:, f: ou sp:)
zh_hans: 按类型名称搜索(t:、v:、f: 或 sp:)

source: Search databases
de: Datenbanken suchen
es: Buscar en las bases de datos
fr: Rechercher dans les bases de données
it: Cerca nei database
ja: 検索データベース
ko: 데이터베이스 검색
pt_br: Pesquisar bancos de dados
zh_hans: 搜索数据库

# insights.runQuery
source: Run Query
de: Abfrage ausführen
es: Ejecutar consulta
fr: Exécuter la requête
it: Esegui query
ja: クエリの実行
ko: 쿼리 실행
pt_br: Executar Consulta
zh_hans: 运行查询

# insights.autoRefreshOffState
source: Auto Refresh: OFF
de: Automatische Aktualisierung: AUS
es: Actualización automática: DESACTIVADA
fr: Actualisation automatique : désactivée
it: Aggiornamento automatico: disattivato
ja: 自動更新: オフ
ko: 자동 새로 고침: 꺼짐
pt_br: Atualização Automática: DESATIVADA
zh_hans: 自动刷新: 关

# insights.lastUpdated
source: Last Updated: {0} {1}
de: Letzte Aktualisierung: {0} {1}
es: Última actualización: {0} {1}
fr: Dernière mise à jour : {0} {1}
it: Ultimo aggiornamento: {0} {1}
ja: 最終更新日: {0} {1}
ko: 최종 업데이트: {0} {1}
pt_br: Ultima Atualização: {0} {1}
zh_hans: 上次更新时间: {0} {1}

# insightsWidgetLoadingCompletedMessage
source: Loading {0} completed
de: "{0}" vollständig geladen.
es: Carga de {0} completada
fr: {0} a été chargé
it: Caricamento di {0} completato
ja: {0} の読み込みが完了しました
ko: {0} 로드 완료
pt_br: Carregamento de {0} concluído
zh_hans: {0} 加载已完成

# insightsWidgetLoadingMessage
source: Loading {0}
de: "{0}" wird geladen.
es: Carga de {0} en curso
fr: Chargement de {0}
it: Caricamento di {0}
ja: {0} を読み込んでいます
ko: {0} 로드
pt_br: Carregando {0}
zh_hans: 正在加载 {0}

# noResults
source: No results to show
de: Keine Ergebnisse zur Anzeige vorhanden.
es: No hay resultados para mostrar
fr: Aucun résultat à afficher
it: Non ci sono risultati da visualizzare
ja: 表示する結果がありません。
ko: 표시할 결과 없음
pt_br: Nenhum resultado para mostrar
zh_hans: 没有可显示的结果

# actionDatabaseDescription
source: Target database for the action; can use the format '${ columnName }' to use a data driven column name.
de: Zieldatenbank für die Aktion. Kann das Format "${ columnName }" verwenden, um einen datengesteuerten Spaltennamen zu nutzen.
es: Base de datos de destino para la acción; puede usar el formato "${ columnName }" para usar un nombre de columna controlado por datos.
fr: Base de données cible de l'action. Peut être au format '${ columnName }' pour utiliser un nom de colonne piloté par les données.
it: Database di destinazione per l'azione. È possibile usare il formato '${columnName}' per specificare un nome di colonna basata sui dati.
ja: アクションのターゲット データベース。形式 '${ columnName }' を使用して、データ ドリブン列名を使用できます。
ko: 작업의 대상 데이터베이스입니다. '${ columnName }' 형식을 사용하여 데이터 기반 열 이름을 사용할 수 있습니다.
pt_br: Banco de dados de destino da ação. É possível usar o formato '${ columnName }' para usar um nome de coluna controlado por dados.
zh_hans: 操作的目标数据库；可使用格式 "${ columnName }" 以便由数据确定列名。

# actionServerDescription
source: Target server for the action; can use the format '${ columnName }' to use a data driven column name.
de: Zielserver für die Aktion. Kann das Format "${ columnName }" verwenden, um einen datengesteuerten Spaltennamen zu nutzen.
es: Servidor de destino para la acción; puede usar el formato "${ columnName }" para usar un nombre de columna controlado por datos.
fr: Serveur cible de l'action. Peut être au format '${ columnName }' pour utiliser un nom de colonne piloté par les données.
it: Server di destinazione per l'azione. È possibile usare il formato '${columnName}' per specificare un nome di colonna basata sui dati.
ja: アクションのターゲット サーバー。形式 '${ columnName }' を使用して、データ ドリブン列名を使用できます。
ko: 작업의 대상 서버입니다. '${ columnName }' 형식을 사용하여 데이터 기반 열 이름을 사용할 수 있습니다.
pt_br: O servidor de destino da ação. É possível usar o formato '${ columnName }' para usar um nome de coluna controlado por dados.
zh_hans: 操作的目标服务器；可使用格式 "${ columnName }" 以便由数据确定列名。

# actionTypes
source: Which actions to use
de: Zu verwendende Aktionen
es: Acciones para utilizar
fr: Actions à utiliser
it: Indica le azioni da usare
ja: 使用するアクション
ko: 사용할 작업
pt_br: Quais ações usar
zh_hans: 要使用的操作

# actionUserDescription
source: Target user for the action; can use the format '${ columnName }' to use a data driven column name.
de: Zielbenutzer für die Aktion. Kann das Format "${ columnName }" verwenden, um einen datengesteuerten Spaltennamen zu nutzen.
es: Usuario de destino para la acción; puede usar el formato "${ columnName }" para usar un nombre de columna controlado por datos.
fr: Utilisateur cible de l'action. Peut être au format '${ columnName } pour utiliser un nom de colonne piloté par les données.
it: Utente di destinazione per l'azione. È possibile usare il formato '${columnName}' per specificare un nome di colonna basata sui dati.
ja: アクションのターゲット ユーザー。形式 '${ columnName }' を使用して、データ ドリブン列名を使用できます。
ko: 작업의 대상 사용자입니다. '${ columnName }' 형식을 사용하여 데이터 기반 열 이름을 사용할 수 있습니다.
pt_br: O usuário de destino para a ação. É possível usar o formato '${ columnName }' para usar um nome de coluna controlado por dados.
zh_hans: 操作的目标用户；可使用格式 "${ columnName }" 以便由数据确定列名。

# carbon.extension.contributes.insightType.id
source: Identifier of the insight
de: Bezeichner für Erkenntnisse
es: Identificador de la información
fr: Identificateur de l'insight
it: Identificatore dei dati analitici
ja: 分析情報の識別子
ko: 인사이트의 식별자
pt_br: Identificador do insight
zh_hans: 见解的标识符

# carbon.extension.contributes.insights
source: Contributes insights to the dashboard palette.
de: Stellt Erkenntnisse in der Dashboardpalette zur Verfügung.
es: Aporta conocimientos a la paleta del panel.
fr: Ajoute des insights à la palette de tableau de bord.
it: Aggiunge come contributo i dati analitici al pannello del dashboard.
ja: ダッシュボード パレットに分析情報を提供します。
ko: 대시보드 팔레트에 인사이트를 적용합니다.
pt_br: Contribui com insights para a paleta do painel.
zh_hans: 向仪表板提供见解。
