Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# insightAutoRefreshIntervalDescription
source: [Optional] Auto refresh interval in minutes, if not set, there will be no auto refresh
de: [Optional] Intervall für die automatische Aktualisierung in Minuten. Ist kein Wert festgelegt, wird keine automatische Aktualisierung durchgeführt.
es: [Opcional] Intervalo de actualización automática en minutos, si no se establece, no habrá actualización automática
fr: [Facultatif] Intervalle d'actualisation automatique en minutes, si la valeur n'est pas définie, il n'y a pas d'actualisation automatique
it: [Facoltativa] Intervallo di aggiornamento automatico in minuti. Se non è impostato, non verrà eseguito alcun aggiornamento automatico
ja: [省略可能] 分単位の自動更新間隔。設定しないと、自動更新されません
ko: [옵션] 자동 새로 고침 간격(분)입니다. 설정하지 않으면 자동 새로 고침이 수행되지 않습니다.
pt_br: [Opcional] Intervalo de atualização automática em minutos, se não estiver definido, não haverá atualização automática
zh_hans: [可选] 自动刷新间隔(分钟数)；如果未设置，则不自动刷新

# insightIdDescription
source: Unique Identifier used for caching the results of the insight.
de: Eindeutiger Bezeichner, der zum Zwischenspeichern der Erkenntnisergebnisse verwendet wird
es: Identificador único utilizado para almacenar en caché los resultados de la información.
fr: Identificateur unique utilisé pour mettre en cache les résultats de l'insight.
it: Identificatore univoco usato per memorizzare nella cache i risultati dei dati analitici.
ja: 分析情報の結果をキャッシュするために使用される一意識別子。
ko: 인사이트의 결과를 캐싱하는 데 사용되는 고유 식별자입니다.
pt_br: Identificador Exclusivo usado para armazenar em cache os resultados do insight.
zh_hans: 用于缓存见解结果的唯一标识符。

# insightQueryDescription
source: SQL query to run. This should return exactly 1 resultset.
de: Auszuführende SQL-Abfrage. Es sollte genau 1 Resultset zurückgegeben werden.
es: Consulta SQL para ejecutar. Esto debería devolver exactamente un conjunto de resultados.
fr: Requête SQL à exécuter. Doit retourner exactement 1 jeu de résultat.
it: Query SQL da eseguire. Dovrebbe restituire esattamente un solo set di risultati.
ja: 実行する SQL クエリ。返す結果セットは 1 つのみでなければなりません。
ko: 실행할 SQL 쿼리입니다. 정확히 1개의 결과 집합을 반환해야 합니다.
pt_br: Consulta SQL para executar. Isso deve retornar exatamente 1 resultset.
zh_hans: 要运行的 SQL 查询。将返回恰好 1 个结果集。

# insightQueryFileDescription
source: [Optional] path to a file that contains a query. Use if 'query' is not set
de: [Optional] Pfad zu einer Datei, die eine Abfrage enthält. Verwenden Sie diese Einstellung, wenn "query" nicht festgelegt ist.
es: [Opcional] Ruta de acceso a un archivo que contiene una consulta. Utilícelo si "query" no está establecido
fr: [Facultatif] Chemin d'un fichier contenant une requête. Utilisez-le si 'query' n'est pas défini.
it: [Facoltativa] Percorso di un file contenente una query. Usare se 'query' non è impostato
ja: [省略可能] クエリを含むファイルへのパス。'クエリ' が設定されていない場合に使用します
ko: [옵션] 쿼리를 포함하는 파일의 경로입니다. '쿼리'를 설정하지 않은 경우에 사용합니다.
pt_br: [Opcional] caminho para um arquivo que contém uma consulta. Use se a 'query' não for definida
zh_hans: [可选] 包含查询的文件的路径。未设置“查询”时使用

# insightWidgetDescription
source: Adds a widget that can query a server or database and display the results in multiple ways - as a chart, summarized count, and more
de: Fügt ein Widget hinzu, das einen Server oder eine Datenbank abfragen und die Ergebnisse in unterschiedlicher Form anzeigen kann – als Diagramm, summierte Anzahl und mehr.
es: Añade un widget que puede consultar un servidor o base de datos y mostrar los resultados de múltiples maneras, como un gráfico o una cuenta de resumen, entre otras.
fr: Ajoute un widget qui peut interroger un serveur ou une base de données, et afficher les résultats de plusieurs façons (par exemple, dans un graphique, sous forme de nombre total, etc.)
it: Aggiunge un widget in grado di eseguire una query su un server o un database e di visualizzare i risultati in vari modi, ovvero sotto forma di grafico, conteggio riepilogativo e altro ancora
ja: ウィジェットを追加します。そこでは、サーバーまたはデータベースのクエリを実行して、その結果をグラフや集計されたカウントなどの複数の方法で表示できます
ko: 서버 또는 데이터베이스를 쿼리하고 여러 방법(차트, 요약 개수 등)으로 결과를 표시할 수 있는 위젯을 추가합니다.
pt_br: Adiciona um widget que pode consultar um servidor ou banco de dados e exibir os resultados de várias maneiras – como um gráfico, uma contagem resumida e muito mais
zh_hans: 添加一个可以查询服务器或数据库并以多种方式(如图表、总数等)显示结果的小组件。

# chartErrorMessage
source: Chart cannot be displayed with the given data
de: Das Diagramm kann mit den angegebenen Daten nicht angezeigt werden.
es: No se puede mostrar el gráfico con los datos proporcionados
fr: Le graphique ne peut pas être affiché avec les données spécifiées
it: Non è possibile visualizzare il grafico con i dati specificati
ja: 指定されたデータでグラフを表示できません
ko: 제공한 데이터로 차트를 표시할 수 없습니다.
pt_br: O gráfico não pode ser exibido com os dados fornecidos
zh_hans: 无法用给定的数据显示图表

# chartInsightDescription
source: Displays results of a query as a chart on the dashboard
de: Zeigt die Ergebnisse einer Abfrage als Diagramm im Dashboard an.
es: Muestra los resultados de una consulta como un gráfico en el panel de información
fr: Affiche les résultats d'une requête dans un graphique sur le tableau de bord
it: Visualizza i risultati di una query sotto forma di grafico nel dashboard
ja: ダッシュボード上のグラフとしてクエリの結果を表示します
ko: 쿼리 결과를 대시보드에 차트로 표시합니다.
pt_br: Exibe os resultados de uma consulta como um gráfico no painel
zh_hans: 将查询结果显示为仪表板上的图表

# colorMapDescription
source: Maps 'column name' -> color. for example add 'column1': red to ensure this column uses a red color
de: Ordnet den Spaltennamen einer Farbe zu. Fügen Sie z. B. "'column1': red" hinzu, damit in dieser Spalte die Farbe Rot verwendet wird.
es: Asigne "nombre de columna" -> color. Por ejemplo, agregue "column1": red para asegurarse de que esta utilice un color rojo
fr: Mappe 'nom de colonne' -> couleur. Par exemple, ajouter 'colonne1': rouge pour que la colonne utilise la couleur rouge
it: Esegue il mapping di 'nome colonna' al colore. Ad esempio, aggiungere 'column1': red se si vuole usare il colore rosso per questa colonna
ja: '列名' -> 色をマップします。たとえば、「'column1': red」を追加して、この列で赤色が使用されるようにします
ko: '열 이름'을 색에 매핑합니다. 예를 들어, 이 열에 빨간색을 사용하려면 'column1': red를 추가합니다.
pt_br: Mapeia 'nome de coluna' -> cor. Por exemplo, adicione 'column1': red para garantir que essa coluna use uma cor vermelha
zh_hans: 映射“列名称”->“颜色”。例如，添加 'column1': red 以确保此列使用红色

# columnsAsLabels
source: If dataDirection is vertical, setting this to true will use the columns names for the legend.
de: Wenn "dataDirection" auf "vertical" festgelegt ist, werden für die Legende die Spaltennamen verwendet.
es: Si dataDirection es vertical, al configurarlo como verdadero se utilizarán los nombres de columna para la leyenda.
fr: Si la valeur de dataDirection est verticale, la définition de ce paramètre sur true utilise les noms de colonnes pour la légende.
it: Se dataDirection è impostato su vertical e si imposta questa opzione su true, per la legenda vengono usati i nomi delle colonne.
ja: dataDirection が縦の場合、true に設定すると凡例に列名が使用されます。
ko: dataDirection이 vertical인 경우, 이 값을 true로 설정하면 범례의 열 이름을 사용합니다.
pt_br: Se dataDirection for vertical, definir como true usará os nomes das colunas para a legenda.
zh_hans: 如果 dataDirection 为 vertical，则将其设置为 true 将使用列名称作为图例。

# dataDirectionDescription
source: Defines whether the data is read from a column (vertical) or a row (horizontal). For time series this is ignored as direction must be vertical.
de: Legt fest, ob die Daten aus einer Spalte (vertikal) oder eine Zeile (horizontal) gelesen werden. Für Zeitreihen wird diese Einstellung ignoriert, da die Richtung vertikal sein muss.
es: Define si los datos se leen desde una columna (vertical) o una fila (horizontal). Para series de tiempo esto se omite, ya que la dirección debe ser vertical.
fr: Définit si les données sont lues dans une colonne (vertical) ou une ligne (horizontal). Pour les séries chronologiques, ce paramètre est ignoré, car la direction doit être verticale.
it: Definisce se i dati vengono letti da una colonna (vertical) o da una riga (horizontal). Per la serie temporale questa impostazione viene ignorata perché la direzione deve essere verticale.
ja: データを列 (縦) 方向から、または行 (横) 方向から読み取るかを定義します。時系列の場合、方向は縦にする必要があるため、これは無視されます。
ko: 데이터를 열(세로)에서 읽어올지 행(가로)에서 읽어올지를 정의합니다. 시계열에서는 방향이 세로여야 하므로 무시됩니다.
pt_br: Define se os dados são lidos de uma coluna (vertical) ou uma linha (horizontal). Para séries temporais, isso é ignorado, pois a direção deve ser vertical.
zh_hans: 定义是从列(垂直)还是从行(水平)读取数据。对于时序，将忽略此设置，因为方向必须为垂直。

# labelFirstColumnDescription
source: If dataDirection is horizontal, setting this to true uses the first columns value for the legend.
de: Wenn "dataDirection" auf "horizontal" festgelegt ist, werden die Werte aus der ersten Spalten als Legende verwendet.
es: Si dataDirection es horizontal, al establecerlo como verdadero se utilizarán los valores de las primeras columnas para la leyenda.
fr: Si la valeur de dataDirection est horizontale, la définition de ce paramètre sur true utilise la valeur des premières colonnes pour la légende.
it: Se dataDirection è impostato su horizontal e si imposta questa opzione su true, per la legenda viene usato il primo valore di ogni colonna.
ja: dataDirection が横の場合、true に設定すると凡例に最初の列値が使用されます。
ko: dataDirection이 horizontal인 경우, 이 값을 true로 설정하면 범례의 첫 번째 열 값을 사용합니다.
pt_br: Se dataDirection for horizontal, definir como true usará o valor das primeiras colunas para a legenda.
zh_hans: 如果 dataDirection 为 horizontal，则将其设置为 true 将使用第一列的值作为图例。

# legendDescription
source: Indicates preferred position and visibility of the chart legend. These are the column names from your query, and map to the label of each chart entry
de: Hiermit wird die bevorzugte Position und Sichtbarkeit der Diagrammlegende angegeben. Darin werden die Spaltennamen aus der Abfrage der Bezeichnung der einzelnen Diagrammeinträge zugeordnet.
es: Indica la posición y visibilidad preferidas de la leyenda del gráfico. Estos son los nombres de columna de la consulta y se asignan a la etiqueta de cada entrada de gráfico
fr: Indique la position par défaut et la visibilité de la légende de graphique. Il s'agit des noms des colonnes de votre requête mappés à l'étiquette de chaque entrée du graphique
it: Indica la posizione preferita e la visibilità della legenda del grafico. Questi sono i nomi di colonna estratti dalla query e associati all'etichetta di ogni voce del grafico
ja: グラフの凡例の優先される位置と表示範囲を示します。これはクエリに基づく列名で、各グラフ項目のラベルにマップされます
ko: 차트 범례의 기본 위치 및 표시 여부를 나타냅니다. 이 항목은 쿼리의 열 이름이며, 각 차트 항목의 레이블에 매핑됩니다.
pt_br: Indica a posição preferida e a visibilidade da legenda do gráfico. Esses são os nomes das colunas da sua consulta e mapeados para o rótulo de cada entrada do gráfico
zh_hans: 表示图表图例的首选位置和可见性。这些是查询中的列名称，并映射到每个图表条目的标签

# showTopNData
source: If showTopNData is set, showing only top N data in the chart.
de: Wenn "showTopNData" festgelegt ist, werden nur die ersten n Daten im Diagramm angezeigt.
es: Si se establece showTopNData, se mostrarán solo los primeros N datos en la tabla.
fr: Si showTopNData est défini, seules les N premières données sont affichées dans le graphique.
it: Se è impostato showTopNData, vengono visualizzati solo i primi N dati del grafico.
ja: showTopNData を設定すると、上位 N 個のデータのみがグラフに表示されます。
ko: showTopNData를 설정한 경우 차트에 상위 N개 데이터만 표시합니다.
pt_br: Se showTopNData for definido, mostre somente os dados top N no gráfico.
zh_hans: 如果设置了 showTopNData，则只在图表中显示前 N 个数据。

# barchart.xAxisLabel
source: Label for the x axis
de: Bezeichnung für die X-Achse
es: Etiqueta para el eje x
fr: Étiquette de l'axe X
it: Etichetta per l'asse X
ja: X 軸のラベル
ko: X축 레이블
pt_br: Rótulo para o eixo x
zh_hans: x 轴的标签

# barchart.yAxisLabel
source: Label for the y axis
de: Bezeichnung für die Y-Achse
es: Etiqueta para el eje y
fr: Étiquette de l'axe Y
it: Etichetta per l'asse Y
ja: Y 軸のラベル
ko: Y축 레이블
pt_br: Rótulo para o eixo y
zh_hans: y 轴的标签

# xAxisMax
source: Maximum value of the x axis
de: Maximalwert der X-Achse
es: Valor máximo del eje x
fr: Valeur maximale de l'axe X
it: Valore massimo dell'asse X
ja: X 軸の最大値
ko: X축 최댓값
pt_br: Valor máximo do eixo x
zh_hans: x 轴的最大值

# xAxisMin
source: Minimum value of the x axis
de: Minimalwert der X-Achse
es: Valor mínimo del eje x
fr: Valeur minimale de l'axe X
it: Valore minimo dell'asse X
ja: X 軸の最小値
ko: X축 최솟값
pt_br: Valor mínimo do eixo x
zh_hans: x 轴的最小值

# yAxisMax
source: Maximum value of the y axis
de: Maximalwert der Y-Achse
es: Valor máximo del eje y
fr: Valeur maximale de l'axe Y
it: Valore massimo dell'asse Y
ja: Y 軸の最大値
ko: Y축 최댓값
pt_br: Valor máximo do eixo y
zh_hans: y 轴的最大值

# yAxisMin
source: Minimum value of the y axis
de: Minimalwert der Y-Achse
es: Valor mínimo del eje y
fr: Valeur minimale de l'axe Y
it: Valore minimo dell'asse Y
ja: Y 軸の最小値
ko: Y축 최솟값
pt_br: Valor mínimo do eixo y
zh_hans: Y 轴的最小值

# dataTypeDescription
source: Indicates data property of a data set for a chart.
de: Zeigt die Dateneigenschaft eines Datensatzes für ein Diagramm an.
es: Indica la propiedad de datos de un conjunto de datos para un gráfico.
fr: Indique la propriété de données d'un jeu de données pour un graphique.
it: Indica la proprietà dati di un set di dati per un grafico.
ja: グラフのデータ セットのデータ プロパティを示します。
ko: 차트 데이터 세트의 데이터 속성을 나타냅니다.
pt_br: Indica a propriedade de dados de um conjunto de dados para um gráfico.
zh_hans: 指示图表数据集的数据属性。

# countInsightDescription
source: For each column in a resultset, displays the value in row 0 as a count followed by the column name. Supports '1 Healthy', '3 Unhealthy' for example, where 'Healthy' is the column name and 1 is the value in row 1 cell 1
de: Zeigt für jede Spalte in einem Resultset den Wert in Zeile 0 als Zählwert gefolgt vom Spaltennamen an. Unterstützt beispielsweise "1 Healthy" oder "3 Unhealthy", wobei "Healthy" dem Spaltennamen und 1 dem Wert in Zeile 1/Zelle 1 entspricht.
es: Para cada columna de un conjunto de resultados, muestra el valor de la fila 0 como un recuento seguido del nombre de la columna. Admite "1 Healthy", "3 Unhealthy", por ejemplo, donde "Healthy" es el nombre de la columna y 1 es el valor de la fila 1, celda 1
fr: Pour chaque colonne d'un jeu de résultats, affiche la valeur de la ligne 0 sous forme de chiffre suivi du nom de la colonne. Prend en charge '1 Healthy', '3 Unhealthy', par exemple, où 'Healthy' est le nom de la colonne et 1 est la valeur de la ligne 1, cellule 1
it: Per ogni colonna in un set di risultati mostra il valore nella riga 0 sotto forma di numero seguito dal nome della colonna. Ad esempio '1 Attivi', '3 Disabilitati', dove 'Attivi' è il nome della colonna e 1 è il valore presente a riga 1 cella 1
ja: 結果セットの各列について、行 0 の値をカウントとして表示し、その後に列名が続きます。たとえば、'1 正常'、'3 異常' をサポートします。ここで、'正常' は列名、1 は行 1 セル 1 の値です。
ko: 결과 세트의 각 열에 대해 행 0의 값을 개수와 열 이름으로 표시합니다. 예를 들어, '1 Healthy', '3 Unhealthy'가 지원됩니다. 여기서 'Healthy'는 열 이름이고 1은 행 1, 셀 1의 값입니다.
pt_br: Para cada coluna em um conjunto de resultados, exibe o valor na linha 0 como uma contagem seguida pelo nome da coluna. Dá suporte para '1 Íntegro', '3 Não Íntegro', por exemplo, em que 'Íntegro' é o nome da coluna e 1 é o valor na célula 1 da linha 1
zh_hans: 对于结果集中的每一列，将行 0 中的值显示为计数后跟列名称。例如支持“1 正常”、“3 不正常”，其中“正常”是列名称，1 表示第 1 行单元格 1 中的值

# encodingDescription
source: Is this encoded as hex, base64 or some other format?
de: Erfolgt eine Codierung im Hexadezimal-, Base64- oder einem anderen Format?
es: ¿Está codificado como hexadecimal, base64 o algún otro formato?
fr: Cet objet est-il encodé en hexadécimal, base64 ou un autre format ?
it: Indica se viene codificato come hex, base64 o in un altro formato.
ja: これは 16 進数、base64 または、他の形式でエンコードされていますか？
ko: 16진수, base64 또는 다른 형식으로 인코딩되어 있나요?
pt_br: É codificado como hexa, base64 ou algum outro formato?
zh_hans: 这是以十六进制、base64 还是其他格式进行编码的?

# imageFormatDescription
source: What format is expected - is this a JPEG, PNG or other format?
de: Welches Format wird erwartet – JPEG, PNG oder ein anderes Format?
es: ¿Qué formato se espera: es un archivo JPEG, PNG u otro formato?
fr: Format attendu : JPEG, PNG ou un autre format ?
it: Indica se il formato previsto è JPEG, PNG o di altro tipo.
ja: 必要な形式は何ですか。JPEG、PNG、またはその他の形式ですか?
ko: 어떤 형식이 필요한가요? JPEG, PNG 또는 다른 형식인가요?
pt_br: Qual é o formato esperado – É um JPEG, PNG ou outro formato?
zh_hans: 期望的格式 - 是 JPEG、PNG 还是其他格式?

# imageInsightDescription
source: Displays an image, for example one returned by an R query using ggplot2
de: Zeigt ein Bild an, beispielsweise ein Bild, das durch eine R-Abfrage unter Verwendung von ggplot2 zurückgegeben wurde.
es: Muestra una imagen, por ejemplo uno devuelta por una consulta R con ggplot2
fr: Affiche une image, par exemple, celle retournée par une requête de type R utilisant ggplot2
it: Visualizza un'immagine, ad esempio una restituita da una query R che usa ggplot2
ja: イメージを表示します。例: ggplot2 を使用して R クエリによって返されたイメージ
ko: 이미지(예: ggplot2를 사용하여 R 쿼리에서 반환한 이미지)를 표시합니다.
pt_br: Exibe uma imagem, por exemplo, um retornado por uma consulta R usando o ggplot2
zh_hans: 显示图像，例如由 R 查询使用 ggplot2 返回的图像

# tableInsightDescription
source: Displays the results in a simple table
de: Stellt die Ergebnisse in einer einfachen Tabelle dar.
es: Muestra los resultados en una tabla simple
fr: Affiche les résultats dans un tableau simple
it: Visualizza i risultati in una tabella semplice
ja: 単純なテーブルに結果を表示する
ko: 단순 테이블에 결과를 표시합니다.
pt_br: Exibe os resultados em uma tabela simples
zh_hans: 在简单表中显示结果

# dashboard.properties.error
source: Unable to load dashboard properties
de: Die Dashboardeigenschaften können nicht geladen werden.
es: No se pueden cargar las propiedades del panel
fr: Impossible de charger les propriétés de tableau de bord
it: Non è possibile caricare le proprietà del dashboard
ja: ダッシュボードのプロパティを読み込めません
ko: 대시보드 속성을 로드할 수 없습니다.
pt_br: Não é possível carregar as propriedades do painel
zh_hans: 无法加载仪表板属性

source: Loading properties
de: Eigenschaften werden geladen.
es: Carga de las propiedades en curso
fr: Chargement des propriétés
it: Caricamento delle proprietà
ja: プロパティを読み込んでいます...
ko: 속성 로드
pt_br: Carregando as propriedades
zh_hans: 正在加载属性

source: Loading properties completed
de: Eigenschaften wurden vollständig geladen.
es: La carga de las propiedades se ha completado.
fr: Les propriétés ont été chargées
it: Caricamento delle proprietà completato
ja: プロパティの読み込みが完了しました
ko: 속성 로드 완료
pt_br: Carregamento de propriedades concluído
zh_hans: 属性加载已完成

# connectionsSortOrder.dateAdded
source: Saved connections are sorted by the dates they were added.
de: Gespeicherte Verbindungen werden nach dem Datum sortiert, an dem sie hinzugefügt wurden.
es: Las conexiones guardadas se ordenan por las fechas en que se agregaron.
fr: Les connexions enregistrées sont triées en fonction des dates auxquelles elles ont été ajoutées.
it: Le connessioni salvate vengono ordinate in base alle date aggiunte.
ja: 保存された接続は、追加された日付順に並べ替えられます。
ko: 저장된 연결은 추가된 날짜를 기준으로 정렬됩니다.
pt_br: As conexões salvas são classificadas pelas datas em que foram adicionadas.
zh_hans: 保存的连接按添加的日期排序。

# connectionsSortOrder.displayName
source: Saved connections are sorted by their display names alphabetically.
de: Gespeicherte Verbindungen werden alphabetisch nach ihren Anzeigenamen sortiert.
es: Las conexiones guardadas se ordenan alfabéticamente por sus nombres para mostrar.
fr: Les connexions enregistrées sont triées par ordre alphabétique de leurs noms d’affichage.
it: Le connessioni salvate vengono ordinate in base ai rispettivi nomi visualizzati in ordine alfabetico.
ja: 保存された接続は、表示名のアルファベット順に並べ替えられます。
ko: 저장된 연결은 표시 이름을 기준으로 사전순으로 정렬됩니다.
pt_br: As conexões salvas são classificadas por seus nomes de exibição alfabeticamente.
zh_hans: 保存的连接按其显示名称按字母顺序排序。

source: Database Connections
de: Datenbankverbindungen
es: Conexiones de base de datos
fr: Connexions de base de données
it: Connessioni di database
ja: データベース接続
ko: 데이터베이스 연결
pt_br: Conexões de Banco de Dados
zh_hans: 数据库连接

# datasource.connectionGroups
source: data source groups
de: Datenquellengruppen
es: grupos de origen de datos
fr: groupes de source de données
it: gruppi di origine dati
ja: データソース グループ
ko: 데이터 원본 그룹
pt_br: grupos de fonte de dados
zh_hans: 数据源组

source: data source connections
de: Datenquellenverbindungen
es: Conexiones de fuentes de datos
fr: connexions de source de données
it: connessioni a origine dati
ja: データ ソース接続
ko: 데이터 원본 연결
pt_br: conexões de fonte de dados
zh_hans: 数据源连接

# datasource.connectionsSortOrder
source: Controls sorting order of saved connections and connection groups.
de: Steuert die Sortierreihenfolge gespeicherter Verbindungen und Verbindungsgruppen.
es: Controla el criterio de ordenación de las conexiones guardadas y los grupos de conexiones.
fr: Contrôle l’ordre de tri des connexions et des groupes de connexions enregistrés.
it: Controllare l'ordinamento delle connessioni salvate e dei gruppi di connessioni.
ja: 保存された接続と接続グループの並べ替え順序を制御します。
ko: 저장된 연결 및 연결 그룹의 정렬 순서를 제어합니다.
pt_br: Controla a ordem de classificação das conexões e dos grupos de conexão salvos.
zh_hans: 控制已保存连接和连接组的排序顺序。

# startup.alwaysShowServersView
source: True for the Servers view to be shown on launch of Azure Data Studio default; false if the last opened view should be shown
de: Bei Festlegung auf TRUE wird beim Start von Azure Data Studio standardmäßig die Serveransicht angezeigt. Bei Festlegung auf FALSE wird die zuletzt geöffnete Ansicht angezeigt.
es: True para que la vista de servidores aparezca en la apertura predeterminada de Azure Data Studio; false si quiere aparezca la última vista abierta
fr: True pour afficher la vue des serveurs au lancement d'Azure Data Studio par défaut, false pour afficher la dernière vue ouverte
it: È true se all'avvio di Azure Data Studio deve essere visualizzata la visualizzazione Server (impostazione predefinita); è false se deve essere visualizzata l'ultima visualizzazione aperta
ja: Azure Data Studio の起動時にサーバー ビューを表示する場合には true (既定)。最後に開いたビューを表示する場合には false
ko: Azure Data Studio 시작 시 서버 보기를 표시하려면 True(기본값), 마지막으로 열었던 보기를 표시하려면 False
pt_br: True para a exibição Servidores a ser mostrada na inicialização do padrão do Azure Data Studio; false se a última visualização aberta deve ser mostrada
zh_hans: 如果要在 Azure Data Studio 启动时默认显示“服务器”视图，则为 true；如果应显示上次打开的视图，则为 false

# startupConfig
source: Startup Configuration
de: Startkonfiguration
es: Configuración de inicio
fr: Configuration de démarrage
it: Configurazione di avvio
ja: 起動の構成
ko: 시작 구성
pt_br: Configuração de Inicialização
zh_hans: 启动配置

# dataExplorer.contributed
source: Contributes views to contributed views container
de: Stellt Sichten für den Container mit bereitgestellten Sichten zur Verfügung.
es: Contribuye vistas al contenedor de vistas aportadas
fr: Ajoute des vues au conteneur de vues ajoutées
it: Aggiunge come contributo le visualizzazioni al contenitore delle visualizzazioni aggiunto come contributo
ja: コントリビューション ビュー コンテナーにビューを提供します
ko: 뷰를 적용된 뷰 컨테이너에 적용합니다.
pt_br: Contribui com exibições para o contêiner de exibições contribuídas
zh_hans: 向“提供的视图”容器提供视图

# duplicateView1
source: Cannot register multiple views with same id `{0}` in the view container `{1}`
de: Es können nicht mehrere Sichten mit derselben ID ({0}) im Container "{1}" mit Sichten registriert werden.
es: No pueden registrar múltiples vistas con el mismo identificador "{0}" en el contenedor de vistas "{1}"
fr: Impossible d'inscrire plusieurs vues avec le même ID '{0}' dans le conteneur de vues '{1}'
it: Non è possibile registrare più visualizzazioni con stesso ID `{0}` nel contenitore di visualizzazioni `{1}`
ja: ビュー コンテナー '{1}'に同じ ID '{0}' のビューを複数登録できません
ko: 뷰 컨테이너 '{1}'에서 동일한 ID '{0}'의 여러 뷰를 등록할 수 없습니다.
pt_br: Não é possível registrar vários modos de exibição com a mesma id '{0}' no contêiner de exibição '{1}'
zh_hans: 无法在视图容器“{1}”中注册多个具有相同 ID (“{0}”) 的视图
