Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# queryEditor.results.saveAsCsv.includeHeaders
source: When true, column headers are included when saving results as CSV
de: Bei Festlegung auf TRUE werden beim Speichern der Ergebnisse als CSV auch die Spaltenüberschriften einbezogen.
es: Si es "true", los encabezados de columna se incluirán al guardar los resultados como CSV.
fr: Quand la valeur est true, les en-têtes de colonne sont inclus dans l'enregistrement des résultats au format CSV
it: Se è impostata su true, le intestazioni di colonna vengono incluse quando si salvano i risultati in formato CSV
ja: true の場合、CSV として結果を保存する際に列ヘッダーが組み込まれます
ko: true이면 결과를 CSV로 저장할 때 열 머리글이 포함됩니다.
pt_br: Quando true, os cabeçalhos de coluna são incluídos ao salvar os resultados como CSV
zh_hans: 为 true 时，将在将结果保存为 CSV 时包含列标题

# queryEditor.results.saveAsCsv.lineSeperator
source: Character(s) used for seperating rows when saving results as CSV
de: Zeichen für die Trennung von Zeilen, das beim Speichern der Ergebnisse als CSV verwendet wird
es: Caracteres que se usan para separar las filas al guardar los resultados como CSV.
fr: Caractère(s) utilisé(s) pour séparer les lignes pendant l'enregistrement des résultats au format CSV
it: Caratteri usati per delimitare le righe quando si salvano i risultati in formato CSV
ja: 結果を CSV として保存するときに行を区切るために使用する文字
ko: 결과를 CSV로 저장할 때 행을 분리하는 데 사용하는 문자
pt_br: Os caracteres usados para separar linhas ao salvar os resultados como CSV
zh_hans: 将结果保存为 CSV 时用于分隔行的字符

# queryEditor.results.saveAsCsv.textIdentifier
source: Character used for enclosing text fields when saving results as CSV
de: Zeichen für das Umschließen von Textfeldern, das beim Speichern der Ergebnisse als CSV verwendet wird
es: Carácter que se usa para delimitar los campos de texto al guardar los resultados como CSV.
fr: Caractère utilisé pour englober les champs de texte pendant l'enregistrement des résultats au format CSV
it: Carattere usato per racchiudere i campi di testo quando si salvano i risultati in formato CSV
ja: 結果を CSV として保存するときにテキスト フィールドを囲むために使用する文字
ko: 결과를 CSV로 저장할 때 텍스트 필드를 묶는 데 사용하는 문자
pt_br: O caractere usado para delimitar os campos de texto ao salvar os resultados como CSV
zh_hans: 将结果保存为 CSV 时用于封装文本字段的字符

# queryEditor.results.saveAsXml.encoding
source: File encoding used when saving results as XML
de: Beim Speichern der Ergebnisse im XML-Format verwendete Dateicodierung
es: Codificación de archivo empleada al guardar los resultados como XML
fr: Encodage de fichier utilisé pendant l'enregistrement des résultats au format XML
it: Codifica di file usata quando si salvano i risultati in formato XML
ja: 結果を XML として保存するときに使用されるファイル エンコード
ko: 결과를 XML로 저장할 때 사용되는 파일 인코딩
pt_br: Codificação de arquivo usada ao salvar os resultados como XML
zh_hans: 将结果保存为 XML 时使用的文件编码

# queryEditor.results.saveAsXml.formatted
source: When true, XML output will be formatted when saving results as XML
de: Bei Festlegung auf TRUE wird die XML-Ausgabe formatiert, wenn die Ergebnisse im XML-Format gespeichert werden.
es: Si es "true", se dará formato a la salida XML al guardar los resultados como XML.
fr: Quand la valeur est true, la sortie XML est mise en forme pendant l'enregistrement des résultats au format XML
it: Quando è true, l'output XML verrà formattato quando si salvano i risultati in formato XML
ja: true の場合、XML として結果を保存すると XML 出力がフォーマットされます
ko: true이면 결과를 XML로 저장할 때 XML 출력에 형식이 지정됩니다.
pt_br: Quando true, a saída XML será formatada ao salvar resultados como XML
zh_hans: 为 true 时，将在将结果保存为 XML 时设置 XML 输出的格式

# queryEditor.results.streaming
source: Enable results streaming; contains few minor visual issues
de: Hiermit wird das Streamen der Ergebnisse aktiviert. Diese Option weist einige geringfügige Darstellungsprobleme auf.
es: Permitir streaming de resultados; contiene algunos defectos visuales menores
fr: Activer le streaming des résultats, contient quelques problèmes visuels mineurs
it: Abilita lo streaming dei risultati. Contiene alcuni problemi minori relativi a oggetti visivi
ja: 結果のストリーミングを有効にします。視覚上の小さな問題がいくつかあります
ko: 결과 스트리밍을 사용하도록 설정합니다. 몇 가지 사소한 시각적 문제가 있습니다.
pt_br: Habilitar streaming de resultados; contém alguns problemas visuais menores
zh_hans: 启用结果流式处理；包含极少轻微的可视化问题

# queryEditor.showConnectionInfoInTitle
source: Controls whether to show the connection info for a tab in the title.
de: Legt fest, ob die Verbindungsinformationen für eine Registerkarte im Titel angezeigt werden.
es: Controla si se muestra la información de conexión para una pestaña en el título.
fr: Contrôle s'il faut montrer les informations de connexion d'un onglet dans le titre.
it: Controlla se visualizzare le informazioni sulla connessione per una scheda nel titolo.
ja: タイトルにタブの接続情報を表示するかを制御します。
ko: 제목에 있는 탭에 연결 정보를 표시할지 여부를 제어합니다.
pt_br: Controla se deseja mostrar a informação de conexão para uma guia no título.
zh_hans: 控制是否显示标题中选项卡的连接信息。

# queryEditor.tabColorMode
source: Controls how to color tabs based on the server group of their active connection
de: Steuert die Farbe von Registerkarten basierend auf der Servergruppe der aktiven Verbindung.
es: Controla cómo colorear las pestañas basadas en el grupo de servidores de la conexión activa
fr: Contrôle comment colorer les onglets en fonction du groupe de serveurs de leur connexion active
it: Controlla come colorare le schede in base al gruppo di server della connessione attiva
ja: アクティブな接続のサーバー グループに基づいてタブに色を付ける方法を制御します
ko: 활성 연결의 서버 그룹을 기준으로 탭 색상 지정 방법을 제어합니다.
pt_br: Controla como colorir as guias com base no grupo de servidores de sua conexão ativa
zh_hans: 控制如何根据活动连接的服务器组为选项卡着色

# queryEditor.tabColorMode.border
source: The top border of each editor tab will be colored to match the relevant server group
de: Der obere Rand der einzelnen Editor-Registerkarten wird entsprechend der jeweiligen Servergruppe eingefärbt.
es: El borde superior de cada pestaña del editor se coloreará para que coincida con el grupo de servidores correspondiente
fr: La bordure supérieure de chaque onglet de l'éditeur est colorée pour correspondre au groupe de serveurs concerné
it: Al bordo superiore di ogni scheda verrà applicato il colore del gruppo di server pertinente
ja: 各エディター タブの上部境界線は、関連するサーバー グループと同じ色になります
ko: 각 편집기 탭의 상단 테두리는 관련 서버 그룹과 일치하도록 칠해집니다.
pt_br: A borda superior de cada guia do editor será colorida para combinar com o grupo de servidores relevante
zh_hans: 每个编辑器选项卡的上边框颜色将与相关服务器组匹配

# queryEditor.tabColorMode.fill
source: Each editor tab's background color will match the relevant server group
de: Die Hintergrundfarbe der Editor-Registerkarten entspricht der jeweiligen Servergruppe.
es: El color de fondo de la pestaña del editor coincidirá con el grupo de servidores pertinente
fr: La couleur d'arrière-plan de chaque onglet de l'éditeur correspond au groupe de serveurs concerné
it: Il colore di sfondo di ogni scheda dell'editor sarà uguale a quello del gruppo di server pertinente
ja: 各エディター タブの背景色は、関連するサーバー グループと同じになります
ko: 각 편집기 탭의 배경색이 관련 서버 그룹과 일치합니다.
pt_br: A cor de fundo de cada editor da guia corresponderá ao grupo de servidores relevante
zh_hans: 每个编辑器选项卡的背景色将与相关服务器组匹配

# queryEditor.tabColorMode.off
source: Tab coloring will be disabled
de: Das Einfärben von Registerkarten wird deaktiviert.
es: Se deshabilitará el coloreado de las pestañas
fr: La coloration des onglets est désactivée
it: La colorazione delle schede verrà disabilitata
ja: タブの色指定は無効になります
ko: 탭 색 지정이 사용하지 않도록 설정됩니다.
pt_br: A coloração da guia será desabilitada
zh_hans: 将禁用选项卡着色

# queryEditorConfigurationTitle
source: Query Editor
de: Abfrage-Editor
es: Editor de Power Query
fr: Éditeur de requêtes
it: Editor di query
ja: クエリ エディター
ko: 쿼리 편집기
pt_br: Editor de Consultas
zh_hans: 查询编辑器

# queryResultsEditor.name
source: Query Results
de: Abfrageergebnisse
es: Resultados de consultas
fr: Résultats de la requête
it: Risultati query
ja: クエリ結果
ko: 쿼리 결과
pt_br: Resultados da Consulta
zh_hans: 查询结果

# queryShortcutDescription
source: Set keybinding workbench.action.query.shortcut{0} to run the shortcut text as a procedure call or query execution. Any selected text in the query editor will be passed as a parameter at the end of your query, or you can reference it with {arg}
de: Legen Sie "workbench.action.query.shortcut{0}" für die Tastenzuordnung fest, um den Verknüpfungstext als Prozeduraufruf oder Abfrageausführung auszuführen. Der ausgewählte Text im Abfrage-Editor wird am Ende der Abfrage als Parameter übergeben, oder Sie können mit "{arg}" darauf verweisen.
es: Establezca keybinding workbench.action.query.shortcut{0} para ejecutar el texto del acceso directo como una llamada de procedimiento o en la ejecución de una consulta. Cualquier texto seleccionado en el editor de consultas se pasará como un parámetro al final de la consulta, o bien puede hacer referencia a él con {arg}
fr: Définissez la combinaison de touches workbench.action.query.shortcut{0} pour exécuter le texte du raccourci en tant qu’appel de procédure ou exécution de la requête. Tout texte sélectionné dans l’éditeur de requête est passé en tant que paramètre à la fin de votre requête, ou vous pouvez le référencer avec {arg}
it: Impostare l'associazione dei tasti workbench.action.query.shortcut{0} per eseguire il testo del collegamento come chiamata di routine o esecuzione di query. Il testo selezionato nell'editor di query verrà passato come parametro alla fine della query oppure è possibile fare riferimento a esso con {arg}
ja: ショートカット テキストをプロシージャ呼び出しまたはクエリ実行として実行するにはキー バインド workbench.action.query.shortcut{0} を設定します。クエリ エディターで選択したテキストはクエリの末尾でパラメーターとして渡されます。または、これを {arg} で参照することができます。
ko: keybinding workbench.action.query.shortcut{0}를 설정하여 프로시저 호출 또는 쿼리 실행으로 바로 가기 텍스트를 실행합니다. 쿼리 편집기에서 선택한 모든 텍스트는 쿼리 끝에 매개 변수로 전달되거나 {arg}로 참조할 수 있습니다.
pt_br: Defina o atalho workbench.action.query.shortcut{0} para executar o texto de atalho como uma chamada de procedimento ou execução de consulta. Qualquer texto selecionado no editor de consultas será passado como um parâmetro no final da consulta ou você pode fazer referência a ele com {arg}
zh_hans: 设置键绑定 workbench.action.query.shortcut{0}，将快捷方式文本作为过程调用或查询执行运行。查询编辑器中的选中的文本将在查询结尾处作为参数进行传递，也可以使用 {arg} 加以引用

# actualQueryPlan
source: Actual
de: Tatsächlich
es: Real
fr: Réel
it: Effettivo
ja: 実際
ko: 실제
pt_br: Real
zh_hans: 实际

# cancelQueryLabel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# changeConnectionDatabaseLabel
source: Change Connection
de: Verbindung ändern
es: Cambiar conexión
fr: Changer la connexion
it: Cambia connessione
ja: 接続の変更
ko: 연결 변경
pt_br: Alterar Conexão
zh_hans: 更改连接

# changeDatabase.failed
source: Failed to change database
de: Fehler beim Ändern der Datenbank.
es: No se pudo cambiar la base de datos
fr: Le changement de base de données a échoué
it: Non è stato possibile modificare il database
ja: データベースを変更できませんでした
ko: 데이터베이스를 변경하지 못함
pt_br: Falha ao alterar o banco de dados
zh_hans: 未能更改数据库

# changeDatabase.failedWithError
source: Failed to change database: {0}
de: Fehler beim Ändern der Datenbank: {0}
es: No se ha podido cambiar de base de datos: {0}
fr: Le changement de la base de données {0} a échoué
it: Non è stato possibile modificare il database: {0}
ja: データベースを変更できませんでした: {0}
ko: 데이터베이스 {0}을(를) 변경하지 못함
pt_br: Falha ao alterar o banco de dados: {0}
zh_hans: 未能更改数据库: {0}

# connectDatabaseLabel
source: Connect
de: Verbinden
es: Conectar
fr: Connecter
it: Connetti
ja: 接続
ko: 연결
pt_br: Conectar
zh_hans: 连接

# disablesqlcmdLabel
source: Disable SQLCMD
de: SQLCMD deaktivieren
es: Desactivar SQLCMD
fr: Désactiver SQLCMD
it: Disabilita SQLCMD
ja: SQLCMD を無効にする
ko: SQLCMD 사용 안 함
pt_br: Desabilitar SQLCMD
zh_hans: 禁用 SQLCMD

# disconnectDatabaseLabel
source: Disconnect
de: Trennen
es: Desconectar
fr: Déconnecter
it: Disconnetti
ja: 切断
ko: 연결 끊기
pt_br: Desconectar
zh_hans: 断开连接

# enablesqlcmdLabel
source: Enable SQLCMD
de: SQLCMD aktivieren
es: Habilitar SQLCMD
fr: Activer SQLCMD
it: Abilita SQLCMD
ja: SQLCMD を有効にする
ko: SQLCMD 사용
pt_br: Habilitar SQLCMD
zh_hans: 启用 SQLCMD

# estimatedQueryPlan
source: Explain
de: Erklärung
es: Explicar
fr: Expliquer
it: Spiega
ja: 説明
ko: 설명
pt_br: Explicar
zh_hans: 解释

# newQueryTask.newQuery
source: New Query
de: Neue Abfrage
es: Nueva consulta
fr: Nouvelle requête
it: Nuova query
ja: 新しいクエリ
ko: 새 쿼리
pt_br: Nova Consulta
zh_hans: 新建查询

# queryEditor.exportSqlAsNotebook
source: Export as Notebook
de: Als Notebook exportieren
es: Exportación como cuaderno
fr: Exporter au format Notebook
it: Esporta come notebook
ja: ノートブックとしてエクスポート
ko: Notebook으로 내보내기
pt_br: Exportar o Notebook
zh_hans: 导出为笔记本

# runQueryLabel
source: Run
de: Ausführen
es: Ejecutar
fr: Exécuter
it: Esegui
ja: 実行
ko: 실행
pt_br: Executar
zh_hans: 运行

source: Select Database
de: Datenbank auswählen
es: Seleccionar la base de datos
fr: Sélectionner une base de données
it: Seleziona database
ja: データベースの選択
ko: 데이터베이스 선택
pt_br: Selecionar Banco de Dados
zh_hans: 选择数据库

# queryEditor.name
source: Query Editor
de: Abfrage-Editor
es: Editor de consultas
fr: Éditeur de requêtes
it: Editor di query
ja: クエリ エディター
ko: 쿼리 편집기
pt_br: Editor de Consultas
zh_hans: 查询编辑器

# messagesTabTitle
source: Messages
de: Meldungen
es: Mensajes
it: Messaggi
ja: メッセージ
ko: 메시지
pt_br: Mensagens
zh_hans: 消息

# queryResults.queryEditorCrashError
source: The query editor ran into an issue and has stopped working. Please save and reopen it.
de: Der Abfrage-Editor hat ein Problem festgestellt und funktioniert nicht mehr. Speichern Sie und öffnen Sie ihn erneut.
it: L'editor di query ha riscontrato un problema e ha smesso di funzionare. Salvare e riaprire.
ja: クエリ エディターで問題が発生し、動作を停止しました。保存してからもう一度開いてください。
ko: 쿼리 편집기에 문제가 발생하여 작동이 중지되었습니다. 저장하고 다시 여세요.

# resultsTabTitle
source: Results
de: Ergebnisse
es: Resultados
fr: Résultats
it: Risultati
ja: 結果
ko: 결과
pt_br: Resultados
zh_hans: 结果

# query.status.executing
source: Executing query...
de: Abfrage wird ausgeführt...
es: Ejecutando consulta...
fr: Exécution de la requête...
it: Esecuzione della query...
ja: クエリを実行しています...
ko: 쿼리를 실행하는 중...
pt_br: Executando consulta...
zh_hans: 正在执行查询…

# rowCount
source: {0} rows
de: {0} Zeilen
es: {0} filas
fr: {0} lignes
it: {0} righe
ja: {0} 行
ko: {0}개의 행
pt_br: {0} linhas
zh_hans: {0} 行

# status.query.rowCount
source: Row Count
de: Zeilenanzahl
es: Recuento de filas
fr: Nombre de lignes
it: Numero di righe
ja: 行数
ko: 행 개수
pt_br: Contagem de Linhas
zh_hans: 行数

# status.query.selection-summary
source: Selection Summary
de: Zusammenfassung der Auswahl
es: Resumen de la selección
fr: Récapitulatif de la sélection
it: Riepilogo selezioni
ja: 選択の要約
ko: 선택 요약
pt_br: Resumo da Seleção
zh_hans: 选择摘要

# status.query.status
source: Execution Status
de: Ausführungsstatus
es: Estado de ejecución
fr: État d'exécution
it: Stato esecuzione
ja: 実行状態
ko: 실행 상태
pt_br: Status de Execução
zh_hans: 执行状态

# status.query.summaryText
source: Average: {0} Count: {1} Sum: {2}
de: Durchschnitt: {0}, Anzahl: {1}, Summe: {2}
es: Promedio: {0}; recuento: {1}; suma: {2}
fr: Moyenne : {0}, nombre : {1}, somme : {2}
it: Media: {0} Conteggio: {1} Somma: {2}
ja: 平均: {0} 数: {1} 合計: {2}
ko: 평균: {0} 개수: {1} 합계: {2}
pt_br: Média: {0} Contagem: {1} Soma: {2}
zh_hans: 平均值: {0} 计数: {1} 总和: {2}

# status.query.timeElapsed
source: Time Elapsed
de: Verstrichene Zeit
es: Tiempo transcurrido
fr: Temps écoulé
it: Tempo trascorso
ja: 経過時間
ko: 경과 시간
pt_br: Tempo Decorrido
zh_hans: 已用时间

# autoSizeColumns
source: Auto size the columns width on inital results. Could have performance problems with large number of columns or large cells
de: Hiermit wird die Spaltenbreite der ersten Ergebnisse automatisch angepasst. Diese Einstellung kann bei einer großen Anzahl von Spalten oder großen Zellen zu Leistungsproblemen führen.
es: Redimensione automáticamente el ancho de las columnas en los resultados iniciales. Podría tener problemas de rendimiento si hay muchas columnas o las celdas son grandes.
fr: Dimensionnez automatiquement la largeur de colonne en fonction des résultats initiaux. Problèmes de performance possibles avec les grands nombres de colonnes ou les grandes cellules
it: Ridimensiona automaticamente la larghezza delle colonne sui risultati iniziali. Potrebbero verificarsi problemi di prestazioni con un numero elevato di colonne o celle di grandi dimensioni
ja: 最初の結果について、列の幅を自動サイズ設定します。多数の列がある場合や、大きいセルがある場合、パフォーマンスの問題が発生する可能性があります
ko: 초기 결과의 열 너비를 자동으로 조정합니다. 열 개수가 많거나 셀이 크면 성능 문제가 발생할 수 있습니다.
pt_br: Dimensionar automaticamente a largura de colunas nos resultados iniciais. Pode haver problemas de desempenho com um grande número de colunas ou com células grandes
zh_hans: 自动调整初始结果的列宽。如果存在大量的列或大型单元格，可能出现性能问题

# cellPadding
source: Controls the cell padding in pixels
de: Legt den Zellenabstand in Pixeln fest.
es: Controla el relleno de la celda en píxeles
fr: Contrôle l'espacement des cellules en pixels
it: Controlla la spaziatura interna celle in pixel
ja: セルの埋め込みをピクセル単位で制御します
ko: 셀 안쪽 여백(픽셀)을 제어합니다.
pt_br: Controla o preenchimento em pixels da célula
zh_hans: 控制单元格边距(像素)

# fontFamily
source: Controls the font family.
de: Steuert die Schriftfamilie.
es: Controla la familia de fuentes.
fr: Contrôle la famille de polices.
it: Controlla la famiglia di caratteri.
ja: フォント ファミリを制御します。
ko: 글꼴 패밀리를 제어합니다.
pt_br: Controla a família de fontes.
zh_hans: 控制字体系列。

# fontSize
source: Controls the font size in pixels.
de: Legt die Schriftgröße in Pixeln fest.
es: Controla el tamaño de fuente en píxeles.
fr: Contrôle la taille de police en pixels.
it: Controlla le dimensioni del carattere in pixel.
ja: フォント サイズ (ピクセル単位) を制御します。
ko: 글꼴 크기(픽셀)를 제어합니다.
pt_br: Controla o tamanho da fonte em pixels.
zh_hans: 控制字体大小(像素)。

# fontWeight
source: Controls the font weight.
de: Steuert die Schriftbreite.
es: Controla el grosor de la fuente.
fr: Contrôle l'épaisseur de police.
it: Controlla lo spessore del carattere.
ja: フォントの太さを制御します。
ko: 글꼴 두께를 제어합니다.
pt_br: Controla a espessura da fonte.
zh_hans: 控制字体粗细。

# letterSpacing
source: Controls the letter spacing in pixels.
de: Legt den Abstand der Buchstaben in Pixeln fest.
es: Controla el espacio entre letras en píxeles.
fr: Contrôle l'espacement des lettres en pixels.
it: Controlla la spaziatura tra le lettere in pixel.
ja: 文字間隔 (ピクセル単位) を制御します。
ko: 문자 간격(픽셀)을 제어합니다.
pt_br: Controla o espaçamento de letras em pixels.
zh_hans: 控制字母间距(像素)。

# maxColumnWidth
source: The maximum width in pixels for auto-sized columns
de: Die maximale Breite in Pixeln für Spalten mit automatischer Größe
es: El máximo ancho en píxeles de las columnas de tamaño automático
fr: Largeur maximale en pixels des colonnes dimensionnées automatiquement
it: Larghezza massima in pixel per colonne con ridimensionamento automatico
ja: 自動サイズ設定される列の最大幅 (ピクセル単位)
ko: 자동으로 크기가 조정되는 열의 최대 너비(픽셀)
pt_br: A largura máxima em pixels para colunas dimensionadas automaticamente
zh_hans: 自动调整大小的列的最大宽度(像素)

# resultsGridConfigurationTitle
source: Results Grid and Messages
de: Ergebnisraster und Meldungen
es: Cuadrícula y mensajes de resultados
fr: Grille de résultats et messages
it: Messaggi e griglia dei risultati
ja: 結果グリッドとメッセージ
ko: 결과 표 및 메시지
pt_br: Grade de Resultados e Mensagens
zh_hans: 结果网格和消息

# rowHeight
source: Controls the row height in pixels
de: Legt die Zeilenhöhe in Pixeln fest.
es: Controla la altura de la fila en píxeles
fr: Contrôle la hauteur de ligne en pixels
it: Controlla l'altezza delle righe in pixel
ja: ピクセル単位で行の高さを制御する
ko: 행 높이(픽셀)를 제어합니다.
pt_br: Controla a altura da linha em pixels
zh_hans: 控制行高(像素)

# queryHistory.clearLabel
source: Clear All History
de: Gesamten Verlauf löschen
es: Borrar todo el historial
fr: Effacer tout l'historique
it: Cancella tutta la cronologia
ja: すべての履歴をクリア
ko: 모든 기록 지우기
pt_br: Limpar Todo o Histórico
zh_hans: 清除所有历史记录

# queryHistory.delete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除

# queryHistory.disableCapture
source: Pause Query History Capture
de: Erfassung des Abfrageverlaufs anhalten
es: Pausar la captura del historial de consultas
fr: Suspendre la capture de l'historique des requêtes
it: Sospendi acquisizione della cronologia delle query
ja: Query History キャプチャの一時停止
ko: 쿼리 기록 캡처 일시 중지
pt_br: Pausar a Captura de Histórico de Consultas
zh_hans: 暂停查询历史记录捕获

# queryHistory.enableCapture
source: Start Query History Capture
de: Erfassung des Abfrageverlaufs starten
es: Iniciar la captura del historial de consultas
fr: Démarrer la capture de l'historique des requêtes
it: Avvia acquisizione della cronologia delle query
ja: Query History キャプチャの開始
ko: 쿼리 기록 캡처 시작
pt_br: Iniciar a Captura do Histórico de Consultas
zh_hans: 开始查询历史记录捕获

# queryHistory.openQuery
source: Open Query
de: Abfrage öffnen
es: Abrir consulta
fr: Ouvrir la requête
it: Apri query
ja: クエリを開く
ko: 쿼리 열기
pt_br: Abrir Consulta
zh_hans: 打开查询

# queryHistory.runQuery
source: Run Query
de: Abfrage ausführen
es: Ejecutar consulta
fr: Exécuter la requête
it: Esegui query
ja: クエリの実行
ko: 쿼리 실행
pt_br: Executar Consulta
zh_hans: 运行查询

# queryHistory.toggleCaptureLabel
source: Toggle Query History capture
de: Erfassung des Abfrageverlaufs umschalten
es: Alternar la captura del historial de consultas
fr: Activer/désactiver la capture de l'historique des requêtes
it: Attiva/Disattiva acquisizione della cronologia delle query
ja: Query History キャプチャの切り替え
ko: 쿼리 기록 캡처 전환
pt_br: Ativar/desativar a captura de Histórico de Consultas
zh_hans: 切换查询历史记录捕获

source: Toggle Query History
de: Abfrageverlauf umschalten
es: Alternar el historial de consultas
fr: Activer/désactiver l'historique des requêtes
it: Attiva/Disattiva cronologia delle query
ja: Query History の切り替え
ko: 쿼리 기록 전환
pt_br: Ativar/desativar o Histórico de Consultas
zh_hans: 切换查询历史记录

source: failed
de: Fehlerhaft
es: error
fr: échec
it: non riuscito
ja: 失敗
ko: 실패
pt_br: falhou
zh_hans: 失败

source: succeeded
de: Erfolgreich
es: se realizó correctamente
fr: succès
it: riuscito
ja: 成功
ko: 성공
pt_br: com êxito
zh_hans: 成功

# noQueriesMessage
source: No queries to display.
de: Keine Abfragen zur Anzeige vorhanden.
es: No hay consultas que mostrar.
fr: Aucune requête à afficher.
it: Non ci sono query da visualizzare.
ja: 表示するクエリがありません。
ko: 표시할 쿼리가 없습니다.
pt_br: Não há nenhuma consulta a ser exibida.
zh_hans: 没有可显示的查询。

# queryHistory.regTreeAriaLabel
source: Query History
de: Abfrageverlauf
es: Historial de consultas
fr: Historique des requêtes
it: Cronologia delle query
ko: 쿼리 기록
pt_br: Histórico de Consultas
zh_hans: 查询历史记录

# miViewQueryHistory
source: &&Query History
de: &&Abfrageverlauf
es: &&Historial de consultas
fr: &&Historique des requêtes
it: &&Cronologia delle query
ja: Query History (&&Q)
ko: 쿼리 기록(&Q)
pt_br: &&Histórico de Consultas
zh_hans: 查询历史记录(&&Q)

source: Query History
de: Abfrageverlauf
es: Historial de consultas
fr: Historique des requêtes
it: Cronologia delle query
ko: 쿼리 기록
pt_br: Histórico de Consultas
zh_hans: 查询历史记录

# queryHistoryCaptureEnabled
source: Whether Query History capture is enabled. If false queries executed will not be captured.
de: Gibt an, ob die Erfassung des Abfrageverlaufs aktiviert ist. Bei Festlegung auf FALSE werden ausgeführte Abfragen nicht erfasst.
es: Si la captura del historial de consultas está habilitada. De no ser así, las consultas ejecutadas no se capturarán.
fr: Indique si la capture de l'historique des requêtes est activée. Si la valeur est false, les requêtes exécutées ne sont pas capturées.
it: Indica se l'acquisizione della cronologia delle query è abilitata. Se è false, le query eseguite non verranno acquisite.
ja: Query History キャプチャが有効かどうか。false の場合、実行されたクエリはキャプチャされません。
ko: 쿼리 기록 캡처가 사용하도록 설정되어 있는지 여부입니다. false이면 실행된 쿼리가 캡처되지 않습니다.
pt_br: Se a captura do Histórico de Consultas estiver habilitada. Se for false, as consultas executadas não serão capturadas.
zh_hans: 是否启用查询历史记录捕获。若为 false，则不捕获所执行的查询。
