Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# notebook.codeEditorLineNumber
source: Notebook: Code editor line numbers
de: Notebook: Code-Editor-Zeilennummern
es: Cuaderno: números de línea del editor de código
fr: Notebook : numéros de ligne de l'éditeur de code
it: Notebook: numeri di riga dell'editor di codice
ja: Notebook: コード エディターの行番号
ko: Notebook: 코드 편집기 줄 번호
pt_br: Notebook: números de linha do editor de código
zh_hans: 笔记本: 代码编辑器行号

source: Notebook: Code editor toolbar background
de: Notebook: Hintergrund der Code-Editor-Symbolleiste
es: Cuaderno: fondo de barra de herramientas del editor de código
fr: Notebook : arrière-plan de la barre d'outils de l'éditeur de code
it: Notebook: sfondo della barra degli strumenti dell'editor di codice
ja: Notebook: コード エディターのツールバーの背景
ko: Notebook: 코드 편집기 도구 모음 배경
pt_br: Notebook: tela de fundo da barra de ferramentas do editor de código
zh_hans: 笔记本: 代码编辑器工具栏背景

# notebook.codeEditorToolbarBorder
source: Notebook: Code editor toolbar right border
de: Notebook: Rechter Rand der Code-Editor-Symbolleiste
es: Cuaderno: borde derecho de la barra de herramientas del editor de código
fr: Notebook : bordure droite de la barre d'outils de l'éditeur de code
it: Notebook: bordo destro della barra degli strumenti dell'editor di codice
ja: Notebook: コード エディターのツールバーの右枠線
ko: Notebook: 코드 편집기 도구 모음 오른쪽 테두리
pt_br: Notebook: borda direita da barra de ferramentas do editor de código
zh_hans: 笔记本: 代码编辑器工具栏右边框

# notebook.codeEditorToolbarIcon
source: Notebook: Code editor toolbar icons
de: Notebook: Symbole der Code-Editor-Symbolleiste
es: Cuaderno: iconos de la barra de herramientas del editor de código
fr: Notebook : icônes de la barre d'outils de l'éditeur de code
it: Notebook: icone della barra degli strumenti dell'editor di codice
ja: Notebook: コード エディターのツールバー アイコン
ko: Notebook: 코드 편집기 도구 모음 아이콘
pt_br: Notebook: ícones da barra de ferramentas do editor de código
zh_hans: 笔记本: 代码编辑器工具栏图标

# notebook.dropdownArrow
source: Notebook: Main toolbar dropdown arrow
de: Notebook: Dropdownpfeil der Hauptsymbolleiste
es: Cuaderno: flecha desplegable de la barra de herramientas principal
fr: Notebook : flèche déroulante de la barre d'outils principale
it: Notebook: freccia a discesa della barra degli strumenti principale
ja: Notebook: メイン ツールバーのドロップダウン矢印
ko: Notebook: 주 도구 모음 드롭다운 화살표
pt_br: Notebook: seta suspensa da barra de ferramentas principal
zh_hans: 笔记本: 主工具栏下拉箭头

source: Notebook: Markdown editor background
de: Notebook: Markdown-Editor-Hintergrund
es: Cuaderno: fondo del editor de Markdown
fr: Notebook : arrière-plan de l'éditeur Markdown
it: Notebook: sfondo di Markdown editor
ja: Notebook: マークダウン エディターの背景
ko: Notebook: Markdown 편집기 배경
pt_br: Notebook: tela de fundo do Markdown editor
zh_hans: 笔记本: Markdown 编辑器背景

# notebook.notebookCellTagBackground
source: Tag background color.
de: Hintergrundfarbe für Tag.
es: Color de fondo de las etiquetas.
fr: Couleur d'arrière-plan de l'étiquette.
it: Colore di sfondo dei tag.
ja: タグの背景色。
ko: 태그 배경색입니다.
pt_br: Marcar a cor da tela de fundo.
zh_hans: 标记背景色。

# notebook.notebookCellTagForeground
source: Tag foreground color.
de: Vordergrundfarbe für Tag.
es: Color de primer plano de las etiquetas.
fr: Couleur de premier plan de l'étiquette.
it: Colore di primo piano dei tag.
ja: タグの前景色。
ko: 태그 전경색입니다.
pt_br: Marcar a cor de primeiro plano.
zh_hans: 标记前景色。

# notebook.notebookToolbarIcon
source: Notebook: Main toolbar icons
de: Notebook: Symbole der Hauptsymbolleiste
es: Cuaderno: iconos de la barra de herramientas principal
fr: Notebook : icônes de la barre d'outils principale
it: Notebook: icone della barra degli strumenti principale
ja: Notebook: メイン ツールバー アイコン
ko: Notebook: 주 도구 모음 아이콘
pt_br: Notebook: ícones da barra de ferramentas principal
zh_hans: 笔记本: 主工具栏图标

# notebook.notebookToolbarLines
source: Notebook: Main toolbar bottom border and separator
de: Notebook: Unterer Rand und Trennlinie der Hauptsymbolleiste
es: Cuaderno: borde inferior y separador de la barra de herramientas principal
fr: Notebook : bordure inférieure et séparateur de la barre d'outils principale
it: Notebook: bordo inferiore e separatore della barra degli strumenti principale
ja: Notebook: メイン ツールバーの下枠線と区切り記号
ko: Notebook: 주 도구 모음 아래쪽 테두리 및 구분 기호
pt_br: Notebook: borda inferior e separador da barra de ferramentas principal
zh_hans: 笔记本: 主工具栏下边框和分隔条

# notebook.notebookToolbarSelectBackground
source: Notebook: Main toolbar select box background
de: Notebook: Hintergrund für Auswahlfelder der Hauptsymbolleiste
es: Cuaderno: fondo del cuadro de selección de la barra de herramientas principal
fr: Notebook : arrière-plan de la zone de sélection de la barre d'outils principale
it: Notebook: sfondo della casella di selezione della barra degli strumenti principale
ja: Notebook: メイン ツールバーの選択ボックスの背景
ko: Notebook: 주 도구 모음 선택 상자 배경
pt_br: Notebook: tela de fundo da caixa de seleção da barra de ferramentas principal
zh_hans: 笔记本: 主工具栏选择框背景

# notebook.notebookToolbarSelectBorder
source: Notebook: Main toolbar select box border
de: Notebook: Rahmen für Auswahlfelder der Hauptsymbolleiste
es: Cuaderno: borde del cuadro de selección de la barra de herramientas principal
fr: Notebook : bordure de la zone de sélection de la barre d'outils principale
it: Notebook: bordo della casella di selezione della barra degli strumenti principale
ja: Notebook: メイン ツールバーの選択ボックスの枠線
ko: Notebook: 주 도구 모음 선택 상자 테두리
pt_br: Notebook: borda da caixa de seleção da barra de ferramentas principal
zh_hans: 笔记本: 主工具栏选择框边框

# notebook.splitBorder
source: Notebook: Border between Markdown editor and preview
de: Notebook: Rahmen zwischen Markdown-Editor und Vorschau
es: Cuaderno: borde entre el editor de Markdown y la vista previa
fr: Notebook : bordure entre l'éditeur Markdown et l'aperçu
it: Notebook: bordo tra Markdown editor e l'anteprima
ja: Notebook: マークダウン エディターとプレビューの間の境界線
ko: Notebook: Markdown 편집기와 미리 보기 간 경계
pt_br: Notebook: borda entre o Markdown editor e a versão prévia
zh_hans: 笔记本: Markdown 编辑器和预览之间的边框

# notebook.toolbarBackground
source: Notebook: Markdown toolbar background
de: Notebook: Hintergrund der Markdownsymbolleiste
es: Cuaderno: fondo de la barra de herramientas de Markdown
fr: Notebook : arrière-plan de la barre d'outils Markdown
it: Notebook: sfondo della barra degli strumenti Markdown
ja: Notebook: マークダウン ツールバーの背景
ko: Notebook: Markdown 도구 모음 배경
pt_br: Notebook: tela de fundo da barra de ferramentas do Markdown
zh_hans: 笔记本: Markdown 工具栏背景

# notebook.toolbarBottomBorder
source: Notebook: Markdown toolbar bottom border
de: Notebook: Unterer Rand der Markdownsymbolleiste
es: Cuaderno: borde inferior de la barra de herramientas de Markdown
fr: Notebook : bordure inférieure de la barre d'outils Markdown
it: Notebook: bordo inferiore della barra degli strumenti Markdown
ja: Notebook: マークダウン ツールバーの下枠線
ko: Notebook: Markdown 도구 모음 아래쪽 테두리
pt_br: Notebook: borda inferior da barra de ferramentas do Markdown
zh_hans: 笔记本: Markdown 工具栏下边框

# notebook.toolbarIcon
source: Notebook: Markdown toolbar icons
de: Notebook: Symbole der Markdownsymbolleiste
es: Cuaderno: iconos de la barra de herramientas de Markdown
fr: Notebook : icônes de la barre d'outils Markdown
it: Notebook: icone della barra degli strumenti Markdown
ja: Notebook: マークダウン ツールバー アイコン
ko: Notebook: Markdown 도구 모음 아이콘
pt_br: Notebook: ícones da barra de ferramentas do Markdown
zh_hans: 笔记本: Markdown 工具栏图标

# notebookFindMatchHighlight
source: Color of the other search matches. The color must not be opaque so as not to hide underlying decorations.
de: Farbe der anderen Suchergebnisse. Die Farbe darf nicht deckend sein, weil sie sonst die zugrunde liegenden Dekorationen verdeckt.
es: Color de los otros resultados de la búsqueda. El color no debe ser opaco para no ocultar las decoraciones subyacentes.
fr: Couleur des autres correspondances de recherche. La couleur ne doit pas être opaque pour ne pas masquer les ornements sous-jacents.
it: Colore degli altri risultati della ricerca. Il colore non deve essere opaco per evitare di nascondere le decorazioni sottostanti.
ja: その他の検索条件に一致する項目の色。この色は、基本装飾が非表示にならないよう不透明にすることはできません。
ko: 기타 검색 일치 항목의 색입니다. 기본 장식을 숨기지 않도록 색은 불투명하지 않아야 합니다.
pt_br: Cor das outras correspondências da pesquisa. A cor não deve ser opaca para não ocultar decorações subjacentes.
zh_hans: 其他搜索匹配项的颜色。颜色必须透明，以免隐藏下面的修饰效果。

# notebookFindRangeHighlight
source: Color of the range limiting the search. The color must not be opaque so as not to hide underlying decorations.
de: Farbe des Bereichs, der die Suche eingrenzt. Die Farbe darf nicht deckend sein, damit sie nicht die zugrunde liegenden Dekorationen verdeckt.
es: Color de la gama que limita la búsqueda. El color no debe ser opaco para no ocultar decoraciones subyacentes.
fr: Couleur de la plage limitant la recherche. La couleur ne doit pas être opaque pour ne pas masquer les ornements sous-jacents.
it: Colore dell'intervallo di limite della ricerca. Il colore non deve essere opaco per evitare di nascondere le decorazioni sottostanti.
ja: 検索を制限する範囲の色。この色は、基本装飾が非表示にならないよう不透明にすることはできません。
ko: 검색을 제한하는 범위의 색입니다. 기본 장식을 숨기지 않도록 색은 불투명하지 않아야 합니다.
pt_br: Cor do intervalo que limita a pesquisa. A cor não deve ser opaca para não ocultar decorações subjacentes.
zh_hans: 限制搜索范围的颜色。颜色不能不透明，以免隐藏底层装饰。

# tileBorder
source: The border color of tiles
de: Die Rahmenfarbe von Kacheln.
es: Color del borde de los iconos
fr: Couleur de bordure des vignettes
it: Colore del bordo dei riquadri
ja: タイルの境界線の色
ko: 타일의 테두리 색
pt_br: A cor da borda dos blocos
zh_hans: 磁贴的边框颜色

# tileBoxShadow
source: The tile box shadow color
de: Die Schattenfarbe des Kachelfelds.
es: Color de la sombra del cuadro del icono
fr: Couleur de l'ombre de la zone de vignette
it: Colore di ombreggiatura della finestra dei riquadri
ja: タイル ボックスの影の色
ko: 타일 상자 그림자 색
pt_br: A cor da sombra da caixa do bloco
zh_hans: 磁贴框阴影颜色

# agentCellBackground
source: SQL Agent table cell background color.
de: Hintergrundfarbe für die SQL-Agent-Tabellenzellen.
es: Color de fondo de celda de la tabla del Agente SQL.
fr: Couleur d'arrière-plan des cellules de la table SQL Agent.
it: Colore di sfondo delle celle della tabella di SQL Agent.
ja: SQL エージェントのテーブル セル背景色。
ko: SQL 에이전트 테이블 셀 배경색입니다.
pt_br: Cor da tela de fundo da célula de tabela do SQL Agent.
zh_hans: SQL 代理表单元格背景色。

# agentCellBorderColor
source: SQL Agent table cell border color.
de: Rahmenfarbe für SQL-Agent-Tabellenzellen.
es: Color del borde de la celda de la tabla del Agente SQL.
fr: Couleur de bordure des cellules de la table SQL Agent.
it: Colore del bordo delle celle della tabella di SQL Agent.
ja: SQL Agent のテーブル セル枠線色。
ko: SQL 에이전트 테이블 셀 테두리 색입니다.
pt_br: Cor da borda da célula na tabela do SQL Agent.
zh_hans: SQL 代理表单元格边框颜色。

# agentJobsHeadingColor
source: SQL Agent heading background color.
de: Hintergrundfarbe für SQL-Agent-Überschriften.
es: Color de fondo del encabezado del Agente SQL.
fr: Couleur d'arrière-plan du titre SQL Agent.
it: Colore di sfondo dell'intestazione di SQL Agent.
ja: SQL Agent の見出し背景色。
ko: SQL 에이전트 제목 배경색입니다.
pt_br: Cor da tela de fundo do título do SQL Agent.
zh_hans: SQL 代理标题背景色。

# agentTableBackground
source: SQL Agent Table background color.
de: Hintergrundfarbe für die SQL-Agent-Tabelle.
es: Color de fondo de la tabla del Agente SQL.
fr: Couleur d'arrière-plan de la table SQL Agent.
it: Colore di sfondo della tabella di SQL Agent.
ja: SQL Agent のテーブル背景色。
ko: SQL 에이전트 테이블 배경색입니다.
pt_br: Cor da tela de fundo da tabela do SQL Agent.
zh_hans: SQL 代理表背景色。

# agentTableHoverBackground
source: SQL Agent table hover background color.
de: Hintergrundfarbe für die SQL-Agent-Tabelle, wenn darauf gezeigt wird.
es: Color de fondo al mantener el mouse de la tabla del Agente SQL.
fr: Couleur d'arrière-plan du pointage de la table SQL Agent.
it: Colore di sfondo della tabella di SQL Agent al passaggio del mouse.
ja: SQL Agent のテーブル ホバー背景色。
ko: 가리킨 경우 SQL 에이전트 테이블 배경색입니다.
pt_br: Cor da tela de fundo para tabela do SQL Agent.
zh_hans: SQL 代理表悬停背景色。

# buttonFocusOutline
source: Button outline color when focused.
de: Konturfarbe der Schaltfläche, wenn diese den Fokus hat.
es: Contorno del botón resaltado cuando se enfoca
fr: Couleur de contour du bouton quand il a le focus.
it: Colore del contorno del pulsante con stato attivo.
ja: フォーカスしたときのボタンの外枠の色。
ko: 포커스가 있는 경우 단추 윤곽선 색입니다.
pt_br: Cor do contorno do botão quando focada.
zh_hans: 聚焦时的按钮轮廓颜色。

source: Disabled checkbox foreground.
de: Vordergrundfarbe für deaktiviertes Kontrollkästchen.
es: Se ha deshabilitado el primer plano de la casilla.
fr: Premier plan de la case à cocher désactivée.
it: Primo piano della casella di controllo disabilitato.
ja: チェック ボックスの前景が無効にされました。
ko: 확인란 전경을 사용하지 않도록 설정했습니다.
pt_br: Primeiro plano da caixa de seleção desabilitado.
zh_hans: 已禁用复选框前景。

source: Disabled Input box background.
de: Hintergrund für deaktiviertes Eingabefeld.
es: Se ha deshabilitado el fondo del cuadro de entrada.
fr: Arrière plan de la zone d'entrée désactivée.
it: Sfondo della casella di input disabilitata.
ja: 入力ボックスの背景が無効にされました。
ko: 입력 상자 배경을 사용하지 않도록 설정했습니다.
pt_br: Fundo da caixa de entrada desabilitado.
zh_hans: 已禁用输入框背景。

source: Disabled Input box foreground.
de: Vordergrund für deaktiviertes Eingabefeld.
es: Se ha deshabilitado el primer plano del cuadro de entrada.
fr: Premier plan de la zone d'entrée désactivée.
it: Primo piano della casella di input disabilitata.
ja: 入力ボックスの前景が無効にされました。
ko: 입력 상자 전경을 사용하지 않도록 설정했습니다.
pt_br: Primeiro plano da caixa de entrada desabilitado.
zh_hans: 已禁用输入框前景。

# listFocusAndSelectionBackground
source: List/Table background color for the selected and focus item when the list/table is active
de: Hintergrundfarbe von Listen/Tabellen für das ausgewählte und fokussierte Element, wenn die Liste/Tabelle aktiv ist
es: Color de fondo de lista/tabla para el elemento seleccionado y elemento de enfoque cuando la lista/tabla está activa
fr: Couleur d'arrière-plan de la liste/table pour les éléments sélectionnés et qui ont le focus quand la liste/table est active
it: Colore di sfondo dell'elenco o della tabella per l'elemento selezionato e con stato attivo quando l'elenco o la tabella è attiva
ja: リスト/テーブルがアクティブなときに選択した項目とフォーカスのある項目のリスト/テーブル背景色
ko: 목록/테이블이 활성 상태일 때 포커스가 있는 선택한 항목의 목록/테이블 배경색
pt_br: Cor da tela de fundo da lista/tabela para o item selecionado e foco quando a lista/tabela estiver ativa
zh_hans: 当列表/表处于活动状态时所选焦点所在项的列表/表背景色

# resultsErrorColor
source: Results messages error color.
de: Farbe für Fehler bei Ergebnismeldungen.
es: Color de error de mensajes de resultados.
fr: Couleurs d'erreur des messages de résultats.
it: Colore dell'errore nei messaggi dei risultati.
ja: 結果メッセージのエラー色。
ko: 결과 메시지 오류 색입니다.
pt_br: Cor de erro das mensagens de resultados.
zh_hans: 结果消息错误颜色。

# tableCellOutline
source: Color of the outline of a cell.
de: Farbe der Kontur einer Zelle.
es: Color del contorno de una celda.
fr: Couleur du contour d'une cellule.
it: Colore del contorno di una cella.
ja: セルの枠線の色。
ko: 셀 윤곽선의 색입니다.
pt_br: Cor do contorno de uma célula.
zh_hans: 单元格边框颜色。

# tableHeaderBackground
source: Table header background color
de: Hintergrundfarbe für Tabellenüberschrift
es: Color de fondo de encabezado de tabla
fr: Couleur d'arrière-plan de l'en-tête du tableau
it: Colore di sfondo dell'intestazione tabella
ja: テーブル ヘッダーの背景色
ko: 테이블 헤더 배경색
pt_br: Cor da tela de fundo do cabeçalho de tabela
zh_hans: 表头背景色

# tableHeaderForeground
source: Table header foreground color
de: Vordergrundfarbe für Tabellenüberschrift
es: Color de primer plano de encabezado de tabla
fr: Couleur de premier plan de l'en-tête du tableau
it: Colore primo piano dell'intestazione tabella
ja: テーブル ヘッダーの前景色
ko: 테이블 헤더 전경색
pt_br: Cor de primeiro plano do cabeçalho de tabela
zh_hans: 表头前景色

source: Don't Show Again
de: Nicht mehr anzeigen
es: No mostrar de nuevo
fr: Ne plus afficher
it: Non visualizzare più questo messaggio
ja: 今後表示しない
ko: 다시 표시 안 함
pt_br: Não Mostrar Novamente
zh_hans: 不再显示

# workbench.generalObsoleteApiNotification
source: Some of the loaded extensions are using obsolete APIs, please find the detailed information in the Console tab of Developer Tools window
de: Einige der geladenen Erweiterungen verwenden veraltete APIs. Ausführliche Informationen finden Sie auf der Registerkarte "Konsole" des Fensters "Entwicklertools".
es: Algunas de las extensiones cargadas utilizan API obsoletas, consulte la información detallada en la pestaña Consola de la ventana Herramientas de desarrollo
fr: Certaines des extensions chargées utilisent des API obsolètes, recherchez les informations détaillées sous l'onglet Console de la fenêtre Outils de développement
it: Alcune delle estensioni caricate usano API obsolete. Per informazioni dettagliate, vedere la scheda Console della finestra Strumenti di sviluppo
ja: 読み込まれた拡張機能の一部は古い API を使用しています。[開発者ツール] ウィンドウの [コンソール] タブで詳細情報を確認してください。
ko: 로드된 확장 중 일부는 사용되지 않는 API를 사용하고 있습니다. 개발자 도구 창의 콘솔 탭에서 자세한 정보를 확인하세요.
pt_br: Algumas das extensões carregadas estão usando APIs obsoletas. Encontre as informações detalhadas na guia Console da janela Ferramentas para Desenvolvedores
zh_hans: 某些加载的扩展正在使用过时的 API，请在“开发人员工具”窗口的“控制台”选项卡中查找详细信息

# clearResultActiveCell
source: Clear result requires a code cell to be selected. Please select a code cell to run.
de: Zum Löschen des Ergebnisses muss eine Zelle ausgewählt sein. Wählen Sie eine Codezelle für die Ausführung aus.
es: Para borrar el resultado es necesario seleccionar una celda de código. Seleccione una para ejecutar.
fr: L'effacement du résultat nécessite la sélection d'une cellule de code. Sélectionnez une cellule de code à exécuter.
it: Con Cancella risultati è richiesta la selezione di una cella di codice. Selezionare una cella di codice da eseguire.
ja: 結果をクリアするには、コード セルを選択する必要があります。実行するコード セルを選択してください。
ko: 명확한 결과를 얻으려면 코드 셀을 선택해야 합니다. 실행할 코드 셀을 선택하세요.
pt_br: Limpar o resultado requer que uma célula de código seja selecionada. Selecione uma célula de código para executar.
zh_hans: 需要选择代码单元格才能清除结果。请选择要运行的代码单元格。

# runActiveCell
source: F5 shortcut key requires a code cell to be selected. Please select a code cell to run.
de: Zur Verwendung der F5-Tastenkombination muss eine Codezelle ausgewählt sein. Wählen Sie eine Codezelle für die Ausführung aus.
es: La tecla de método abreviado F5 requiere que se seleccione una celda de código. Seleccione una para ejecutar.
fr: La touche de raccourci F5 nécessite la sélection d'une cellule de code. Sélectionnez une cellule de code à exécuter.
it: Con il tasto di scelta rapida F5 è richiesta la selezione di una cella di codice. Selezionare una cella di codice da eseguire.
ja: F5 ショートカット キーでは、コード セルを選択する必要があります。実行するコード セルを選択してください。
ko: F5 바로 가기 키를 사용하려면 코드 셀을 선택해야 합니다. 실행할 코드 셀을 선택하세요.
pt_br: A tecla de atalho F5 requer que uma célula de código seja selecionada. Selecione uma célula de código para executar.
zh_hans: 需要选择代码单元格才能使用 F5 快捷键。请选择要运行的代码单元格。

# invalidIndex
source: The index {0} is invalid.
de: Der Index "{0}" ist ungültig.
es: El índice {0} no es válido.
fr: L'index {0} n'est pas valide.
it: L'indice {0} non è valido.
ja: インデックス {0} が無効です。
ko: {0} 인덱스가 잘못되었습니다.
pt_br: O índice {0} é inválido.
zh_hans: 索引 {0} 无效。

# unknownComponentType
source: Unknown component type. Must use ModelBuilder to create objects
de: Unbekannter Komponententyp. Zum Erstellen von Objekten muss "ModelBuilder" verwendet werden.
es: Tipo de componente desconocido. Debe utilizar ModelBuilder para crear objetos
fr: Type de composant inconnu. Vous devez utiliser ModelBuilder pour créer des objets
it: Tipo di componente sconosciuto. Per creare oggetti, è necessario usare ModelBuilder
ja: 不明なコンポーネントの種類です。ModelBuilder を使用してオブジェクトを作成する必要があります
ko: 알 수 없는 구성 요소 유형입니다. ModelBuilder를 사용하여 개체를 만들어야 합니다.
pt_br: Tipo de componente desconhecido. É necessário usar o ModelBuilder para criar objetos
zh_hans: 未知组件类型。必须使用 ModelBuilder 创建对象

# unknownConfig
source: Unkown component configuration, must use ModelBuilder to create a configuration object
de: Unbekannte Komponentenkonfiguration. Zum Erstellen eines Konfigurationsobjekts muss "ModelBuilder" verwendet werden.
es: Configuración del componente desconocida, debe usar ModelBuilder para crear un objeto de configuración
fr: Configuration des composants inconnue, vous devez utiliser ModelBuilder pour créer un objet de configuration
it: La configurazione del componente è sconosciuta. Per creare un oggetto di configurazione, è necessario usare ModelBuilder
ja: 不明なコンポーネント構成です。ModelBuilder を使用して構成オブジェクトを作成する必要があります
ko: 알 수 없는 구성 요소 구성입니다. ModelBuilder를 사용하여 구성 개체를 만들어야 합니다.
pt_br: Configuração de componente desconhecida. É necessário usar o ModelBuilder para criar um objeto de configuração
zh_hans: 组件配置未知，必须使用 ModelBuilder 创建配置对象

# dashboardNotInitialized
source: Tabs are not initialized
de: Registerkarten sind nicht initialisiert.
es: Las pestañas no se han inicializado.
fr: Les onglets ne sont pas initialisés
it: Le schede non sono inizializzate
ja: タブが初期化されていません
ko: 탭이 초기화되지 않았습니다.
pt_br: As guias não estão inicializadas
zh_hans: 选项卡未初始化

# dialogCancelLabel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# dialogDoneLabel
source: Done
de: Fertig
es: Listo
fr: Terminé
it: Fatto
ja: 完了
ko: 완료
pt_br: Concluído
zh_hans: 完成

# dialogNextLabel
source: Next
de: Weiter
es: Siguiente
fr: Suivant
it: Avanti
ja: 次へ
ko: 다음
pt_br: Próximo
zh_hans: 下一步

# dialogPreviousLabel
source: Previous
de: Zurück
es: Anterior
fr: Précédent
it: Indietro
ja: 前へ
ko: 이전
pt_br: Anterior
zh_hans: 上一步

# generateScriptLabel
source: Generate script
de: Skript generieren
es: Generar script
fr: Générer le script
it: Genera script
ja: スクリプトの生成
ko: 스크립트 생성
pt_br: Gerar script
zh_hans: 生成脚本

# treeView.notRegistered
source: No tree view with id '{0}' registered.
de: Es wurde keine Strukturansicht mit der ID "{0}" registriert.
es: No se ha registrado ninguna vista del árbol con el id. "{0}".
fr: Aucune arborescence avec l'ID "{0}" n'est inscrite.
it: Non è stata registrata alcuna visualizzazione struttura ad albero con ID '{0}'.
ja: ID '{0}' のツリー ビューは登録されていません。
ko: ID가 '{0}'인 등록된 트리 뷰가 없습니다.
pt_br: Não há exibição de árvore com a id '{0}' registrada.
zh_hans: 未注册 ID 为 "{0}" 的树状视图。

# errNoExecuteManager
source: No execute manager found
de: Kein Ausführungsmanager gefunden
es: No se encontró ningún administrador de ejecución
fr: Aucun gestionnaire d’exécution trouvé
it: Non è stato trovato alcun gestore di esecuzione
ja: 実行マネージャーが見つかりません
ko: 실행 관리자를 찾을 수 없음
pt_br: Não foi encontrado nenhum gerente de execução
zh_hans: 找不到执行管理器

# errNoExecuteProvider
source: No notebook execute provider found
de: Kein Notebookausführungsanbieter gefunden
es: No se encontró ningún proveedor de ejecución de cuadernos
fr: Aucun fournisseur d’exécution de bloc-notes trouvé
it: Non è stato trovato alcun provider di esecuzione di notebook
ja: ノートブック実行プロバイダーが見つかりません
ko: 전자 필기장 실행 공급자를 찾을 수 없음
pt_br: Nenhum provedor de execução de bloco de anotações encontrado
zh_hans: 找不到笔记本执行提供程序

# errNoSerializationManager
source: No serialization manager found
de: Kein Serialisierungsmanager gefunden
es: No se encontró ningún administrador de serialización
fr: Aucun gestionnaire de sérialisation n’a été trouvé
it: Non è stato trovato alcun gestore di serializzazione
ja: シリアル化マネージャーが見つかりません
ko: serialization 관리자를 찾을 수 없음
pt_br: Não foi encontrado nenhum gerente de serialização
zh_hans: 找不到序列化管理器
