Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# backup.commandNotSupported
source: Backup command is not supported for Azure SQL databases.
de: Der Sicherungsbefehl wird für Azure SQL-Datenbank-Instanzen nicht unterstützt.
es: No se admite el comando de copia de seguridad para bases de datos de Azure SQL.
fr: La commande de sauvegarde n'est pas prise en charge pour les bases de données Azure SQL.
it: Il comando di backup non è supportato per i database SQL di Azure.
ja: Azure SQL データベースでは、バックアップ コマンドはサポートされていません。
ko: Azure SQL Database에 대해 백업 명령이 지원되지 않습니다.
pt_br: O comando Backup não é compatível com bancos de dados SQL do Azure.
zh_hans: Azure SQL 数据库不支持备份命令。

# backup.commandNotSupportedForServer
source: Backup command is not supported outside of a database context. Please select a database and try again.
de: Der Sicherungsbefehl wird außerhalb eines Datenbankkontexts nicht unterstützt. Wählen Sie eine Datenbank aus, und versuchen Sie es noch mal.
es: No se admite el comando de copia de seguridad en el contexto del servidor. Seleccione una base de datos y vuelva a intentarlo.
fr: La commande Sauvegarder n'est pas prise en charge en dehors d’un contexte de base de données. Sélectionnez une base de données et réessayez.
it: Il comando Backup non è supportato all'esterno di un contesto di database. Selezionare un database e riprovare.
ja: バックアップ コマンドは、データベース コンテキストの外ではサポートされていません。データベースを選択して、もう一度お試しください。
ko: 백업 명령은 데이터베이스 컨텍스트 외부에서 지원되지 않습니다. 데이터베이스를 선택하고 다시 시도하세요.
pt_br: O comando Backup não é suportado fora de um contexto de banco de dados. Selecione um banco de dados e tente novamente.
zh_hans: 数据库上下文外不支持备份命令，请选择数据库并重试。

# backup.isPreviewFeature
source: You must enable preview features in order to use backup
de: Sie müssen die Vorschaufeatures aktivieren, um die Sicherung verwenden zu können.
es: Debe habilitar las características en versión preliminar para utilizar la copia de seguridad
fr: Vous devez activer les fonctionnalités en préversion pour utiliser la sauvegarde
it: Per usare il backup, è necessario abilitare le funzionalità di anteprima
ja: バックアップを使用するにはプレビュー機能を有効にする必要があります
ko: 백업을 사용하려면 미리 보기 기능을 사용하도록 설정해야 합니다.
pt_br: Você precisa habilitar as versões prévias dos recursos para poder utilizar o backup
zh_hans: 必须启用预览功能才能使用备份

# backupAction.backup
source: Backup
de: Sicherung
es: Copia de seguridad
fr: Sauvegarder
ja: バックアップ
ko: 백업
zh_hans: 备份

# backup.asymmetricKey
source: Asymmetric Key
de: Asymmetrischer Schlüssel
es: Clave asimétrica
fr: Clé asymétrique
it: Chiave asimmetrica
ja: 非対称キー
ko: 비대칭 키
pt_br: Chave Assimétrica
zh_hans: 非对称密钥

# backup.compressBackup
source: Compress backup
de: Sicherung komprimieren
es: Comprimir copia de seguridad
fr: Compresser la sauvegarde
it: Comprimi il backup
ja: バックアップの圧縮
ko: 백업 압축
pt_br: Compactar backup
zh_hans: 压缩备份

# backup.defaultCompression
source: Use the default server setting
de: Standardservereinstellung verwenden
es: Utilizar la configuración del servidor predeterminada
fr: Utiliser le paramètre de serveur par défaut
it: Usa l'impostazione predefinita del server
ja: 既定のサーバー設定を使用する
ko: 기본 서버 설정 사용
pt_br: Usar a configuração padrão do servidor
zh_hans: 使用默认服务器设置

# backup.doNotCompress
source: Do not compress backup
de: Sicherung nicht komprimieren
es: No comprimir copia de seguridad
fr: Ne pas compresser la sauvegarde
it: Non comprimere il backup
ja: バックアップを圧縮しない
ko: 백업 압축 안 함
pt_br: Não compactar backup
zh_hans: 不压缩备份

# backup.labelDatabase
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
zh_hans: 数据库

# backup.labelDifferential
source: Differential
de: Differenziell
es: Diferencial
fr: Différentielle
it: Differenziale
ja: 差分
ko: 차등
pt_br: Diferencial
zh_hans: 差异

# backup.labelDisk
source: Disk
de: Datenträger
es: Disco
fr: Disque
it: Disco
ja: ディスク
ko: 디스크
pt_br: Disco
zh_hans: 磁盘

# backup.labelFilegroup
source: Files and filegroups
de: Dateien und Dateigruppen
es: Archivos y grupos de archivos
fr: Fichiers et groupes de fichiers
it: File e filegroup
ja: ファイルとファイル グループ
ko: 파일 및 파일 그룹
pt_br: Arquivos e grupos de arquivos
zh_hans: 文件和文件组

# backup.labelFull
source: Full
de: Vollständig
es: Completa
fr: Complète
it: Completo
ja: 完全
ko: 전체
pt_br: Completo
zh_hans: 完整

# backup.labelLog
source: Transaction Log
de: Transaktionsprotokoll
es: Registro de transacciones
fr: Journal des transactions
it: Log delle transazioni
ja: トランザクション ログ
ko: 트랜잭션 로그
pt_br: Log de Transações
zh_hans: 事务日志

# backup.serverCertificate
source: Server Certificate
de: Serverzertifikat
es: Certificado de servidor
fr: Certificat de serveur
it: Certificato del server
ja: サーバー証明書
ko: 서버 인증서
pt_br: Certificado do Servidor
zh_hans: 服务器证书

# chartNotFound
source: Could not find chart to save
de: Das zu speichernde Diagramm wurde nicht gefunden.
es: No se pudo encontrar el gráfico a guardar
fr: Aucun graphique à enregistrer
it: Non è stato possibile trovare il grafico da salvare
ja: 保存するグラフが見つかりませんでした
ko: 저장할 차트를 찾을 수 없습니다.
pt_br: Não foi possível encontrar o gráfico para salvar
zh_hans: 未找到要保存的图表

# chartSaved
source: Saved Chart to path: {0}
de: Diagramm in Pfad gespeichert: {0}
es: Gráfico guardado en la ruta: {0}
fr: Graphique enregistré dans le chemin : {0}
it: Grafico salvato nel percorso: {0}
ja: グラフが保存されたパス: {0}
ko: {0} 경로에 차트를 저장함
pt_br: Gráfico salvo no caminho: {0}
zh_hans: 将图表保存到路径: {0}

# configureChartLabel
source: Configure Chart
de: Diagramm konfigurieren
es: Configurar gráfico
fr: Configurer le graphique
it: Configura grafico
ja: グラフの構成
ko: 차트 구성
pt_br: Configurar Gráfico
zh_hans: 配置图表

# copyChartLabel
source: Copy as image
de: Als Bild kopieren
es: Copiar como imagen
fr: Copier comme une image
it: Copia come immagine
ja: イメージとしてコピー
ko: 이미지로 복사
pt_br: Copiar como imagem
zh_hans: 复制为图像

# createInsightLabel
source: Create Insight
de: Erkenntnisse generieren
es: Crear conclusión
fr: Créer un insight
it: Crea dati analitici
ja: 分析情報の作成
ko: 인사이트 만들기
pt_br: Criar Insight
zh_hans: 创建创建

# createInsightNoEditor
source: Cannot create insight as the active editor is not a SQL Editor
de: Es können keine Erkenntnisse generiert werden, weil der aktive Editor kein SQL-Editor ist.
es: No se puede crear la conclusión porque el editor activo no es un Editor de SQL
fr: Impossible de créer un insight, car l'éditeur actif n'est pas un éditeur SQL
it: Non è possibile creare i dati analitici perché l'editor attivo non è un editor SQL
ja: アクティブなエディターが SQL エディターではないため、分析情報を作成できません
ko: 활성 편집기가 SQL 편집기가 아니므로 인사이트를 만들 수 없습니다.
pt_br: Não é possível criar insight, pois o editor ativo não é um Editor SQL
zh_hans: 无法创建见解，因为活动编辑器不是 SQL 编辑器

# myWidgetName
source: My-Widget
es: Mi Widget
fr: Mon widget
it: Widget personale
ja: マイ ウィジェット
ko: 내 위젯
pt_br: Meu Widget
zh_hans: 我的小组件

# saveImageLabel
source: Save as image
de: Als Bild speichern
es: Guardar como imagen
fr: Enregistrer comme une image
it: Salva come immagine
ja: イメージとして保存
ko: 이미지로 저장
pt_br: Salvar como imagem
zh_hans: 另存为图像

# chartTypeLabel
source: Chart Type
de: Diagrammtyp
es: Tipo de gráfico
fr: Type de graphique
it: Tipo di grafico
ja: グラフの種類
ko: 차트 종류
pt_br: Tipo de Gráfico
zh_hans: 图表类型

# columnsAsLabelsLabel
source: Use column names as labels
de: Spaltennamen als Beschriftungen verwenden
es: Usar nombres de columna como etiquetas
fr: Utiliser les noms de colonne comme étiquettes
it: Usa i nomi di colonna come etichette
ja: 列名をラベルとして使用
ko: 열 이름을 레이블로 사용
pt_br: Use nomes de colunas como rótulos
zh_hans: 将列名用作标签

# dataDirectionLabel
source: Data Direction
de: Datenrichtung
es: Dirección de datos
fr: Direction des données
it: Direzione dei dati
ja: データの方向
ko: 데이터 방향
pt_br: Direção de Dados
zh_hans: 数据方向

# dataTypeLabel
source: Data Type
de: Datentyp
es: Tipo de datos
fr: Type de données
it: Tipo di dati
ja: データ型
ko: 데이터 형식
pt_br: Tipo de Dados
zh_hans: 数据类型

# encodingOption
source: Encoding
de: Codierung
es: Codificación
fr: Encodage
it: Codifica
ja: エンコード
ko: 인코딩
pt_br: Codificação
zh_hans: 编码

# horizontalLabel
source: Horizontal
it: Orizzontale
ja: 横
ko: 가로
zh_hans: 水平

# imageFormatOption
source: Image Format
de: Bildformat
es: Formato de imagen
fr: Format d'image
it: Formato immagine
ja: イメージ形式
ko: 이미지 형식
pt_br: Formato de Imagem
zh_hans: 图像格式

# labelFirstColumnLabel
source: Use first column as row label
de: Erste Spalte als Zeilenbeschriftung verwenden
es: Usar la primera columna como etiqueta de fila
fr: Utiliser la première colonne comme étiquette de ligne
it: Usa la prima colonna come etichetta di riga
ja: 先頭列を行ラベルとして使用
ko: 첫 번째 열을 행 레이블로 사용
pt_br: Use a primeira coluna como rótulo de linha
zh_hans: 使用第一列作为行标签

# legendLabel
source: Legend Position
de: Legendenposition
es: Posición de la leyenda
fr: Position de la légende
it: Posizione della legenda
ja: 凡例の位置
ko: 범례 위치
pt_br: Posição da Legenda
zh_hans: 图例位置

# numberLabel
source: Number
de: Anzahl
es: Número
fr: Nombre
it: Numero
ja: 数値
ko: 숫자
pt_br: Número
zh_hans: 数字

# pointLabel
source: Point
de: Punkt
es: Punto
it: Punto
ja: ポイント
ko: 점
pt_br: Ponto
zh_hans: 点

# verticalLabel
source: Vertical
de: Vertikal
it: Verticale
ja: 縦
ko: 세로
zh_hans: 垂直

source: X Axis Label
de: Beschriftung für X-Achse
es: Etiqueta del eje X
fr: Étiquette de l'axe X
it: Etichetta dell'asse X
ja: X 軸のラベル
ko: X축 레이블
pt_br: Rótulo do Eixo X
zh_hans: X 轴标签

# xAxisMaxDate
source: X Axis Maximum Date
de: Spätestes Datum für X-Achse
es: Fecha máxima del eje X
fr: Date maximale de l'axe X
it: Data massima dell'asse X
ja: X 軸の最大日付
ko: X축 최대 날짜
pt_br: Data Máxima do Eixo X
zh_hans: X 轴最大日期

# xAxisMaxVal
source: X Axis Maximum Value
de: Höchstwert für X-Achse
es: Valor máximo del eje X
fr: Valeur maximale de l'axe X
it: Valore massimo dell'asse X
ja: X 軸の最大値
ko: X축 최댓값
pt_br: Valor Máximo do Eixo X
zh_hans: X 轴最大值

# xAxisMinDate
source: X Axis Minimum Date
de: Frühestes Datum für X-Achse
es: Fecha mínima del eje X
fr: Date minimale de l'axe X
it: Data minima dell'asse X
ja: X 軸の最小日付
ko: X축 최소 날짜
pt_br: Data Mínima do Eixo X
zh_hans: X 轴最小日期

# xAxisMinVal
source: X Axis Minimum Value
de: Mindestwert für X-Achse
es: Valor mínimo del eje X
fr: Valeur minimale de l'axe X
it: Valore minimo dell'asse X
ja: X 軸の最小値
ko: X축 최솟값
pt_br: Valor Mínimo do Eixo X
zh_hans: X 轴最小值

source: Y Axis Label
de: Beschriftung für Y-Achse
es: Etiqueta del eje Y
fr: Étiquette de l'axe Y
it: Etichetta dell'asse Y
ja: Y 軸のラベル
ko: Y축 레이블
pt_br: Rótulo do Eixo Y
zh_hans: Y 轴标签

# yAxisMaxVal
source: Y Axis Maximum Value
de: Höchstwert für Y-Achse
es: Valor máximo del eje Y
fr: Valeur maximale de l'axe Y
it: Valore massimo dell'asse Y
ja: Y 軸の最大値
ko: Y축 최댓값
pt_br: Valor Máximo do Eixo Y
zh_hans: Y 轴最大值

# yAxisMinVal
source: Y Axis Minimum Value
de: Mindestwert für Y-Achse
es: Valor mínimo del eje Y
fr: Valeur minimale de l'axe Y
it: Valore minimo dell'asse Y
ja: Y 軸の最小値
ko: Y축 최솟값
pt_br: Valor Mínimo do Eixo Y
zh_hans: Y 轴最小值

# chartTabTitle
source: Chart
de: Diagramm
es: Gráfico
fr: Graphique
it: Grafico
ja: グラフ
ko: 차트
pt_br: Gráfico
zh_hans: 图表

# barAltName
source: Bar
de: Balken
es: Barras
fr: Histogramme
it: A barre
ja: バー
ko: 막대형
pt_br: Barra
zh_hans: 条形图

# charting.failedToGetRows
source: Failed to get rows for the dataset to chart.
de: Fehler beim Einfügen von Zeilen für das Dataset in das Diagramm.
es: No se pudieron obtener las filas para el conjunto de datos en el gráfico.
fr: L'obtention des lignes du jeu de données à afficher dans le graphique a échoué.
it: Non è stato possibile recuperare le righe per il set di dati da rappresentare nel grafico.
ja: グラフを作成するデータセットの行を取得できませんでした。
ko: 데이터 세트의 행을 차트로 가져오지 못했습니다.
pt_br: Falha ao obter as linhas do conjunto de dados para o gráfico.
zh_hans: 未能获得数据集的行来绘制图表。

# charting.unsupportedType
source: Chart type '{0}' is not supported.
de: Der Diagrammtyp "{0}" wird nicht unterstützt.
es: No se admite el tipo de gráfico "{0}".
fr: Le type de graphique « {0} » n'est pas pris en charge.
it: Il tipo di grafico: '{0}' non è supportato.
ja: グラフの種類 '{0}' はサポートされていません。
ko: 차트 종류 '{0}'은(는) 지원되지 않습니다.
pt_br: Não há suporte para o tipo de gráfico '{0}'.
zh_hans: 不支持图表类型“{0}”。

# countAltName
source: Count
de: Anzahl
es: Recuento
fr: Nombre
it: Conteggio
ja: カウント
ko: 개수
pt_br: Contagem
zh_hans: 计数

# doughnutAltName
source: Doughnut
de: Ring
es: Anillo
fr: Anneau
it: Ad anello
ja: ドーナツ
ko: 도넛형
pt_br: Rosca
zh_hans: 圆环图

# horizontalBarAltName
source: Horizontal Bar
de: Horizontale Leiste
es: Barra horizontal
fr: Histogramme horizontal
it: A barre orizzontali
ja: 水平バー
ko: 가로 막대
pt_br: Barra Horizontal
zh_hans: 水平条

# imageAltName
source: Image
de: Bild
es: Imagen
it: Immagine
ja: イメージ
ko: 이미지
pt_br: Imagem
zh_hans: 图像

# lineAltName
source: Line
de: Linie
es: Línea
fr: Ligne
it: A linee
ja: 直線
ko: 꺾은선형
pt_br: Linha
zh_hans: 折线图

# pieAltName
source: Pie
de: Kreis
es: Circular
fr: Camembert
it: A torta
ja: 円
ko: 원형
pt_br: Pizza
zh_hans: 饼图

# scatterAltName
source: Scatter
de: Punkt
es: Dispersión
fr: Nuage de points
it: A dispersione
ja: 散布
ko: 분산형
pt_br: Dispersão
zh_hans: 散点图

# tableAltName
source: Table
es: Tabla
it: Tabella
ja: テーブル
ko: 테이블
pt_br: Tabela
zh_hans: 表

# timeSeriesAltName
source: Time Series
de: Zeitreihe
es: Serie temporal
it: Serie temporale
ja: 時系列
ko: 시계열
pt_br: Série Temporal
zh_hans: 时序

# builtinCharts.maxRowCountDescription
source: The maximum number of rows for charts to display. Warning: increasing this may impact performance.
de: Die maximale Anzahl von Zeilen, die in Diagrammen angezeigt werden sollen. Warnung: Durch Erhöhen dieses Werts kann die Leistung beeinträchtigt werden.
es: El número máximo de filas para gráficos que se mostrarán. Advertencia: incrementar esto podría afectar al rendimiento.
fr: Le nombre maximal de lignes à afficher pour les graphiques. Attention : augmenter ce nombre peut avoir un impact sur les performances.
it: Numero massimo di righe per i grafici da visualizzare. Avviso: l'aumento di questo valore può influire sulle prestazioni.
ja: グラフに表示する最大の行数です。警告: これを大きくするとパフォーマンスに影響が及ぶ場合があります。
ko: 표시할 차트의 최대 행 수입니다. 경고:이 수를 늘리면 성능에 영향을 줄 수 있습니다.
pt_br: O número máximo de linhas para os gráficos exibirem. Aviso: aumentar isso pode afetar o desempenho.
zh_hans: 要显示的图表的最大行数。警告: 增加行数可能会影响性能。

# builtinChartsConfigurationTitle
source: Built-in Charts
de: Integrierte Diagramme
es: Gráficos integrados
fr: Graphiques intégrés
it: Grafici predefiniti
ja: 組み込みグラフ
ko: 기본 제공 차트
pt_br: Gráficos Integrados
zh_hans: 内置图表

# configureChartDialog.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# series
source: Series {0}
de: Reihe "{0}"
es: Serie {0}
fr: Série {0}
it: Serie {0}
ja: 系列 {0}
ko: 시리즈 {0}
pt_br: Série {0}
zh_hans: 系列 {0}

# invalidImage
source: Table does not contain a valid image
de: Die Tabelle enthält kein gültiges Bild.
es: La tabla no contiene una imagen válida
fr: La table n'a pas d'image valide
it: La tabella non contiene un'immagine valida
ja: テーブルに有効なイメージが含まれていません
ko: 테이블에 유효한 이미지가 포함되어 있지 않습니다.
pt_br: A tabela não contém uma imagem válida
zh_hans: 表格中不包含有效的图像

# charts.maxAllowedRowsExceeded
source: Maximum row count for built-in charts has been exceeded, only the first {0} rows are used. To configure the value, you can open user settings and search for: 'builtinCharts.maxRowCount'.
de: Die maximale Zeilenanzahl für integrierte Diagramme wurde überschritten, nur die ersten {0} Zeilen werden verwendet. Um den Wert zu konfigurieren, öffnen Sie die Benutzereinstellungen, und suchen Sie nach "builtinCharts.maxRowCount".
es: Se ha superado el número máximo de filas para gráficos integrados, solo se usan las primeras {0} filas. Para configurar el valor, puede abrir la configuración de usuario y buscar: "builtinCharts. maxRowCount".
fr: Le nombre maximal de lignes pour les graphiques intégrés a été dépassé, seules les premières {0} lignes sont utilisées. Pour configurer la valeur, vous pouvez ouvrir les paramètres utilisateur et rechercher : « builtinCharts.maxRowCount ».
it: È stato superato il numero massimo di righe per i grafici predefiniti. Vengono usate solo {0} prime righe. Per configurare il valore, è possibile aprire le impostazioni utente e cercare: 'builtinCharts.maxRowCount'.
ja: 組み込みグラフの最大行カウントを超過しました。最初の {0} 行だけが使用されます。値を構成するには、ユーザー設定を開き、'builtinCharts.maxRowCount' を検索してください。
ko: 기본 제공 차트의 최대 행 수가 초과되어 첫 번째 {0}행만 사용됩니다. 값을 구성하려면 사용자 설정을 열고 'builtinCharts.maxRowCount'를 검색할 수 있습니다.
pt_br: A contagem máxima de linhas para gráficos integrados foi excedida, somente as primeiras {0} linhas são usadas. Para definir o valor, você pode abrir as configurações do usuário e procurar: 'builtinCharts.maxRowCount'.
zh_hans: 已超过内置图表的最大行数，仅使用了前 {0} 行。要配置该值，可以打开用户设置并搜索:"builtinCharts. maxRowCount"。

# charts.neverShowAgain
source: Don't Show Again
de: Nicht mehr anzeigen
es: No volver a mostrar
fr: Ne plus afficher
it: Non visualizzare più questo messaggio
ja: 今後表示しない
ko: 다시 표시 안 함
pt_br: Não Mostrar Novamente
zh_hans: 不再显示

# confirmConnect
source: Are you sure you want to connect?
de: Möchten Sie die Verbindung herstellen?
es: ¿Seguro que desea conectarse?
fr: Voulez-vous vraiment vous connecter ?
it: Connettersi?
ja: 接続しますか?
ko: 연결하시겠습니까?
pt_br: Tem certeza de que deseja se conectar?
zh_hans: 确定要连接吗?

# connectServerDetail
source: This will connect to server {0}
de: Hiermit wird eine Verbindung mit dem Server "{0}" hergestellt.
es: Esto se conectará al servidor {0}
fr: Cette opération établit une connexion au serveur {0}
it: Verrà eseguita la connessione al server {0}
ja: これにより、サーバー {0} に接続されます
ko: 이렇게 하면 서버 {0}에 연결됩니다.
pt_br: Isso será conectado ao servidor {0}
zh_hans: 这将连接到服务器 {0}

# connectingLabel
source: Connecting: {0}
de: Verbindung wird hergestellt: {0}
es: Conectando: {0}
fr: Connexion : {0}
it: Connessione: {0}
ja: 接続中: {0}
ko: {0}에 연결하는 중
pt_br: Conectando: {0}
zh_hans: 正在连接: {0}

# connectingQueryLabel
source: Connecting query file
de: Abfragedatei wird verbunden
es: Conectando con el archivo de consulta
fr: Connexion du fichier de requête
it: Connessione del file di query
ja: クエリ ファイルへの接続中
ko: 쿼리 파일 연결 중
pt_br: Conectando o arquivo de consulta
zh_hans: 正在连接查询文件

# errConnectUrl
source: Could not open URL due to error {0}
de: Die URL konnte aufgrund eines Fehlers nicht geöffnet werden: {0}
es: No se pudo abrir la dirección URL debido a un error {0}
fr: Impossible d'ouvrir l'URL en raison de l'erreur {0}
it: Non è stato possibile aprire l'URL a causa dell'errore {0}
ja: エラー {0} により URL を開くことができませんでした
ko: {0} 오류로 인해 URL을 열 수 없습니다.
pt_br: Não foi possível abrir a URL devido ao erro {0}
zh_hans: 由于错误 {0} 而无法打开 URL

source: &&Open
de: &&Öffnen
es: &&Abrir
fr: &&Ouvrir
it: &&Apri
ja: 開く(&&O)
ko: 열기(&O)
pt_br: &&Abrir
zh_hans: 打开(&&O)

# openingNewQueryLabel
source: Opening new query: {0}
de: Neue Abfrage wird geöffnet: {0}
es: Abriendo nueva consulta: {0}
fr: Ouverture d'une nouvelle requête : {0}
it: Apertura della nuova query: {0}
ja: 新しいクエリを開いています: {0}
ko: 새 쿼리 {0}을(를) 여는 중
pt_br: Abrindo a nova consulta: {0}
zh_hans: 正在打开新查询: {0}

# runningCommandLabel
source: Running command: {0}
de: Befehl wird ausgeführt: {0}
es: Ejecutando comando: {0}
fr: Exécution de la commande : {0}
it: Esecuzione del comando: {0}
ja: 実行中のコマンド: {0}
ko: 명령 {0} 실행 중
pt_br: Comando em execução: {0}
zh_hans: 正在运行命令: {0}

# warnServerRequired
source: Cannot connect as no server information was provided
de: Keine Verbindung möglich, weil keine Serverinformationen bereitgestellt wurden.
es: No se puede conectar ya que no se proporcionó información del servidor
fr: Connexion impossible, car aucune information du serveur n'a été fournie
it: Non è possibile connettersi perché non sono state fornite informazioni sul server
ja: サーバー情報が提供されていないため接続できません
ko: 서버 정보가 제공되지 않았으므로 연결할 수 없습니다.
pt_br: Não é possível se conectar, pois não foi fornecida nenhuma informação do servidor
zh_hans: 无法连接，因为未提供服务器信息

# workbench.configuration.upgradeUser
source: {0} was replaced with {1} in your user settings.
de: "{0}" wurde in Ihren Benutzereinstellungen durch "{1}" ersetzt.
es: {0} se ha reemplazado por {1} en la configuración de usuario.
fr: {0} a été remplacé par {1} dans vos paramètres utilisateur.
it: {0} è stato sostituito con {1} nelle impostazioni utente.
ja: ユーザー設定の {0} は {1} に置き換えられました。
ko: 사용자 설정에서 {0}이(가) {1}(으)로 바뀌었습니다.
pt_br: {0} foi substituído por {1} nas suas configurações de usuário.
zh_hans: {0} 已被替换为用户设置中的 {1}。

# workbench.configuration.upgradeWorkspace
source: {0} was replaced with {1} in your workspace settings.
de: "{0}" wurde in Ihren Arbeitsbereichseinstellungen durch "{1}" ersetzt.
es: {0} se ha reemplazado por {1} en la configuración del área de trabajo.
fr: {0} a été remplacé par {1} dans vos paramètres d'espace de travail.
it: {0} è stato sostituito con {1} nelle impostazioni dell'area di lavoro.
ja: ワークスペース設定の {0} は {1} に置き換えられました。
ko: 작업 영역 설정에서 {0}이(가) {1}(으)로 바뀌었습니다.
pt_br: {0} foi substituído por {1} nas suas configurações de workspace.
zh_hans: {0} 已被替换为工作区设置中的 {1}。

# connection.parseClipboardForConnectionStringDescription
source: Attempt to parse the contents of the clipboard when the connection dialog is opened or a paste is performed.
de: Hiermit wird versucht, die Inhalte der Zwischenablage zu analysieren, wenn das Verbindungsdialogfeld geöffnet ist oder ein Element eingefügt wird.
es: Intente analizar el contenido del portapapeles cuando se abre el cuadro de diálogo de conexión o se realiza un pegado.
fr: Essayez d'analyser le contenu du presse-papiers quand la boîte de dialogue de connexion est ouverte ou qu'une opération de collage est effectuée.
it: Prova ad analizzare il contenuto degli appunti quando si apre la finestra di dialogo di connessione o si esegue un'operazione Incolla.
ja: 接続ダイアログが開いたり、解析が実行されたりするときにクリップボードの内容の解析を試行します。
ko: 연결 대화 상자가 열리거나 붙여넣기가 수행되면 클립보드의 내용을 구문 분석하려고 합니다.
pt_br: Tentativa de analisar o conteúdo da área de transferência quando a caixa de diálogo conexão é aberta ou a cópia é executada.
zh_hans: 在打开连接对话框或执行粘贴时尝试分析剪贴板的内容。

# connection.showUnsupportedServerVersionWarning
source: Whether to show the warning message when user connects to a server version that is not supported by Azure Data Studio.
de: Gibt an, ob die Warnmeldung angezeigt werden soll, wenn ein Benutzer eine Verbindung mit einer Serverversion herstellt, die von Azure Data Studio nicht unterstützt wird.
es: Si se muestra o no el mensaje de advertencia cuando el usuario se conecta a una versión del servidor que no es compatible con Azure Data Studio.
fr: Indique si le message d’avertissement doit s’afficher quand l’utilisateur se connecte à une version de serveur qui n’est pas prise en charge par Azure Data Studio.
it: Indica se visualizzare un messaggio di avviso quando l'utente si connette a una versione del server non supportata da Azure Data Studio.
ja: Azure Data Studio でサポートされていないサーバー バージョンにユーザーが接続した場合に警告メッセージを表示するかどうか。
ko: 사용자가 Azure Data Studio에서 지원하지 않는 서버 버전에 연결할 때 경고 메시지를 표시할지 여부입니다.
pt_br: Se a mensagem de aviso deve ser exibida quando o usuário se conecta a uma versão do servidor que não tem suporte do Azure Data Studio.
zh_hans: 当用户连接到 Azure Data Studio 不支持的服务器版本时是否显示警告消息。

# sql.defaultAuthenticationType.AzureMFA
source: Azure Active Directory - Universal with MFA support
de: Azure Active Directory: universell mit MFA-Unterstützung
es: Azure Active Directory: universal con compatibilidad con MFA
fr: Azure Active Directory - Authentification universelle avec prise en charge de MFA
it: Azure Active Directory - Universale con supporto MFA
ja: Azure Active Directory - MFA サポート付きユニバーサル
ko: Azure Active Directory - MFA가 지원되는 유니버설
pt_br: Azure Active Directory – Universal com suporte para MFA
zh_hans: Azure Active Directory - 支持 MFA 的通用目录
