Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# jobaction.editOperator
source: Edit Operator
de: Operator bearbeiten
es: Editar operador
fr: Modifier l'opérateur
it: Modifica operatore
ja: 演算子の編集
ko: 연산자 편집
pt_br: Editar Operador
zh_hans: 编辑运算符

# jobaction.editProxy
source: Edit Proxy
de: Proxy bearbeiten
es: Editar proxy
fr: Modifier le proxy
it: Modifica proxy
ja: プロキシの編集
ko: 프록시 편집
pt_br: Editar Proxy
zh_hans: 编辑代理

# jobaction.failedToDeleteAlert
source: Could not delete alert '{0}'. Error: {1}
de: Die Warnung "{0}" konnte nicht gelöscht werden. Fehler: {1}
es: No se pudo eliminar la alerta "{0}". Error: {1}
fr: Impossible de supprimer l'alerte '{0}'. Erreur : {1}
it: Non è stato possibile eliminare l'avviso '{0}'. Errore: {1}
ja: アラート '{0}' を削除できませんでした。 エラー: {1}
ko: '{0}' 경고를 삭제할 수 없습니다. 오류: {1}
pt_br: Não foi possível excluir o alerta '{0}'. Erro: {1}
zh_hans: 无法删除警报“{0}”。 错误: {1}

# jobaction.failedToDeleteJob
source: Could not delete job '{0}'. Error: {1}
de: Der Auftrag "{0}" konnte nicht gelöscht werden. Fehler: {1}
es: No se pudo eliminar el trabajo "{0}". Error: {1}
fr: Impossible de supprimer le travail '{0}'. Erreur : {1}
it: Non è stato possibile eliminare il processo '{0}'. Errore: {1}
ja: ジョブ '{0}' を削除できませんでした。 エラー: {1}
ko: '{0}' 작업을 삭제할 수 없습니다. 오류: {1}
pt_br: Não foi possível excluir o trabalho '{0}'. Erro: {1}
zh_hans: 无法删除作业“{0}”。 错误: {1}

# jobaction.failedToDeleteNotebook
source: Could not delete notebook '{0}'. Error: {1}
de: Das Notebook "{0}" konnte nicht gelöscht werden. Fehler: {1}
es: No se pudo eliminar el cuaderno "{0}". Error: {1}
fr: Impossible de supprimer le notebook '{0}'. Erreur : {1}
it: Non è stato possibile eliminare il notebook '{0}'. Errore: {1}
ja: ノートブック '{0}' を削除できませんでした。 エラー: {1}
ko: '{0}' Notebook을 삭제할 수 없습니다. 오류: {1}
pt_br: Não foi possível excluir o notebook '{0}'. Erro: {1}
zh_hans: 无法删除笔记本“{0}”。 错误: {1}

# jobaction.failedToDeleteOperator
source: Could not delete operator '{0}'. Error: {1}
de: Der Operator "{0}" konnte nicht gelöscht werden. Fehler: {1}
es: No se pudo eliminar el operador "{0}". Error: {1}
fr: Impossible de supprimer l'opérateur '{0}'. Erreur : {1}
it: Non è stato possibile eliminare l'operatore '{0}'. Errore: {1}
ja: 演算子 '{0}' を削除できませんでした。 エラー: {1}
ko: '{0}' 연산자를 삭제할 수 없습니다. 오류: {1}
pt_br: Não foi possível excluir o operador '{0}'. Erro: {1}
zh_hans: 无法删除运算符“{0}”。 错误: {1}"

# jobaction.failedToDeleteProxy
source: Could not delete proxy '{0}'. Error: {1}
de: Der Proxy "{0}" konnte nicht gelöscht werden. Fehler: {1}
es: No se pudo eliminar el proxy "{0}". Error: {1}
fr: Impossible de supprimer le proxy '{0}'. Erreur : {1}
it: Non è stato possibile eliminare il proxy '{0}'. Errore: {1}
ja: プロキシ '{0}' を削除できませんでした。 エラー: {1}
ko: '{0}' 프록시를 삭제할 수 없습니다. 오류: {1}
pt_br: Não foi possível excluir o proxy '{0}'. Erro: {1}
zh_hans: 无法删除代理“{0}”。 错误: {1}

# jobaction.failedToDeleteStep
source: Could not delete step '{0}'. Error: {1}
de: Der Schritt "{0}" konnte nicht gelöscht werden. Fehler: {1}
es: No se puede eliminar el paso "{0}". Error: {1}
fr: Impossible de supprimer l'étape '{0}'. Erreur : {1}
it: Non è stato possibile eliminare il passaggio '{0}'. Errore: {1}
ja: ステップ '{0}' を削除できませんでした。 エラー: {1}
ko: '{0}' 단계를 삭제할 수 없습니다. 오류: {1}
pt_br: Não foi possível excluir a etapa '{0}'. Erro: {1}
zh_hans: 无法删除步骤“{0}”。 错误: {1}

# jobaction.faillabel
source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pt_br: Erro
zh_hans: 错误

# jobaction.newAlert
source: New Alert
de: Neue Warnung
es: Nueva alerta
fr: Nouvelle alerte
it: Nuovo avviso
ja: 新しいアラート
ko: 새 경고
pt_br: Novo Alerta
zh_hans: 新建警报

# jobaction.newJob
source: New Job
de: Neuer Auftrag
es: Nuevo trabajo
fr: Nouveau travail
it: Nuovo processo
ja: 新しいジョブ
ko: 새 작업
pt_br: Novo Trabalho
zh_hans: 新建作业

# jobaction.newOperator
source: New Operator
de: Neuer Operator
es: Nuevo operador
fr: Nouvel opérateur
it: Nuovo operatore
ja: 新しい演算子
ko: 새 연산자
pt_br: Novo Operador
zh_hans: 新建运算符

# jobaction.newProxy
source: New Proxy
de: Neuer Proxy
es: Nuevo proxy
fr: Nouveau proxy
it: Nuovo proxy
ja: 新しいプロキシ
ko: 새 프록시
pt_br: Novo Proxy
zh_hans: 新建代理

# jobaction.newStep
source: New Step
de: Neuer Schritt
es: Nuevo paso
fr: Nouvelle étape
it: Nuovo passaggio
ja: 新しいステップ
ko: 새 단계
pt_br: Nova Etapa
zh_hans: 新建步骤

# jobaction.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
zh_hans: 刷新

# jobaction.run
source: Run
de: Ausführen
es: Ejecutar
fr: Exécuter
it: Esegui
ja: 実行
ko: 실행
pt_br: Executar
zh_hans: 运行

# jobaction.stop
source: Stop
de: Beenden
es: Detener
fr: Arrêter
it: Arresta
ja: 停止
ko: 중지
pt_br: Parar
zh_hans: 停止

# jobaction.successLabel
source: Success
de: Erfolgreich
es: Correcto
fr: Réussite
it: Operazione riuscita
ja: 成功
ko: 성공
pt_br: Sucesso
zh_hans: 成功

# notebookAction.openNotebook
source: Open
de: Öffnen
es: Abrir
fr: Ouvrir
it: Apri
ja: 開く
ko: 열기
pt_br: Abrir
zh_hans: 打开

# notebookaction.deleteMaterializedNotebook
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除

# notebookaction.deleteNotebook
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除

# notebookaction.editJob
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
pt_br: Editar
zh_hans: 编辑

# notebookaction.newJob
source: New Notebook Job
de: Neuer Notebook-Auftrag
es: Nuevo trabajo de cuaderno
fr: Nouveau travail de notebook
it: Nuovo processo notebook
ja: 新しいノートブック ジョブ
ko: 새 Notebook 작업
pt_br: Novo Trabalho do Notebook
zh_hans: 新建笔记本作业

# notebookaction.openLatestRun
source: Open Latest Run
de: Letzte Ausführung öffnen
es: Abrir última ejecución
fr: Ouvrir la dernière exécution
it: Apri ultima esecuzione
ja: 最新の実行を開く
ko: 마지막 실행 열기
pt_br: Abrir a Última Execução
zh_hans: 打开最近运行的内容

# notebookaction.openNotebook
source: Open Template Notebook
de: Vorlagen-Notebook öffnen
es: Abrir cuaderno de plantilla
fr: Ouvrir le modèle de notebook
it: Apri notebook modello
ja: テンプレート ノートブックを開く
ko: 템플릿 Notebook 열기
pt_br: Abrir o Notebook do Modelo
zh_hans: 打开模板笔记本

# notebookaction.pinNotebook
source: Pin
de: Anheften
es: Anclar
fr: Épingler
it: Aggiungi
ja: ピン留めする
ko: 고정
pt_br: Fixar
zh_hans: 固定

# notebookaction.renameNotebook
source: Rename
de: Umbenennen
es: Cambiar nombre
fr: Renommer
it: Rinomina
ja: 名前の変更
ko: 이름 바꾸기
pt_br: Renomear
zh_hans: 重命名

# notebookaction.unpinNotebook
source: Unpin
de: Lösen
es: Desanclar
fr: Désépingler
it: Rimuovi
ja: ピン留めを外す
ko: 고정 해제
pt_br: Desafixar
zh_hans: 取消固定

# stepRow.message
source: Message
de: Meldung
es: Mensaje
it: Messaggio
ja: メッセージ
ko: 메시지
pt_br: Mensagem
zh_hans: 消息

# stepRow.stepID
source: Step ID
de: Schritt-ID
es: Id. de paso
fr: ID d'étape
it: ID passaggio
ja: ステップ ID
ko: 단계 ID
pt_br: ID da Etapa
zh_hans: 步骤 ID

# stepRow.stepName
source: Step Name
de: Schrittname
es: Nombre del paso
fr: Nom de l'étape
it: Nome del passaggio
ja: ステップ名
ko: 단계 이름
pt_br: Nome da Etapa
zh_hans: 步骤名称

# agent.steps
source: Steps
de: Schritte
es: Pasos
fr: Étapes
it: Passaggi
ja: ステップ
ko: 단계
pt_br: Etapas
zh_hans: 步骤

# jobColumns.category
source: Category
de: Kategorie
es: Categoría
fr: Catégorie
it: Categoria
ja: カテゴリ
ko: 범주
pt_br: Categoria
zh_hans: 类别

# jobColumns.enabled
source: Enabled
de: Aktiviert
es: Habilitado
fr: Activé
it: Abilitata
ja: 有効
ko: 사용
pt_br: Habilitado
zh_hans: 已启用

# jobColumns.lastRun
source: Last Run
de: Letzte Ausführung
es: Última ejecución
fr: Dernière exécution
it: Ultima esecuzione
ja: 前回の実行
ko: 마지막 실행
pt_br: Última Execução
zh_hans: 上次运行

# jobColumns.lastRunOutcome
source: Last Run Outcome
de: Ergebnis der letzten Ausführung
es: Último resultado ejecutado
fr: Résultats de la dernière exécution
it: Risultati ultima esecuzione
ja: 前回の実行の結果
ko: 마지막 실행 결과
pt_br: Resultado da Última Execução
zh_hans: 上次运行结果

# jobColumns.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称

# jobColumns.nextRun
source: Next Run
de: Nächste Ausführung
es: Próxima ejecución
fr: Exécution suivante
it: Prossima esecuzione
ja: 次回の実行
ko: 다음 실행
pt_br: Próxima Execução
zh_hans: 下次运行

# jobColumns.previousRuns
source: Previous Runs
de: Vorherigen Ausführungen
es: Ejecuciones anteriores
fr: Exécutions précédentes
it: Esecuzioni precedenti
ja: 以前の実行
ko: 이전 실행
pt_br: Execuções Anteriores
zh_hans: 之前的运行

# jobColumns.runnable
source: Runnable
de: Ausführbar
es: Se puede ejecutar
fr: Exécutable
it: Eseguibile
ja: 実行可能
ko: 실행 가능
pt_br: Executável
zh_hans: 可运行

# jobColumns.schedule
source: Schedule
de: Zeitplan
es: Programación
fr: Planification
it: Pianificazione
ja: スケジュール
ko: 일정
pt_br: Agendamento
zh_hans: 计划

# jobColumns.status
source: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
zh_hans: 状态

# jobsView.error
source: Error:
de: Fehler:
fr: Erreur :
it: Errore:
ja: エラー:
ko: 오류:
pt_br: Erro:
zh_hans: 错误:

# jobsView.noSteps
source: No Steps available for this job.
de: Für diesen Auftrag sind keine Schritte verfügbar.
es: No hay pasos disponibles para este trabajo.
fr: Aucune étape disponible pour ce travail.
it: Non sono disponibili passaggi per questo processo.
ja: このジョブに利用できるステップはありません。
ko: 이 작업에 사용할 수 있는 단계가 없습니다.
pt_br: Nenhuma etapa disponível para este trabalho.
zh_hans: 没有可用于此作业的步骤。

# notebookHistory.ErrorTooltip
source: Job Error:
de: Auftragsfehler:
es: Error de trabajo:
fr: Erreur de travail :
it: Errore del processo:
ja: ジョブ エラー:
ko: 작업 오류:
pt_br: Erro de Trabalho:
zh_hans: 作业错误:

# notebookHistory.dateCreatedTooltip
source: Date Created:
de: Erstellungsdatum:
es: Fecha de creación:
fr: Date de création :
it: Data di creazione:
ja: 作成日:
ko: 만든 날짜:
pt_br: Data de Criação:
zh_hans: 创建日期:

# notebookHistory.notebookErrorTooltip
source: Notebook Error:
de: Notebook-Fehler:
es: Error del Notebook:
fr: Erreur de notebook :
it: Errore del notebook:
ja: ノートブック エラー:
ko: Notebook 오류:
pt_br: Erro do Notebook:
zh_hans: 笔记本错误:

# notebookHistory.pastRunsTitle
source: Past Runs
de: Vergangene Ausführungen
es: Ejecuciones pasadas
fr: Exécutions précédentes
it: Esecuzioni precedenti
ja: 過去の実行
ko: 지난 실행
pt_br: Execuções Anteriores
zh_hans: 已运行

# notebookHistory.pinnedTitle
source: Pinned
de: Angeheftet
es: Anclado
fr: Épinglé
it: Aggiunta
ja: ピン留めされました
ko: 고정됨
pt_br: Fixo
zh_hans: 已固定

# notebookHistory.recentRunsTitle
source: Recent Runs
de: Aktuelle Ausführungen
es: Ejecuciones recientes
fr: Dernières exécutions
it: Esecuzioni recenti
ja: 最近の実行
ko: 최근 실행
pt_br: Execuções Recentes
zh_hans: 最近运行

# notebookColumns.lastRun
source: Last Run
de: Letzte Ausführung
es: Última ejecución
fr: Dernière exécution
it: Ultima esecuzione
ja: 前回の実行
ko: 마지막 실행
pt_br: Última Execução
zh_hans: 上次运行

# notebookColumns.lastRunOutcome
source: Last Run Outcome
de: Ergebnis der letzten Ausführung
es: Último resultado ejecutado
fr: Résultats de la dernière exécution
it: Risultati ultima esecuzione
ja: 前回の実行の結果
ko: 마지막 실행 결과
pt_br: Resultado da Última Execução
zh_hans: 上次运行结果

# notebookColumns.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称

# notebookColumns.nextRun
source: Next Run
de: Nächste Ausführung
es: Próxima ejecución
fr: Exécution suivante
it: Prossima esecuzione
ja: 次回の実行
ko: 다음 실행
pt_br: Próxima Execução
zh_hans: 下次运行

# notebookColumns.previousRuns
source: Previous Runs
de: Vorherigen Ausführungen
es: Ejecuciones anteriores
fr: Exécutions précédentes
it: Esecuzioni precedenti
ja: 以前の実行
ko: 이전 실행
pt_br: Execuções Anteriores
zh_hans: 之前的运行

# notebookColumns.status
source: Status
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
zh_hans: 状态

# notebookColumns.targetDatbase
source: Target Database
de: Zieldatenbank
es: Base de datos de destino
fr: Base de données cible
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de Dados de Destino
zh_hans: 目标数据库

# notebooksView.error
source: Error:
de: Fehler:
fr: Erreur :
it: Errore:
ja: エラー:
ko: 오류:
pt_br: Erro:
zh_hans: 错误:

# notebooksView.noSteps
source: No Steps available for this job.
de: Für diesen Auftrag sind keine Schritte verfügbar.
es: No hay pasos disponibles para este trabajo.
fr: Aucune étape disponible pour ce travail.
it: Non sono disponibili passaggi per questo processo.
ja: このジョブに利用できるステップはありません。
ko: 이 작업에 사용할 수 있는 단계가 없습니다.
pt_br: Nenhuma etapa disponível para este trabalho.
zh_hans: 没有可用于此作业的步骤。

# notebooksView.notebookError
source: Notebook Error:
de: Notebook-Fehler:
es: Error del Notebook:
fr: Erreur de notebook :
it: Errore del notebook:
ja: ノートブック エラー:
ko: Notebook 오류:
pt_br: Erro do Notebook:
zh_hans: 笔记本错误:

# jobOperatorsView.emailAddress
source: Email Address
de: E-Mail-Adresse
es: Dirección de correo electrónico
fr: Adresse e-mail
it: Indirizzo di posta elettronica
ja: 電子メール アドレス
ko: 전자 메일 주소
pt_br: Endereço de Email
zh_hans: 电子邮件地址

# jobOperatorsView.enabled
source: Enabled
de: Aktiviert
es: Habilitado
fr: Activé
it: Abilitata
ja: 有効
ko: 사용
pt_br: Habilitado
zh_hans: 已启用

# jobOperatorsView.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称

# jobProxiesView.accountName
source: Account Name
de: Kontoname
es: Nombre de la cuenta
fr: Nom de compte
it: Nome dell'account
ja: アカウント名
ko: 계정 이름
pt_br: Nome da Conta
zh_hans: 帐户名称

# jobProxiesView.credentialName
source: Credential Name
de: Name der Anmeldeinformationen
es: Nombre de credencial
fr: Nom d'identification
it: Nome della credenziale
ja: 資格情報名
ko: 자격 증명 이름
pt_br: Nome da Credencial
zh_hans: 凭据名称

# jobProxiesView.description
source: Description
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
pt_br: Descrição
zh_hans: 说明

# jobProxiesView.isEnabled
source: Enabled
de: Aktiviert
es: Habilitado
fr: Activé
it: Abilitata
ja: 有効
ko: 사용
pt_br: Habilitado
zh_hans: 已启用

# callout.cancelButton
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# callout.insertButton
source: Insert
de: Einfügen
es: Insertar
fr: Insérer
it: Inserisci
ja: 挿入
ko: 삽입
pt_br: Inserir
zh_hans: 插入

# imageCallout.browseAltText
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
pt_br: Procurar
zh_hans: 浏览

# imageCallout.embedImageLabel
source: Attach image to notebook
de: Bild an Notebook anfügen
es: Adjuntar imagen al cuaderno
fr: Attacher l'image au notebook
it: Collega immagine al notebook
ja: ノートブックに画像を添付する
ko: Notebook에 이미지 연결
pt_br: Anexar imagem ao notebook
zh_hans: 将图像附加到笔记本

# imageCallout.local
source: Local
de: Lokal
it: Locale
ja: ローカル
ko: 로컬
zh_hans: 本地

# imageCallout.localImageLabel
source: This computer
de: Dieser Computer
es: Este equipo
fr: Cet ordinateur
it: Questo computer
ja: このコンピューター
ko: 이 컴퓨터
pt_br: Este computador
zh_hans: 此计算机

# imageCallout.locationLabel
source: Image location
de: Bildspeicherort
es: Ubicación de la imagen
fr: Emplacement de l'image
it: Posizione immagine
ja: 画像の場所
ko: 이미지 위치
pt_br: Localização da imagem
zh_hans: 图像位置

# imageCallout.pathInputLabel
source: Image URL
de: Bild-URL
es: Dirección URL de la imagen
fr: URL de l'image
it: URL immagine
ja: 画像の URL
ko: 이미지 URL
pt_br: URL da Imagem
zh_hans: 图像 URL

# imageCallout.pathPlaceholder
source: Enter image path
de: Bildpfad eingeben
es: Escriba la ruta de acceso de la imagen.
fr: Entrer le chemin de l'image
it: Immettere il percorso dell'immagine
ja: イメージ パスを入力してください
ko: 이미지 경로 입력
pt_br: Inserir caminho da imagem
zh_hans: 输入图像路径

# imageCallout.remote
source: Remote
es: Remoto
fr: À distance
it: Remoto
ja: リモート
ko: 원격
pt_br: Remoto
zh_hans: 远程

# imageCallout.remoteImageLabel
source: Online
es: En línea
fr: En ligne
ja: オンライン
ko: 온라인
zh_hans: 联机

# imageCallout.urlPlaceholder
source: Enter image URL
de: Bild-URL eingeben
es: Escriba la dirección URL de la imagen.
fr: Entrer l'URL de l'image
it: Immettere l'URL dell'immagine
ja: イメージの URL を入力してください
ko: 이미지 URL 입력
pt_br: Inserir URL da imagem
zh_hans: 输入图像 URL

# linkCallout.linkAddressLabel
source: Address
de: Adresse
es: Dirección
fr: Adresse
it: Indirizzo
ja: アドレス
ko: 주소
pt_br: Endereço
zh_hans: 地址

# linkCallout.linkAddressPlaceholder
source: Link to an existing file or web page
de: Mit vorhandener Datei oder Webseite verknüpfen
es: Vincular a un archivo o página web existente
fr: Lier à un fichier existant ou une page web
it: Collegare a un file o a una pagina Web esistente
ja: 既存のファイルまたは Web ページへのリンク
ko: 기존 파일 또는 웹 페이지에 연결
pt_br: Vincular a um arquivo ou página da Web existente
zh_hans: 链接到现有文件或网页

# linkCallout.linkTextLabel
source: Text to display
de: Anzuzeigender Text
es: Texto para mostrar
fr: Texte à afficher
it: Testo da visualizzare
ja: 表示するテキスト
ko: 표시할 텍스트
pt_br: Texto para exibição
zh_hans: 要显示的文本

# linkCallout.linkTextPlaceholder
source: Text to display
de: Anzuzeigender Text
es: Texto para mostrar
fr: Texte à afficher
it: Testo da visualizzare
ja: 表示するテキスト
ko: 표시할 텍스트
pt_br: Texto para exibição
zh_hans: 要显示的文本

source: Remove parameter cell
de: Parameterzelle entfernen
es: Quitar celda de parámetro
fr: Supprimer la cellule de paramètre
it: Rimuovi cella parametri
ja: パラメーター セルの削除
ko: 매개 변수 셀 제거
pt_br: Remover célula de parâmetro
zh_hans: 删除参数单元格

# clear
source: Clear Result
de: Ergebnis löschen
es: Borrar resultado
fr: Effacer le résultat
it: Cancella risultato
ja: 結果のクリア
ko: 결과 지우기
pt_br: Limpar Resultado
zh_hans: 清除结果

# closeLabel
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# codeAbove
source: Insert Code Above
de: Code oberhalb einfügen
es: Insertar código arriba
fr: Insérer du code au-dessus
it: Inserisci codice sopra
ja: コードを上に挿入
ko: 위에 코드 삽입
pt_br: Inserir Código Acima
zh_hans: 在上方插入代码

# codeBelow
source: Insert Code Below
de: Code unterhalb einfügen
es: Insertar código abajo
fr: Insérer du code en dessous
it: Inserisci codice sotto
ja: コードを下に挿入
ko: 아래에 코드 삽입
pt_br: Inserir Código Abaixo
zh_hans: 在下方插入代码

source: Collapse Cell
de: Zelle reduzieren
es: Contraer celda
fr: Réduire la cellule
it: Comprimi cella
ja: セルを折りたたむ
ko: 셀 축소
pt_br: Recolher Célula
zh_hans: 折叠单元格

source: Convert Cell
de: Zelle konvertieren
es: Convertir celda
fr: Convertir la cellule
it: Converti cella
ja: セルの変換
ko: 셀 변환
pt_br: Converter Célula
zh_hans: 转换单元格

# editLabel
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
pt_br: Editar
zh_hans: 编辑

source: Expand Cell
de: Zelle erweitern
es: Expandir celda
fr: Développer la cellule
it: Espandi cella
ja: セルの展開
ko: 셀 확장
pt_br: Expandir Célula
zh_hans: 展开单元格

source: Make parameter cell
de: Parameterzelle erstellen
es: Crear celda de parámetro
fr: Créer une cellule de paramètre
it: Crea cella parametri
ja: パラメーター セルの作成
ko: 매개 변수 셀 만들기
pt_br: Criar célula de parâmetro
zh_hans: 生成参数单元格

# markdownAbove
source: Insert Text Above
de: Text oberhalb einfügen
es: Insertar texto arriba
fr: Insérer le texte au-dessus
it: Inserisci testo sopra
ja: テキストを上に挿入
ko: 위에 텍스트 삽입
pt_br: Inserir Texto Acima
zh_hans: 在上方插入文本

# markdownBelow
source: Insert Text Below
de: Text unterhalb einfügen
es: Insertar texto abajo
fr: Insérer le texte en dessous
it: Inserisci testo sotto
ja: テキストを下に挿入
ko: 아래에 텍스트 삽입
pt_br: Inserir Texto Abaixo
zh_hans: 在下方插入文本

# moreActionsLabel
source: More
de: Mehr
es: Más
fr: Plus
it: Altro
ja: その他
ko: 자세히
pt_br: Mais
zh_hans: 更多

# runAllAbove
source: Run Cells Above
de: Alle Zellen oberhalb ausführen
es: Ejecutar celdas de arriba
fr: Exécuter les cellules au-dessus
it: Esegui celle sopra
ja: 上のセルの実行
ko: 위 셀 실행
pt_br: Executar as Células Acima
zh_hans: 在上方运行单元格

# runAllBelow
source: Run Cells Below
de: Alle Zellen unterhalb ausführen
es: Ejecutar celdas de abajo
fr: Exécuter les cellules en dessous
it: Esegui celle sotto
ja: 下のセルの実行
ko: 아래 셀 실행
pt_br: Executar as Células Abaixo
zh_hans: 在下方运行单元格

# buttonAdd
source: Add cell
de: Zelle hinzufügen
es: Agregar celda
fr: Ajouter une cellule
it: Aggiungi cella
ja: セルの追加
ko: 셀 추가
pt_br: Adicionar célula
zh_hans: 添加单元格

# buttonDelete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除

# buttonMoveDown
source: Move cell down
de: Zelle nach unten verschieben
es: Bajar celda
fr: Déplacer la cellule vers le bas
it: Sposta cella in basso
ja: セルを下に移動します
ko: 아래로 셀 이동
pt_br: Mover a célula para baixo
zh_hans: 下移单元格

# buttonMoveUp
source: Move cell up
de: Zelle nach oben verschieben
es: Subir celda
fr: Déplacer la cellule vers le haut
it: Sposta cella in alto
ja: セルを上に移動します
ko: 위로 셀 이동
pt_br: Mover a célula para cima
zh_hans: 上移单元格

# codeCellsPreview
source: Add cell
de: Zelle hinzufügen
es: Agregar celda
fr: Ajouter une cellule
it: Aggiungi cella
ja: セルの追加
ko: 셀 추가
pt_br: Adicionar célula
zh_hans: 添加单元格

# codePreview
source: Code cell
de: Codezelle
es: Celda de código
fr: Cellule de code
it: Cella di codice
ja: コード セル
ko: 코드 셀
pt_br: Célula de código
zh_hans: 代码单元格

# optionCodeCell
source: Code cell
de: Codezelle
es: Celda de código
fr: Cellule de code
it: Cella di codice
ja: コード セル
ko: 코드 셀
pt_br: Célula de código
zh_hans: 代码单元格

# optionTextCell
source: Text cell
de: Textzelle
es: Celda de texto
fr: Cellule de texte
it: Cella di testo
ja: テキスト セル
ko: 텍스트 셀
pt_br: Célula de texto
zh_hans: 文本单元格

source: Split cell
de: Zelle teilen
it: Divide la cella
ja: セルを分割する
ko: 셀 분할

# textPreview
source: Text cell
de: Textzelle
es: Celda de texto
fr: Cellule de texte
it: Cella di testo
ja: テキスト セル
ko: 텍스트 셀
pt_br: Célula de texto
zh_hans: 文本单元格

# parametersText
source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres
it: Parametri
ja: パラメーター
ko: 매개 변수
pt_br: Parâmetros
zh_hans: 参数

# errorRunCell
source: Error on last run. Click to run again
de: Fehler bei der letzten Ausführung. Klicken Sie, um den Vorgang zu wiederholen.
es: Error en la última ejecución. Haga clic para volver a ejecutar
fr: Erreur de la dernière exécution. Cliquer pour réexécuter
it: Si è verificato un errore durante l'ultima esecuzione. Fare clic per ripetere l'esecuzione
ja: 最後の実行でエラーが発生しました。もう一度実行するにはクリックしてください
ko: 마지막 실행 시 오류가 발생했습니다. 다시 실행하려면 클릭하세요.
pt_br: Erro na última execução. Clique para executar novamente
zh_hans: 上次运行时出错。请单击以重新运行

# notebook.failed
source: Please select active cell and try again
de: Wählen Sie eine aktive Zelle aus, und versuchen Sie es noch mal.
es: Seleccione la celda activa y vuelva a intentarlo
fr: Sélectionnez la cellule active et réessayez
it: Selezionare la cella attiva e riprovare
ja: アクティブなセルを選択して、もう一度お試しください
ko: 활성 셀을 선택하고 다시 시도하세요.
pt_br: Selecione a célula ativa e tente novamente
zh_hans: 请选择活动单元格并重试

source: Run cell
de: Zelle ausführen
es: Ejecutar celda
fr: Exécuter la cellule
it: Esegui cella
ja: セルの実行
ko: 셀 실행
pt_br: Executar célula
zh_hans: 运行单元格

# stopCell
source: Cancel execution
de: Ausführung abbrechen
es: Cancelar ejecución
fr: Annuler l'exécution
it: Annulla esecuzione
ja: 実行のキャンセル
ko: 실행 취소
pt_br: Cancelar execução
zh_hans: 取消执行

# collapseCellContents
source: Collapse code cell contents
de: Codezelleninhalt reduzieren
es: Contraer contenido de la celda de código
fr: Réduire le contenu de la cellule de code
it: Comprimi contenuto cella di codice
ja: コード セル コンテンツを折りたたむ
ko: 코드 셀 콘텐츠 축소
pt_br: Recolher conteúdo da célula do código
zh_hans: 折叠代码单元格内容

# expandCellContents
source: Expand code cell contents
de: Codezelleninhalt erweitern
es: Expandir contenido de la celda de código
fr: Développer le contenu de la cellule de code
it: Espandi contenuto cella codice
ja: コード セルの内容の展開
ko: 코드 셀 콘텐츠 확장
pt_br: Expandir conteúdo da célula do código
zh_hans: 展开代码单元格内容

source: Bold
de: Fett
it: Grassetto
ja: 太字
ko: 굵게
