Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# buttonPreview
source: Markdown preview toggle - off
de: Markdownvorschau umschalten – aus
es: Alternancia de la vista previa de Markdown: desactivada
fr: Bouton bascule d'aperçu Markdown - désactivé
it: Disattivazione anteprima Markdown
ja: マークダウン プレビューの切り替え - オフ
ko: Markdown 미리 보기 토글 - 끄기
pt_br: Alternância de versão prévia do Markdown – Desativado
zh_hans: Markdown 预览切换 - 关闭

# dropdownHeading
source: Heading
de: Überschrift
es: Encabezado
fr: Titre
it: Intestazione
ja: 見出し
ko: 제목
pt_br: Título
zh_hans: 标题

source: Highlight
de: Hervorheben
it: Evidenziazione
ja: 強調表示
ko: 강조 표시

source: Insert code
de: Code einfügen
it: Inserisci codice
ja: コードの挿入
ko: 코드 삽입

source: Insert image
de: Bild einfügen
it: Inserisci immagine
ja: 画像の挿入
ko: 이미지 삽입

source: Insert link
de: Link einfügen
it: Inserire il collegamento
ja: リンクの挿入
ko: 링크 삽입

source: Insert list
de: Liste einfügen
it: Inserisci elenco
ja: リストの挿入
ko: 목록 삽입

source: Insert ordered list
de: Sortierte Liste einfügen
it: Inserisci elenco numerato
ja: 順序指定されたリストの挿入
ko: 순서가 지정된 목록 삽입

source: Italic
de: Kursiv
it: Corsivo
ja: 斜体
ko: 기울임꼴

# markdownViewButton
source: Markdown View
de: Markdownansicht
es: Vista de Markdown
fr: Vue Markdown
it: Visualizzazione Markdown
ja: マークダウン ビュー
ko: Markdown 보기
pt_br: Exibição do Markdown
zh_hans: Markdown 视图

# optionHeading1
source: Heading 1
de: Überschrift 1
es: Encabezado 1
fr: Titre 1
it: Intestazione 1
ja: 見出し 1
ko: 제목 1
pt_br: Título 1
zh_hans: 标题 1

# optionHeading2
source: Heading 2
de: Überschrift 2
es: Encabezado 2
fr: Titre 2
it: Intestazione 2
ja: 見出し 2
ko: 제목 2
pt_br: Título 2
zh_hans: 标题 2

# optionHeading3
source: Heading 3
de: Überschrift 3
es: Encabezado 3
fr: Titre 3
it: Intestazione 3
ja: 見出し 3
ko: 제목 3
pt_br: Título 3
zh_hans: 标题 3

# optionParagraph
source: Paragraph
de: Absatz
es: Párrafo
fr: Paragraphe
it: Paragrafo
ja: 段落
ko: 단락
pt_br: Parágrafo
zh_hans: 段落

# richTextViewButton
source: Rich Text View
de: Rich-Text-Ansicht
es: Vista de texto enriquecido
fr: Vue de texte enrichi
it: Visualizzazione RTF
ja: リッチ テキスト ビュー
ko: 서식 있는 텍스트 보기
pt_br: Exibição de Rich Text
zh_hans: 格式文本视图

# splitViewButton
source: Split View
de: Geteilte Ansicht
es: Vista En dos paneles
fr: Mode fractionné
it: Doppia visualizzazione
ja: 分割ビュー
ko: 분할 보기
pt_br: Modo Divisão
zh_hans: 拆分视图

source: Underline
de: Unterstrichen
it: Sottolineato
ja: 下線を付ける
ko: 밑줄

# componentRenderError
source: Error rendering component: {0}
de: Fehler beim Rendern der Komponente: {0}
es: Error al representar el componente: {0}
fr: Erreur de rendu du composant : {0}
it: Si è verificato un errore durante il rendering del componente: {0}
ja: コンポーネントのレンダリング エラー: {0}
ko: 구성 요소 {0} 렌더링 중 오류 발생
pt_br: Erro ao renderizar o componente: {0}
zh_hans: 渲染组件时出错: {0}

# noMimeTypeFound
source: No {0}renderer could be found for output. It has the following MIME types: {1}
de: Für die Ausgabe wurde kein {0}-Renderer gefunden. Folgende MIME-Typen sind enthalten: {1}
es: No se ha encontrado ningún representador {0} para la salida. Tiene los siguientes tipos MIME: {1}
fr: Aucun renderer {0} pour la sortie. Types MIME : {1}
it: Non è stato possibile trovare alcun renderer {0} per l'output. Include i tipi MIME seguenti: {1}
ja: 出力用の {0} レンダラーが見つかりませんでした。次の MIME の種類があります: {1}
ko: 출력의 {0}렌더러를 찾을 수 없습니다. MIME 형식이 {1}입니다.
pt_br: Não foi possível encontrar nenhum {0}renderizador para saída. Ele tem os seguintes tipos MIME: {1}
zh_hans: 未找到 {0} 呈现器用于输出。它具有以下 MIME 类型: {1}

# noSelectorFound
source: No component could be found for selector {0}
de: Für Selektor "{0}" wurde keine Komponente gefunden.
es: No se encontró un componente para el selector {0}
fr: Aucun composant pour le sélecteur {0}
it: Non è stato possibile trovare alcun componente per il selettore {0}
ja: セレクター {0} のコンポーネントが見つかりませんでした
ko: 선택기 {0}에 대한 구성 요소를 찾을 수 없습니다.
pt_br: Não foi possível encontrar nenhum componente para o seletor {0}
zh_hans: 未找到选择器 {0} 的组件

source: safe
de: Sicher
es: seguro
fr: sécurisé
it: sicuro
ja: 安全
ko: 안전
pt_br: seguro
zh_hans: 安全

source: Click on
de: Klicken Sie auf
es: Haga clic en
fr: Cliquer sur
it: Fare clic su
ja: 次をクリック
ko: 코드 또는 텍스트 셀을 추가하려면
pt_br: Clique em
zh_hans: 单击

source: or
de: oder
es: o
fr: ou
it: o
ja: または
ko: 또는
pt_br: ou
zh_hans: 或

# plusCode
source: + Code
es: + Código
it: + Codice
ja: + コード
ko: + 코드
pt_br: + Código
zh_hans: + 代码

# plusCodeAriaLabel
source: Add a code cell
de: Eine Codezelle hinzufügen
es: Agregar una celda de código
fr: Ajouter une cellule de code
it: Aggiungere cella di codice
ja: コード セルの追加
ko: 코드 셀 추가
pt_br: Adicionar uma célula de código
zh_hans: 添加代码单元格

# plusText
source: + Text
es: + Texto
fr: + Texte
it: + Testo
ja: + テキスト
ko: + 텍스트
pt_br: + Texto
zh_hans: + 文本

# plusTextAriaLabel
source: Add a text cell
de: Eine Textzelle hinzufügen
es: Agregar una celda de texto
fr: Ajouter une cellule de texte
it: Aggiungi una cella di testo
ja: テキスト セルの追加
ko: 텍스트 셀 추가
pt_br: Adicionar uma célula de texto
zh_hans: 添加文本单元格

# toAddCell
source: to add a code or text cell
de: zum Hinzufügen einer Code- oder Textzelle
es: para agregar una celda de código o texto
fr: pour ajouter une cellule de code ou de texte
it: per aggiungere una cella di testo o codice
ja: コードまたはテキストのセルを追加するため
ko: 클릭
pt_br: para adicionar uma célula de texto ou código
zh_hans: 添加代码或文本单元格

# addContent
source: <i>Add content here...</i>
de: <i>Hier Inhalte hinzufügen... </i>
es: <i>Agregue contenido aquí...</i>
fr: <i>Ajouter du contenu ici...</i>
it: <i>Aggiungere contenuto qui...</i>
ja: <i>ここにコンテンツを追加...</i>
ko: <i>여기에 콘텐츠를 추가...</i>
pt_br: <i>Adicionar conteúdo aqui... </i>
zh_hans: <i>在此处添加内容...</i>

# doubleClickEdit
source: <i>Double-click to edit</i>
de: <i>Zum Bearbeiten doppelklicken</i>
es: <i>Haga doble clic para editar.</i>
fr: <i>Double-cliquer pour modifier</i>
it: <i>Fare doppio clic per modificare</i>
ja: <i>ダブルクリックして編集</i>
ko: <i>편집하려면 두 번 클릭</i>
pt_br: <i>Clique duas vezes para editar</i>
zh_hans: <i>双击以编辑</i>

# label.closeButton
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# label.find
source: Find
de: Suchen
es: Buscar
fr: Rechercher
it: Trova
ja: 検索
ko: 찾기
pt_br: Encontrar
zh_hans: 查找

# label.nextMatchButton
source: Next match
de: Nächste Übereinstimmung
es: Coincidencia siguiente
fr: Correspondance suivante
it: Corrispondenza successiva
ja: 次の一致項目
ko: 다음 검색 결과
pt_br: Próxima correspondência
zh_hans: 下一个匹配项

# label.noResults
source: No Results
de: Keine Ergebnisse
es: No hay ningún resultado.
fr: Aucun résultat
it: Nessun risultato
ja: 結果なし
ko: 결과 없음
pt_br: Nenhum Resultado
zh_hans: 无结果

# label.previousMatchButton
source: Previous match
de: Vorherige Übereinstimmung
es: Coincidencia anterior
fr: Correspondance précédente
it: Corrispondenza precedente
ja: 前の一致項目
ko: 이전 검색 결과
pt_br: Correspondência anterior
zh_hans: 上一个匹配项

# placeholder.find
source: Find
de: Suchen
es: Buscar
fr: Rechercher
it: Trova
ja: 検索
ko: 찾기
pt_br: Encontrar
zh_hans: 查找

# title.matchesCountLimit
source: Your search returned a large number of results, only the first 999 matches will be highlighted.
de: Für Ihre Suche wurden sehr viele Ergebnisse zurückgegeben. Es werden nur die ersten 999 Übereinstimmungen hervorgehoben.
es: La búsqueda ha devuelto un gran número de resultados, se resaltarán solo las primeras 999 coincidencias.
fr: Votre recherche a retourné un grand nombre de résultats, seuls les 999 premières correspondances sont mises en surbrillance.
it: La ricerca ha restituito un numero elevato di risultati. Verranno evidenziate solo le prime 999 corrispondenze.
ja: 検索で多数の結果が返されました。最初の 999 件の一致のみ強調表示されます。
ko: 많은 수의 검색 결과가 반환되었습니다. 처음 999개의 일치 항목만 강조 표시됩니다.
pt_br: Sua pesquisa retornou um grande número de resultados. Apenas as primeiras 999 correspondências serão destacadas.
zh_hans: 搜索返回了大量结果，将仅突出显示前 999 个匹配项。

# addCell
source: Cell
de: Zelle
es: Celda
fr: Cellule
it: Cella
ja: セル
ko: 셀
pt_br: Célula
zh_hans: 单元格

# addCodeLabel
source: Add code
de: Code hinzufügen
es: Agregar código
fr: Ajouter du code
it: Aggiungi codice
ja: コードの追加
ko: 코드 추가
pt_br: Adicionar código
zh_hans: 添加代码

# addTextLabel
source: Add text
de: Text hinzufügen
es: Agregar texto
fr: Ajouter du texte
it: Aggiungi testo
ja: テキストの追加
ko: 텍스트 추가
pt_br: Adicionar texto
zh_hans: 添加文本

# cellNotFound
source: cell with URI {0} was not found in this model
de: Die Zelle mit dem URI "{0}" wurde in diesem Modell nicht gefunden.
es: no se encontró la celda con URI {0} en este modelo
fr: la cellule avec l'URI {0} est introuvable dans ce modèle
it: la cella con URI {0} non è stata trovata in questo modello
ja: URI {0} を含むセルは、このモデルには見つかりませんでした
ko: 이 모델에서 URI가 {0}인 셀을 찾을 수 없습니다.
pt_br: a célula com o URI {0} não foi encontrada neste modelo
zh_hans: 未在此模型中找到具有 URI {0} 的单元格

# cellRunFailed
source: Run Cells failed - See error in output of the currently selected cell for more information.
de: Fehler beim Ausführen von Zellen: Weitere Informationen finden Sie im Fehler in der Ausgabe der aktuell ausgewählten Zelle.
es: Error al ejecutar las celdas. Para más información, vea el error en la salida de la celda seleccionada actualmente.
fr: L'exécution des cellules a échoué. Pour plus d'informations, consultez l'erreur dans la sortie de la cellule actuellement sélectionnée.
it: Comando Esegui celle non riuscito. Per altre informazioni, vedere l'errore nell'output della cella attualmente selezionata.
ja: セルの実行に失敗しました。詳細については、現在選択されているセルの出力内のエラーをご覧ください。
ko: 셀 실행 실패 - 자세한 내용은 현재 선택한 셀의 출력 오류를 참조하세요.
pt_br: Falha ao executar células – Confira o erro na saída da célula selecionada no momento para obter mais informações.
zh_hans: 单元格运行失败 - 有关详细信息，请参阅当前所选单元格输出中的错误。

source: Code
es: Código
it: Codice
ja: コード
ko: 코드
pt_br: Código
zh_hans: 代码

source: Create File
de: Datei erstellen
es: Crear archivo
fr: Créer un fichier
it: Crea file
ja: ファイルの作成
ko: 파일 만들기
pt_br: Criar Arquivo
zh_hans: 创建文件

# displayFailed
source: Could not display contents: {0}
de: Inhalt konnte nicht angezeigt werden: {0}
es: No se pudo mostrar contenido: {0}
fr: Impossible d'afficher le contenu : {0}
it: Non è stato possibile visualizzare il contenuto: {0}
ja: コンテンツを表示できませんでした: {0}
ko: 내용 {0}을(를) 표시할 수 없습니다.
pt_br: Não foi possível exibir o conteúdo: {0}
zh_hans: 无法显示内容: {0}

source: Editor
fr: Éditeur
ja: エディター
ko: 편집기
zh_hans: 编辑器

# nextButtonLabel
source: Next >
de: Weiter >
es: Siguiente >
fr: Suivant >
it: Avanti >
ja: 次へ >
ko: 다음 >
pt_br: Próximo >
zh_hans: 下一步 >

# previousButtonLabel
source: < Previous
de: < Zurück
es: < Anterior
fr: < Précédent
it: < Indietro
ja: < 前へ
ko: < 이전
pt_br: < Anterior
zh_hans: < 上一步

# runAll
source: Run Cells
de: Zellen ausführen
es: Ejecutar celdas
fr: Exécuter les cellules
it: Esegui celle
ja: セルの実行
ko: 셀 실행
pt_br: Executar Células
zh_hans: 运行单元格

# runAllPreview
source: Run all
de: Alle ausführen
es: Ejecutar todo
fr: Tout exécuter
it: Esegui tutti
ja: すべて実行
ko: 모두 실행
pt_br: Executar tudo
zh_hans: 全部运行

source: Text
es: Texto
fr: Texte
it: Testo
ja: テキスト
ko: 텍스트
pt_br: Texto
zh_hans: 文本

source: Views
de: Ansichten
es: Vistas
fr: Vues
it: Visualizzazioni
ja: ビュー
ko: 뷰
pt_br: Exibições
zh_hans: 视图

# exclude
source: Configure glob patterns for excluding files and folders in fulltext searches and quick open. Inherits all glob patterns from the `#files.exclude#` setting. Read more about glob patterns [here](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options).
de: Konfigurieren Sie Globmuster für das Ausschließen von Dateien und Ordnern aus Volltextsuchen und Quick Open. Alle Globmuster werden von der Einstellung #files.exclude# geerbt. Weitere Informationen zu Globmustern finden Sie [hier](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options).
es: Configure patrones globales para excluir archivos y carpetas en búsquedas de texto completo y abrir los patrones de uso rápido. Hereda todos los patrones globales de la configuración "#files.exclude". Lea más acerca de los patrones globales [aquí](https://code.visualstudio.com/docs/editor/codebasics-_advanced-search-options).
fr: Configurez des modèles glob pour exclure des fichiers et des dossiers dans les recherches en texte intégral et le mode Quick Open. Hérite tous les modèles glob du paramètre '#files.exclude#'. Découvrez plus d'informations sur les modèles glob [ici](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options).
it: Consente di configurare i criteri GLOB per escludere file e cartelle nelle ricerche full-text e in Quick Open. Eredita tutti i criteri GLOB dall'impostazione `#files.exclude#`. Per altre informazioni sui criteri GLOB, fare clic [qui](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options).
ja: フルテキスト検索および Quick Open でファイルやフォルダーを除外するための glob パターンを構成します。'#files.exclude#' 設定からすべての glob パターンを継承します。glob パターンの詳細については、[こちら](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options) を参照してください。
ko: 전체 텍스트 검색 및 빠른 열기에서 glob 패턴을 구성하여 파일 및 폴더를 제외합니다. `#files.exclude#` 설정에서 모든 glob 패턴을 상속합니다. [여기](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options)에서 glob 패턴에 대해 자세히 알아보세요.
pt_br: Configurar padrões glob para excluir arquivos e pastas em pesquisas de texto completo e abrir rapidamente. Herda todos os padrões glob da configuração `#files.exclude#`. Leia mais sobre padrões glob [aqui] (https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options).
zh_hans: 配置glob模式以在全文本搜索和快速打开中排除文件和文件夹。从“＃files.exclude＃”设置继承所有glob模式。在[此处](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options)了解更多关于glob模式的信息

# exclude.boolean
source: The glob pattern to match file paths against. Set to true or false to enable or disable the pattern.
de: Das Globmuster, mit dem Dateipfade verglichen werden sollen. Legen Sie diesen Wert auf "true" oder "false" fest, um das Muster zu aktivieren bzw. zu deaktivieren.
es: El patrón global con el que se harán coincidir las rutas de acceso de los archivos. Establézcalo en true o false para habilitarlo o deshabilitarlo.
fr: Modèle Glob auquel les chemins de fichiers doivent correspondre. Affectez la valeur true ou false pour activer ou désactiver le modèle.
it: Criterio GLOB da usare per trovare percorsi file. Impostare su True o False per abilitare o disabilitare il criterio.
ja: ファイル パスの照合基準となる glob パターン。これを true または false に設定すると、パターンがそれぞれ有効/無効になります。
ko: 파일 경로를 일치시킬 GLOB 패턴입니다. 패턴을 사용하거나 사용하지 않도록 설정하려면 true 또는 false로 설정하세요.
pt_br: O padrão glob ao qual corresponder os caminhos do arquivo. Defina como true ou false para habilitar ou desabilitar o padrão.
zh_hans: 匹配文件路径所依据的 glob 模式。设置为 true 或 false 可启用或禁用该模式。

# exclude.when
source: Additional check on the siblings of a matching file. Use $(basename) as variable for the matching file name.
de: Zusätzliche Überprüfung der gleichgeordneten Elemente einer entsprechenden Datei. Verwenden Sie "$(basename)" als Variable für den entsprechenden Dateinamen.
es: Comprobación adicional de los elementos del mismo nivel de un archivo coincidente. Use $(nombreBase) como variable para el nombre de archivo que coincide.
fr: Vérification supplémentaire des frères d'un fichier correspondant. Utilisez $(basename) comme variable pour le nom de fichier correspondant.
it: Controllo aggiuntivo sugli elementi di pari livello di un file corrispondente. Usare $(basename) come variabile del nome file corrispondente.
ja: 一致するファイルの兄弟をさらにチェックします。一致するファイル名の変数として $(basename) を使用します。
ko: 일치하는 파일의 형제에 대한 추가 검사입니다. $(basename)을 일치하는 파일 이름에 대한 변수로 사용하세요.
pt_br: Verificação adicional nos irmãos de um arquivo correspondente. Use $(basename) como variável para o nome do arquivo correspondente.
zh_hans: 对匹配文件的同级文件的其他检查。使用 $(basename) 作为匹配文件名的变量。

# filterSortOrder
source: Controls sorting order of editor history in quick open when filtering.
de: Legt die Sortierreihenfolge des Editor-Verlaufs beim Filtern in Quick Open fest.
es: Controla el orden de clasificación del historial del editor en apertura rápida al filtrar.
fr: Contrôle l'ordre de tri de l'historique de l'éditeur en mode Quick Open pendant le filtrage.
it: Controlla l'ordinamento della cronologia dell'editor in Quick Open quando viene applicato il filtro.
ja: フィルター処理時に、 Quick Open におけるエディター履歴の並べ替え順序を制御します。
ko: 필터링할 때 빠른 열기에서 편집기 기록의 정렬 순서를 제어합니다.
pt_br: Controla a ordem de classificação do histórico do editor ao abrir rapidamente ao filtrar.
zh_hans: 控制在快速打开中筛选时编辑器历史记录的排序顺序。

# filterSortOrder.default
source: History entries are sorted by relevance based on the filter value used. More relevant entries appear first.
de: Verlaufseinträge werden anhand des verwendeten Filterwerts nach Relevanz sortiert. Relevantere Einträge werden zuerst angezeigt.
es: Las entradas de historial se ordenan por pertinencia en función del valor de filtro utilizado. Las entradas más pertinentes aparecen primero.
fr: Les entrées d'historique sont triées par pertinence en fonction de la valeur de filtre utilisée. Les entrées les plus pertinentes apparaissent en premier.
it: Le voci della cronologia sono ordinate per pertinenza in base al valore di filtro usato. Le voci più pertinenti vengono visualizzate per prime.
ja: 履歴エントリは、使用されるフィルター値に基づいて関連性によって並び替えられます。関連性の高いエントリが最初に表示されます。
ko: 기록 항목은 사용된 필터 값을 기준으로 관련성별로 정렬됩니다. 관련성이 더 높은 항목이 먼저 표시됩니다.
pt_br: As entradas do histórico são classificadas por relevância com base no valor do filtro usado. As entradas mais relevantes aparecem primeiro.
zh_hans: 历史记录条目按与筛选值的相关性排序。首先显示更相关的条目。

# filterSortOrder.recency
source: History entries are sorted by recency. More recently opened entries appear first.
de: Verlaufseinträge werden absteigend nach Datum sortiert. Zuletzt geöffnete Einträge werden zuerst angezeigt.
es: Las entradas de historial se ordenan por uso reciente. Las entradas abiertas más recientemente aparecen primero.
fr: Les entrées d'historique sont triées par date. Les dernières entrées ouvertes sont affichées en premier.
it: Le voci della cronologia sono ordinate in base alla data. Le voci aperte più di recente vengono visualizzate per prime.
ja: 履歴エントリは、新しい順に並べ替えられます。最近開いたエントリが最初に表示されます。
ko: 기록이 최신순으로 정렬됩니다. 가장 최근에 열람한 항목부터 표시됩니다.
pt_br: As entradas do histórico são classificadas por recência. As entradas abertas mais recentemente aparecem primeiro.
zh_hans: 历史记录条目按最近时间排序。首先显示最近打开的条目。

source: New Notebook
de: Neues Notebook
es: Nuevo Notebook
fr: Nouveau notebook
it: Nuovo notebook
ja: 新しいノートブック
ko: 새 Notebook
pt_br: Novo Notebook
zh_hans: 新建笔记本

# newQuery
source: New Notebook
de: Neues Notebook
es: Nuevo Notebook
fr: Nouveau notebook
it: Nuovo notebook
ja: 新しいノートブック
ko: 새 Notebook
pt_br: Novo Notebook
zh_hans: 新建笔记本

# notebook.allowADSCommands
source: Allow notebooks to run Azure Data Studio commands.
de: Hiermit wird Notebooks das Ausführen von Azure Data Studio-Befehlen ermöglicht.
es: Permita a los cuadernos ejecutar comandos de Azure Data Studio.
fr: Autorisez les notebooks à exécuter des commandes Azure Data Studio.
it: Consentire ai notebook di eseguire i comandi di Azure Data Studio.
ja: ノートブックでの Azure Data Studio コマンドの実行を許可します。
ko: Notebook이 Azure Data Studio 명령을 실행하도록 허용합니다.
pt_br: Permitir que notebooks executem comandos do Azure Data Studio.
zh_hans: 允许笔记本运行 Azure Data Studio 命令。

# notebook.defaultTextEditMode
source: The default editing mode used for text cells
de: Der Standardbearbeitungsmodus, der für Textzellen verwendet wird
es: Modo de edición predeterminado usado para las celdas de texto
fr: Mode Édition par défaut utilisé pour les cellules de texte
it: Modalità di modifica predefinita usata per le celle di testo
ja: テキスト セルに使用される既定の編集モード
ko: 텍스트 셀에 사용되는 기본 편집 모드
pt_br: O modo de edição padrão usado para células de texto
zh_hans: 用于文本单元格的默认编辑模式

# notebook.enableDoubleClickEdit
source: Enable double click to edit for text cells in notebooks
de: Hiermit wird ein Doppelklick zum Bearbeiten von Textzellen in Notebooks aktiviert.
es: Habilitar doble clic para editar las celdas de texto en los cuadernos
fr: Activer le double-clic pour modifier les cellules de texte dans les notebooks
it: Abilitare il doppio clic per modificare le celle di testo nei notebook
ja: ノートブックのテキスト セルのダブルクリックして編集を有効する
ko: 두 번 클릭을 사용하여 Notebook에서 텍스트 셀 편집
pt_br: Habilitar clique duplo para editar células de texto nos notebooks
zh_hans: 启用双击来编辑笔记本中的文本单元格

# notebook.enableIncrementalGridRendering
source: Enable incremental grid rendering for notebooks. This will improve the initial rendering time for large notebooks. There may be performance issues when interacting with the notebook while the rest of the grids are rendering.
de: Aktivieren Sie inkrementelles Rasterrendering für Notebooks. Hierdurch wird die anfängliche Renderingzeit für große Notebooks verbessert. Bei der Interaktion mit dem Notebook können Leistungsprobleme auftreten, während die restlichen Raster gerendert werden.
es: Habilite la representación de la cuadrícula incremental para los cuadernos. Esto mejorará el tiempo de representación inicial de los cuadernos grandes. Puede haber problemas de rendimiento al interactuar con el cuaderno mientras el resto de las cuadrículas se están representando.
fr: Activer le rendu de grille incrémentielle pour les blocs-notes. Cela permet d’améliorer le temps de rendu initiale pour les grands notebook. Des problèmes de performances peuvent survenir lors de l’interaction avec le notebook pendant que le reste des grilles sont en cours de rendu.
it: Abilitare il rendering delle griglie incrementale per i notebook. In questo modo verrà migliorato il tempo di rendering iniziale per i notebook di grandi dimensioni. Potrebbero verificarsi problemi di prestazioni durante l'interazione con il notebook mentre viene eseguito il rendering delle griglie rimanenti.
ja: Notebooks のインクリメンタル グリッド レンダリングを有効にします。これにより、大規模な Notebooks の初期レンダリング時間が改善します。残りのグリッドがレンダリングされている間は、 Notebook との連携時にパフォーマンスの問題が発生する可能性があります。
ko: 전자 필기장에 대한 증분 그리드 렌더링을 활성화합니다. 이렇게 하면 대형 전자 필기장의 초기 렌더링 시간이 향상됩니다. 나머지 그리드가 렌더링되는 동안 전자 필기장과 상호 작용할 때 성능 문제가 있을 수 있습니다.
pt_br: Habilitar a renderização em grade incremental para blocos de anotações. Isto melhorará o tempo inicial de renderização para grandes blocos de anotações. Pode haver problemas de desempenho ao interagir com o bloco de anotações enquanto o resto das grades estão sendo renderizadas.
zh_hans: 为笔记本启用增量网格呈现。这将缩短大型笔记本的初始呈现时间。当其余网格呈现时，与笔记本交互时可能会出现性能问题。

# notebook.markdownModeDescription
source: Text is displayed as Markdown.
de: Der Text wird als Markdown angezeigt.
es: El texto se muestra como "Markdown".
fr: Le texte s’affiche sous forme de Markdown.
it: Il testo viene visualizzato come Markdown.
ja: テキストはマークダウンとして表示されます。
ko: 텍스트가 Markdown으로 표시됩니다.
pt_br: O texto é exibido como Markdown.
zh_hans: 文本显示为 Markdown。

# notebook.markdownPreviewLineHeight
source: Controls the line height used in the notebook markdown preview. This number is relative to the font size.
de: Hiermit wird die in der Notebook-Markdownvorschau verwendete Zeilenhöhe gesteuert. Diese Zahl ist relativ zum Schriftgrad.
es: Controla la altura de línea utilizada en la vista previa de Markdown del cuaderno. Este número es relativo al tamaño de la fuente.
fr: Contrôle la hauteur de ligne utilisée dans l'aperçu Markdown du notebook. Ce nombre est relatif à la taille de police.
it: Controlla l'altezza della riga usata nell'anteprima Markdown del notebook. Questo numero è relativo alle dimensioni del carattere.
ja: ノートブック マークダウン プレビューで使用される行の高さを制御します。この数値はフォント サイズを基準とします。
ko: Notebook markdown 미리 보기에서 사용되는 줄 높이를 제어합니다. 해당 숫자는 글꼴 크기에 상대적입니다.
pt_br: Controla a altura da linha usada na versão prévia de markdown do notebook. Este número é relativo ao tamanho da fonte.
zh_hans: 控制笔记本 Markdown 预览中使用的行高。此数字与字号相关。
