Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# designer.checkConstraint.description.name
source: The name of the check constraint.
de: Der Name der Check-Einschränkung.
it: Nome del vincolo CHECK.
ja: CHECK 制約の名前。
ko: CHECK 제약 조건의 이름입니다.

# designer.column.description.allowNulls
source: Specifies whether the column may have a NULL value.
de: Gibt an, ob die Spalte einen NULL-Wert aufweisen darf.
it: Specifica se la colonna può includere un valore NULL.
ja: 列が NULL 値を持つことができるかどうかを指定します。
ko: 열에 NULL 값을 사용할 수 있는지 여부를 지정합니다.

# designer.column.description.dataType
source: Displays the data type name for the column
de: Zeigt den Datentypnamen für die Spalte an
it: Visualizza il nome del tipo di dati della colonna.
ja: 列のデータ型名を表示します
ko: 열의 데이터 형식 이름을 표시합니다.

# designer.column.description.defaultValueBinding
source: A predefined global default value for the column or binding.
de: Ein vordefinierter globaler Standardwert für die Spalte oder Bindung.
it: Valore predefinito globale per la colonna o l'associazione.
ja: 列またはバインドの定義済みのグローバルな既定値です。
ko: 열 또는 바인딩에 대해 미리 정의된 전역 기본값입니다.

# designer.column.description.length
source: The maximum length (in characters) that can be stored in this database object.
de: Die maximale Länge (in Zeichen), die in diesem Datenbankobjekt gespeichert werden kann.
it: Lunghezza massima (in caratteri) che è possibile archiviare in questo oggetto di database.
ja: このデータベース オブジェクトに格納できる最大長 (文字数) です。
ko: 이 데이터베이스 개체에 저장할 수 있는 최대 길이(문자 수)입니다.

# designer.column.description.name
source: The name of the column object.
de: Der Name des Spaltenobjekts.
it: Il nome dell’oggetto colonna.
ja: 列オブジェクトの名前です。
ko: 열 개체의 이름입니다.

# designer.column.description.precision
source: For numeric data, the maximum number of decimal digits that can be stored in this database object.
de: Für numerische Daten die maximale Anzahl von Dezimalstellen, die in diesem Datenbankobjekt gespeichert werden können.
it: Per dati numerici, il numero massimo di cifre decimali che è possibile archiviare in questo oggetto di database.
ja: 数値データの場合、このデータベース オブジェクトに格納できる 10 進数の最大桁数です。
ko: 숫자 데이터의 경우 이 데이터베이스 개체에 저장할 수 있는 최대 자릿수입니다.

# designer.column.description.primaryKey
source: Specifies whether the column is included in the primary key for the table.
de: Gibt an, ob die Spalte in den Primärschlüssel für die Tabelle eingeschlossen ist.
it: Specifica se la colonna è inclusa nella chiave primaria della tabella.
ja: 列がテーブルの主キーに含まれるかどうかを指定します。
ko: 열이 테이블의 기본 키에 포함되는지 여부를 지정합니다.

# designer.column.description.scale
source: For numeric data, the maximum number of decimal digits that can be stored in this database object to the right of decimal point.
de: Für numerische Daten die maximale Anzahl von Dezimalstellen, die in diesem Datenbankobjekt rechts vom Dezimaltrennzeichen gespeichert werden können.
it: Per dati numerici, il numero massimo di cifre decimali che è possibile archiviare in questo oggetto di database a destra della virgola.
ja: 数値データの場合、この小数点の右側にあるデータベース オブジェクトに格納できる小数点以下の最大桁数です。
ko: 숫자 데이터의 경우 소수점 오른쪽에 있는 이 데이터베이스 개체에 저장할 수 있는 최대 10진수 수입니다.

# designer.foreignkey.description.columnMapping
source: The mapping between foreign key columns and primary key columns.
de: Die Zuordnung zwischen Fremdschlüsselspalten und Primärschlüsselspalten.
it: Mapping tra colonne chiave esterna e colonne chiave primaria.
ja: 外部キー列と主キー列の間のマッピング。
ko: 외래 키 열과 기본 키 열 간의 매핑입니다.

# designer.foreignkey.description.name
source: The name of the foreign key.
de: Der Name des Fremdschlüssels.
it: Nome della chiave esterna.
ja: 外部キーの名前です。
ko: 외래 키의 이름입니다.

# designer.foreignkey.description.onDeleteAction
source: The behavior when a user tries to delete a row with data that is involved in a foreign key relationship.
de: Das Verhalten, wenn ein Benutzer versucht, eine Zeile mit Daten zu löschen, die an einer Fremdschlüsselbeziehung beteiligt sind.
it: Comportamento applicato quando un utente tenta di eliminare una riga contenente dati che interessano una relazione di chiave esterna.
ja: 外部キー リレーションシップに含まれるデータのある行をユーザーが削除しようとしたときの動作です。
ko: 사용자가 외래 키 관계에 포함된 데이터가 있는 행을 삭제하려고 할 때 수행할 동작입니다.

# designer.foreignkey.description.onUpdateAction
source: The behavior when a user tries to update a row with data that is involved in a foreign key relationship.
de: Das Verhalten, wenn ein Benutzer versucht, eine Zeile mit Daten zu aktualisieren, die an einer Fremdschlüsselbeziehung beteiligt sind.
it: Comportamento applicato quando un utente tenta di aggiornare una riga contenente dati che interessano una relazione di chiave esterna.
ja: 外部キー リレーションシップに含まれるデータのある行をユーザーが更新しようとしたときの動作です。
ko: 사용자가 외래 키 관계에 포함된 데이터가 있는 행을 업데이트하려고 할 때 수행할 동작입니다.

# designer.foreignkey.description.primaryKeyTable
source: The table which contains the primary or unique key column.
de: Die Tabelle, die die PRIMARY KEY- oder UNIQUE KEY-Spalte enthält.
it: Tabella contenente la colonna chiave univoca o primaria.
ja: 主キー列または一意キー列を含むテーブルです。
ko: 기본 또는 고유 키 열을 포함하는 테이블입니다.

# designer.table.description.description
source: Description for the table.
de: Die Beschreibung der Tabelle.
it: Descrizione della tabella.
ja: テーブルの説明です。
ko: 테이블에 대한 설명입니다.

# designer.table.description.name
source: The name of the table object.
de: Der Name des Tabellenobjekts.
it: Il nome dell’oggetto tabella.
ja: テーブル オブジェクトの名前です。
ko: 테이블 개체의 이름입니다.

# designer.table.description.schema
source: The schema that contains the table.
de: Das Schema, das die Tabelle enthält.
it: Schema che contiene la tabella.
ja: テーブルを含むスキーマです。
ko: 테이블을 포함하는 스키마입니다.

# tableDesigner.ForeignKeyTypeName
source: Foreign Key
de: Fremdschlüssel
it: Chiave esterna
ja: 外部キー
ko: 외래 키

# tableDesigner.PrimaryKeyTableName
source: Primary Key Table
de: Primärschlüsseltabelle
it: Tabella chiave primaria
ja: 主キー テーブル
ko: 기본 키 테이블

# tableDesigner.checkConstraintExpressionTitle
source: Expression
de: Ausdruck
it: Espressione
ja: 式
ko: 식

# tableDesigner.checkConstraintNameTitle
source: Name
it: Nome
ja: 名前
ko: 이름

# tableDesigner.checkConstraintTypeName
source: Check Constraint
de: Check-Einschränkung
it: Vincolo CHECK
ja: 制約のチェック
ko: CHECK 제약 조건

# tableDesigner.checkConstraintsTabTitle
source: Check Constraints
de: Einschränkungen überprüfen
it: Vincoli CHECK
ja: チェック制約
ko: CHECK 제약 조건

# tableDesigner.columnAllowNullTitle
source: Allow Nulls
de: NULL-Werte zulassen
it: Consenti valori Null
ja: Null を許容
ko: Null 허용

# tableDesigner.columnDefaultValueTitle
source: Default Value
de: Standardwert
it: Valore predefinito
ja: 既定値
ko: 기본값

# tableDesigner.columnIsPrimaryKeyTitle
source: Primary Key
de: Primärschlüssel
it: Chiave primaria
ja: 主キー
ko: 기본 키

# tableDesigner.columnLengthTitle
source: Length
de: Länge
it: Lunghezza
ja: 長さ
ko: 길이

# tableDesigner.columnNameTitle
source: Name
it: Nome
ja: 名前
ko: 이름

# tableDesigner.columnPrecisionTitle
source: Precision
de: Genauigkeit
it: Precisione
ja: 有効桁数
ko: 정밀도

# tableDesigner.columnScaleTitle
source: Scale
de: Skala
it: Scala
ja: 倍率
ko: 스케일링

# tableDesigner.columnTypeName
source: Column
de: Spalte
it: Colonna
ja: 列
ko: 열

# tableDesigner.columnTypeTitle
source: Type
de: Typ
it: Tipo
ja: 種類
ko: 형식

# tableDesigner.columnsTabTitle
source: Columns
de: Spalten
it: Colonne
ja: 列
ko: 열

# tableDesigner.descriptionTitle
source: Description
de: Beschreibung
it: Descrizione
ja: 説明
ko: 설명

# tableDesigner.errorInitializingTableDesigner
source: An error occured while initializing the table designer: {0}
de: Fehler beim Initialisieren des Tabellen-Designers: {0}
it: Errore durante l'inizializzazione della progettazione tabelle: {0}
ja: テーブル デザイナーの初期化中にエラーが発生しました: {0}
ko: 테이블 디자이너를 초기화하는 동안 오류가 발생했습니다. {0}

# tableDesigner.errorProcessingEdit
source: An error occured while processing the change: {0}
de: Fehler beim Verarbeiten der Änderung: {0}
it: Errore durante l'elaborazione della modifica: {0}
ja: 変更の処理中にエラーが発生しました: {0}
ko: 변경을 처리하는 동안 오류가 발생했습니다: {0}

# tableDesigner.foreignKeyColumn
source: Foreign Key Column
de: Fremdschlüsselspalte
it: Colonna chiave esterna
ja: 外部キー列
ko: 외래 키 열

# tableDesigner.foreignKeyColumns
source: Column Mapping
de: Spaltenzuordnung
it: Mapping colonne
ja: 列マッピング
ko: 열 매핑

# tableDesigner.foreignKeyNameTitle
source: Name
it: Nome
ja: 名前
ko: 이름

# tableDesigner.foreignKeyOnDeleteAction
source: On Delete Action
de: Bei Löschvorgang
it: Azione di eliminazione
ja: 削除アクション時に
ko: 삭제 시 작업

# tableDesigner.foreignKeyOnUpdateAction
source: On Update Action
de: Bei Updateaktion
it: Azione di aggiornamento
ja: 更新アクション時に
ko: 업데이트 작업 시

# tableDesigner.foreignKeysTabTitle
source: Foreign Keys
de: Fremdschlüssel
it: Chiavi esterne
ja: 外部キー
ko: 외래 키

# tableDesigner.generalTab
source: General
de: Allgemein
it: Generale
ja: 全般
ko: 일반

# tableDesigner.nameTitle
source: Table name
de: Tabellenname
it: Nome della tabella
ja: テーブル名
ko: 테이블 이름

# tableDesigner.primaryKeyColumn
source: Primary Key Column
de: Primärschlüsselspalte
it: Colonna chiave primaria
ja: 主キー列
ko: 기본 키 열

# tableDesigner.saveChangeError
source: An error occured while saving changes: {0}
de: Beim Speichern der Änderungen ist ein Fehler aufgetreten: {0}
it: Si è verificato un errore durante il salvataggio delle modifiche: {0}
ja: 変更の保存中にエラーが発生しました: {0}
ko: 변경 내용을 저장하는 동안 오류가 발생했습니다. {0}

# tableDesigner.savedChangeSuccess
source: The changes have been successfully saved.
de: Ihre Änderungen wurden erfolgreich gespeichert.
it: Le modifiche sono state salvate.
ja: 変更が正常に保存されました。
ko: 변경 내용이 저장되었습니다.

# tableDesigner.savingChanges
source: Saving table designer changes...
de: Änderungen am Tabellen-Designer werden gespeichert...
it: Salvataggio delle modifiche di Progettazione tabelle in corso...
ja: テーブル デザイナーの変更を保存しています...
ko: 테이블 디자이너 변경 내용을 저장하는 중...

# tableDesigner.schemaTitle
source: Schema
ja: スキーマ
ko: 스키마

# tableDesigner.tableObjectType
source: Table
de: Tabelle
it: Tabella
ja: テーブル
ko: 테이블

# InProgressWarning
source: 1 or more tasks are in progress. Are you sure you want to quit?
de: Mindestens eine Aufgabe wird zurzeit ausgeführt. Möchten Sie den Vorgang abbrechen?
es: 1 o más tareas están en curso. ¿Seguro que desea salir?
fr: 1 ou plusieurs tâches sont en cours. Voulez-vous vraiment quitter ?
it: Sono in corso una o più attività. Uscire comunque?
ja: 1 つ以上のタスクを実行中です。終了してもよろしいですか?
ko: 1개 이상의 작업이 진행 중입니다. 그래도 작업을 종료하시겠습니까?
pt_br: 1 ou mais tarefas estão em andamento. Tem certeza de que deseja sair?
zh_hans: 一个或多个任务正在运行中。确定要退出吗?

# taskService.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否

# taskService.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
zh_hans: 是

# miGettingStarted
source: Getting &&Started
de: Erste &&Schritte
es: I&&ntroducción
fr: Pri&&se en main
it: &&Introduzione
ja: はじめに(&&S)
ko: 시작(&S)
pt_br: I&&ntrodução
zh_hans: 入门(&&S)

# showReleaseNotes
source: Show Getting Started
de: "Erste Schritte" anzeigen
es: Ver introducción
fr: Afficher la prise en main
it: Mostra introduzione
ja: 「はじめに」を表示する
ko: 시작 표시
pt_br: Mostrar Introdução
zh_hans: 显示入门指南

# recommendedExtensions
source: Marketplace
fr: Place de marché
ja: マーケット プレース
zh_hans: 市场

# profilerInput.profiler
source: Profiler
ja: プロファイラー
zh_hans: 探查器

# scriptKustoSelect
source: Take 10
de: 10 zurückgeben
fr: Prendre 10
ja: 10 個
pt_br: Levar 10
zh_hans: 选取 10 个

# label.matchesLocation
source: {0} of {1}
de: {0} von {1}
es: {0} de {1}
fr: {0} sur {1}
it: {0} di {1}
ja: {0}/{1} 件
pt_br: {0} de {1}
zh_hans: {0} 个(共 {1} 个)

source: Notebook
ja: ノートブック
zh_hans: 笔记本

# queryHistoryConfigurationTitle
source: QueryHistory
de: Abfrageverlauf
es: Historial de consultas
it: Cronologia query
ja: クエリ履歴

# profilerColumnDialog.profiler
source: Profiler
ja: プロファイラー
zh_hans: 探查器

# buttonBold
source: Bold
es: Negrita
fr: Gras
pt_br: Negrito
zh_hans: 加粗

# buttonCode
source: Code
es: Código
pt_br: Código
zh_hans: 代码

# buttonHighlight
source: Highlight
es: Resaltar
fr: Recommandation
pt_br: Realçar
zh_hans: 突出显示

# buttonImage
source: Image
es: Imagen
pt_br: Imagem
zh_hans: 图像

# buttonItalic
source: Italic
es: Cursiva
fr: Italique
pt_br: Itálico
zh_hans: 倾斜

# buttonLink
source: Link
es: Vínculo
fr: Lien
pt_br: Vínculo
zh_hans: 链接

# buttonList
source: List
es: Lista
fr: Liste
pt_br: Lista
zh_hans: 列表

# buttonOrderedList
source: Ordered list
es: Lista ordenada
fr: Liste triée
pt_br: Lista ordenada
zh_hans: 已排序列表

# buttonUnderline
source: Underline
es: Subrayado
fr: Souligné
pt_br: Sublinhado
zh_hans: 下划线

# callout.insertImageHeading
source: Insert image
es: Inserción de una imagen
fr: Insérer une image
pt_br: Inserir imagem
zh_hans: 插入图像

# callout.insertLinkHeading
source: Insert link
es: Inserción de un vínculo
fr: Insérer un lien
pt_br: Inserir link
zh_hans: 插入链接

source: Profiler
zh_hans: 探查器

# welcomePage.sqlServerDacpac
source: SQL Server Dacpac
fr: Package DAC SQL Server
