Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# propertiesContainerPropertyValue
source: Color for property values displayed in the properties container component
de: Farbe für Eigenschaftswerte, die in der Eigenschaftencontainerkomponente angezeigt werden
es: Color de los valores de propiedad que se muestran en el componente de contenedor de propiedades
fr: Couleur des valeurs de propriété affichées dans le composant conteneur des propriétés
it: Colore per i valori delle proprietà visualizzati nel componente del contenitore delle proprietà
ja: プロパティ コンテナー コンポーネントに表示されるプロパティ色の値
ko: 속성 컨테이너 구성 요소에 표시되는 속성 값의 색
pt_br: Cor dos valores de propriedade exibidos no componente contêiner de propriedades
zh_hans: 属性容器组件中显示的属性值的颜色

# toolbarOverflowShadow
source: Toolbar overflow shadow color
de: Schattenfarbe für Symbolleistenüberlauf
es: Color de sombra del texto de desbordamiento de la barra de herramientas
fr: Couleur d’ombre de dépassement de la barre d’outils
it: Colore ombra overflow barra degli strumenti
ja: ツールバーのオーバーフローの影の色
ko: 도구 모음 오버플로 그림자 색
pt_br: Cor da sombra do estouro de barra de ferramentas
zh_hans: 工具栏溢出阴影颜色

# verticalTabActiveBackground
source: Active tab background color for vertical tabs
de: Hintergrundfarbe für aktive Registerkarten für vertikale Tabstopps
es: Color de fondo de la pestaña activa para pestañas verticales
fr: Couleur d’arrière-plan de l’onglet actif pour les onglets verticaux
it: Colore di sfondo della scheda attiva per le schede verticali
ja: 垂直タブのアクティブなタブの背景色
ko: 세로 탭의 활성 탭 배경색
pt_br: Cor da tela de fundo da guia ativa para guias verticais
zh_hans: 垂直选项卡的活动选项卡背景色

# carbon.extension.contributes.account
source: Contributes icons to account provider.
de: Stellt Symbole für den Kontoanbieter zur Verfügung.
es: Aporta iconos al proveedor de la cuenta.
fr: Ajoute des icônes à un fournisseur de compte.
it: Aggiunge come contributo le icone al provider di account.
ja: アカウント プロバイダーにアイコンを提供します。
ko: 계정 공급자에게 아이콘을 제공합니다.
pt_br: Contribui ícones para provedor de conta.
zh_hans: 向帐户提供者提供图标。

# carbon.extension.contributes.account.icon
source: (Optional) Icon which is used to represent the accpunt in the UI. Either a file path or a themable configuration
de: (Optional) Symbol zur Darstellung des Kontos in der Benutzeroberfläche. Es handelt sich entweder um einen Dateipfad oder um eine designfähige Konfiguration.
es: (Opcional) El icono que se usa para representar la cuenta en la IU. Una ruta de acceso al archivo o una configuración con temas
fr: (Facultatif) Icône utilisée pour représenter le compte dans l'interface utilisateur. Peut être un chemin de fichier ou une configuration à thèmes
it: (Facoltativa) Icona usata per rappresentare l'account nell'interfaccia utente. Percorso di file o configurazione che supporta i temi
ja: (省略可能) UI の accpunt を表すために使用するアイコン。ファイル パスまたはテーマを設定可能な構成のいずれかです
ko: (옵션) UI에서 명령을 나타내는 데 사용되는 아이콘입니다. 파일 경로 또는 테마 지정 가능 구성입니다.
pt_br: (Opcional) Ícone que é usado para representar o accpunt na interface do usuário. Um caminho de arquivo ou uma configuração tematizáveis
zh_hans: (可选) UI 中用于表示帐户的图标。可以是文件路径或可设置主题的配置

# carbon.extension.contributes.account.icon.dark
source: Icon path when a dark theme is used
de: Symbolpfad, wenn ein dunkles Design verwendet wird
es: Ruta de icono cuando se usa un tema oscuro
fr: Chemin de l'icône quand un thème foncé est utilisé
it: Percorso dell'icona quando viene usato un tema scuro
ja: 暗いテーマを使用した場合のアイコンのパス
ko: 어두운 테마를 사용하는 경우의 아이콘 경로
pt_br: Caminho de ícone quando um tema escuro é usado
zh_hans: 使用深色主题时的图标路径

# carbon.extension.contributes.account.icon.light
source: Icon path when a light theme is used
de: Symbolpfad, wenn ein helles Design verwendet wird
es: Ruta del icono cuando se usa un tema ligero
fr: Chemin de l'icône quand un thème clair est utilisé
it: Percorso dell'icona quando viene usato un tema chiaro
ja: 明るいテーマを使用した場合のアイコンのパス
ko: 밝은 테마를 사용하는 경우의 아이콘 경로
pt_br: Caminho do ícone quando um tema leve é usado
zh_hans: 使用浅色主题时的图标路径

# carbon.extension.contributes.account.id
source: Identifier of the account type
de: Bezeichner des Kontotyps
es: Identificador del tipo de cuenta
fr: Identificateur du type de compte
it: Identificatore del tipo di account
ja: アカウントの種類の識別子
ko: 계정 유형 식별자
pt_br: Identificador do tipo de conta
zh_hans: 帐户类型的标识符

# asmtaction.database.getitems
source: View applicable rules for {0}
de: Anwendbare Regeln für "{0}" anzeigen
es: Ver reglas aplicables para {0}
fr: Voir les règles applicables à {0}
it: Visualizza regole applicabili per {0}
ja: {0} に適用可能な規則を表示する
ko: {0}에 적용 가능한 규칙 보기
pt_br: Exibir regras aplicáveis para {0}
zh_hans: 查看 {0} 的适用规则

# asmtaction.database.invokeitems
source: Invoke Assessment for {0}
de: Bewertung für "{0}" aufrufen
es: Invocar evaluación para {0}
fr: Appeler l'évaluation pour {0}
it: Richiama valutazione per {0}
ja: {0} の評価の呼び出し
ko: {0}의 평가 호출
pt_br: Invocar Avaliação para {0}
zh_hans: 调用 {0} 的评估

# asmtaction.exportasscript
source: Export As Script
de: Als Skript exportieren
es: Exportar como script
fr: Exporter sous forme de script
it: Esporta come script
ja: スクリプトとしてエクスポート
ko: 스크립트로 내보내기
pt_br: Exportar como Script
zh_hans: 导出为脚本

# asmtaction.generatehtmlreport
source: Create HTML Report
de: HTML-Bericht erstellen
es: Crear informe en HTML
fr: Créer un rapport HTML
it: Crea report HTML
ja: HTML レポートの作成
ko: HTML 보고서 만들기
pt_br: Criar Relatório HTML
zh_hans: 创建 HTML 报表

# asmtaction.label.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# asmtaction.label.open
source: Open
de: Öffnen
es: Abrir
fr: Ouvrir
it: Apri
ja: 開く
ko: 열기
pt_br: Abrir
zh_hans: 打开

# asmtaction.openReport
source: Report has been saved. Do you want to open it?
de: Der Bericht wurde gespeichert. Möchten Sie ihn öffnen?
es: El informe se ha guardado. ¿Quiere abrirlo?
fr: Le rapport a été enregistré. Voulez-vous l'ouvrir ?
it: Il report è stato salvato. Aprirlo?
ja: レポートが保存されました。開きますか?
ko: 보고서가 저장되었습니다. 열어보시겠습니까?
pt_br: O relatório foi salvo. Deseja abri-lo?
zh_hans: 已保存报表。是否要打开它?

# asmtaction.server.getitems
source: View applicable rules
de: Anwendbare Regeln anzeigen
es: Ver reglas aplicables
fr: Voir les règles applicables
it: Visualizza regole applicabili
ja: 適用可能な規則を表示する
ko: 적용 가능한 규칙 보기
pt_br: Exibir regras aplicáveis
zh_hans: 查看适用规则

# asmtaction.server.invokeitems
source: Invoke Assessment
de: Bewertung aufrufen
es: Invocar evaluación
fr: Appeler l'évaluation
it: Richiama valutazione
ja: 評価の呼び出し
ko: 평가 호출
pt_br: Invocar Avaliação
zh_hans: 调用评估

# asmtaction.showsamples
source: View all rules and learn more on GitHub
de: Alle Regeln anzeigen und weitere Informationen auf GitHub erhalten
es: Ver todas las reglas y obtener más información en GitHub
fr: Voir toutes les règles et en savoir plus sur GitHub
it: Visualizza tutte le regole e altre informazioni su GitHub
ja: すべての規則を表示し、GitHub の詳細を確認する
ko: GitHub에서 모든 규칙 보기 및 자세히 알아보기
pt_br: Veja todas as regras e saiba mais no GitHub
zh_hans: 查看所有规则并了解有关 GitHub 的详细信息

# asmt.NoResultsInitial
source: Nothing to show. Invoke assessment to get results
de: Keine Elemente zur Anzeige vorhanden. Rufen Sie die Bewertung auf, um Ergebnisse zu erhalten.
es: No hay nada que mostrar. Invoque una evaluación para obtener resultados.
fr: Rien à afficher. Appeler l'évaluation pour obtenir des résultats
it: Niente da mostrare. Richiamare la valutazione per ottenere risultati
ja: 表示するものがありません。評価を呼び出して結果を取得します
ko: 표시할 내용이 없습니다. 평가를 호출하여 결과를 가져옵니다.
pt_br: Nada para mostrar. Invoque a avaliação para obter resultados
zh_hans: 没有要显示的内容。请调用评估以获取结果

# asmt.TargetDatabaseComplient
source: Database {0} is totally compliant with the best practices. Good job!
de: Die Datenbank "{0}" entspricht vollständig den empfohlenen Methoden. Gut gemacht!
es: La base de datos {0} es totalmente conforme con los procedimientos recomendados. ¡Buen trabajo!
fr: La base de données {0} est totalement conforme aux bonnes pratiques. Bon travail !
it: Il database {0} è totalmente conforme alle procedure consigliate. Ottimo lavoro!
ja: データベース {0} は、ベスト プラクティスに完全に準拠しています。お疲れさまでした。
ko: {0} 데이터베이스는 모범 사례를 완전히 준수합니다. 잘하셨습니다!
pt_br: O banco de dados {0} está em total conformidade com as práticas recomendadas. Bom trabalho!
zh_hans: 数据库 {0} 完全符合最佳做法。非常棒!

# asmt.TargetInstanceComplient
source: Instance {0} is totally compliant with the best practices. Good job!
de: Die Instanz "{0}" entspricht vollständig den empfohlenen Methoden. Gut gemacht!
es: La instancia de {0} es totalmente conforme con los procedimientos recomendados. ¡Buen trabajo!
fr: L'instance {0} est entièrement conforme aux bonnes pratiques. Bon travail !
it: L'istanza {0} è totalmente conforme alle procedure consigliate. Ottimo lavoro!
ja: インスタンス {0} は、ベスト プラクティスに完全に準拠しています。お疲れさまでした。
ko: {0} 인스턴스는 모범 사례를 완전히 준수합니다. 잘하셨습니다!
pt_br: A instância {0} está em total conformidade com as práticas recomendadas. Bom trabalho!
zh_hans: 实例 {0} 完全符合最佳做法。非常棒!

# asmt.column.displayName
source: Display Name
de: Anzeigename
es: Nombre para mostrar
fr: Nom d'affichage
it: Nome visualizzato
ja: 表示名
ko: 표시 이름
pt_br: Nome de Exibição
zh_hans: 显示名称

# asmt.column.severity
source: Severity
de: Schweregrad
es: Gravedad
fr: Gravité
it: Gravità
ja: 重大度
ko: 심각도
pt_br: Severidade
zh_hans: 严重性

# asmt.column.target
source: Target
de: Ziel
es: Destino
fr: Cible
it: Destinazione
ja: ターゲット
ko: 대상
pt_br: Destino
zh_hans: 目标

# asmt.apiversion
source: API Version:
es: Versión de API:
fr: Version d'API :
it: Versione API:
ja: API バージョン:
ko: API 버전:
pt_br: Versão da API:
zh_hans: API 版本:

# asmt.column.checkId
source: Check ID
de: ID überprüfen
es: Comprobar id.
fr: Vérifier l'ID
it: ID controllo
ja: ID の確認
ko: 확인 ID
pt_br: Verificar ID
zh_hans: 检查 ID

# asmt.column.helpLink
source: Help Link
de: Hilfelink
es: Vínculo de ayuda
fr: Lien d'aide
it: Collegamento alla Guida
ja: ヘルプ リンク
ko: 도움말 링크
pt_br: Link da Ajuda
zh_hans: 帮助链接

# asmt.column.message
source: Message
de: Meldung
es: Mensaje
it: Messaggio
ja: メッセージ
ko: 메시지
pt_br: Mensagem
zh_hans: 消息

# asmt.column.tags
source: Tags
es: Etiquetas
fr: Étiquettes
it: Tag
ja: タグ
ko: 태그
pt_br: Marcas
zh_hans: 标记

# asmt.instancename
source: Instance Name:
de: Instanzname:
es: Nombre de la instancia:
fr: Nom de l'instance :
it: Nome istanza:
ja: インスタンス名:
ko: 인스턴스 이름:
pt_br: Nome da Instância:
zh_hans: 实例名:

# asmt.learnMore
source: Learn More
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Saiba Mais
zh_hans: 了解更多

# asmt.osversion
source: OS Version:
de: Betriebssystemversion:
es: Versión del sistema operativo:
fr: Version de système d'exploitation :
it: Versione del sistema operativo:
ja: OS バージョン
ko: OS 버전:
pt_br: Versão do SO:
zh_hans: OS 版本:

# asmt.rulesetversion
source: Default Ruleset Version:
de: Standardversion für Regelsatz:
es: Versión predeterminada del conjunto de reglas:
fr: Version de l'ensemble de règles par défaut :
it: Versione predefinita del set di regole:
ja: 既定のルールセット バージョン:
ko: 기본 규칙 집합 버전:
pt_br: Versão do RuleSet Padrão:
zh_hans: 默认规则集版本:

# asmt.section.api.title
source: API information
de: API-Informationen
es: Información de API
fr: Informations d'API
it: Informazioni API
ja: API 情報
ko: API 정보
pt_br: Informações da API
zh_hans: API 信息

# asmt.section.instance.title
source: SQL Server Instance Details
de: Details zur SQL Server-Instanz
es: Detalles de la instancia de SQL Server
fr: Détails de l'instance SQL Server
it: Dettagli dell'istanza di SQL Server
ja: SQL Server インスタンスの詳細
ko: SQL Server 인스턴스 세부 정보
pt_br: Detalhes da Instância do SQL Server
zh_hans: SQL Server 实例详细信息

# asmt.serveredition
source: Edition:
es: Edición:
fr: Édition :
it: Edizione:
ja: エディション:
ko: 버전:
pt_br: Edição:
zh_hans: 版本类别:

# asmt.serverversion
source: Version:
es: Versión:
it: Versione:
ja: バージョン:
ko: 버전:
pt_br: Versão:
zh_hans: 版本:

# asmt.sqlReport.Error
source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pt_br: Erro
zh_hans: 错误

# asmt.sqlReport.Info
source: Information
es: Información
fr: Informations
it: Informazioni
ja: 情報
ko: 정보
pt_br: Informações
zh_hans: 信息

# asmt.sqlReport.Warning
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
it: Avviso
ja: 警告
ko: 경고
pt_br: Aviso
zh_hans: 警告

# asmt.sqlReport.resultForDatabase
source: Results for database
de: Ergebnisse für Datenbank
es: Resultados de la base de datos
fr: Résultats pour la base de données
it: Risultati per il database
ja: データベースの結果
ko: 데이터베이스에 대한 결과
pt_br: Resultados do banco de dados
zh_hans: 数据库结果

# asmt.sqlReport.resultForInstance
source: Results for server
de: Ergebnisse für Server
es: Resultados del servidor
fr: Résultats pour le serveur
it: Risultati per il server
ja: サーバーの結果
ko: 서버에 대한 결과
pt_br: Resultados do servidor
zh_hans: 服务器结果

# asmt.sqlReport.severityMsg
source: {0}: {1} item(s)
de: {0}: {1} Element(e)
es: {0}: {1} elemento(s)
fr: {0} : {1} élément(s)
it: {0}: {1} elemento/i
ja: {0}: {1} 項目
ko: {0}: {1}개 항목
pt_br: {0}: {1} itens
zh_hans: {0}: {1} 个项

# asmt.sqlReportTitle
source: SQL Assessment Report
de: SQL-Bewertungsbericht
es: Informe de SQL Assessment
fr: Rapport SQL Assessment
it: Report di valutazione SQL
ja: SQL Assessment レポート
ko: SQL 평가 보고서
pt_br: Relatório de Avaliação do SQL
zh_hans: SQL 评估报表

# azure.openInAzurePortal.title
source: Open in Azure Portal
de: In Azure-Portal öffnen
es: Abrir en Azure Portal
fr: Ouvrir dans le portail Azure
it: Apri nel portale di Azure
ja: Azure Portal で開きます
ko: Azure Portal에서 열기
pt_br: Abrir no Portal do Azure
zh_hans: 在 Azure 门户中打开

# addFile
source: Add a file
de: Datei hinzufügen
es: Agregar un archivo
fr: Ajouter un fichier
it: Aggiungi un file
ja: ファイルを追加
ko: 파일 추가
pt_br: Adicionar um arquivo
zh_hans: 添加文件

# backup.advancedConfiguration
source: Advanced Configuration
de: Erweiterte Konfiguration
es: Configuración avanzada
fr: Configuration avancée
it: Configurazione avanzata
ja: 高度な構成
ko: 고급 구성
pt_br: Configuração Avançada
zh_hans: 高级配置

# backup.algorithm
source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
it: Algoritmo
ja: アルゴリズム
ko: 알고리즘
pt_br: Algoritmo
zh_hans: 算法

# backup.backupDevice
source: Backup files
de: Sicherungsdateien
es: Archivos de copia de seguridad
fr: Fichiers de sauvegarde
it: File di backup
ja: バックアップ ファイル
ko: 백업 파일
pt_br: Arquivos de backup
zh_hans: 备份文件

# backup.backupFileRequired
source: Backup file path is required
de: Der Pfad für die Sicherungsdatei muss angegeben werden.
es: La ruta del archivo de copia de seguridad es obligatoria
fr: Le chemin du fichier de sauvegarde est obligatoire
it: Il percorso del file di backup è obbligatorio
ja: バックアップ ファイルのパスが必須です
ko: 백업 파일 경로가 필요합니다.
pt_br: O caminho do arquivo de backup é obrigatório
zh_hans: 需要备份文件路径

# backup.backupName
source: Backup name
es: Nombre de copia de seguridad
fr: Nom de la sauvegarde
it: Nome del backup
ja: バックアップ名
ko: 백업 이름
pt_br: Nome do backup
zh_hans: 备份名称

# backup.backupTail
source: Backup the tail of the log
de: Sicherung des Protokollfragments
es: Hacer copia de seguridad de la cola del registro
fr: Sauvegarder la fin du journal
it: Esegui il backup della coda del log
ja: ログ末尾のバックアップ
ko: 비상 로그 백업
pt_br: Backup do final do log
zh_hans: 备份日志的末尾

# backup.backupType
source: Backup type
de: Sicherungstyp
es: Tipo de copia de seguridad
fr: Type de sauvegarde
it: Tipo di backup
ja: バックアップの種類
ko: 백업 유형
pt_br: Tipo de backup
zh_hans: 备份类型

# backup.certificateOrAsymmetricKey
source: Certificate or Asymmetric key
de: Zertifikat oder asymmetrischer Schlüssel
es: Certificado o clave asimétrica
fr: Certificat ou clé asymétrique
it: Certificato o chiave asimmetrica
ja: 証明書または非対称キー
ko: 인증서 또는 비대칭 키
pt_br: Chave de Certificado ou Assimétrica
zh_hans: 证书或非对称密钥

# backup.checksumContainer
source: Perform checksum before writing to media
de: Vor dem Schreiben auf Medium Prüfsumme berechnen
es: Realizar la suma de comprobación antes de escribir en los medios
fr: Effectuer la somme de contrôle avant d'écrire sur le support
it: Esegui il checksum prima della scrittura sui supporti
ja: メディアに書き込む前にチェックサムを行う
ko: 미디어에 쓰기 전에 체크섬 수행
pt_br: Executar soma de verificação antes de gravar na mídia
zh_hans: 在写入到媒体前执行校验和

# backup.compression
source: Compression
de: Komprimierung
es: Compresión
it: Compressione
ja: 圧縮
ko: 압축
pt_br: Compactação
zh_hans: 压缩

# backup.containsBackupToUrlError
source: Only backup to file is supported
de: Es wird nur das Sichern in einer Datei unterstützt.
es: Solo se admite la copia de seguridad en un archivo
fr: Seule la sauvegarde dans un fichier est prise en charge
it: È supportato solo il backup su file
ja: ファイルへのバックアップのみがサポートされています
ko: 파일로 백업만 지원됩니다.
pt_br: Apenas backup para arquivo é compatível
zh_hans: 只支持备份到文件

# backup.continueOnErrorContainer
source: Continue on error
de: Bei Fehler fortsetzen
es: Seguir en caso de error
fr: Continuer en cas d'erreur
it: Continua in caso di errore
ja: エラー時に続行
ko: 오류 발생 시 계속
pt_br: Continuar em caso de erro
zh_hans: 出错时继续

# backup.copyOnly
source: Copy-only backup
de: Kopiesicherung
es: Copia de seguridad de solo copia
fr: Sauvegarde de copie uniquement
it: Backup di sola copia
ja: コピーのみのバックアップ
ko: 복사 전용 백업
pt_br: Backup somente cópia
zh_hans: 仅限复制的备份

# backup.encryption
source: Encryption
de: Verschlüsselung
es: Cifrado
fr: Chiffrement
it: Crittografia
ja: 暗号化
ko: 암호화
pt_br: Criptografia
zh_hans: 加密

# backup.existingMediaAppend
source: Append to the existing backup set
de: An vorhandenem Sicherungssatz anhängen
es: Añadir al conjunto de copia de seguridad existente
fr: Ajouter au jeu de sauvegarde existant
it: Accoda al set di backup esistente
ja: 既存のバックアップ セットに追加
ko: 기존 백업 세트에 추가
pt_br: Acrescentar ao conjunto de backup existente
zh_hans: 追加到现有备份集

# backup.existingMediaOverwrite
source: Overwrite all existing backup sets
de: Alle vorhandenen Sicherungssätze überschreiben
es: Sobrescribir todos los conjuntos de copia de seguridad existentes
fr: Remplacer tous les jeux de sauvegarde existants
it: Sovrascrivi tutti i set di backup esistenti
ja: 既存のすべてのバックアップ セットを上書きする
ko: 모든 기존 백업 세트 덮어쓰기
pt_br: Substituir todos os conjuntos de backup existentes
zh_hans: 覆盖所有现有备份集

# backup.expiration
source: Expiration
de: Ablauf
es: Expiración
it: Scadenza
ja: 有効期限
ko: 만료
pt_br: Expiração
zh_hans: 有效期

# backup.media
source: Media
de: Medien
es: Multimedia
fr: Support
it: Supporti
ja: メディア
ko: 미디어
pt_br: Mídia
zh_hans: 媒体

# backup.mediaNameRequired
source: Media name is required
de: Der Name des Mediums muss angegeben werden.
es: El nombre del medio es obligatorio
fr: Le nom de support est obligatoire
it: Il nome del supporto è obbligatorio
ja: メディア名が必須です
ko: 미디어 이름이 필요합니다.
pt_br: O nome da mídia é obrigatório
zh_hans: 需要媒体名称

# backup.mediaOption
source: Backup to the existing media set
de: Sicherung im vorhandenen Mediensatz
es: Realizar la copia de seguridad sobre el conjunto de medios existente
fr: Sauvegarder sur le support de sauvegarde existant
it: Esegui il backup sul set di supporti esistente
ja: 既存のメディア セットにバックアップ
ko: 기존 미디어 세트에 백업
pt_br: Backup para o conjunto de mídias existente
zh_hans: 备份到现有媒体集

# backup.mediaOptionFormat
source: Backup to a new media set
de: Sicherung in einem neuen Mediensatz
es: Realizar copia de seguridad en un nuevo conjunto de medios
fr: Sauvegarder sur un nouveau support de sauvegarde
it: Esegui il backup su un nuovo set di supporti
ja: 新しいメディア セットにバックアップ
ko: 새 미디어 세트에 백업
pt_br: Backup para um novo conjunto de mídias
zh_hans: 备份到新的媒体集

# backup.newMediaSetDescription
source: New media set description
de: Beschreibung des neuen Mediensatzes
es: Nueva descripción del conjunto de medios
fr: Description du nouveau support de sauvegarde
it: Descrizione del nuovo set di supporti
ja: 新しいメディア セットの説明
ko: 새 미디어 세트 설명
pt_br: Nova descrição do conjunto de mídias
zh_hans: 新建媒体集说明

# backup.newMediaSetName
source: New media set name
de: Name des neuen Mediensatzes
es: Nuevo nombre de conjunto de medios
fr: Nom du nouveau support de sauvegarde
it: Nome del nuovo set di supporti
ja: 新しいメディア セット名
ko: 새 미디어 세트 이름
pt_br: Novo nome do conjunto de mídias
zh_hans: 新建媒体集名称

# backup.noEncryptorWarning
source: No certificate or asymmetric key is available
de: Es ist kein Zertifikat oder asymmetrischer Schlüssel verfügbar.
es: No hay certificado o clave asimétrica disponible
fr: Aucun certificat ni clé asymétrique n'est disponible
it: Non sono disponibili certificati o chiavi asimmetriche
ja: 使用可能な証明書または非対称キーがありません
ko: 사용 가능한 인증서 또는 비대칭 키가 없습니다.
pt_br: Nenhum certificado ou chave assimétrica está disponível
zh_hans: 没有可用的证书或非对称密钥

# backup.recoveryModel
source: Recovery model
de: Wiederherstellungsmodell
es: Modelo de recuperación
fr: Mode de récupération
it: Modello di recupero
ja: 復旧モデル
ko: 복구 모델
pt_br: Modelo de recuperação
zh_hans: 恢复模式

# backup.reliability
source: Reliability
de: Zuverlässigkeit
es: Fiabilidad
fr: Fiabilité
it: Affidabilità
ja: 信頼性
ko: 안정성
pt_br: Confiabilidade
zh_hans: 可靠性

# backup.setBackupCompression
source: Set backup compression
de: Sicherungskomprimierung festlegen
es: Establecer la compresión de copia de seguridad
fr: Définir la compression de sauvegarde
it: Imposta la compressione del backup
ja: バックアップの圧縮の設定
ko: 백업 압축 설정
pt_br: Definir a compactação de backup
zh_hans: 设置备份压缩

# backup.setBackupRetainDays
source: Set backup retain days
de: Aufbewahrungsdauer der Sicherung in Tagen festlegen
es: Configure los días de conservación de la copia de seguridad
fr: Définir le délai de conservation de sauvegarde en jours
it: Imposta i giorni di mantenimento del backup
ja: バックアップ保持日数の設定
ko: 백업 보존 기간(일) 설정
pt_br: Defina os dias de retenção de backup
zh_hans: 设置备份保留天数

# backup.transactionLog
source: Transaction log
de: Transaktionsprotokoll
es: Registro de transacciones
fr: Journal des transactions
it: Log delle transazioni
ja: トランザクション ログ
ko: 트랜잭션 로그
pt_br: Log de transações
zh_hans: 事务日志

# backup.truncateTransactionLog
source: Truncate the transaction log
de: Transaktionsprotokoll abschneiden
es: Truncar el registro de transacciones
fr: Tronquer le journal des transactions
it: Tronca il log delle transazioni
ja: トランザクション ログの切り捨て
ko: 트랜잭션 로그 잘라내기
pt_br: Truncar o log de transações
zh_hans: 截断事务日志

# backup.verifyContainer
source: Verify backup when finished
de: Sicherung nach Abschluss überprüfen
es: Comprobar copia de seguridad cuando haya terminado
fr: Vérifier la sauvegarde une fois terminée
it: Verifica il backup al termine
ja: 完了時にバックアップを検証する
ko: 완료되면 백업 확인
pt_br: Verificar backup quando terminar
zh_hans: 完成后验证备份

# backupComponent.backup
source: Backup
de: Sicherung
es: Copia de seguridad
fr: Sauvegarder
ja: バックアップ
ko: 백업
zh_hans: 备份

# backupComponent.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# backupComponent.invalidInput
source: Invalid input. Value must be greater than or equal 0.
de: Ungültige Eingabe. Wert muss größer oder gleich 0 sein.
es: Entrada no válida. El valor debe ser igual o mayor que 0.
fr: Entrée non valide. La valeur doit être supérieure ou égale à 0.
it: Input non valido. Il valore deve essere maggiore o uguale a 0.
ja: 入力が無効です。値は 0 以上でなければなりません。
ko: 잘못된 입력입니다. 값은 0보다 크거나 같아야 합니다.
pt_br: Entrada inválida. O valor deve ser maior ou igual a 0.
zh_hans: 输入无效。值必须大于或等于 0。

# backupComponent.script
source: Script
de: Skript
ja: スクリプト
ko: 스크립트
zh_hans: 脚本

# removeFile
source: Remove files
de: Dateien entfernen
es: Eliminar archivos
fr: Supprimer les fichiers
it: Rimuovi file
ja: ファイルを削除
ko: 파일 제거
pt_br: Remover arquivos
zh_hans: 删除文件

source: Backup
de: Sicherung
es: Copia de seguridad
fr: Sauvegarder
ja: バックアップ
ko: 백업
zh_hans: 备份
