Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# profiler.findPrevious
source: Find Previous String
de: Vorhergehende Zeichenfolge suchen
es: Buscar la cadena anterior
fr: Rechercher la chaîne précédente
it: Trova la stringa precedente
ja: 前の文字列を検索
ko: 이전 문자열 찾기
pt_br: Encontrar Cadeia de Caracteres Anterior
zh_hans: 查找上一个字符串

# profiler.toggleCollapsePanel
source: Toggle Collapsed Panel
de: Ausgeblendeten Bereich umschalten
es: Alternar el panel contraído
fr: Afficher/masquer le panneau réduit
it: Attiva/Disattiva pannello compresso
ja: 折りたたんだパネルを切り替える
ko: 축소된 패널로 전환
pt_br: Alternar Painel Recolhido
zh_hans: 切换已折叠的面板

# profilerAction.autoscrollOff
source: Auto Scroll: Off
de: Automatisches Scrollen: Aus
es: Desplazamiento automático: desactivado
fr: Défilement automatique : désactivé
it: Scorrimento automatico: disattivato
ja: 自動スクロール: オフ
ko: 자동 스크롤: 끄기
pt_br: Rolagem Automática: Desativada
zh_hans: 自动滚动: 关

# profilerAction.autoscrollOn
source: Auto Scroll: On
de: Automatisches Scrollen: Ein
es: Desplazamiento automático: activado
fr: Défilement automatique : activé
it: Scorrimento automatico: attivato
ja: 自動スクロール: オン
ko: 자동 스크롤: 켜기
pt_br: Rolagem Automática: Ativada
zh_hans: 自动滚动: 开

# profilerAction.connect
source: Connect
de: Verbinden
es: Conectar
fr: Connecter
it: Connetti
ja: 接続
ko: 연결
pt_br: Conectar
zh_hans: 连接

# profilerAction.disconnect
source: Disconnect
de: Trennen
es: Desconectar
fr: Déconnecter
it: Disconnetti
ja: 切断
ko: 연결 끊기
pt_br: Desconectar
zh_hans: 断开连接

# profilerAction.newProfiler
source: Launch Profiler
de: Profiler starten
es: Iniciar Profiler
fr: Lancer Profiler
it: Avvia profiler
ja: Profiler を起動
ko: Profiler 시작
pt_br: Iniciar Profiler
zh_hans: 启动探查器

# profilerAction.pauseCapture
source: Pause
de: Anhalten
es: Pausar
fr: Suspendre
it: Sospendi
ja: 一時停止
ko: 일시 중지
pt_br: Pausar
zh_hans: 暂停

# profilerAction.resumeCapture
source: Resume
de: Fortsetzen
es: Reanudar
fr: Reprendre
it: Riprendi
ja: 再開
ko: 재개
pt_br: Continuar
zh_hans: 继续

# profilerStop.stop
source: Stop
de: Beenden
es: Detener
fr: Arrêter
it: Arresta
ja: 停止
ko: 중지
pt_br: Parar
zh_hans: 停止

source: Start
de: Starten
es: Inicio
fr: Démarrer
it: Avvia
ja: 開始
ko: 시작
pt_br: Início
zh_hans: 开始

source: Details
es: Detalles
fr: Détails
it: Dettagli
ja: 詳細
ko: 세부 정보
pt_br: Detalhes
zh_hans: 详细信息

source: Label
de: Beschriftung
es: Etiqueta
fr: Étiquette
it: Etichetta
ja: ラベル
ko: 레이블
pt_br: Rótulo
zh_hans: 标签

# profiler.sessionSelectAccessibleName
source: Select Session
de: Sitzung auswählen
es: Seleccionar sesión
fr: Sélectionner une session
it: Seleziona sessione
ja: セッションの選択
ko: 세션 선택
pt_br: Selecionar Sessão
zh_hans: 选择会话

# profiler.sessionSelectLabel
source: Select Session:
de: Sitzung auswählen:
es: Seleccionar sesión:
fr: Sélectionner une session :
it: Seleziona sessione:
ja: セッションを選択:
ko: 세션 선택:
pt_br: Selecionar Sessão:
zh_hans: 选择会话:

# profiler.viewSelectAccessibleName
source: Select View
de: Ansicht auswählen
es: Seleccionar vista
fr: Sélectionner une vue
it: Seleziona visualizzazione
ja: ビューの選択
ko: 뷰 선택
pt_br: Selecionar Exibição
zh_hans: 选择视图

# profiler.viewSelectLabel
source: Select View:
de: Ansicht auswählen:
es: Seleccionar vista:
fr: Sélectionner une vue :
it: Seleziona visualizzazione:
ja: ビューを選択:
ko: 뷰 선택:
pt_br: Selecionar Exibição:
zh_hans: 选择视图:

# profilerEditor.value
source: Value
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
ko: 값
pt_br: Valor
zh_hans: 值

# profilerTextEditorAriaLabel
source: Profiler editor for event text. Readonly
de: Profiler-Editor für Ereignistext (schreibgeschützt)
es: Editor de Profiler para el texto del evento. Solo lectura
fr: Editeur Profiler pour le texte d'événement. En lecture seule
it: Editor del profiler per il testo dell'evento. Di sola lettura
ja: イベント テキストの Profiler エディター。読み取り専用
ko: 이벤트 텍스트의 Profiler 편집기. 읽기 전용
pt_br: Editor do Profiler para o texto do evento .ReadOnly
zh_hans: 用于事件文本的探查器编辑器。只读

# ProfilerTableEditor.eventCount
source: Events: {0}
de: Ereignisse: {0}
es: Eventos: {0}
fr: Événements : {0}
it: Eventi: {0}
ja: イベント: {0}
ko: 이벤트: {0}
pt_br: Eventos: {0}
zh_hans: 事件: {0}

# ProfilerTableEditor.eventCountFiltered
source: Events (Filtered): {0}/{1}
de: Ereignisse (gefiltert): {0}/{1}
es: Eventos (filtrados): {0}/{1}
fr: Événements (filtrés) : {0}/{1}
it: Eventi (filtrati): {0}/{1}
ja: イベント (フィルター処理済み): {0}/{1}
ko: 이벤트(필터링됨): {0}/{1}
pt_br: Eventos (Filtrados): {0}/{1}
zh_hans: 事件(已筛选): {0}/{1}

# status.eventCount
source: Event Count
de: Ereignisanzahl
es: Recuento de eventos
fr: Nombre d'événements
it: Numero di eventi
ja: イベント数
ko: 이벤트 수
pt_br: Contagem de Eventos
zh_hans: 事件计数

source: Chart
de: Diagramm
es: Gráfico
fr: Graphique
it: Grafico
ja: グラフ
ko: 차트
pt_br: Gráfico
zh_hans: 图表

# jsonEncoding
source: Results encoding will not be saved when exporting to JSON, remember to save with desired encoding once file is created.
de: Die Ergebniscodierung wird beim Exportieren in JSON nicht gespeichert. Nachdem die Datei erstellt wurde, speichern Sie sie mit der gewünschten Codierung.
es: La codificación de los resultados no se guardará al realizar la exportación en JSON. Recuerde guardarlos con la codificación deseada una vez que se cree el archivo.
fr: L'encodage des résultats n'est pas enregistré quand vous les exportez au format JSON, n'oubliez pas d'enregistrer le fichier que vous créez avec l'encodage souhaité.
it: La codifica dei risultati non verrà salvata quando si esporta in JSON. Ricordarsi di salvare con la codifica desiderata dopo la creazione del file.
ja: JSON にエクスポートするときに結果のエンコードは保存されません。ファイルが作成されたら、目的のエンコードで保存することを忘れないでください。
ko: JSON으로 내보낼 때 결과 인코딩이 저장되지 않습니다. 파일이 만들어지면 원하는 인코딩으로 저장해야 합니다.
pt_br: A codificação de resultados não será salva ao exportar para JSON. Lembre-se de salvar com a codificação desejada após a criação do arquivo.
zh_hans: 导出到 JSON 时，将不会保存结果编码，请记得在创建文件后使用所需编码进行保存。

source: Maximize
de: Maximieren
es: Maximizar
fr: Maximiser
it: Ingrandisci
ja: 最大化
ko: 최대화
pt_br: Maximizar
zh_hans: 最大化

source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
it: Ripristina
ja: 復元
ko: 복원
pt_br: Restaurar
zh_hans: 还原

# saveToFileNotSupported
source: Save to file is not supported by the backing data source
de: Das Speichern in einer Datei wird von der zugrunde liegenden Datenquelle nicht unterstützt.
es: El origen de datos de respaldo no admite la opción Guardar en archivo
fr: L'enregistrement dans un fichier n'est pas pris en charge par la source de données de stockage
it: Il salvataggio nel file non è supportato dall'origine dati di supporto
ja: バッキング データ ソースでファイルへの保存はサポートされていません
ko: 백업 데이터 원본에서 파일로 저장하도록 지원하지 않습니다.
pt_br: Salvar em arquivo não é uma ação compatível com a fonte de dados de backup
zh_hans: 备份数据源不支持保存到文件

source: Visualizer
de: Schnellansicht
es: Visualizador
fr: Visualiseur
it: Visualizzatore
ja: ビジュアライザー
ko: 시각화 도우미
pt_br: Visualizador
zh_hans: 可视化工具

# alreadyConnected
source: A connection using engine {0} exists. To change please disconnect or change connection
de: Es besteht eine Verbindung über die Engine "{0}". Um die Verbindung zu ändern, trennen oder wechseln Sie die Verbindung.
es: Existe una conexión mediante el motor {0}. Para cambiar, por favor desconecte o cambie la conexión
fr: Une connexion qui utilise le moteur {0} existe déjà. Pour changer, déconnectez-vous ou changez de connexion
it: Esiste già una connessione che usa il motore {0}. Per cambiare, disconnettersi o cambiare connessione
ja: エンジン {0} を使用している接続が存在します。変更するには、切断するか、接続を変更してください
ko: {0} 엔진을 사용하는 연결이 존재합니다. 변경하려면 연결을 끊거나 연결을 변경하세요.
pt_br: Existe uma conexão usando o mecanismo {0}. Para alterar, desconecte ou altere a conexão
zh_hans: 使用引擎 {0} 的连接已存在。若要更改，请先断开或更改连接

# changeProvider
source: Change SQL language provider
de: SQL-Sprachanbieter ändern
es: Cambiar proveedor de lenguaje SQL
fr: Changer le fournisseur de langage SQL
it: Cambia provider del linguaggio SQL
ja: SQL 言語プロバイダーの変更
ko: SQL 언어 공급자 변경
pt_br: Alterar provedor de linguagem SQL
zh_hans: 更改 SQL 语言提供程序

# changeSqlProvider
source: Change SQL Engine Provider
de: SQL-Engine-Anbieter ändern
es: Cambiar el proveedor del motor SQL
fr: Changer le fournisseur de moteur SQL
it: Cambia provider del motore SQL
ja: SQL エンジン プロバイダーの変更
ko: SQL 엔진 공급자 변경
pt_br: Alterar Provedor de Mecanismo SQL
zh_hans: 更改 SQL 引擎提供程序

# chooseSqlLang
source: Choose SQL Language
de: SQL-Sprache auswählen
es: Elegir lenguaje SQL
fr: Choisir un langage SQL
it: Scegli linguaggio SQL
ja: SQL 言語の選択
ko: SQL 언어 선택
pt_br: Escolha a linguagem SQL
zh_hans: 选择 SQL 语言

# noEditor
source: No text editor active at this time
de: Momentan ist kein Text-Editor aktiv.
es: Ningún editor de texto activo en este momento
fr: Aucun éditeur de texte actif actuellement
it: Al momento non ci sono editor di testo attivi
ja: 現時点でアクティブなテキスト エディターはありません
ko: 현재 활성 텍스트 편집기 없음
pt_br: Nenhum editor de texto ativo neste momento
zh_hans: 当前没有活动的文本编辑器

# pickSqlProvider
source: Select Language Provider
de: Sprachanbieter auswählen
es: Seleccionar proveedor de lenguaje
fr: Sélectionner un fournisseur de langage
it: Seleziona provider del linguaggio
ja: 言語プロバイダーの選択
ko: 언어 공급자 선택
pt_br: Selecionar o Provedor de Linguagem
zh_hans: 选择语言提供程序

# status.query.flavor
source: SQL Language Flavor
de: SQL-Sprachvariante
es: Tipo de lenguaje SQL
fr: Saveur de langage SQL
it: Versione del linguaggio SQL
ja: SQL 言語のフレーバー
ko: SQL 언어 버전
pt_br: Variante de linguagem SQL
zh_hans: SQL 语言风格

source: Results grid
de: Ergebnisraster
es: Cuadrícula de resultados
fr: Grille de résultats
it: Griglia dei risultati
ja: 結果グリッド
ko: 결과 표
pt_br: Grade de resultados
zh_hans: 结果网格

# resultsGrid.maxRowCountExceeded
source: Max row count for filtering/sorting has been exceeded. To update it, navigate to User Settings and change the setting: 'queryEditor.results.inMemoryDataProcessingThreshold'
de: Die maximale Zeilenanzahl für das Filtern/Sortieren wurde überschritten. Navigieren Sie zu "Benutzereinstellungen", und ändern Sie die Einstellung "queryEditor.results.inMemoryDataProcessingThreshold", um sie zu aktualisieren.
es: Se ha superado el número máximo de filas para el filtrado y la ordenación. Para actualizarlo, vaya a Configuración de usuario y cambie la configuración: "queryEditor.results.inMemoryDataProcessingThreshold".
fr: Le nombre maximal de lignes pour le filtrage/tri a été dépassé. Pour le mettre à jour, accédez à Paramètres utilisateur et modifiez le paramètre : « queryEditor.results.inMemoryDataProcessingThreshold »
it: È stato superato il numero massimo di righe per il filtraggio o l'ordinamento. Per aggiornarlo, passare alle impostazioni utente e modificare l'impostazione 'queryEditor.results.inMemoryDataProcessingThreshold'
ja: フィルター/並べ替えに使用する行の最大数を超えました。更新するには、[ユーザーの設定] に移動し、設定を変更します: 'queryEditor.results.inMemoryDataProcessingThreshold'
ko: 필터링/정렬에 대한 최대 행 수가 초과되었습니다. 업데이트하려면 사용자 설정으로 이동하여 'queryEditor.results.inMemoryDataProcessingThreshold' 설정을 변경할 수 있습니다.
pt_br: A contagem máxima de linhas para filtragem/classificação foi excedida. Para atualizá-la, você pode ir para Configurações do Usuário e alterar a configuração: 'queryEditor. Results. inMemoryDataProcessingThreshold'
zh_hans: 已超过筛选/排序的最大行计数。若要更新它，可以转到“用户设置”并更改设置: "queryEditor.results.inMemoryDataProcessingThreshold"

source: XML Showplan
es: Plan de presentación XML
fr: Plan d'exécution de requêtes XML
it: Showplan XML
ja: XML プラン表示
ko: XML 실행 계획
pt_br: Plano de execução XML
zh_hans: XML 显示计划

# ToggleFocusBetweenQueryEditorAndResultsAction
source: Toggle Focus Between Query And Results
de: Fokus zwischen Abfrage und Ergebnissen umschalten
es: Alternar enfoque entre consulta y resultados
fr: Basculer le focus entre la requête et les résultats
it: Alterna lo stato attivo tra la query e i risultati
ja: クエリと結果の間のフォーカスの切り替え
ko: 쿼리와 결과 간 포커스 전환
pt_br: Alternar Foco entre a Consulta e os Resultados
zh_hans: 在查询和结果之间切换焦点

# cancelQueryKeyboardAction
source: Cancel Query
de: Abfrage abbrechen
es: Cancelar consulta
fr: Annuler la requête
it: Annulla query
ja: クエリのキャンセル
ko: 쿼리 취소
pt_br: Cancelar Consulta
zh_hans: 取消查询

# copyQueryWithResultsKeyboardAction
source: Copy Query With Results
de: Abfrage mit Ergebnissen kopieren
es: Copiar consulta con resultados
fr: Copier la requête avec les résultats
it: Copia query con risultati
ja: 結果を含むクエリのコピー
ko: 결과와 함께 쿼리 복사
pt_br: Copiar Consulta com Resultados
zh_hans: 复制查询和结果

# focusOnCurrentQueryKeyboardAction
source: Focus on Current Query
de: Fokus auf aktuelle Abfrage
es: Centrarse en la consulta actual
fr: Se concentrer sur la requête actuelle
it: Stato attivo su query corrente
ja: 現在のクエリにフォーカスを移動する
ko: 현재 쿼리에 포커스
pt_br: Foco na Consulta Atual
zh_hans: 关注当前查询

# parseSyntaxLabel
source: Parse Query
de: Abfrage analysieren
es: Analizar consulta
fr: Analyser la requête
it: Analizza query
ja: クエリの解析
ko: 쿼리 구문 분석
pt_br: Analisar Consulta
zh_hans: 分析查询

# queryActions.notConnected
source: Please connect to a server
de: Stellen Sie eine Verbindung mit einem Server her.
es: Conéctese a un servidor
fr: Connectez-vous à un serveur
it: Connettersi a un server
ja: サーバーに接続してください
ko: 서버에 연결하세요.
pt_br: Conecte-se a um servidor
zh_hans: 请连接到服务器

# queryActions.parseSyntaxFailure
source: Command failed:
de: Fehler bei Befehl:
es: Error del comando:
fr: La commande a échoué :
it: Comando non riuscito:
ja: コマンドが失敗しました:
ko: 명령 실패:
pt_br: Falha no comando:
zh_hans: 命令失败:

# queryActions.parseSyntaxSuccess
source: Commands completed successfully
de: Die Befehle wurden erfolgreich ausgeführt.
es: Comandos completados correctamente
fr: Commandes exécutées
it: I comandi sono stati completati
ja: コマンドが正常に完了しました
ko: 명령을 완료했습니다.
pt_br: Comandos concluídos com êxito
zh_hans: 命令已成功完成

# queryActions.queryResultsCopySuccess
source: Successfully copied query and results.
de: Die Abfrage und die Ergebnisse wurden erfolgreich kopiert.
es: La consulta y los resultados se han copiado correctamente.
fr: La requête et les résultats ont été copiés.
it: Copia della query e dei risultati completata.
ja: クエリと結果が正常にコピーされました。
ko: 쿼리 및 결과를 복사했습니다.
pt_br: Consulta e resultados copiados com êxito.
zh_hans: 已成功复制查询和结果。

# queryShortcutNoEditor
source: Editor parameter is required for a shortcut to be executed
de: Editor-Parameter zum Ausführen einer Tastenkombination erforderlich.
es: El parámetro de editor es necesario para la ejecución de un acceso directo
fr: Le paramètre de l'éditeur est nécessaire pour exécuter un raccourci
it: Per consentire l'esecuzione del tasto di scelta rapida, è necessario specificare il parametro Editor
ja: ショートカットを実行するにはエディター パラメーターが必須です
ko: 바로 가기를 실행하려면 편집기 매개 변수가 필요합니다.
pt_br: O editor de parâmetro é necessário para um atalho ser executado
zh_hans: 需要编辑器参数才能执行快捷方式

# refreshIntellisenseKeyboardAction
source: Refresh IntelliSense Cache
de: IntelliSense-Cache aktualisieren
es: Actualizar caché de IntelliSense
fr: Actualiser le cache IntelliSense
it: Aggiorna cache IntelliSense
ja: IntelliSense キャッシュの更新
ko: IntelliSense 캐시 새로 고침
pt_br: Atualizar Cache do IntelliSense
zh_hans: 刷新 IntelliSense 缓存

# runCurrentQueryKeyboardAction
source: Run Current Query
de: Aktuelle Abfrage ausführen
es: Ejecutar la consulta actual
fr: Exécuter la requête actuelle
it: Esegui query corrente
ja: 現在のクエリを実行
ko: 현재 쿼리 실행
pt_br: Executar Consulta Atual
zh_hans: 运行当前查询

# runCurrentQueryWithActualPlanKeyboardAction
source: Run Current Query with Actual Plan
de: Aktuelle Abfrage mit Istplan ausführen
es: Ejecutar la consulta actual con el plan real
fr: Exécuter la requête actuelle avec le plan réel
it: Esegui query corrente con piano effettivo
ja: 実際のプランで現在のクエリを実行
ko: 실제 계획에 따라 현재 쿼리 실행
pt_br: Executar Consulta Atual com Plano Real
zh_hans: 使用实际计划运行当前查询

# runQueryKeyboardAction
source: Run Query
de: Abfrage ausführen
es: Ejecutar consulta
fr: Exécuter la requête
it: Esegui query
ja: クエリの実行
ko: 쿼리 실행
pt_br: Executar Consulta
zh_hans: 运行查询

# toggleQueryResultsKeyboardAction
source: Toggle Query Results
de: Abfrageergebnisse umschalten
es: Alternar resultados de la consulta
fr: Activer/désactiver les résultats de requête
it: Attiva/Disattiva risultati della query
ja: クエリ結果の切り替え
ko: 쿼리 결과 전환
pt_br: Alternar Resultados da Consulta
zh_hans: 切换查询结果

source: Copy
de: Kopieren
es: Copiar
fr: Copier
it: Copia
ja: コピー
ko: 복사
pt_br: Copiar
zh_hans: 复制

source: Copy All
de: Alle kopieren
es: Copiar todo
fr: Tout copier
it: Copia tutto
ja: すべてコピー
ko: 모두 복사
pt_br: Copiar Tudo
zh_hans: 全部复制

source: Message Panel
de: Meldungspanel
es: Panel de mensajes
fr: Panneau des messages
it: Pannello dei messaggi
ja: メッセージ パネル
ko: 메시지 패널
pt_br: Painel de Mensagens
zh_hans: 消息面板

# queryEditor.chart.defaultChartType
source: The default chart type to use when opening Chart Viewer from a Query Results
de: Dieser Diagrammtyp wird standardmäßig verwendet, wenn der Diagramm-Viewer von Abfrageergebnissen aus geöffnet wird.
es: Tipo de gráfico predeterminado para usar al abrir el visor de gráficos a partir de los resultados de una consulta
fr: Type de graphique par défaut à utiliser à l'ouverture de la visionneuse graphique à partir des résultats d'une requête
it: Tipo di grafico predefinito da usare quando si apre il visualizzatore grafico dai risultati di una query
ja: クエリ結果からグラフ ビューアーを開くときに使用する既定のグラフの種類
ko: 쿼리 결과에서 차트 뷰어를 열 때 사용할 기본 차트 유형
pt_br: O tipo de gráfico padrão a ser usado ao abrir o Visualizador de Gráficos nos Resultados da Consulta
zh_hans: 从“查询结果”打开“图表查看器”时要使用的默认图表类型

# queryEditor.inMemoryDataProcessingThreshold
source: Controls the max number of rows allowed to do filtering and sorting in memory. If the number is exceeded, sorting and filtering will be disabled. Warning: Increasing this may impact performance.
de: Steuert die maximale Anzahl von Zeilen, die im Arbeitsspeicher gefiltert und sortiert werden dürfen. Wenn die Zahl überschritten wird, werden die Sortier- und Filterfunktionen deaktiviert. Warnung: die Erhöhung dieser Anzahl kann sich auf die Leistung auswirken.
es: Controla el número máximo de filas permitidas para filtrar y ordenar en memoria. Si se supera el número, se deshabilitará la ordenación y el filtrado. Advertencia: El incremento de este número puede afectar al rendimiento.
fr: Contrôle le nombre maximal de lignes autorisées pour effectuer le filtrage et le tri en mémoire. Si ce nombre est dépassé, le tri et le filtrage sont désactivés. Avertissement : l’augmentation de cette valeur peut avoir un impact sur les performances.
it: Controlla il numero massimo di righe consentite per l'applicazione di filtri e ordinamento in memoria. Se il numero viene superato, l'ordinamento e il filtro verranno disabilitati. Avviso: l'aumento di questo valore può influire sulle prestazioni.
ja: メモリ内でフィルター処理と並べ替えを実行できる行の最大数を制御します。この数を超えた場合、並べ替えとフィルター処理は無効になります。警告: これを増やすと、パフォーマンスに影響を与える可能性があります。
ko: 메모리에서 필터링 및 정렬할 수 있는 최대 행 수를 제어합니다. 숫자를 초과하는 경우 정렬과 필터링이 비활성화됩니다. 경고: 이 항목을 늘리면 성능에 영향을 미칠 수 있습니다.
pt_br: Controla o número máximo de linhas permitidas para filtragem e classificação na memória. Se o número for excedido, a classificação e a filtragem serão desabilitadas. Aviso: aumentar isso pode afetar o desempenho.
zh_hans: 控制允许在内存中进行筛选和排序的最大行数。如果超过最大行数，则将禁用排序和筛选。警告: 增加此值可能会影响性能。

# queryEditor.messages.showBatchTime
source: Should execution time be shown for individual batches
de: Gibt an, ob die Ausführungszeit für einzelne Batches angezeigt werden soll.
es: Indica si debe mostrarse el tiempo de ejecución para los lotes individuales.
fr: Spécifie si la durée d'exécution doit être indiquée pour chaque lot
it: Indicare se visualizzare il tempo di esecuzione per singoli batch
ja: 各バッチの実行時間を表示するかどうか
ko: 개별 일괄 처리에 대한 실행 시간 표시 여부
pt_br: O tempo de execução deve ser mostrado para lotes individuais?
zh_hans: 是否应显示每个批处理的执行时间

# queryEditor.messages.wordwrap
source: Word wrap messages
de: Meldungen zu Zeilenumbrüchen
es: Mensajes de ajuste automático de línea
fr: Messages de retour automatique à la ligne
it: Messaggi con ritorno a capo automatico
ja: メッセージを右端で折り返す
ko: 메시지 자동 줄 바꿈
pt_br: Mensagens de quebra automática de linha
zh_hans: 自动换行消息

# queryEditor.promptToSaveGeneratedFiles
source: Prompt to save generated SQL files
de: Aufforderung zum Speichern generierter SQL-Dateien
es: Solicitud para guardar los archivos SQL generados
fr: Inviter à enregistrer les fichiers SQL générés
it: Richiede di salvare i file SQL generati
ja: 生成された SQL ファイルを保存するかをプロンプトで確認する
ko: 생성된 SQL 파일 저장 여부 확인
pt_br: Pedir para salvar arquivos SQL gerados
zh_hans: 提示保存生成的 SQL 文件

# queryEditor.results.copyIncludeHeaders
source: Configuration options for copying results from the Results View
de: Konfigurationsoptionen für das Kopieren von Ergebnissen aus der Ergebnisansicht
es: Opciones de configuración para copiar los resultados de la vista de resultados.
fr: Options de configuration pour copier les résultats de la Vue Résultats
it: Opzioni di configurazione per la copia di risultati dalla Visualizzazione risultati
ja: 結果を結果ビューからコピーするための構成オプション
ko: 결과 뷰에서 결과를 복사하기 위한 구성 옵션
pt_br: Opções de configuração para copiar os resultados na Visualização dos Resultados
zh_hans: 用于从“结果视图”复制结果的配置选项

# queryEditor.results.copyRemoveNewLine
source: Configuration options for copying multi-line results from the Results View
de: Konfigurationsoptionen für das Kopieren mehrzeiliger Ergebnisse aus der Ergebnisansicht
es: Opciones de configuración para copiar los resultados de varias líneas de la vista de resultados.
fr: Options de configuration pour copier les résultats multilignes de la vue Résultats
it: Opzioni di configurazione per la copia di risultati su più righe dalla visualizzazione risultati
ja: 複数行の結果を結果ビューからコピーするための構成オプション
ko: 결과 뷰에서 여러 줄 결과를 복사하기 위한 구성 옵션
pt_br: Opções de configuração para copiar os resultados de várias linhas da Visualização dos Resultados
zh_hans: 用于从“结果视图”复制多行结果的配置选项

# queryEditor.results.openAfterSave
source: Whether to open the file in Azure Data Studio after the result is saved.
de: Gibt an, ob die Datei in Azure Data Studio geöffnet werden soll, nachdem das Ergebnis gespeichert wurde.
es: Indica si se debe abrir el archivo en Azure Data Studio después de guardar el resultado.
fr: Indique si le fichier doit être ouvert dans Azure Data Studio une fois le résultat enregistré.
it: Indica se aprire il file in Azure Data Studio dopo il salvataggio del risultato.
ja: 結果保存後に Azure Data Studio でファイルを開くかどうかを指定します。
ko: 결과를 저장한 후 Azure Data Studio의 파일을 열지 여부입니다.
pt_br: Se o arquivo deve ser aberto no Azure Data Studio depois que o resultado é salvo.
zh_hans: 是否在保存结果后打开 Azure Data Studio 中的文件。

# queryEditor.results.saveAsCsv.delimiter
source: The custom delimiter to use between values when saving as CSV
de: Benutzerdefiniertes Trennzeichen zwischen Werten, das beim Speichern der Ergebnisse als CSV verwendet wird
es: Delimitador personalizado para usar entre los valores al guardar como CSV
fr: Délimiteur personnalisé à utiliser entre les valeurs pendant l'enregistrement au format CSV
it: Delimitatore personalizzato da usare tra i valori quando si salvano i risultati in formato CSV
ja: CSV として保存するときに値の間に使用するカスタム区切り記号
ko: CSV로 저장할 때 값 사이에 사용할 사용자 지정 구분 기호
pt_br: O delimitador personalizado a ser usado entre valores ao salvar como CSV
zh_hans: 保存为 CSV 时在值之间使用的自定义分隔符

# queryEditor.results.saveAsCsv.encoding
source: File encoding used when saving results as CSV
de: Dateicodierung, die beim Speichern der Ergebnisse als CSV verwendet wird
es: Codificación de archivo empleada al guardar los resultados como CSV
fr: Encodage de fichier utilisé pendant l'enregistrement des résultats au format CSV
it: Codifica di file usata quando si salvano i risultati in formato CSV
ja: 結果を CSV として保存するときに使用するファイル エンコード
ko: 결과를 CSV로 저장할 때 사용되는 파일 인코딩
pt_br: Arquivo de codificação usado ao salvar os resultados como CSV
zh_hans: 将结果保存为 CSV 时使用的文件编码
