Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# welcomePage.history
source: History
de: Verlauf
es: Historial
fr: Historique
it: Cronologia
ja: 履歴
ko: 기록
pt_br: Histórico
zh_hans: 历史记录

# welcomePage.learnMore
source: Learn more
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Saiba mais
zh_hans: 了解更多

# welcomePage.location
source: Location
de: Standort
es: Ubicación
fr: Localisation
it: Posizione
ja: 場所
ko: 위치
pt_br: Localização
zh_hans: 位置

# welcomePage.moreRecent
source: Show more
de: Mehr anzeigen
es: Mostrar más
fr: Afficher plus
it: Mostra di più
ja: さらに表示
ko: 자세히 표시
pt_br: Mostrar mais
zh_hans: 显示更多

# welcomePage.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称

# welcomePage.preview
source: Preview
de: Vorschau
es: Versión preliminar
fr: Aperçu
it: Anteprima
ja: プレビュー
ko: 미리 보기
pt_br: Versão prévia
zh_hans: 预览

# welcomePage.previewBody
source: This feature page is in preview. Preview features introduce new functionalities that are on track to becoming a permanent part the product. They are stable, but need additional accessibility improvements. We welcome your early feedback while they are under development.
de: Diese Featureseite befindet sich in der Vorschauphase. Durch die Vorschaufeatures werden neue Funktionen eingeführt, die demnächst als dauerhafter Bestandteil in das Produkt integriert werden. Sie sind stabil, erfordern jedoch zusätzliche Verbesserungen im Hinblick auf die Barrierefreiheit. Wir freuen uns über Ihr frühes Feedback, solange die Features noch entwickelt werden.
es: Esta página de características está en versión preliminar. Las características en versión preliminar presentan nuevas funcionalidades que están en proceso de convertirse en parte permanente del producto. Son estables, pero necesitan mejoras de accesibilidad adicionales. Agradeceremos sus comentarios iniciales mientras están en desarrollo.
fr: Cette page de fonctionnalité est en préversion. Les fonctionnalités en préversion sont des nouvelles fonctionnalités en passe d'être définitivement intégrées dans le produit. Elles sont stables, mais ont besoin d'améliorations d'accessibilité supplémentaires. Nous vous invitons à nous faire part de vos commentaires en avant-première pendant leur développement.
it: Questa pagina delle funzionalità è in anteprima. Le funzionalità in anteprima introducono nuove funzionalità che stanno per diventare una parte permanente del prodotto. Sono stabili, ma richiedono ulteriori miglioramenti per l'accessibilità. Apprezziamo il feedback iniziale degli utenti mentre sono in fase di sviluppo.
ja: この機能ページはプレビュー段階です。プレビュー機能では、製品の永続的な部分になる予定の新しい機能が導入されています。これらは安定していますが、追加のアクセシビリティの改善が必要です。開発中の早期のフィードバックを歓迎しています。
ko: 이 기능 페이지는 미리 보기로 제공됩니다. 미리 보기 기능은 제품에 영구적으로 포함될 예정인 새로운 기능을 도입합니다. 이와 같은 기능은 안정적이지만 접근성 측면에서 추가적인 개선이 필요합니다. 해당 기능이 개발되는 동안 초기 피드백을 주시면 감사하겠습니다.
pt_br: Esta página de recurso está em versão prévia. Os recursos de versão prévia apresentam novas funcionalidades que estão no caminho para se tornar parte permanente do produto. Eles são estáveis, mas precisam de melhorias de acessibilidade adicionais. Nós agradecemos os seus comentários iniciais enquanto os recursos estão em desenvolvimento.
zh_hans: 此功能页面处于预览状态。预览功能引入了新功能，这些功能有望成为产品的永久组成部分。它们是稳定的，但需要改进额外的辅助功能。欢迎在功能开发期间提供早期反馈。

# welcomePage.resources
source: Resources
de: Ressourcen
es: Recursos
fr: Ressources
it: Risorse
ja: リソース
ko: 리소스
pt_br: Recursos
zh_hans: 资源

# welcomePage.runQuery
source: Run a query
de: Abfrage ausführen
es: Ejecutar una consulta
fr: Exécuter une requête
it: Esegui una query
ja: クエリの実行
ko: 쿼리 실행
pt_br: Executar uma consulta
zh_hans: 运行查询

# welcomePage.runQueryBody
source: Interact with data through a query editor.
de: Interagieren Sie mit Daten über einen Abfrage-Editor.
es: Interactúe con los datos por medio de un editor de consultas.
fr: Interagir avec des données par le biais d'un éditeur de requête.
it: Interagire con i dati tramite un editor di query.
ja: クエリ エディターを使用してデータを操作します。
ko: 쿼리 편집기를 통해 데이터와 상호 작용합니다.
pt_br: Interagir com os dados por meio de um editor de consultas.
zh_hans: 通过查询编辑器与数据交互。

# welcomePage.showAll
source: Show All
de: Alle anzeigen
es: Mostrar todo
fr: Tout afficher
it: Mostra tutto
ja: すべて表示
ko: 모두 표시
pt_br: Mostrar Tudo
zh_hans: 全部显示

# welcomePage.showOnStartup
source: Show welcome page on startup
de: Beim Start Willkommensseite anzeigen
es: Mostrar página principal al inicio
fr: Afficher la page d'accueil au démarrage
it: Mostra la pagina iniziale all'avvio
ja: 起動時にウェルカム ページを表示する
ko: 시작 시 시작 페이지 표시
pt_br: Mostrar a página inicial na inicialização
zh_hans: 启动时显示欢迎页

# welcomePage.usefuLinks
source: Useful Links
de: Nützliche Links
es: Vínculos útiles
fr: Liens utiles
it: Collegamenti utili
ja: 役に立つリンク
ko: 유용한 링크
pt_br: Links Úteis
zh_hans: 有用链接

# welcomePage.videoDescriptionIntroduction
source: Introduction to Azure Data Studio Notebooks | Data Exposed
de: Einführung in Azure Data Studio-Notebooks | Verfügbare Daten
es: Introducción a los cuadernos de Azure Data Studio | Datos expuestos
fr: Présentation des notebooks Azure Data Studio | Données exposées
it: Introduzione ai notebook di Azure Data Studio | Dati esposti
ja: Azure Data Studio ノートブックの概要 | 公開されたデータ
ko: Azure Data Studio Notebook 소개 | 데이터 공개됨
pt_br: Introdução aos Notebooks do Azure Data Studio | Dados Expostos
zh_hans: Azure Data Studio 笔记本简介 | 已公开的数据

# welcomePage.videoDescriptionOverview
source: Overview of Azure Data Studio
de: Übersicht über Azure Data Studio
es: Información general de Azure Data Studio
fr: Vue d'ensemble d'Azure Data Studio
it: Panoramica di Azure Data Studio
ja: Azure Data Studio の概要
ko: Azure Data Studio 개요
pt_br: Visão geral do Azure Data Studio
zh_hans: Azure Data Studio 概述

# welcomePage.videos
source: Videos
es: Vídeos
fr: Vidéos
it: Video
ja: ビデオ
ko: 비디오
pt_br: Vídeos
zh_hans: 视频

# GuidedTour.addExtensions
source: Extend the functionality of Azure Data Studio by installing extensions developed by us/Microsoft as well as the third-party community (you!).
de: Erweitern Sie die Funktionalität von Azure Data Studio durch die Installation von Erweiterungen, die von uns/Microsoft und von der Drittanbietercommunity (von Ihnen!) entwickelt wurden.
es: Amplíe la funcionalidad de Azure Data Studio mediante la instalación de extensiones desarrolladas por nosotros y Microsoft, así como por la comunidad de terceros (es decir, ¡usted!).
fr: Étendez les fonctionnalités d'Azure Data Studio en installant des extensions développées par nous/Microsoft ainsi que par la communauté (vous !).
it: Estendere le funzionalità di Azure Data Studio installando le estensioni sviluppate da Microsoft e dalla community di terze parti.
ja: Microsoft (私たち) だけでなくサードパーティ コミュニティ (あなた) が開発した拡張機能をインストールすることにより、Azure Data Studio の機能を拡張します。
ko: Microsoft 및 타사 커뮤니티에서 개발한 확장을 설치하여 Azure Data Studio 기능을 확장합니다.
pt_br: Estenda a funcionalidade do Azure Data Studio instalando extensões desenvolvidas por nós/Microsoft e também pela comunidade de terceiros (você!).
zh_hans: 通过安装由我们/Microsoft 以及第三方社区(你!)开发的扩展来扩展 Azure Data Studio 的功能。

# GuidedTour.connections
source: Connections
de: Verbindungen
es: Conexiones
fr: Connexions
it: Connessioni
ja: 接続
ko: 연결
pt_br: Conexões
zh_hans: 连接

# GuidedTour.discoverWelcomePage
source: Discover top features, recently opened files, and recommended extensions on the Welcome page. For more information on how to get started in Azure Data Studio, check out our videos and documentation.
de: Entdecken Sie wichtige Features, zuletzt geöffneten Dateien und empfohlene Erweiterungen auf der Willkommensseite. Weitere Informationen zum Einstieg in Azure Data Studio finden Sie in den Videos und in der Dokumentation.
es: Descubra las principales características, los archivos abiertos recientemente y las extensiones recomendadas en la página de bienvenida. Para obtener más información sobre cómo empezar a trabajar con Azure Data Studio, consulte los vídeos y la documentación.
fr: Découvrez les fonctionnalités principales, les fichiers récemment ouverts et les extensions recommandées dans la page d'accueil. Pour plus d'informations sur le démarrage avec Azure Data Studio, consultez nos vidéos et notre documentation.
it: Individuare le funzionalità principali, i file aperti di recente e le estensioni consigliate nella pagina iniziale. Per altre informazioni su come iniziare a usare Azure Data Studio, vedere i video e la documentazione.
ja: ウェルカム ページで、トップの機能、最近開いたファイル、推奨される拡張機能がわかります。Azure Data Studio で作業を開始する方法の詳細については、ビデオとドキュメントをご覧ください。
ko: 시작 페이지에서 주요 기능, 최근에 연 파일 및 추천 확장을 검색합니다. Azure Data Studio를 시작하는 방법에 관한 자세한 내용은 비디오 및 설명서를 확인하세요.
pt_br: Descubra os principais recursos, arquivos abertos recentemente e extensões recomendadas na Página inicial. Para obter mais informações sobre como começar a usar o Azure Data Studio, confira nossos vídeos e documentação.
zh_hans: 在“欢迎”页面上发现热门功能、最近打开的文件以及建议的扩展。有关如何开始使用 Azure Data Studio 的详细信息，请参阅我们的视频和文档。

# GuidedTour.extensions
source: Extensions
de: Erweiterungen
es: Extensiones
it: Estensioni
ja: 拡張
ko: 확장
pt_br: Extensões
zh_hans: 扩展

# GuidedTour.finish
source: Finish
de: Fertig stellen
es: Finalizar
fr: Terminer
it: Fine
ja: 完了
ko: 마침
pt_br: Concluir
zh_hans: 完成

# GuidedTour.gettingStartedNotebooks
source: Get started creating your own notebook or collection of notebooks in a single place.
de: Beginnen Sie an einer zentralen Stelle mit der Erstellung Ihres eigenen Notebooks oder einer Sammlung von Notebooks.
es: Empiece a crear su propio cuaderno o colección de cuadernos en un solo lugar.
fr: Démarrez en créant votre propre notebook ou collection de notebooks au même endroit.
it: Iniziare a creare il proprio notebook o la propria raccolta di notebook in un'unica posizione.
ja: 1 か所で独自のノートブックまたはノートブックのコレクションの作成を開始します。
ko: 한 곳에서 사용자 Notebook 또는 Notebook 컬렉션을 만드는 작업을 시작합니다.
pt_br: Comece a criar o seu notebook ou uma coleção de notebooks em um único lugar.
zh_hans: 开始在一个位置创建你自己的笔记本或笔记本集合。

# GuidedTour.makeConnections
source: Connect, query, and manage your connections from SQL Server, Azure, and more.
de: Über SQL Server, Azure und weitere Plattformen können Sie Verbindungen herstellen, abfragen und verwalten.
es: Conéctese a SQL Server y Azure, realice consultas, administre las conexiones y mucho más.
fr: Connectez, interrogez et gérez vos connexions SQL Server, Azure, etc.
it: È possibile connettersi, eseguire query e gestire le connessioni da SQL Server, Azure e altro ancora.
ja: SQL Server、Azure などからの接続を接続、クエリ、および管理します。
ko: SQL Server, Azure 등에서 연결을 연결, 쿼리 및 관리합니다.
pt_br: Conecte-se, consulte e gerencie as suas conexões no SQL Server, no Azure e muito mais.
zh_hans: 通过 SQL Server、Azure 等连接、查询和管理你的连接。

# GuidedTour.makeConnesetSettings
source: Customize Azure Data Studio based on your preferences. You can configure Settings like autosave and tab size, personalize your Keyboard Shortcuts, and switch to a Color Theme of your liking.
de: Passen Sie Azure Data Studio basierend auf Ihren Einstellungen an. Sie können Einstellungen wie automatisches Speichern und Registerkartengröße konfigurieren, Ihre Tastenkombinationen personalisieren und zu einem Farbdesign Ihrer Wahl wechseln.
es: Personalice Azure Data Studio según sus preferencias. Puede configurar opciones como el autoguardado y el tamaño de las pestañas, personalizar los métodos abreviados de teclado y cambiar a un tema de color de su gusto.
fr: Personnalisez Azure Data Studio en fonction de vos préférences. Vous pouvez configurer des paramètres comme l'enregistrement automatique et la taille des onglets, personnaliser vos raccourcis clavier et adopter le thème de couleur de votre choix.
it: Personalizzare Azure Data Studio in base alle proprie preferenze. È possibile configurare impostazioni come il salvataggio automatico e le dimensioni delle schede, personalizzare i tasti di scelta rapida e scegliere il tema colori preferito.
ja: 好みに応じて Azure Data Studio をカスタマイズします。自動保存やタブ サイズなどの設定の構成、キーボード ショートカットのカスタマイズ、好きな配色テーマへの切り替えを行うことができます。
ko: 기본 설정에 따라 Azure Data Studio를 사용자 지정합니다. 자동 저장 및 탭 크기 같은 설정을 구성하고, 바로 가기 키를 개인 설정하고, 원하는 색 테마로 전환할 수 있습니다.
pt_br: Personalize o Azure Data Studio com base nas suas preferências. Você pode definir configurações como o salvamento automático e o tamanho da tabulação, personalizar os seus Atalhos de Teclado e mudar para um Tema de Cores de sua preferência.
zh_hans: 根据你的偏好自定义 Azure Data Studio。可以配置自动保存和选项卡大小等设置，个性化设置键盘快捷方式，并切换到你喜欢的颜色主题。

# GuidedTour.next
source: Next
de: Weiter
es: Siguiente
fr: Suivant
it: Avanti
ja: 次へ
ko: 다음
pt_br: Próximo
zh_hans: 下一步

# GuidedTour.notebooks
source: Notebooks
es: Cuadernos
it: Notebook
ja: ノートブック
ko: Notebook
zh_hans: 笔记本

# GuidedTour.readMore
source: Read more
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Leia mais
zh_hans: 了解更多

# GuidedTour.settings
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
ko: 설정
pt_br: Configurações
zh_hans: 设置

# GuidedTour.welcomePage
source: Welcome Page
de: Willkommensseite
es: Página de bienvenida
fr: Page d'accueil
it: Pagina iniziale
ja: ウェルカム ページ
ko: 시작 페이지
pt_br: Página Inicial
zh_hans: 欢迎页面

# guidedTour
source: User Welcome Tour
de: Einführungstour für Benutzer
es: Paseo de bienvenida para el usuario
fr: Visite de bienvenue de l'utilisateur
it: Presentazione iniziale
ja: ユーザー紹介ツアー
ko: 사용자 시작 둘러보기
pt_br: Tour de Boas-Vindas do Usuário
zh_hans: 用户欢迎教程

source: Help
de: Hilfe
es: Ayuda
fr: Aide
it: Guida
ja: ヘルプ
ko: 도움말
pt_br: Ajuda
zh_hans: 帮助

# hideGuidedTour
source: Hide Welcome Tour
de: Einführungstour ausblenden
es: Ocultar paseo de presentación
fr: Masquer la visite de bienvenue
it: Nascondi presentazione iniziale
ja: 紹介ツアーの非表示
ko: 시작 둘러보기 숨기기
pt_br: Ocultar Tour de Boas-Vindas
zh_hans: 隐藏欢迎教程

# WelcomePage.TakeATour
source: Would you like to take a quick tour of Azure Data Studio?
de: Möchten Sie eine kurze Einführung in Azure Data Studio erhalten?
es: ¿Le gustaría dar un paseo introductorio por Azure Data Studio?
fr: Voulez-vous voir une présentation rapide d'Azure Data Studio ?
it: Visualizzare una presentazione di Azure Data Studio?
ja: Azure Data Studio のクイック ツアーを開始しますか?
ko: Azure Data Studio를 빠르게 둘러보시겠습니까?
pt_br: Deseja fazer um tour rápido pelo Azure Data Studio?
zh_hans: 是否希望快速浏览 Azure Data Studio?

# WelcomePage.welcome
source: Welcome!
de: Willkommen!
es: ¡Le damos la bienvenida!
fr: Bienvenue !
it: Introduzione
ja: ようこそ
ko: 환영합니다!
pt_br: Bem-vindo(a)!
zh_hans: 欢迎使用!

# closeTourBar
source: Close quick tour bar
de: Leiste für Schnelleinführung schließen
es: Cerrar barra del paseo introductorio
fr: Fermer la barre de présentation rapide
it: Chiudi barra della presentazione
ja: クイック ツアー バーを閉じる
ko: 빠른 둘러보기 표시줄 닫기
pt_br: Fechar barra do tour rápido
zh_hans: 关闭快速浏览栏

source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# welcome.title
source: Welcome
de: Willkommen
es: Bienvenida
fr: Bienvenue
it: Introduzione
ja: ようこそ
ko: 시작
pt_br: Bem-vindo(a)
zh_hans: 欢迎

# welcomePage
source: Welcome
de: Willkommen
es: Bienvenida
fr: Bienvenue
it: Introduzione
ja: ようこそ
ko: 시작
pt_br: Bem-vindo(a)
zh_hans: 欢迎

# welcomePage.PostgreSQLDescription
source: Connect, query, and manage Postgres databases with Azure Data Studio
de: Mit Azure Data Studio können Sie PostgreSQL-Datenbanken verbinden, abfragen und verwalten.
es: Conéctese a bases de datos Postgre, adminístrelas y realice consultas en ellas con Azure Data Studio.
fr: Connecter, interroger et gérer les bases de données Postgres avec Azure Data Studio
it: È possibile connettersi, eseguire query e gestire database Postgres con Azure Data Studio
ja: Azure Data Studio で Postgres データベースを接続、クエリ、および管理します
ko: Azure Data Studio를 사용하여 Postgres 데이터베이스 연결, 쿼리 및 관리
pt_br: Conecte-se, consulte e gerencie bancos de dados Postgres com o Azure Data Studio
zh_hans: 使用 Azure Data Studio 连接、查询和管理 Postgres 数据库

# welcomePage.adminPack
source: SQL Admin Pack
de: SQL-Administratorpaket
es: Paquete de administración de SQL
fr: Pack d'administration SQL
it: Admin Pack di SQL
ja: SQL 管理パック
ko: SQL 관리 팩
pt_br: Admin Pack do SQL
zh_hans: SQL 管理包

# welcomePage.adminPackDescription
source: Admin Pack for SQL Server is a collection of popular database administration extensions to help you manage SQL Server
de: Das Administratorpaket für SQL Server ist eine Sammlung gängiger Erweiterungen für die Datenbankverwaltung, die Sie beim Verwalten von SQL Server unterstützen.
es: El paquete de administración para SQL Server es una colección de populares extensiones de administración de bases de datos para ayudarle a administrar SQL Server.
fr: Le pack d'administration de SQL Server est une collection d'extensions d'administration de base de données courantes qui vous permet de gérer SQL Server
it: Admin Pack per SQL Server è una raccolta delle estensioni più usate per l'amministrazione di database per semplificare la gestione di SQL Server
ja: SQL Server の管理パックは、一般的なデータベース管理拡張機能のコレクションであり、SQL Server の管理に役立ちます
ko: SQL Server 관리 팩은 SQL Server를 관리하는 데 도움이 되는 인기 있는 데이터베이스 관리 확장 컬렉션입니다.
pt_br: O Admin Pack do SQL Server é uma coleção de extensões populares de administração de banco de dados que ajudam você a gerenciar o SQL Server
zh_hans: SQL Server 管理包是热门数据库管理扩展的一个集合，可帮助你管理 SQL Server

# welcomePage.background
source: Background color for the Welcome page.
de: Hintergrundfarbe für die Startseite.
es: Color de fondo para la página de bienvenida.
fr: Couleur d'arrière-plan de la page d'accueil.
it: Colore di sfondo della pagina di benvenuto.
ja: ウェルカム ページの背景色。
ko: 시작 페이지 배경색입니다.
pt_br: Cor da tela de fundo da página inicial.
zh_hans: 欢迎页面的背景色。

# welcomePage.dataVirtualization
source: Data Virtualization
de: Datenvirtualisierung
es: Virtualización de datos
fr: Virtualisation des données
it: Virtualizzazione dei dati
ja: データ仮想化
ko: 데이터 가상화
pt_br: Virtualização de Dados
zh_hans: 数据虚拟化

# welcomePage.dataVirtualizationDescription
source: Virtualize data with SQL Server 2019 and create external tables using interactive wizards
de: Hiermit werden Daten mit SQL Server 2019 virtualisiert und externe Tabellen mithilfe interaktiver Assistenten erstellt.
es: Virtualice datos con SQL Server 2019 y cree tablas externas por medio de asistentes interactivos.
fr: Virtualiser les données avec SQL Server 2019 et créer des tables externes à l'aide d'Assistants interactifs
it: Virtualizza i dati con SQL Server 2019 e crea tabelle esterne tramite procedure guidate interattive
ja: SQL Server 2019 を使用してデータを仮想化し、インタラクティブなウィザードを使用して外部テーブルを作成します
ko: SQL Server 2019로 데이터를 가상화하고 대화형 마법사를 사용하여 외부 테이블 만들기
pt_br: Virtualize os dados com o SQL Server 2019 e crie tabelas externas usando assistentes interativos
zh_hans: 使用 SQL Server 2019 虚拟化数据，并使用交互式向导创建外部表

# welcomePage.extensionPackAlreadyInstalled
source: Support for {0} is already installed.
de: Unterstützung für {0} ist bereits installiert.
es: El soporte para '{0}' ya está instalado.
fr: Le support pour {0} est déjà installé.
it: Il supporto per {0} è già installato.
ja: {0} のサポートは既にインストールされています。
ko: {0}에 대한 지원이 이미 설치되어 있습니다.
pt_br: O suporte para {0} já está instalado.
zh_hans: 已安装对 {0} 的支持。

# welcomePage.extensionPackNotFound
source: Support for {0} with id {1} could not be found.
de: Unterstützung für {0} mit der ID {1} wurde nicht gefunden.
es: No se pudo encontrar el soporte para {0} con id {1}.
fr: Le support pour {0} avec l'ID {1} est introuvable.
it: Il supporto per {0} con ID {1} non è stato trovato.
ja: ID {1} のサポート {0} は見つかりませんでした。
ko: ID가 {1}인 {0}에 대한 지원을 찾을 수 없습니다.
pt_br: Não foi possível encontrar suporte para {0} com a id {1}.
zh_hans: 找不到对 {0} (ID: {1}) 的支持。

# welcomePage.install
source: Install
de: Installieren
es: Instalar
fr: Installer
it: Installa
ja: インストール
ko: 설치
pt_br: Instalar
zh_hans: 安装

# welcomePage.installExtensionPack
source: Install additional support for {0}
de: Zusätzliche Unterstützung für {0} installieren
es: Instalar compatibilidad adicional con {0}
fr: Installer un support supplémentaire pour {0}
it: Installa supporto aggiuntivo per {0}
ja: {0} に追加のサポートをインストールする
ko: {0}에 대한 추가 지원 설치
pt_br: Instalar suporte adicional para {0}
zh_hans: 安装对 {0} 的额外支持

# welcomePage.installKeymap
source: Install {0} keymap
de: Tastenzuordnung {0} öffnen
es: Instalar asignación de teclas de {0}
fr: Installer le mappage de touches {0}
it: Installa mappatura tastiera {0}
ja: {0} キーマップのインストール
ko: {0} 키맵 설치
pt_br: Instalar o mapa de teclas {0}
zh_hans: 安装 {0} 键映射

# welcomePage.installed
source: Installed
de: Installiert
es: Instalado
fr: Installé
it: Installato
ja: インストール済み
ko: 설치됨
pt_br: Instalado
zh_hans: 已安装

# welcomePage.installedExtensionPack
source: {0} support is already installed
de: Unterstützung für {0} ist bereits installiert.
es: La compatibilidad con {0} ya está instalada
fr: Le support {0} est déjà installé.
it: Il supporto {0} è già installato
ja: {0} のサポートは既にインストールされています
ko: {0} 지원이 이미 설치되어 있습니다.
pt_br: O suporte de {0} já está instalado
zh_hans: 已安装 {0} 支持

# welcomePage.installedKeymap
source: {0} keymap is already installed
de: Die Tastaturzuordnung {0} ist bereits installiert.
es: El mapa de teclas de {0} ya está instalado
fr: Le mappage de touches '{0}' est déjà installé
it: Mappatura tastiera {0} è già installata
ja: {0} キーマップは既にインストールされています
ko: {0} 키맵이 이미 설치되어 있습니다.
pt_br: O mapa de teclas {0} já está instalado
zh_hans: 已安装 {0} 按键映射

# welcomePage.installingExtensionPack
source: Installing additional support for {0}...
de: Zusätzliche Unterstützung für {0} wird installiert...
es: Instalando compatibilidad adicional con {0}...
fr: Installation d'un support supplémentaire pour {0}...
it: Installazione di supporto aggiuntivo per {0} in corso...
ja: {0} に追加のサポートをインストールしています...
ko: {0}에 대한 추가 지원을 설치하는 중...
pt_br: Instalando suporte adicional para {0}...
zh_hans: 正在安装对 {0} 的额外支持...

# welcomePage.new
source: New
de: Neu
es: Nuevo
fr: Nouveau
it: Nuovo
ja: 新規
ko: 새로 만들기
pt_br: Novo
zh_hans: 新建

# welcomePage.newConnection
source: New connection
de: Neue Verbindung
es: Nueva conexión
fr: Nouvelle connexion
it: Nuova connessione
ja: 新しい接続
ko: 새 연결
pt_br: Nova conexão
zh_hans: 新建连接

# welcomePage.newNotebook
source: New notebook
de: Neues Notebook
es: Nuevo cuaderno
fr: Nouveau notebook
it: Nuovo notebook
ja: 新しいノートブック
ko: 새 Notebook
pt_br: Novo notebook
zh_hans: 新建笔记本

# welcomePage.newQuery
source: New query
de: Neue Abfrage
es: Nueva consulta
fr: Nouvelle requête
it: Nuova query
ja: 新しいクエリ
ko: 새 쿼리
pt_br: Nova consulta
zh_hans: 新建查询

# welcomePage.open
source: Open…
de: Öffnen…
es: Abrir...
fr: Ouvrir…
it: Apri…
ja: 開く…
ko: 열기...
pt_br: Abrir…
zh_hans: 打开…

# welcomePage.openFile
source: Open file…
de: Datei öffnen…
es: Abrir archivo...
fr: Ouvrir le fichier...
it: Apri file…
ja: ファイルを開く…
ko: 파일 열기...
pt_br: Abrir arquivo…
zh_hans: 打开文件…

# welcomePage.openFolder
source: Open folder…
de: Ordner öffnen…
es: Abrir carpeta...
fr: Ouvrir le dossier...
it: Apri cartella…
ja: フォルダーを開く
ko: 폴더 열기...
pt_br: Abrir a pasta…
zh_hans: 打开文件夹…

# welcomePage.openFolderWithPath
source: Open folder {0} with path {1}
de: Ordner {0} mit Pfad {1} öffnen
es: Abrir la carpeta {0} con la ruta de acceso {1}
fr: Ouvrir le dossier {0} avec le chemin {1}
it: Apri la cartella {0} con percorso {1}
ja: パス {1} のフォルダー {0} を開く
ko: 경로가 {1}인 {0} 폴더 열기
pt_br: Abrir pasta {0} com caminho {1}
zh_hans: 打开路径为 {1} 的文件夹 {0}
