Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# search.seedWithNearestWord
source: Enable seeding search from the word nearest the cursor when the active editor has no selection.
de: Aktivieren Sie das Starten der Suche mit dem Wort, das dem Cursor am nächsten liegt, wenn der aktive Editor keine Auswahl aufweist.
es: Habilite la búsqueda de propagación a partir de la palabra más cercana al cursor cuando el editor activo no tiene ninguna selección.
fr: Activez l'essaimage de la recherche à partir du mot le plus proche du curseur quand l'éditeur actif n'a aucune sélection.
it: Abilita il seeding della ricerca a partire dalla parola più vicina al cursore quando non ci sono selezioni nell'editor attivo.
ja: アクティブなエディターで何も選択されていないときに、カーソルに最も近い語からのシード検索を有効にします。
ko: 활성 편집기에 선택 항목이 없을 경우 커서에 가장 가까운 단어에서 시드 검색을 사용합니다.
pt_br: Habilitar a pesquisa de propagação da palavra mais próxima ao cursor quando o editor ativo não tiver nenhuma seleção.
zh_hans: 当活动编辑器没有选定内容时，从离光标最近的字词开始进行种子设定搜索。

# search.showLineNumbers
source: Controls whether to show line numbers for search results.
de: Steuert, ob Zeilennummern für Suchergebnisse angezeigt werden.
es: Controla si deben mostrarse los números de línea en los resultados de la búsqueda.
fr: Détermine s'il faut afficher les numéros de ligne dans les résultats de recherche.
it: Controlla se visualizzare i numeri di riga per i risultati della ricerca.
ja: 検索結果に行番号を表示するかどうかを制御します。
ko: 검색 결과의 줄 번호를 표시할지 여부를 제어합니다.
pt_br: Controla se os números de linha devem ser mostrados para os resultados da pesquisa.
zh_hans: 控制是否显示搜索结果所在的行号。

# search.smartCase
source: Search case-insensitively if the pattern is all lowercase, otherwise, search case-sensitively.
de: Sucht ohne Berücksichtigung von Groß-/Kleinschreibung, wenn das Muster kleingeschrieben ist, andernfalls wird mit Berücksichtigung von Groß-/Kleinschreibung gesucht.
es: Buscar sin distinción de mayúsculas y minúsculas si el patrón es todo en minúsculas; de lo contrario, buscar con distinción de mayúsculas y minúsculas.
fr: Faire une recherche non sensible à la casse si le modèle est tout en minuscules, dans le cas contraire, faire une rechercher sensible à la casse.
it: Esegue la ricera senza fare distinzione tra maiuscole/minuscole se il criterio è tutto minuscolo, in caso contrario esegue la ricerca facendo distinzione tra maiuscole/minuscole.
ja: すべて小文字のパターンの場合、大文字と小文字を区別しないで検索し、そうでない場合は大文字と小文字を区別して検索します。
ko: 패턴이 모두 소문자인 경우 대/소문자를 구분하지 않고 검색하고, 그렇지 않으면 대/소문자를 구분하여 검색합니다.
pt_br: Pesquisar sem diferenciar maiúsculas de minúsculas se o padrão for todo em minúsculas, caso contrário, pesquisar diferenciando maiúsculas de minúsculas.
zh_hans: 若搜索词全为小写，则不区分大小写进行搜索，否则区分大小写进行搜索。

# search.sortOrder
source: Controls sorting order of search results.
de: Steuert die Sortierreihenfolge der Suchergebnisse.
es: Controla el orden de los resultados de búsqueda.
fr: Contrôle l'ordre de tri des résultats de recherche.
it: Controlla l'ordinamento dei risultati della ricerca.
ja: 検索結果の並べ替え順序を制御します。
ko: 검색 결과의 정렬 순서를 제어합니다.
pt_br: Controla a ordem de classificação dos resultados da pesquisa.
zh_hans: 控制搜索结果的排序顺序。

# search.usePCRE2
source: Whether to use the PCRE2 regex engine in text search. This enables using some advanced regex features like lookahead and backreferences. However, not all PCRE2 features are supported - only features that are also supported by JavaScript.
de: Gibt an, ob die PCRE2-RegEx-Engine bei der Textsuche verwendet werden soll. Dadurch wird die Verwendung einiger erweiterter RegEx-Features wie Lookahead und Rückverweise ermöglicht. Allerdings werden nicht alle PCRE2-Features unterstützt, sondern nur solche, die auch von JavaScript unterstützt werden.
es: Si se utiliza el motor de expresión regular PCRE2 en la búsqueda de texto. Esto permite utilizar algunas características avanzadas de regex como la búsqueda anticipada y las referencias inversas. Sin embargo, no todas las características de PCRE2 son compatibles: solo las características que también admite JavaScript.
fr: Détermine s'il faut utiliser le moteur regex PCRE2 dans la recherche de texte. Cette option permet d'utiliser des fonctionnalités regex avancées comme lookahead et les références arrière. Toutefois, les fonctionnalités PCRE2 ne sont pas toutes prises en charge, seulement celles qui sont aussi prises en charge par JavaScript.
it: Indica se usare il motore regex PCRE2 nella ricerca di testo. In questo modo è possibile usare alcune funzionalità avanzate di regex, come lookahead e backreference. Non sono però supportate tutte le funzionalità di PCRE2, ma solo quelle supportate anche da JavaScript.
ja: テキスト検索に PCRE2 正規表現エンジンを使用するかどうか。これにより、先読みや後方参照といった高度な正規表現機能を使用できるようになります。ただし、すべての PCRE2 機能がサポートされているわけではありません。JavaScript によってサポートされる機能のみが使用できます。
ko: 텍스트 검색에서 PCRE2 regex 엔진을 사용할지 여부입니다. 사용하도록 설정하면 lookahead 및 backreferences와 같은 몇 가지 고급 regex 기능을 사용할 수 있습니다. 하지만 모든 PCRE2 기능이 지원되지는 않으며, JavaScript에서도 지원되는 기능만 지원됩니다.
pt_br: Se o mecanismo de regex do PCRE2 deve ser usado na pesquisa de texto. Isso permite o uso de alguns recursos de regex avançados, como referências inversas e de lookahead. No entanto, nem todos os recursos PCRE2 são compatíveis, somente recursos compatíveis com o JavaScript.
zh_hans: 是否在文本搜索中使用 pcre2 正则表达式引擎。这允许使用一些高级正则表达式功能, 如前瞻和反向引用。但是, 并非所有 pcre2 功能都受支持-仅支持 javascript 也支持的功能。

# search.useReplacePreview
source: Controls whether to open Replace Preview when selecting or replacing a match.
de: Steuert, ob die Vorschau für das Ersetzen geöffnet werden soll, wenn eine Übereinstimmung ausgewählt oder ersetzt wird.
es: Controla si debe abrirse la vista previa de reemplazo cuando se selecciona o reemplaza una coincidencia.
fr: Détermine s'il faut ouvrir l'aperçu du remplacement quand vous sélectionnez ou remplacez une correspondance.
it: Controlla se aprire Anteprima sostituzione quando si seleziona o si sostituisce una corrispondenza.
ja: 一致項目を選択するか置換するときに、置換のプレビューを開くかどうかを制御します。
ko: 일치하는 항목을 선택하거나 바꿀 때 미리 보기 바꾸기를 열지 여부를 제어합니다.
pt_br: Controla se é necessário abrir a Visualização de Substituição ao selecionar ou substituir uma correspondência.
zh_hans: 控制在选择或替换匹配项时是否打开“替换预览”视图。

# searchConfigurationTitle
source: Search Notebooks
de: Notebooks suchen
es: Búsqueda de cuadernos
fr: Rechercher dans les notebooks
it: Cerca nei notebook
ja: ノートブックの検索
ko: Notebook 검색
pt_br: Pesquisar Notebooks
zh_hans: 搜索笔记本

# searchSortOrder.countAscending
source: Results are sorted by count per file, in ascending order.
de: Die Ergebnisse werden nach Anzahl pro Datei in aufsteigender Reihenfolge sortiert.
es: Los resultados se ordenan por recuento por archivo, en orden ascendente.
fr: Les résultats sont triés par nombre dans chaque fichier, dans l'ordre croissant.
it: I risultati vengono visualizzati in ordine crescente in base al conteggio per file.
ja: 結果は、ファイルごとのカウントで昇順に並べ替えられます。
ko: 결과는 파일별 개수의 오름차순으로 정렬됩니다.
pt_br: Os resultados são classificados por contagem por arquivo, em ordem ascendente.
zh_hans: 结果按每个文件的计数以升序排序。

# searchSortOrder.countDescending
source: Results are sorted by count per file, in descending order.
de: Ergebnisse werden nach Anzahl pro Datei und in absteigender Reihenfolge sortiert.
es: Los resultados se ordenan de forma descendente por conteo de archivos.
fr: Les résultats sont triés par nombre dans chaque fichier, dans l'ordre décroissant.
it: I risultati vengono visualizzati in ordine decrescente in base al conteggio per file.
ja: 結果は、ファイルあたりの数で降順に並べ替えられます。
ko: 결과는 파일별 개수의 내림차순으로 정렬됩니다.
pt_br: Os resultados são classificados por contagem por arquivo, em ordem descendente.
zh_hans: 结果按每个文件的计数降序排序。

# searchSortOrder.default
source: Results are sorted by folder and file names, in alphabetical order.
de: Ergebnisse werden nach Ordner- und Dateinamen in alphabetischer Reihenfolge sortiert.
es: Los resultados se ordenan por nombre de carpeta y archivo, en orden alfabético.
fr: Les résultats sont triés par dossier et noms de fichier, dans l'ordre alphabétique.
it: I risultati vengono visualizzati in ordine alfabetico in base ai nomi di file e cartella.
ja: 結果はフォルダー名とファイル名でアルファベット順に並べ替えられます。
ko: 결과는 폴더 및 파일 이름의 알파벳 순으로 정렬됩니다.
pt_br: Os resultados são classificados por nomes de pastas e arquivos, em ordem alfabética.
zh_hans: 结果按文件夹和文件名按字母顺序排序。

# searchSortOrder.filesOnly
source: Results are sorted by file names ignoring folder order, in alphabetical order.
de: Die Ergebnisse werden nach Dateinamen in alphabetischer Reihenfolge sortiert. Die Ordnerreihenfolge wird ignoriert.
es: Los resultados estan ordenados alfabéticamente por nombres de archivo, ignorando el orden de las carpetas.
fr: Les résultats sont triés par noms de fichier en ignorant l'ordre des dossiers, dans l'ordre alphabétique.
it: I risultati vengono visualizzati in ordine alfabetico in base ai nomi file ignorando l'ordine delle cartelle.
ja: 結果はフォルダーの順序を無視したファイル名でアルファベット順に並べ替えられます。
ko: 결과는 폴더 순서를 무시하고 파일 이름별 알파벳 순으로 정렬됩니다.
pt_br: Os resultados são classificados por nomes de arquivo ignorando a ordem da pasta, em ordem alfabética.
zh_hans: 结果按文件名排序，忽略文件夹顺序，按字母顺序排列。

# searchSortOrder.modified
source: Results are sorted by file last modified date, in descending order.
de: Die Ergebnisse werden nach dem Datum der letzten Dateiänderung in absteigender Reihenfolge sortiert.
es: Los resultados se ordenan por la última fecha de modificación del archivo, en orden descendente.
fr: Les résultats sont triés par date de dernière modification de fichier, dans l'ordre décroissant.
it: I risultati vengono visualizzati in ordine decrescente in base alla data dell'ultima modifica del file.
ja: 結果は、ファイルの最終更新日で降順に並べ替えられます。
ko: 결과는 파일을 마지막으로 수정한 날짜의 내림차순으로 정렬됩니다.
pt_br: Os resultados são classificados pela data da última modificação do arquivo, em ordem descendente.
zh_hans: 结果按文件的最后修改日期按降序排序。

# searchSortOrder.type
source: Results are sorted by file extensions, in alphabetical order.
de: Die Ergebnisse werden nach Dateiendungen in alphabetischer Reihenfolge sortiert.
es: Los resultados se ordenan por extensiones de archivo, en orden alfabético.
fr: Les résultats sont triés par extensions de fichier dans l'ordre alphabétique.
it: I risultati vengono visualizzati in ordine alfabetico in base all'estensione del file.
ja: 結果は、ファイル拡張子でアルファベット順に並べ替えられます。
ko: 결과는 파일 확장자의 알파벳 순으로 정렬됩니다.
pt_br: Os resultados são classificados por extensões de arquivo, em ordem alfabética.
zh_hans: 结果按文件扩展名的字母顺序排序。

# useGlobalIgnoreFiles
source: Controls whether to use global `.gitignore` and `.ignore` files when searching for files.
de: Steuert, ob bei der Dateisuche globale GITIGNORE- und IGNORE-Dateien verwendet werden.
es: Controla si deben usarse archivos ".ignore" y ".gitignore" globables cuando se buscan archivos.
fr: Détermine s'il faut utiliser les fichiers généraux '.gitignore' et '.ignore' pendant la recherche de fichiers.
it: Controlla se usare i file `.gitignore` e `.ignore` globali durante la ricerca di file.
ja: ファイルを検索するときに、グローバルの `.gitignore` と `.ignore` ファイルを使用するかどうかを制御します。
ko: 파일을 검색할 때 전역 '.gitignore' 및 '.ignore' 파일을 사용할지 여부를 제어합니다.
pt_br: Controla se os arquivos globais `.gitignore` e `.ignore` devem ser usados durante a pesquisa de arquivos.
zh_hans: 控制在搜索文件时是否使用全局 `.gitignore` 和 `.ignore` 文件。

# useIgnoreFiles
source: Controls whether to use `.gitignore` and `.ignore` files when searching for files.
de: Steuert, ob bei der Dateisuche GITIGNORE- und IGNORE-Dateien verwendet werden.
es: Controla si se deben usar los archivos ".gitignore" e ".ignore" al buscar archivos.
fr: Contrôle s'il faut utiliser les fichiers `.gitignore` et `.ignore` par défaut pendant la recherche de fichiers.
it: Controlla se utilizzare i file `.gitignore` e `.ignore` durante la ricerca di file.
ja: ファイルを検索するときに、`.gitignore` ファイルと `.ignore` ファイルを使用するかどうかを制御します。
ko: 파일을 검색할 때 '.gitignore' 파일 및 '.ignore' 파일을 사용할지 여부를 제어합니다.
pt_br: Controla se os arquivos `.gitignore` e `.ignore` devem ser usados ao pesquisar arquivos.
zh_hans: 控制在搜索文件时是否使用 `.gitignore` 和 `.ignore` 文件。

# usePCRE2Deprecated
source: Deprecated. PCRE2 will be used automatically when using regex features that are only supported by PCRE2.
de: Veraltet. PCRE2 wird beim Einsatz von Features für reguläre Ausdrücke, die nur von PCRE2 unterstützt werden, automatisch verwendet.
es: En desuso. Se usará PCRE2 automáticamente al utilizar características de regex que solo se admiten en PCRE2.
fr: Déprécié. PCRE2 est utilisé automatiquement lors de l'utilisation de fonctionnalités regex qui ne sont prises en charge que par PCRE2.
it: Deprecata. PCRE2 verrà usato automaticamente se si usano funzionalità regex supportate solo da PCRE2.
ja: 廃止されました。PCRE2 でのみサポートされている正規表現機能を使用すると、PCRE2 が自動的に使用されます。
ko: 사용되지 않습니다. PCRE2는 PCRE2에서만 지원하는 regex 기능을 사용할 경우 자동으로 사용됩니다.
pt_br: Preterido. O PCRE2 será usado automaticamente ao usar os recursos regex que só têm suporte do PCRE2.
zh_hans: 弃用。当使用仅 PCRE2 支持的正则表达式功能时，将自动使用 PCRE2。

# useRipgrep
source: This setting is deprecated and now falls back on "search.usePCRE2".
de: Diese Einstellung ist veraltet und greift jetzt auf "search.usePCRE2" zurück.
es: Esta opción están en desuso y ahora se utiliza "search.usePCRE2".
fr: Ce paramètre est déprécié et remplacé par "search.usePCRE2".
it: Questa impostazione è deprecata. Verrà ora eseguito il fallback a "search.usePCRE2".
ja: この設定は推奨されず、現在 "search.usePCRE2" にフォール バックします。
ko: 이 설정은 사용되지 않으며 이제 "search.usePCRE2"로 대체됩니다.
pt_br: Essa configuração foi preterida e agora retorna ao "search.usePCRE2".
zh_hans: 此设置已被弃用，将回退到 "search.usePCRE2"。

# useRipgrepDeprecated
source: Deprecated. Consider "search.usePCRE2" for advanced regex feature support.
de: Veraltet. Verwenden Sie "search.usePCRE2" für die erweiterte Unterstützung von RegEx-Features.
es: En desuso. Considere la utilización de "search.usePCRE2" para admitir la característica de expresiones regulares avanzadas.
fr: Déprécié. Utilisez "search.usePCRE2" pour prendre en charge la fonctionnalité regex avancée.
it: Deprecata. Per il supporto della funzionalità avanzate delle espressioni regex provare a usare "search.usePCRE2".
ja: 推奨されません。高度な正規表現機能サポートのために "search.usePCRE2" の利用を検討してください。
ko: 사용되지 않습니다. 고급 regex 기능을 지원하려면 "search.usePCRE2"를 사용해 보세요.
pt_br: Preterido. Considere "search.usePCRE2" para obter suporte do recurso regex avançado.
zh_hans: 已弃用。请考虑使用 "search.usePCRE2" 获取对高级正则表达式功能的支持。

# workbench.action.setWorkspaceAndOpen
source: Set Workspace And Open
de: Arbeitsbereich festlegen und öffnen
es: Establecer área de trabajo y abrir
fr: Définir l'espace de travail et l'ouvrir
it: Imposta area di lavoro e apri
ja: ワークスペースを設定して開く
ko: 작업 영역 설정 및 열기
pt_br: Definir Workspace e Abrir
zh_hans: 设置工作区并打开

source: Attach to
de: Anfügen an
es: Adjuntar a
fr: Attacher à
it: Collega a
ja: 接続先:
ko: 연결 대상
pt_br: Anexar a
zh_hans: 附加到

source: Kernel
fr: Noyau
ja: カーネル
ko: 커널
zh_hans: 内核

source: Change Connection
de: Verbindung ändern
es: Cambiar conexión
fr: Changer la connexion
it: Cambia connessione
ja: 接続の変更
ko: 연결 변경
pt_br: Alterar Conexão
zh_hans: 更改连接

# changing
source: Changing kernel...
de: Kernel wird geändert...
es: Cambiando kernel...
fr: Changement du noyau...
it: Modifica del kernel...
ja: カーネルを変更しています...
ko: 커널을 변경하는 중...
pt_br: Alterando kernel...
zh_hans: 正在更改内核…

source: Clear Results
de: Ergebnisse löschen
es: Borrar resultados
fr: Effacer les résultats
it: Cancella risultati
ja: 結果のクリア
ko: 결과 지우기
pt_br: Limpar Resultados
zh_hans: 清除结果

# collapseAllCells
source: Collapse Cells
de: Zellen reduzieren
es: Contraer celdas
fr: Réduire les cellules
it: Comprimi celle
ja: セルを折りたたむ
ko: 셀 축소
pt_br: Recolher Células
zh_hans: 折叠单元格

# expandAllCells
source: Expand Cells
de: Zellen erweitern
es: Expandir celdas
fr: Développer les cellules
it: Espandi celle
ja: セルを展開する
ko: 셀 확장
pt_br: Expandir Células
zh_hans: 展开单元格

# kernelNotSupported
source: This notebook cannot run with parameters as the kernel is not supported. Please use the supported kernels and format. [Learn more](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
de: Dieses Notizbuch kann nicht mit Parametern ausgeführt werden, da der Kernel nicht unterstützt wird. Verwenden Sie die unterstützten Kernel und das unterstützte Format. [Weitere Informationen] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
es: Este cuaderno no se puede ejecutar con parámetros porque no se admite el kernel. Use los kernel y formato admitidos. [Más información](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
fr: Ce bloc-notes ne peut pas être exécuté avec des paramètres, car le noyau n’est pas pris en charge. Utilisez les noyaux et le format pris en charge. [En savoir plus] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
it: Questo notebook non può essere eseguito con parametri perché il kernel non è supportato. Usare i kernel e il formato supportati. [Altre informazioni] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
ja: カーネルがサポートされていないため、このノートブックはパラメーターを指定して実行できません。サポートされているカーネルと形式を使用してください。[詳細情報](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization)。
ko: 커널이 지원되지 않으므로 이 전자 필기장을 매개 변수로 실행할 수 없습니다. 지원되는 커널 및 형식을 사용하세요. [자세한 정보] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
pt_br: Esse bloco de anotações não pode ser executado com parâmetros porque não há suporte para o kernel. Use os kernels e o formato com suporte. [Learn more] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
zh_hans: 此笔记本无法使用参数运行，因为不支持内核。请使用支持的内核和格式。[了解详细信息](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization)。

# loading
source: Loading kernels...
de: Kernel werden geladen...
es: Cargando kernels...
fr: Chargement des noyaux...
it: Caricamento dei kernel...
ja: カーネルを読み込んでいます...
ko: 커널을 로드하는 중...
pt_br: Carregando kernels...
zh_hans: 正在加载内核…

source: Loading contexts...
de: Kontexte werden geladen...
es: Cargando contextos...
fr: Chargement des contextes...
it: Caricamento dei contesti...
ja: コンテキストを読み込んでいます...
ko: 컨텍스트를 로드하는 중...
pt_br: Carregando contextos...
zh_hans: 正在加载上下文…

# newNotebookAction
source: New Notebook
de: Neues Notebook
es: Nuevo Notebook
fr: Nouveau notebook
it: Nuovo notebook
ja: 新しいノートブック
ko: 새 Notebook
pt_br: Novo Notebook
zh_hans: 新建笔记本

# newViewLabel
source: Create New View
de: Neue Ansicht erstellen
es: Crear nueva vista
fr: Créer une nouvelle vue
it: Crea nuova visualizzazione
ja: 新しいビューの作成
ko: 새 보기 만들기
pt_br: Criar novo modo de exibição
zh_hans: 创建新视图

# noContextAvailable
source: None
de: Keine
es: Ninguno
fr: Aucun(e)
it: Nessuno
ja: なし
ko: 없음
pt_br: Nenhum
zh_hans: 无

source: No Kernel
de: Kein Kernel
es: Sin kernel
fr: Pas de noyau
it: Nessun kernel
ja: カーネルなし
ko: 커널 없음
pt_br: Nenhum Kernel
zh_hans: 无内核

# noParametersCell
source: This notebook cannot run with parameters until a parameter cell is added. [Learn more](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
de: Dieses Notebook kann erst mit Parametern ausgeführt werden, wenn eine Parameterzelle hinzugefügt wird. [Weitere Informationen](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
es: Este bloc de notas no se puede ejecutar con parámetros hasta que se agregue una celda de parámetro. [Más información] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
fr: Ce bloc-notes ne peut pas être exécuté avec des paramètres tant qu'une cellule de paramètre n'est pas ajoutée. [En savoir plus](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
it: Il notebook non può essere eseguito con parametri finché non viene aggiunta una cella di parametri. [Altre informazioni] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
ja: パラメーター セルが追加されるまで、パラメーターを指定してこのノートブックを実行することはできません。[詳細情報](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization)。
ko: 이 전자 필기장은 매개 변수 셀이 추가될 때까지 매개 변수를 사용하여 실행할 수 없습니다. [자세히 알아보기] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
pt_br: Este bloco de anotações não pode ser executado com parâmetros até que uma célula de parâmetro seja adicionada. [Saiba mais] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
zh_hans: 在添加参数单元格之前，此笔记本无法使用参数运行。[了解详细信息] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization)。

# noParametersInCell
source: This notebook cannot run with parameters until there are parameters added to the parameter cell. [Learn more](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
de: Dieses Notizbuch kann erst mit Parametern ausgeführt werden, wenn der Parameterzelle Parameter hinzugefügt wurden. [Weitere Informationen](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
es: Este cuaderno no se puede ejecutar con los parámetros hasta que se agregue una celda de parámetro. [Más información](https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
fr: Ce bloc-notes ne peut pas s’exécuter avec des paramètres tant que des paramètres n’ont pas été ajoutés à la cellule de paramètres. [En savoir plus] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
it: Il notebook non può essere eseguito con parametri finché non vengono aggiunti parametri alla cella dei parametri. [Altre informazioni] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
ja: パラメーター セルにパラメーターが追加されるまで、パラメーターを指定してこのノートブックを実行することはできません。[詳細情報] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization)。
ko: 매개 변수 셀에 추가된 매개 변수가 있을 때까지 이 전자 필기장을 매개 변수로 실행할 수 없습니다. [자세한 정보] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
pt_br: Este bloco de anotações não pode ser executado com parâmetros até que haja parâmetros adicionados à célula de parâmetro. [Saiba mais] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization).
zh_hans: 在将参数添加到参数单元格之前，此笔记本无法使用参数运行。[了解详细信息] (https://docs.microsoft.com/sql/azure-data-studio/notebooks/notebooks-parameterization)。

# notebook.findNext
source: Find Next String
de: Nächste Zeichenfolge suchen
es: Buscar cadena siguiente
fr: Rechercher la chaîne suivante
it: Trova stringa successiva
ja: 次の文字列を検索
ko: 다음 문자열 찾기
pt_br: Encontrar Próxima Cadeia de Caracteres
zh_hans: 查找下一个字符串

# notebook.findPrevious
source: Find Previous String
de: Vorhergehende Zeichenfolge suchen
es: Buscar cadena anterior
fr: Rechercher la chaîne précédente
it: Trova stringa precedente
ja: 前の文字列を検索
ko: 이전 문자열 찾기
pt_br: Encontrar Cadeia de Caracteres Anterior
zh_hans: 查找上一个字符串

# notebookViewLabel
source: Editor
fr: Éditeur
ja: エディター
ko: 편집기
zh_hans: 编辑器

# runParameters
source: Run with Parameters
de: Mit Parametern ausführen
es: Ejecutar con parámetros
fr: Exécuter avec des paramètres
it: Esegui con parametri
ja: パラメーターを指定して実行
ko: 매개 변수를 사용하여 실행
pt_br: Executar com Parâmetros
zh_hans: 使用参数运行

source: Select Connection
de: Verbindung auswählen
es: Seleccionar conexión
fr: Sélectionner une connexion
it: Seleziona connessione
ja: 接続を選択
ko: 연결 선택
pt_br: Selecionar Conexão
zh_hans: 选择连接

# trustLabel
source: Trusted
de: Vertrauenswürdig
es: De confianza
fr: Approuvé
it: Attendibile
ja: 信頼されています
ko: 신뢰할 수 있음
pt_br: Confiável
zh_hans: 受信任

# untrustLabel
source: Not Trusted
de: Nicht vertrauenswürdig
es: No de confianza
fr: Non approuvé
it: Non attendibile
ja: 信頼されていません
ko: 신뢰할 수 없음
pt_br: Não Confiável
zh_hans: 不受信任
