Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# uninstallExtensionComplete
source: Please reload Azure Data Studio to complete the uninstallation of the extension {0}.
de: Laden Sie Azure Data Studio erneut, um die Deinstallation der Erweiterung {0} abzuschließen.
es: Vuelva a cargar Azure Data Studio para completar la desinstalación de la extensión {0}.
fr: Rechargez Azure Data Studio pour désinstaller de l’extension {0}.
it: Ricaricare Azure Data Studio per completare la disinstallazione dell’estensione {0}.
ja: 拡張機能 {0}のアンインストールを完了するには、Azure Data Studio を再度読み込んでください。
ko: Azure Data Studio를 다시 로드하여 이 확장 {0}의 제거를 완료하세요.
pt_br: Recarregue o Azure Data Studio para concluir a desinstalação da extensão {0}.
zh_hans: 请重新加载 Azure Data Studio 以完成扩展 {0} 的卸载。

# updateLocale
source: Would you like to change Azure Data Studio's UI language to {0} and restart?
de: Möchten Sie die Sprache der Benutzeroberfläche von Azure Data Studio in {0} ändern und einen Neustart durchführen?
es: ¿Desea cambiar el idioma de la interfaz de usuario de Azure Data Studio a {0} y reiniciar?
fr: Souhaitez-vous changer la langue de l’interface d’Azure Data Studio en {0} et redémarrer ?
it: Cambiare la lingua dell'interfaccia utente di Azure Data Studio in {0} e riavviare?
ja: Azure Data Studio の UI 言語を {0} に変更して再起動しますか?
ko: Azure Data Studio의 UI 언어를 {0}(으)로 변경하고 다시 시작하시겠습니까?
pt_br: Deseja alterar o idioma da interface do usuário do Azure Data Studio para {0} e reiniciar?
zh_hans: 是否要将 Azure Data Studio 的 UI 语言更改为 {0} 并重启?

# watermark.newNotebook
source: New Notebook
de: Neues Notizbuch
es: Nuevo cuaderno
fr: Nouveau notebook
it: Nuovo notebook
ja: 新しいノートブック
ko: 새 Notebook
pt_br: Novo bloco de anotações
zh_hans: 新建笔记本

# watermark.newSqlFile
source: New SQL File
de: Neue SQL-Datei
es: Nuevo archivo SQL
fr: Nouveau fichier SQL
it: Nuovo file SQL
ja: 新しい SQL ファイル
ko: 새 SQL 파일
pt_br: Novo arquivo SQL
zh_hans: 新建 SQL 文件

# workspace.trust.description
source: Controls whether or not workspace trust is enabled within Azure Data Studio.
de: Steuert, ob die Arbeitsbereichsvertrauensstellung in Azure Data Studio aktiviert ist oder nicht.
it: Controlla se l'attendibilità dell'area di lavoro è abilitata all'interno di Azure Data Studio.
ja: Azure Data Studio 内でワークスペースの信頼を有効にするかどうかを制御します。
ko: Azure Data Studio 내에서 작업 영역 신뢰를 사용할지 여부를 제어합니다.

# workspace.trust.emptyWindow.description
source: Controls whether or not the empty window is trusted by default within Azure Data Studio. When used with `#{0}#`, you can enable the full functionality of Azure Data Studio without prompting in an empty window.
de: Steuert, ob das leere Fenster in Azure Data Studio standardmäßig als vertrauenswürdig eingestuft wird. Bei Verwendung mit „#{0}#“ können Sie die vollständige Funktionalität von Azure Data Studio aktivieren, ohne in einem leeren Fenster dazu aufgefordert zu werden.
it: Controlla se la finestra vuota è attendibile o meno per impostazione predefinita all'interno di Azure Data Studio. Se usata con '#{0}#', è possibile abilitare le funzionalità complete di Azure Data Studio senza chiedere conferma in una finestra vuota.
ja: 空のウィンドウを Azure Data Studio 内で既定で信頼するかどうかを制御します。'#{0}#' と共に使用すると、空のウィンドウでプロンプトを表示せずに、Azure Data Studio のすべての機能を有効にすることができます。
ko: 빈 창이 기본적으로 Azure Data Studio 내에서 신뢰할 수 있는지 여부를 제어합니다. '#{0}#’와(과) 함께 사용하는 경우 빈 창에서 메시지를 표시하지 않고 Azure Data Studio 전체 기능을 사용하도록 설정할 수 있습니다.

# editableDropdown.errorValidate
source: Must be an option from the list
de: Muss eine Option aus der Liste sein
es: Debe ser una opción de la lista
fr: Doit être une option de la liste
it: Deve essere un'opzione inclusa nell'elenco
ja: 一覧からオプションを選択する必要があります
ko: 목록에 있는 옵션이어야 합니다.
pt_br: Deve ser uma opção da lista
zh_hans: 必须是列表中的选项

source: Select Box
de: Auswahlfeld
es: Seleccionar cuadro
fr: Zone de sélection
it: Casella di selezione
ja: ボックスを選択
ko: Box 선택
pt_br: Selecionar Caixa
zh_hans: 选择框

# NoAccountToRefresh
source: There is no account to refresh
de: Es ist kein Konto zur Aktualisierung vorhanden.
es: No hay ninguna cuenta para actualizar
fr: Aucun compte à actualiser
it: Non ci sono account da aggiornare
ja: 更新するアカウントはありません
ko: 새로 고칠 계정이 없습니다.
pt_br: Não há nenhuma conta para atualizar
zh_hans: 没有可刷新的帐户

# accountActions.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否

# accountActions.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
zh_hans: 是

# addAccount
source: Add an account
de: Konto hinzufügen
es: Agregar una cuenta
fr: Ajouter un compte
it: Aggiungi un account
ja: アカウントを追加します
ko: 계정 추가
pt_br: Adicionar uma conta
zh_hans: 添加帐户

source: Apply Filters
de: Filter anwenden
es: Aplicar filtros
fr: Appliquer des filtres
it: Applica filtri
ja: フィルターを適用する
ko: 필터 적용
pt_br: Aplicar Filtros
zh_hans: 应用筛选器

# confirmRemoveUserAccountMessage
source: Are you sure you want to remove '{0}'?
de: Möchten Sie "{0}" entfernen?
es: ¿Seguro que quiere quitar "{0}"?
fr: Voulez-vous vraiment supprimer '{0}' ?
it: Rimuovere '{0}'?
ja: '{0}' を削除してよろしいですか?
ko: '{0}'을(를) 제거하시겠습니까?
pt_br: Tem certeza de que deseja remover '{0}'?
zh_hans: 确定要删除 "{0}" 吗?

# refreshAccount
source: Reenter your credentials
de: Anmeldeinformationen erneut eingeben
es: Vuelva a introducir sus credenciales
fr: Entrer à nouveau vos informations d'identification
it: Immetti di nuovo le credenziali
ja: 資格情報を再入力してください
ko: 자격 증명 다시 입력
pt_br: Reinsira suas credenciais
zh_hans: 再次输入你的凭据

source: Remove account
de: Konto entfernen
es: Eliminar cuenta
fr: Supprimer le compte
it: Rimuovi account
ja: アカウントを削除します
ko: 계정 제거
pt_br: Remover conta
zh_hans: 删除帐户

# removeAccountFailed
source: Failed to remove account
de: Fehler beim Entfernen des Kontos.
es: Error al quitar cuenta
fr: La suppression du compte a échoué
it: Non è stato possibile rimuovere l'account
ja: アカウントを削除できませんでした
ko: 계정을 제거하지 못함
pt_br: Falha ao remover conta
zh_hans: 未能删除帐户

# imageCopyingNotSupported
source: Copying images is not supported
de: Das Kopieren von Images wird nicht unterstützt.
es: No se admite la copia de imágenes
fr: La copie d'images n'est pas prise en charge
it: La copia delle immagini non è supportata
ja: イメージのコピーはサポートされていません
ko: 이미지 복사가 지원되지 않습니다.
pt_br: Não há suporte para copiar imagens
zh_hans: 不支持复制图像

# invalidServerName
source: A server group with the same name already exists.
de: Es ist bereits eine Servergruppe mit diesem Namen vorhanden.
es: Ya existe un grupo de servidores con el mismo nombre.
fr: Un groupe de serveurs du même nom existe déjà.
it: Esiste già un gruppo di server con lo stesso nome.
ja: 同じ名前のサーバー グループが既に存在します。
ko: 같은 이름의 서버 그룹이 이미 있습니다.
pt_br: Um grupo de servidores com o mesmo nome já existe.
zh_hans: 已存在同名的服务器组。

# connectionStatusManager.noConnectionForUri
source: Could not find connection with uri: {0}
de: Die Verbindung mit URI konnte nicht gefunden werden: {0}
es: No se encontró la conexión con el URI: {0}
fr: Impossible de trouver une connexion avec l'uri : {0}
it: Non è stato possibile trovare la connessione per l'URI:{0}
ja: URI '{0}' の接続 が見つかりませんでした。
ko: {0} URI를 사용하여 연결을 찾을 수 없습니다.
pt_br: Não foi possível localizar a conexão com o uri: {0}
zh_hans: 找不到与此 URI 的连接: {0}

# connectionStatusManager.uriAlreadyInConnectionsList
source: There is already a connection with uri: {0}
de: Es besteht bereits eine Verbindung mit URI: {0}
es: Ya hay una conexión con el URI: {0}
fr: Il existe déjà une connexion avec l’uri : {0}
it: Esiste già una connessione con URI: {0}
ja: URI を持つ接続が既に存在します: {0}
ko: {0} URI가 있는 연결이 이미 있습니다.
pt_br: Já existe uma conexão com o uri: {0}
zh_hans: 已存在与此 URI 的连接: {0}

# schema.dashboardWidgets.InsightsRegistry
source: Widget used in the dashboards
de: In den Dashboards verwendetes Widget
es: Widget utilizado en los paneles
fr: Widget utilisé dans les tableaux de bord
it: Widget usato nei dashboard
ja: ダッシュ ボードで使用されているウィジェット
ko: 대시보드에 사용되는 위젯
pt_br: Widget usado nos painéis
zh_hans: 仪表板中使用的小组件

# schema.dashboardWidgets.all
source: Widget used in the dashboards
de: In den Dashboards verwendetes Widget
es: Widget utilizado en los paneles
fr: Widget utilisé dans les tableaux de bord
it: Widget usato nei dashboard
ja: ダッシュ ボードで使用されているウィジェット
ko: 대시보드에 사용되는 위젯
pt_br: Widget usado nos painéis
zh_hans: 仪表板中使用的小组件

# schema.dashboardWidgets.database
source: Widget used in the dashboards
de: In den Dashboards verwendetes Widget
es: Widget utilizado en los paneles
fr: Widget utilisé dans les tableaux de bord
it: Widget usato nei dashboard
ja: ダッシュ ボードで使用されているウィジェット
ko: 대시보드에 사용되는 위젯
pt_br: Widget usado nos painéis
zh_hans: 仪表板中使用的小组件

# schema.dashboardWidgets.server
source: Widget used in the dashboards
de: In den Dashboards verwendetes Widget
es: Widget utilizado en los paneles
fr: Widget utilisé dans les tableaux de bord
it: Widget usato nei dashboard
ja: ダッシュ ボードで使用されているウィジェット
ko: 대시보드에 사용되는 위젯
pt_br: Widget usado nos painéis
zh_hans: 仪表板中使用的小组件

# noSerializationProvider
source: Cannot serialize data as no provider has been registered
de: Daten können nicht serialisiert werden, weil kein Anbieter registriert wurde.
es: No se pueden serializar datos ya que no se ha registrado ningún proveedor
fr: Impossible de sérialiser les données, car aucun fournisseur n'est inscrit
it: Non è possibile serializzare i dati perché non è stato registrato alcun provider
ja: プロバイダーが登録されていないため、データをシリアル化できません
ko: 공급자가 등록되지 않은 경우 데이터를 직렬화할 수 없습니다.
pt_br: Não foi possível serializar os dados, pois não foi registrado nenhum provedor
zh_hans: 无法序列化数据，因为尚未注册任何提供程序

# saveAsNotSupported
source: Saving results into different format disabled for this data provider.
de: Das Speichern von Ergebnissen in einem anderen Format ist für diesen Datenanbieter deaktiviert.
es: El guardado de resultados en diferentes formatos se ha deshabilitado para este proveedor de datos.
fr: L'enregistrement des résultats dans un format différent est désactivé pour ce fournisseur de données.
it: Il salvataggio dei risultati in un formato diverso è disabilitato per questo provider di dati.
ja: このデータ プロバイダーに対して無効になっている別の形式で結果を保存しています。
ko: 이 데이터 공급자에 대해 사용하지 않도록 설정한 다른 형식으로 결과를 저장하고 있습니다.
pt_br: O salvamento de resultados em diferentes formatos está desabilitado para este provedor de dados.
zh_hans: 已禁止此数据提供程序将结果保存为其他格式。

# unknownSerializationError
source: Serialization failed with an unknown error
de: Unbekannter Fehler bei der Serialisierung.
es: Error desconocido en la serialización
fr: La sérialisation a échoué avec une erreur inconnue
it: La serializzazione non è riuscita e si verificato un errore sconosciuto
ja: 不明なエラーにより、シリアル化に失敗しました
ko: 알 수 없는 오류로 인해 serialization에 실패했습니다.
pt_br: Falha na serialização com um erro desconhecido
zh_hans: 出现未知错误，序列化失败

# buttonDropdownBackgroundHover
source: The button dropdown background hover color
de: Die Hoverfarbe für den Hintergrund des Schaltflächen-Dropdownfelds
es: Color de fondo del menú desplegable del botón al mantener el puntero
fr: Couleur de pointage de l'arrière-plan de la liste déroulante du bouton
it: Colore di sfondo al passaggio del mouse sulla casella a discesa del pulsante
ja: ボタン ドロップダウンの背景のポイント時の色
ko: 단추 드롭다운 배경 가리키기 색
pt_br: A cor do foco da tela de fundo suspensa do botão
zh_hans: 按钮下拉背景悬停颜色

# buttonDropdownBoxShadow
source: The button dropdown box shadow color
de: Die Schattenfarbe des Schaltflächen-Dropdownfelds
es: Color de la sombra del cuadro desplegable del botón
fr: Couleur de l'ombre de la zone déroulante du bouton
it: Colore di ombreggiatura della casella a discesa del pulsante
ja: ボタン ドロップダウン ボックスの影の色
ko: 단추 드롭다운 상자 그림자 색
pt_br: A cor da sombra da caixa suspensa do botão
zh_hans: 按钮下拉框阴影颜色

source: Callout dialog body background.
de: Texthintergrund des Legendendialogfelds.
es: Fondo del cuerpo del cuadro de diálogo de llamada.
fr: Arrière-plan du corps de la boîte de dialogue de légende.
it: Sfondo del corpo della finestra di dialogo callout.
ja: 吹き出しダイアログの本文の背景。
ko: 설명선 대화 상자 본문 배경입니다.
pt_br: Tela de fundo do corpo da caixa de diálogo do texto explicativo.
zh_hans: 标注对话框正文背景。

# calloutDialogExteriorBorder
source: Callout dialog exterior borders to provide contrast against notebook UI.
de: Die Außenränder des Legendendialogfelds stellen einen Kontrast zur Notebook-Benutzeroberfläche dar.
es: Bordes exteriores del cuadro de diálogo de llamada que se usan para proporcionar contraste con la interfaz de usuario del cuaderno.
fr: Bordures extérieures de la boîte de dialogue de légende pour fournir du contraste sur l'interface utilisateur du notebook.
it: Bordi esterni della finestra di dialogo di callout per fornire un contrasto con l'interfaccia utente del notebook.
ja: ノートブック UI に対してコントラストを提供する吹き出しダイアログの外側の境界線。
ko: Notebook UI에 대비를 제공하는 설명선 대화 상자 외부 테두리입니다.
pt_br: Bordas exteriores da caixa de diálogo do texto explicativo para fornecer contraste em relação à interface do usuário do notebook.
zh_hans: 标注对话框外部边框，与笔记本 UI 形成对比。

source: Callout dialog foreground.
de: Vordergrund des Legendendialogfelds.
es: Primer plano del cuadro de diálogo de llamada.
fr: Premier plan de la boîte de dialogue de légende.
it: Primo piano della finestra di dialogo di callout.
ja: 吹き出しダイアログの前景。
ko: 설명선 대화 상자 전경입니다.
pt_br: Primeiro plano da caixa de diálogo do texto explicativo.
zh_hans: 标注对话框前景。

# calloutDialogHeaderFooterBackground
source: Callout dialog header and footer background.
de: Kopf- und Fußzeilenhintergrund für Legendendialogfeld.
es: Fondo del encabezado y pie del cuadro de diálogo de llamada.
fr: Arrière-plan de l'en-tête et du pied de page de la boîte de dialogue de légende.
it: Sfondo dell'intestazione e del piè di pagina della finestra di dialogo di callout.
ja: 吹き出しダイアログのヘッダーとフッターの背景。
ko: 설명선 대화 상자 머리글 및 바닥글 배경입니다.
pt_br: Tela de fundo do cabeçalho e rodapé da caixa de diálogo do texto explicativo.
zh_hans: 标注对话框页眉和页脚背景。

# calloutDialogInteriorBorder
source: Callout dialog interior borders used for separating elements.
de: Die Innenränder des Legendendialogfelds werden zum Trennen von Elementen verwendet.
es: Bordes interiores del cuadro de diálogo de llamada que se usan para separar elementos.
fr: Bordures intérieures de la boîte de dialogue de légende utilisées pour séparer les éléments.
it: Bordi interni della finestra di dialogo callout usati per separare gli elementi.
ja: 要素を区切るために使用される吹き出しダイアログの内側の境界線。
ko: 요소를 구분하는 데 사용되는 설명선 대화 상자 내부 테두리입니다.
pt_br: Bordas interiores da caixa de diálogo do texto explicativo usadas para separar elementos.
zh_hans: 标注对话框内部边框，用于分隔元素。

# calloutDialogShadowColor
source: Callout dialog box shadow color.
de: Schattenfarbe des Legendendialogfelds.
es: Color de sombra del cuadro de diálogo de llamada.
fr: Couleur de l'ombre de la boîte de dialogue de légende.
it: Colore di ombreggiatura della finestra di dialogo di callout.
ja: 吹き出しダイアログ ボックスの影の色。
ko: 설명선 대화 상자 그림자 색입니다.
pt_br: Cor da sombra da caixa de diálogo do texto explicativo.
zh_hans: 标注对话框阴影颜色。

# designer.paneSeparator
source: The pane separator color.
de: Die Trennzeichenfarbe des Bereichs.
it: Colore separatore riquadro.
ja: ウィンドウ区切り記号の色。
ko: 창 구분 기호 색입니다.

# extensionPackGradientColorOne
source: The top color for the extension pack gradient
de: Die obere Farbe für den Farbverlauf des Erweiterungspakets
es: Color superior del degradado del paquete de extensiones
fr: Couleur supérieure du dégradé du pack d'extension
it: Colore superiore per la sfumatura del pacchetto di estensione
ja: 拡張機能パックのグラデーションの上部の色
ko: 확장 팩 그라데이션의 위쪽 색
pt_br: A cor superior do gradiente do pacote de extensão
zh_hans: 扩展包渐变的顶部颜色

# extensionPackGradientColorTwo
source: The bottom color for the extension pack gradient
de: Die untere Farbe für den Farbverlauf des Erweiterungspakets
es: Color inferior del degradado del paquete de extensiones
fr: Couleur inférieure du dégradé du pack d'extension
it: Colore inferiore per la sfumatura del pacchetto di estensione
ja: 拡張機能パックのグラデーションの下部の色
ko: 확장 팩 그라데이션의 아래쪽 색
pt_br: A cor inferior do gradiente do pacote de extensão
zh_hans: 扩展包渐变的底部颜色

# extensionPackHeaderShadow
source: The extension pack header text shadowcolor
de: Die Schattenfarbe für den Kopfzeilentext des Erweiterungspakets
es: Color de fondo del texto del encabezado del paquete de extensiones
fr: Couleur de l'ombre du texte d'en-tête du pack d'extension
it: Colore di ombreggiatura del testo dell'intestazione del pacchetto di estensione
ja: 拡張機能パックのヘッダー テキストの shadowcolor
ko: 확장 팩 헤더 텍스트 그림자 색
pt_br: A cor da sombra do texto do cabeçalho do pacote de extensão
zh_hans: 扩展包标头文本阴影颜色

# gradientBackground
source: The background color for the banner image gradient
de: Die Hintergrundfarbe für den Farbverlauf des Bannerbilds.
es: Color de fondo del degradado de la imagen del mensaje emergente
fr: Couleur d'arrière-plan du dégradé de l'image de bannière
it: Colore di sfondo per la sfumatura dell'immagine del banner
ja: バナー画像のグラデーションの背景色
ko: 배너 이미지 그라데이션의 배경색
pt_br: A cor da tela de fundo do gradiente de imagem da barra de notificação
zh_hans: 横幅图像渐变的背景色

# gradientOne
source: The top color for the banner image gradient
de: Die obere Farbe für den Farbverlauf des Bannerbilds.
es: Color superior del degradado de la imagen del mensaje emergente
fr: Couleur supérieure du dégradé de l'image de bannière
it: Colore superiore per la sfumatura dell'immagine del banner
ja: バナー画像のグラデーションの上部の色
ko: 배너 이미지 그라데이션의 위쪽 색
pt_br: A cor superior do gradiente de imagem da barra de notificação
zh_hans: 横幅图像渐变的顶部颜色

# gradientTwo
source: The bottom color for the banner image gradient
de: Die untere Farbe für den Farbverlauf des Bannerbilds.
es: Color inferior del degradado de la imagen del mensaje emergente
fr: Couleur inférieure du dégradé de l'image de bannière
it: Colore inferiore per la sfumatura dell'immagine del banner
ja: バナー画像のグラデーションの下部の色
ko: 배너 이미지 그라데이션의 아래쪽 색
pt_br: A cor inferior do gradiente de imagem da barra de notificação
zh_hans: 横幅图像渐变的底部颜色

# groupHeaderBackground
source: Background color of the group header.
de: Hintergrundfarbe des Gruppenheaders.
it: Colore di sfondo dell'intestazione del gruppo.
ja: グループ ヘッダーの背景色。
ko: 그룹 헤더의 배경색입니다.

# infoBox.errorBackground
source: InfoBox: The background color when the notification type is error.
de: InfoBox: Die Hintergrundfarbe für den Benachrichtigungstyp "Fehler".
es: Cuadro de información: color de fondo cuando la notificación es sobre algún error.
fr: InfoBox : couleur d'arrière-plan quand le type de notification est Erreur.
it: InfoBox: colore di sfondo per una notifica di tipo errore.
ja: InfoBox: 通知の種類がエラーの場合の背景色。
ko: InfoBox: 알림 유형이 오류인 경우 배경색입니다.
pt_br: InfoBox: a cor da tela de fundo quando o tipo de notificação for erro.
zh_hans: InfoBox: 通知类型为错误时的背景色。

# infoBox.infomationBackground
source: InfoBox: The background color when the notification type is information.
de: InfoBox: Die Hintergrundfarbe für den Benachrichtigungstyp "Information".
es: Cuadro de información: color de fondo cuando la notificación es informativa.
fr: InfoBox : couleur d'arrière-plan quand le type de notification est Information.
it: InfoBox: colore di sfondo per una notifica di tipo informazioni.
ja: InfoBox: 通知の種類が情報の場合の背景色。
ko: InfoBox: 알림 유형이 정보인 경우 배경색입니다.
pt_br: InfoBox: a cor da tela de fundo quando o tipo de notificação for informações.
zh_hans: InfoBox: 通知类型为信息时的背景色。

# infoBox.successBackground
source: InfoBox: The background color when the notification type is success.
de: InfoBox: Die Hintergrundfarbe für den Benachrichtigungstyp "Erfolgreich".
es: Cuadro de información: color de fondo cuando la notificación es sobre algo correcto.
fr: InfoBox : couleur d'arrière-plan quand le type de notification est Réussite.
it: InfoBox: colore di sfondo per una notifica di tipo operazione riuscita.
ja: InfoBox: 通知の種類が成功の場合の背景色。
ko: InfoBox: 알림 유형이 성공인 경우 배경색입니다.
pt_br: InfoBox: a cor da tela de fundo quando o tipo de notificação for bem-sucedido.
zh_hans: InfoBox: 通知类型为成功时的背景色。

# infoBox.warningBackground
source: InfoBox: The background color when the notification type is warning.
de: InfoBox: Die Hintergrundfarbe für den Benachrichtigungstyp "Warnung".
es: Cuadro de información: color de fondo cuando la notificación es sobre alguna advertencia.
fr: InfoBox : couleur d'arrière-plan quand le type de notification est Avertissement.
it: InfoBox: colore di sfondo per una notifica di tipo avviso.
ja: InfoBox: 通知の種類が警告の場合の背景色。
ko: InfoBox: 알림 유형이 경고인 경우 배경색입니다.
pt_br: InfoBox: a cor da tela de fundo quando o tipo de notificação for aviso.
zh_hans: InfoBox: 通知类型为警告时的背景色。

# infoButton.background
source: Info button background color.
de: Hintergrundfarbe für Infoschaltfläche.
es: Color de fondo del botón de información.
fr: Couleur d'arrière-plan du bouton d'informations.
it: Colore di sfondo del pulsante informazioni.
ja: 情報ボタンの背景色。
ko: 정보 단추 배경색입니다.
pt_br: Cor da tela de fundo do botão de informações.
zh_hans: 信息按钮背景色。

# infoButton.border
source: Info button border color.
de: Rahmenfarbe für Infoschaltfläche.
es: Color de borde del botón de información.
fr: Couleur de bordure du bouton d'informations.
it: Colore del bordo del pulsante informazioni.
ja: 情報ボタンの境界線の色。
ko: 정보 단추 테두리 색입니다.
pt_br: Cor da borda do botão de informações.
zh_hans: 信息按钮边框颜色。

# infoButton.foreground
source: Info button foreground color.
de: Vordergrundfarbe für Infoschaltfläche.
es: Color de primer plano del botón de información.
fr: Couleur de premier plan du bouton d'informations.
it: Colore di primo piano del pulsante informazioni.
ja: 情報ボタンの前景色。
ko: 정보 단추 전경색입니다.
pt_br: Cor de primeiro plano do botão de informações.
zh_hans: 信息按钮前景色。

# infoButton.hoverBackground
source: Info button hover background color.
de: Hoverfarbe für den Hintergrund der Infoschaltfläche.
es: Color de fondo al mantener el puntero en el botón de información.
fr: Couleur d'arrière-plan du pointage sur le bouton d'informations.
it: Colore di sfondo al passaggio del mouse sul pulsante informazioni.
ja: 情報ボタンのポイント時の背景色。
ko: 정보 단추 가리키기 배경색입니다.
pt_br: Cor do foco da tela de fundo do botão de informações.
zh_hans: 信息按钮悬停背景色。

# notebook.buttonMenuArrow
source: Notebook: Main toolbar custom buttonMenu dropdown arrow
de: Notebook: Dropdownpfeil für benutzerdefiniertes buttonMenu der Hauptsymbolleiste
es: Cuaderno: flecha de lista desplegable personalizada buttonMenu de la barra de herramientas principal
fr: Notebook : flèche déroulante du buttonMenu personnalisé de la barre d'outils principale
it: Notebook: freccia a discesa del menu dei pulsanti personalizzati della barra degli strumenti principale
ja: Notebook: メイン ツールバーのカスタム buttonMenu ドロップダウン矢印
ko: Notebook: 주 도구 모음 사용자 지정 단추 메뉴 드롭다운 화살표
pt_br: Notebook: seta suspensa do buttonMenu personalizado da barra de ferramentas principal
zh_hans: 笔记本: 主工具栏自定义按钮菜单下拉箭头

# notebook.cellBorder
source: Notebook: Active cell border
de: Notebook: Rahmen für aktive Zelle
es: Cuaderno: borde de celda activa
fr: Notebook : bordure de cellule active
it: Notebook: bordo cella attiva
ja: Notebook: アクティブ セルの枠線
ko: Notebook: 활성 셀 테두리
pt_br: Notebook: borda da célula ativa
zh_hans: 笔记本: 活动单元格边框

source: Notebook: Code editor background
de: Notebook: Code-Editor-Hintergrund
es: Cuaderno: fondo del editor de código
fr: Notebook : arrière-plan de l'éditeur de code
it: Notebook: sfondo dell'editor di codice
ja: Notebook: コード エディターの背景
ko: Notebook: 코드 편집기 배경
pt_br: Notebook: tela de fundo do editor de código
zh_hans: 笔记本: 代码编辑器背景

# notebook.codeEditorBackgroundActive
source: Notebook: Code editor background of active cell
de: Notebook: Code-Editor-Hintergrund der aktiven Zelle
es: Cuaderno: fondo del editor de código de la celda activa
fr: Notebook : arrière-plan de l'éditeur de code de la cellule active
it: Notebook: sfondo dell'editor di codice della cella attiva
ja: Notebook: コード エディターのアクティブ セルの背景
ko: Notebook: 활성 셀의 코드 편집기 배경
pt_br: Notebook: tela de fundo do editor de código da célula ativa
zh_hans: 笔记本: 活动单元格的代码编辑器背景
