Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# serversAriaLabel
source: Servers
de: Server
es: Servidores
fr: Serveurs
it: Server
ja: サーバー
ko: 서버
pt_br: Servidores
zh_hans: 服务器

# treeAriaLabel
source: Recent Connections
de: Letzte Verbindungen
es: Conexiones recientes
fr: Connexions récentes
it: Connessioni recenti
ja: 最近の接続
ko: 최근 연결
pt_br: Conexões Recentes
zh_hans: 最近的连接

# treeCreation.regTreeAriaLabel
source: Servers
de: Server
es: Servidores
fr: Serveurs
it: Server
ja: サーバー
ko: 서버
pt_br: Servidores
zh_hans: 服务器

# eventSort
source: Sort by event
de: Nach Ereignis sortieren
es: Ordenar por evento
fr: Trier par événement
it: Ordina per evento
ja: イベントで並べ替え
ko: 이벤트 기준 정렬
pt_br: Classificar por evento
zh_hans: 按事件排序

# nameColumn
source: Sort by column
de: Nach Spalte sortieren
es: Ordenar por columna
fr: Trier par colonne
it: Ordina per colonna
ja: 列で並べ替え
ko: 열 기준 정렬
pt_br: Classificar por coluna
zh_hans: 按列排序

# profilerColumnDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# profilerColumnDialog.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# profilerFilterDialog.addClauseText
source: Add a clause
de: Klausel hinzufügen
es: Agregar una cláusula
fr: Ajouter une clause
it: Aggiungi una clausola
ja: 句を追加する
ko: 절 추가
pt_br: Adicionar uma cláusula
zh_hans: 添加子句

# profilerFilterDialog.apply
source: Apply
de: Anwenden
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
ko: 적용
pt_br: Aplicar
zh_hans: 应用

# profilerFilterDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# profilerFilterDialog.clear
source: Clear all
de: Alle löschen
es: Borrar todo
fr: Tout effacer
it: Cancella tutto
ja: すべてクリア
ko: 모두 지우기
pt_br: Limpar tudo
zh_hans: 全部清除

# profilerFilterDialog.containsOperator
source: Contains
de: Enthält
es: Contiene
fr: Contient
it: Contiene
ja: 含む
ko: 포함
pt_br: Contém
zh_hans: 包含

# profilerFilterDialog.fieldColumn
source: Field
de: Feld
es: Campo
fr: Champ
it: Campo
ja: フィールド
ko: 필드
pt_br: Campo
zh_hans: 字段

# profilerFilterDialog.isNotNullOperator
source: Is Not Null
de: Ist nicht NULL
es: No es NULL
fr: N'est pas Null
it: Non è Null
ja: Null でない
ko: Null이 아님
pt_br: Não É Nulo
zh_hans: 不为 Null

# profilerFilterDialog.isNullOperator
source: Is Null
de: Ist NULL
es: Es NULL
fr: Est Null
it: È Null
ja: Null である
ko: Null임
pt_br: É Nulo
zh_hans: 为 Null

# profilerFilterDialog.loadFilter
source: Load Filter
de: Filter laden
es: Cargar filtro
fr: Charger le filtre
it: Carica filtro
ja: フィルターを読み込む
ko: 필터 로드
pt_br: Carregar Filtro
zh_hans: 加载筛选器

# profilerFilterDialog.notContainsOperator
source: Not Contains
de: Enthält nicht
es: No contiene
fr: Ne contient pas
it: Non contiene
ja: 含まない
ko: 포함하지 않음
pt_br: Não Contém
zh_hans: 不包含

# profilerFilterDialog.notStartsWithOperator
source: Not Starts With
de: Beginnt nicht mit
es: No comienza por
fr: Ne commence pas par
it: Non inizia con
ja: 次で始まらない
ko: 다음으로 시작하지 않음
pt_br: Não Começa Com
zh_hans: 开头不为

# profilerFilterDialog.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# profilerFilterDialog.operatorColumn
source: Operator
es: Operador
fr: Opérateur
it: Operatore
ja: 演算子
ko: 연산자
pt_br: Operador
zh_hans: 运算符

# profilerFilterDialog.remove
source: Remove this clause
de: Diese Klausel entfernen
es: Quitar esta cláusula
fr: Supprimer cette clause
it: Rimuovi questa clausola
ja: この句を削除する
ko: 이 절 제거
pt_br: Remover esta cláusula
zh_hans: 删除此子句

# profilerFilterDialog.saveFilter
source: Save Filter
de: Filter speichern
es: Guardar filtro
fr: Enregistrer le filtre
it: Salva filtro
ja: フィルターを保存する
ko: 필터 저장
pt_br: Salvar Filtro
zh_hans: 保存筛选器

# profilerFilterDialog.startsWithOperator
source: Starts With
de: Beginnt mit
es: Comienza por
fr: Commence par
it: Inizia con
ja: 次で始まる
ko: 다음으로 시작
pt_br: Começa Com
zh_hans: 开头为

# profilerFilterDialog.title
source: Filters
de: Filter
es: Filtros
fr: Filtres
it: Filtri
ja: フィルター
ko: 필터
pt_br: Filtros
zh_hans: 筛选器

# profilerFilterDialog.valueColumn
source: Value
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
ko: 값
pt_br: Valor
zh_hans: 值

# queryManagement.noQueryRunnerForUri
source: Could not find Query Runner for uri: {0}
de: Die Abfragenausführung für URI konnte nicht gefunden werden: {0}
es: No se encontró el ejecutor de consultas para el URI: {0}
fr: Impossible de trouver Query Runner pour l’uri :{0}
it: Non è stato possibile trovare il Runner di query per l'URI: {0}
ja: URI のクエリ ランナーが見つかりませんでした:{0}
ko: {0} URI에 대한 쿼리 실행기를 찾을 수 없습니다.
pt_br: Não foi possível localizar o Executor de Consulta para o uri: {0}
zh_hans: 找不到此 URI 的查询运行程序: {0}

# queryManagement.uriAlreadyHasQueryRunner
source: Uri: {0} unexpectedly already has a query runner.
de: URI: {0} verfügt unerwarteterweise bereits über eine Abfragenausführung.
es: URI: inesperadamente {0} ya tiene un ejecutor de consultas.
fr: Uri : {0} a déjà un Runner de requête de manière inattendue.
it: URI: {0} imprevisto ha già un Runner di query.
ja: URI: {0}には予期しないクエリ ランナーが既に存在します。
ko: URI: {0} 예외에는 쿼리 실행기를 이미 가지고 있습니다.
pt_br: Uri: {0} inesperadamente já tem um executor de consulta.
zh_hans: URI: {0} 意外地已具有查询运行程序。

# commitEditFailed
source: Commit row failed:
de: Fehler bei Zeilencommit:
es: Error al confirmar una fila:
fr: La validation de la ligne a échoué :
it: Commit della riga non riuscito:
ja: 行のコミットに失敗しました:
ko: 행 커밋 실패:
pt_br: A linha de commit falhou:
zh_hans: 提交行失败:

# msgCancelQueryFailed
source: Canceling the query failed: {0}
de: Fehler beim Abbrechen der Abfrage: {0}
es: Error al cancelar la consulta: {0}
fr: L'annulation de la requête a échoué : {0}
it: Annullamento della query non riuscito: {0}
ja: 失敗したクエリのキャンセル中: {0}
ko: 쿼리 취소 실패: {0}
pt_br: O cancelamento da consulta falhou: {0}
zh_hans: 取消查询失败: {0}

# queryModelService.noQueryFoundForUri
source: No Query found for {0}
de: Für {0} wurde keine Abfrage gefunden.
es: No se encontró ninguna consulta para {0}
fr: Requête introuvable pour {0}
it: Non sono state trovate query per {0}
ja: {0}のクエリがありません
ko: {0}에 대한 쿼리를 찾을 수 없습니다.
pt_br: Nenhuma Consulta encontrada para {0}
zh_hans: 找不到 {0} 的查询

# queryModelService.uriAlreadyHasQuery
source: {0} already has an existing query
de: {0} verfügt bereits über eine vorhandene Abfrage.
es: {0} ya tiene una consulta existente
fr: {0} a déjà une requête existante.
it: {0} esiste già una query esistente
ja: {0} には既存のクエリが既に存在します
ko: {0}에 기존 쿼리가 이미 있습니다.
pt_br: {0} já tem uma consulta existente
zh_hans: {0} 已具有现有查询

# runQueryBatchStartLine
source: Line {0}
de: Zeile {0}
es: Línea {0}
fr: Ligne {0}
it: Riga {0}
ja: 行 {0}
ko: 줄 {0}
pt_br: Linha {0}
zh_hans: 第 {0} 行

# runQueryBatchStartMessage
source: Started executing query at
de: Ausführung der Abfrage gestartet um
es: La consulta comenzó a ejecutarse a las
fr: Exécution de la requête démarrée à
it: Esecuzione della query iniziata a
ja: 次の場所でクエリの実行を開始しました:
ko: 다음에서 쿼리 실행 시작:
pt_br: Iniciada a execução de consulta em
zh_hans: 开始执行查询的位置:

# runQueryStringBatchStartMessage
source: Started executing query "{0}"
de: Die Ausführung der Abfrage "{0}" wurde gestartet.
es: Comenzó a ejecutar la consulta "{0}"
fr: L'exécution de la requête "{0}" a démarré
it: Esecuzione della query "{0}" avviata
ja: クエリ「{0}」の実行を開始しました
ko: 쿼리 "{0}" 실행을 시작함
pt_br: Começou a executar consulta "{0}"
zh_hans: 已开始执行查询 "{0}"

source: Update cell failed:
de: Fehler beim Aktualisieren der Zelle:
es: Error en la actualización de la celda:
fr: La mise à jour de la cellule a échoué :
it: Aggiornamento della cella non riuscito:
ja: セルの更新が失敗しました:
ko: 셀 업데이트 실패:
pt_br: Falha na célula de atualização:
zh_hans: 更新单元格失败:

# elapsedBatchTime
source: Batch execution time: {0}
de: Batchausführungszeit: {0}
es: Tiempo de ejecución por lotes: {0}
fr: Durée d'exécution en lot : {0}
it: Tempo di esecuzione del batch: {0}
ja: バッチ実行時間: {0}
ko: 일괄 처리 실행 시간: {0}
pt_br: Tempo de execução em lote: {0}
zh_hans: 批处理执行时间: {0}

# query.ExecutionFailedError
source: Execution failed due to an unexpected error: {0} {1}
de: Die Ausführung war aufgrund eines unerwarteten Fehlers nicht möglich: {0} {1}
es: La ejecución no se completó debido a un error inesperado: {0} {1}
fr: L'exécution a échoué en raison d'une erreur inattendue : {0} {1}
it: L'esecuzione non è riuscita a causa di un errore imprevisto: {0} {1}
ja: 予期しないエラーにより、実行が失敗しました: {0} {1}
ko: 예기치 않은 오류로 인해 실행하지 못했습니다. {0} {1}
pt_br: A execução falhou devido a um erro inesperado: {0} {1}
zh_hans: 由于意外错误，执行失败: {0} {1}

# query.message.executionTime
source: Total execution time: {0}
de: Ausführungszeit gesamt: {0}
es: Tiempo total de ejecución: {0}
fr: Durée d'exécution totale : {0}
it: Tempo di esecuzione totale: {0}
ja: 総実行時間: {0}
ko: 총 실행 시간: {0}
pt_br: Tempo total de execução: {0}
zh_hans: 执行时间总计: {0}

# query.message.startQuery
source: Started executing batch {0}
de: Die Ausführung von Batch "{0}" wurde gestartet.
es: Se ha iniciado la ejecución del proceso por lotes ({0}).
fr: Démarrage de l'exécution du lot {0}
it: Esecuzione del batch {0} avviata
ja: バッチ {0} の実行を開始しました
ko: 일괄 처리 {0} 실행을 시작함
pt_br: Execução do lote {0} iniciada
zh_hans: 已开始执行批处理 {0}

# query.message.startQueryWithRange
source: Started executing query at Line {0}
de: Die Abfrageausführung wurde in Zeile {0} gestartet.
es: Comenzó a ejecutar la consulta en la línea {0}
fr: L'exécution de la requête a démarré à la ligne {0}
it: L'esecuzione della query a riga {0} è stata avviata
ja: 行 {0} でのクエリの実行が開始されました
ko: 줄 {0}에서 쿼리 실행을 시작함
pt_br: Execução da consulta iniciada na linha {0}
zh_hans: 开始执行查询的位置: 第 {0} 行

# msgSaveFailed
source: Failed to save results.
de: Fehler beim Speichern der Ergebnisse.
es: Error al guardar los resultados.
fr: L'enregistrement des résultats a échoué.
it: Non è stato possibile salvare i risultati.
ja: 結果を保存できませんでした。
ko: 결과를 저장하지 못했습니다.
pt_br: Falha ao salvar os resultados.
zh_hans: 未能保存结果。

# msgSaveSucceeded
source: Successfully saved results to {0}
de: Ergebnisse wurden erfolgreich in "{0}" gespeichert.
es: Los resultados se han guardado correctamente en {0}.
fr: Résultats enregistrés dans {0}
it: I risultati sono stati salvati in {0}
ja: 結果が {0} に正常に保存されました
ko: {0}에 결과를 저장함
pt_br: Os resultados foram salvos com êxito em {0}
zh_hans: 已成功将结果保存到 {0}

source: Open file
de: Datei öffnen
es: Abrir archivo
fr: Ouvrir un fichier
it: Apri file
ja: ファイルを開く
ko: 파일 열기
pt_br: Abrir arquivo
zh_hans: 打开文件

# resultsSerializer.saveAsFileExtensionCSVTitle
source: CSV (Comma delimited)
de: CSV (durch Trennzeichen getrennte Datei)
es: CSV (delimitado por comas)
fr: CSV (valeurs séparées par des virgules)
it: CSV (delimitato da virgole)
ja: CSV (コンマ区切り)
ko: CSV(쉼표로 구분)
pt_br: CSV (separado por vírgula)
zh_hans: CSV (以逗号分隔)

# resultsSerializer.saveAsFileExtensionExcelTitle
source: Excel Workbook
de: Excel-Arbeitsmappe
es: Libro de Excel
fr: Classeur Excel
it: Cartella di lavoro di Excel
ja: Excel ブック
ko: Excel 통합 문서
pt_br: Pasta de Trabalho do Excel
zh_hans: Excel 工作簿

# resultsSerializer.saveAsFileExtensionTXTTitle
source: Plain Text
de: Nur-Text
es: Texto sin formato
fr: Texte brut
it: Testo normale
ja: プレーン テキスト
ko: 일반 텍스트
pt_br: Texto Sem Formatação
zh_hans: 纯文本

# resultsSerializer.saveAsFileTitle
source: Choose Results File
de: Ergebnisdatei auswählen
es: Selección del archivo de resultados
fr: Choisir le fichier de résultats
it: Scegli file di risultati
ja: 結果ファイルの選択
ko: 결과 파일 선택
pt_br: Escolher o Arquivo de Resultados
zh_hans: 选择结果文件

source: Saving file...
de: Datei wird gespeichert...
es: Se está guardando el archivo...
fr: Enregistrement du fichier...
it: Salvataggio del file...
ja: ファイルを保存しています...
ko: 파일을 저장하는 중...
pt_br: Salvando arquivo...
zh_hans: 正在保存文件...

# addIPAddressLabel
source: Add my client IP
de: Meine Client-IP-Adresse hinzufügen
es: Agregar mi IP de cliente
fr: Ajouter l'adresse IP de mon client
it: Aggiungi IP client personale
ja: 自分のクライアント IP アドレスを追加
ko: 내 클라이언트 IP 추가
pt_br: Adicionar o meu IP de cliente
zh_hans: 添加我的客户端 IP

# addIpRangeLabel
source: Add my subnet IP range
de: Meinen Subnetz-IP-Adressbereich hinzufügen
es: Agregar mi rango IP de subred
fr: Ajouter la plage d'adresses IP de mon sous-réseau
it: Aggiungi intervallo di IP della sottorete personale
ja: 自分のサブネット IP 範囲を追加
ko: 내 서브넷 IP 범위 추가
pt_br: Adicionar meu intervalo de IP de sub-rede
zh_hans: 添加我的子网 IP 范围

source: Create new firewall rule
de: Neue Firewallregel erstellen
es: Crear nueva regla de firewall
fr: Créer une règle de pare-feu
it: Crea nuova regola firewall
ja: 新しいファイアウォール規則の作成
ko: 새 방화벽 규칙 만들기
pt_br: Criar regra de firewall
zh_hans: 新建防火墙规则

# filewallRule
source: Firewall rule
de: Firewallregel
es: Regla de firewall
fr: Règle de pare-feu
it: Regola del firewall
ja: ファイアウォール規則
ko: 방화벽 규칙
pt_br: Regra de firewall
zh_hans: 防火墙规则

# firewall.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# firewall.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# firewallRuleDialogDescription
source: Your client IP address does not have access to the server. Sign in to an Azure account and create a new firewall rule to enable access.
de: Ihre Client-IP-Adresse hat keinen Zugriff auf den Server. Melden Sie sich bei einem Azure-Konto an, und erstellen Sie eine neue Firewallregel für die Aktivierung des Zugriffs.
es: La dirección IP del cliente no tiene acceso al servidor. Inicie sesión en una cuenta de Azure y cree una regla de firewall para habilitar el acceso.
fr: L'adresse IP de votre client n'a pas accès au serveur. Connectez-vous à un compte Azure et créez une règle de pare-feu pour autoriser l'accès.
it: L'indirizzo IP client non ha accesso al server. Accedere a un account Azure e creare una nuova regola del firewall per consentire l'accesso.
ja: このクライアント IP アドレスではサーバーにアクセスできません。アクセスできるようにするには、Azure アカウントにサインインし、新しいファイアウォール規則を作成します。
ko: 클라이언트 IP 주소에서 서버에 액세스할 수 없습니다. Azure 계정에 로그인하고 액세스를 허용하는 새 방화벽 규칙을 만드세요.
pt_br: Seu endereço IP de cliente não tem acesso ao servidor. Entre com uma conta Azure e crie uma regra de firewall para permitir o acesso.
zh_hans: 你的客户端 IP 地址无权访问此服务器。请登录到 Azure 帐户，然后新建一个防火墙规则以启用访问。

# firewallRuleHelpDescription
source: Learn more about firewall settings
de: Weitere Informationen zu Firewalleinstellungen
es: Más información sobre configuración de firewall
fr: En savoir plus sur les paramètres de pare-feu
it: Altre informazioni sulle impostazioni del firewall
ja: ファイアウォール設定の詳細情報
ko: 방화벽 설정에 대한 자세한 정보
pt_br: Saiba mais sobre as configurações do firewall
zh_hans: 详细了解防火墙设置

source: From
de: Von
es: De
fr: De
it: Da
ja: 開始
ko: 시작
pt_br: De
zh_hans: 从

source: To
de: An
es: A
fr: À
it: A
ja: 終了
ko: 끝
pt_br: Para
zh_hans: 到

# firewallDialog.addAccountErrorTitle
source: Error adding account
de: Fehler beim Hinzufügen des Kontos
es: Error al agregar la cuenta
fr: Erreur d'ajout de compte
it: Errore di aggiunta account
ja: アカウントの追加でのエラー
ko: 계정 추가 오류
pt_br: Erro ao adicionar a conta
zh_hans: 添加帐户时出错

source: Firewall rule error
de: Fehler bei Firewallregel
es: Error de la regla de firewall
fr: Erreur de règle de pare-feu
it: Errore della regola del firewall
ja: ファイアウォール規則のエラー
ko: 방화벽 규칙 오류
pt_br: Erro de regra de firewall
zh_hans: 防火墙规则错误

# RestoreDialogTitle
source: Restore database
de: Datenbank wiederherstellen
es: Restauración de una base de datos
fr: Restaurer la base de données
it: Ripristina database
ja: データベースの復元
ko: 데이터베이스 복원
pt_br: Restaurar banco de dados
zh_hans: 还原数据库

source: Backup file path
de: Pfad zur Sicherungsdatei
es: Ruta del archivo de copia de seguridad
fr: Chemin du fichier de sauvegarde
it: Percorso del file di backup
ja: バックアップ ファイルのパス
ko: 백업 파일 경로
pt_br: Caminho do arquivo de backup
zh_hans: 备份文件路径

source: Backup sets to restore
de: Wiederherzustellende Sicherungssätze
es: Grupos de copias de seguridad para restaurar
fr: Jeux de sauvegarde à restaurer
it: Set di backup da ripristinare
ja: 復元するバックアップ セット
ko: 복원할 백업 세트
pt_br: Conjuntos de backup para restaurar
zh_hans: 要还原的备份集

source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
zh_hans: 数据库

source: Destination
de: Ziel
es: Destino
it: Destinazione
ja: ターゲット
ko: 대상
pt_br: Destino
zh_hans: 目标

source: File type
de: Dateityp
es: Tipo de archivo
fr: Type de fichier
it: Tipo di file
ja: ファイルの種類
ko: 파일 형식
pt_br: Tipo de arquivo
zh_hans: 文件类型

# filesTitle
source: Files
de: Dateien
es: Archivos
fr: Fichiers
it: File
ja: ファイル
ko: 파일
pt_br: Arquivos
zh_hans: 文件

# generalTitle
source: General
de: Allgemein
fr: Général
it: Generale
ja: 全般
ko: 일반
pt_br: Geral
zh_hans: 常规

source: Logical file Name
de: Logischer Dateiname
es: Nombre lógico del archivo
fr: Nom de fichier logique
it: Nome file logico
ja: 論理ファイル名
ko: 논리적 파일 이름
pt_br: Nome do Arquivo lógico
zh_hans: 逻辑文件名

# missingBackupFilePathError
source: Backup file path is required.
de: Sie müssen einen Pfad für die Sicherungsdatei angeben.
es: Se requiere la ruta de acceso del archivo de copia de seguridad.
fr: Le chemin du fichier de sauvegarde est obligatoire.
it: Il percorso del file di backup è obbligatorio.
ja: バックアップ ファイルのパスが必須です。
ko: 백업 파일 경로가 필요합니다.
pt_br: O caminho do arquivo de backup é obrigatório.
zh_hans: 需要备份文件路径。

# multipleBackupFilePath
source: Please enter one or more file paths separated by commas
de: Geben Sie einen oder mehrere Dateipfade (durch Kommas getrennt) ein.
es: Especifique una o más rutas de archivo separadas por comas
fr: Entrez un ou plusieurs chemins de fichier séparés par des virgules
it: Immettere uno o più percorsi di file separati da virgole
ja: １つまたは複数のファイル パスをコンマで区切って入力してください。
ko: 하나 이상의 파일 경로를 쉼표로 구분하여 입력하세요.
pt_br: Insira um ou mais caminhos de arquivo separados por vírgulas
zh_hans: 请输入一个或多个用逗号分隔的文件路径

# optionsTitle
source: Options
de: Optionen
es: Opciones
it: Opzioni
ja: オプション​​
ko: 옵션
pt_br: Opções
zh_hans: 选项

source: Original File Name
de: Ursprünglicher Dateiname
es: Nombre del archivo original
fr: Nom de fichier d'origine
it: Nome file originale
ja: 元のファイル名
ko: 원래 파일 이름
pt_br: Nome do Arquivo Original
zh_hans: 原始文件名

source: Restore as
de: Wiederherstellen als
es: Restaurar como
fr: Restaurer comme
it: Ripristina come
ja: 復元ファイル名
ko: 다음으로 복원
pt_br: Restaurar como
zh_hans: 还原为

# restoreDatabaseFileAs
source: Restore database files as
de: Datenbankdateien wiederherstellen als
es: Restaurar archivos de base de datos como
fr: Restaurer les fichiers de base de données en tant que
it: Ripristina file di database come
ja: データベース ファイルを名前を付けて復元
ko: 데이터베이스 파일을 다음으로 복원
pt_br: Restaurar arquivos de banco de dados como
zh_hans: 将数据库文件还原为

source: Restore database file details
de: Details zu Datenbankdateien wiederherstellen
es: Restaurar detalles del archivo de base de datos
fr: Restaurer les détails du fichier de base de données
it: Dettagli del file di ripristino del database
ja: データベース ファイルの詳細を復元する
ko: 데이터베이스 파일 복원 세부 정보
pt_br: Restaurar os detalhes do arquivo de banco de dados
zh_hans: 还原数据库文件详细信息

# restoreDialog.backupFile
source: Backup file
de: Sicherungsdatei
es: Archivo de copia de seguridad
fr: Fichier de sauvegarde
it: File di backup
ja: バックアップ ファイル
ko: 백업 파일
pt_br: Arquivo de backup
zh_hans: 备份文件

# restoreDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# restoreDialog.database
source: Database
de: Datenbank
es: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt_br: Banco de dados
zh_hans: 数据库

# restoreDialog.restore
source: Restore
de: Wiederherstellen
es: Restaurar
fr: Restaurer
it: Ripristina
ja: 復元
ko: 복원
pt_br: Restaurar
zh_hans: 还原

# restoreDialog.restoreTitle
source: Restore database
de: Datenbank wiederherstellen
es: Restauración de una base de datos
fr: Restaurer la base de données
it: Ripristina database
ja: データベースの復元
ko: 데이터베이스 복원
pt_br: Restaurar banco de dados
zh_hans: 还原数据库

# restoreDialog.script
source: Script
de: Skript
ja: スクリプト
ko: 스크립트
zh_hans: 脚本

source: Restore from
de: Wiederherstellen aus
es: Restaurar de
fr: Restaurer à partir de
it: Ripristina da
ja: 復元元
ko: 복원할 원본 위치
pt_br: Restaurar de
zh_hans: 还原自

source: Restore options
de: Wiederherstellungsoptionen
es: Opciones de restauración
fr: Options de restauration
it: Opzioni di ripristino
ja: 復元オプション
ko: 복원 옵션
pt_br: Opções de restauração
zh_hans: 还原选项

source: Restore plan
de: Wiederherstellungsplan
es: Plan de restauración
fr: Plan de restauration
it: Piano di ripristino
ja: 復元計画
ko: 복원 계획
pt_br: Restaurar plano
zh_hans: 还原计划

source: Restore to
de: Wiederherstellen in
es: Restaurar en
fr: Restaurer vers
it: Ripristina in
ja: 復元先
ko: 복원 위치
pt_br: Restaurar para
zh_hans: 还原到

# serverConnection
source: Server connections
de: Serververbindungen
es: Conexiones del servidor
fr: Connexions du serveur
it: Connessioni server
ja: サーバーの接続
ko: 서버 연결
pt_br: Conexões de servidor
zh_hans: 服务器连接

source: Source
de: Quelle
es: Origen
it: Origine
ja: ソース
ko: 원본
pt_br: Fonte
zh_hans: 源

source: Tail-Log backup
de: Sicherung des Protokollfragments
es: Copia del final del registro
fr: Sauvegarde de la fin du journal
it: Backup della parte finale del log
ja: ログ末尾のバックアップ
ko: 비상 로그 백업
pt_br: Backup da parte final do log
zh_hans: 结尾日志备份

source: Target database
de: Zieldatenbank
es: Base de datos de destino
fr: Base de données cible
it: Database di destinazione
ja: ターゲット データベース
ko: 대상 데이터베이스
pt_br: Banco de dados de destino
zh_hans: 目标数据库

# backup.allFiles
source: All Files
de: Alle Dateien
es: Todos los archivos
fr: Tous les fichiers
it: Tutti i file
ja: すべてのファイル
ko: 모든 파일
pt_br: Todos os Arquivos
zh_hans: 所有文件

# backup.filterBackupFiles
source: Backup Files
de: Sicherungsdateien
es: Archivos de copia de seguridad
fr: Fichiers de sauvegarde
it: File di backup
ja: バックアップ ファイル
ko: 백업 파일
pt_br: Arquivos de Backup
zh_hans: 备份文件

# MissingGroupNameError
source: Group name is required.
de: Der Gruppenname ist erforderlich.
es: Se requiere el nombre del grupo.
fr: Le nom du groupe est obligatoire.
it: Il nome del gruppo è obbligatorio.
ja: グループ名が必須です。
ko: 그룹 이름이 필요합니다.
pt_br: O nome do grupo é obrigatório.
zh_hans: 组名称是必需的。

# ServerGroupsDialogTitle
source: Server Groups
de: Servergruppen
es: Grupos de servidores
fr: Groupes de serveurs
it: Gruppi di server
ja: サーバー グループ
ko: 서버 그룹
pt_br: Grupos de Servidores
zh_hans: 服务器组

# connectionGroupName
source: Server group name
de: Name der Servergruppe
es: Nombre del grupo de servidores
fr: Nom de groupe de serveurs
it: Nome del gruppo di server
ja: サーバー グループ名
ko: 서버 그룹 이름
pt_br: Nome do grupo de servidores
zh_hans: 服务器组名称

source: Group color
de: Gruppenfarbe
es: Color del grupo
fr: Couleur de groupe
it: Colore del gruppo
ja: グループの色
ko: 그룹 색
pt_br: Cor do grupo
zh_hans: 组颜色

source: Group description
de: Gruppenbeschreibung
es: Descripción del grupo
fr: Description de groupe
it: Descrizione gruppo
ja: グループの説明
ko: 그룹 설명
pt_br: Descrição do grupo
zh_hans: 组描述

# serverGroup.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# serverGroup.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# serverGroup.addServerGroup
source: Add server group
de: Servergruppe hinzufügen
es: Agregar grupo de servidores
fr: Ajouter un groupe de serveurs
it: Aggiungi gruppo di server
ja: サーバー グループを追加する
ko: 서버 그룹 추가
pt_br: Adicionar grupo de servidores
zh_hans: 添加服务器组

# serverGroup.editServerGroup
source: Edit server group
de: Servergruppe bearbeiten
es: Editar grupo de servidores
fr: Modifier le groupe de serveurs
it: Modifica gruppo di server
ja: サーバー グループの編集
ko: 서버 그룹 편집
pt_br: Editar grupo de servidores
zh_hans: 编辑服务器组

# designer.checkConstraint.description.expression
source: The expression defining the check constraint.
de: Der Ausdruck, durch den die CHECK-Einschränkung definiert wird.
it: Espressione che definisce il vincolo CHECK.
ja: CHECK 制約を定義する式です。
ko: CHECK 제약 조건을 정의하는 식입니다.
