Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# duplicateView2
source: A view with id `{0}` is already registered in the view container `{1}`
de: Im Container "{1}" mit Sichten ist bereits eine Sicht mit der ID {0} registriert.
es: Una vista con el identificador "{0}" ya está registrada en el contenedor de vista "{1}"
fr: Une vue avec l'ID '{0}' est déjà inscrite dans le conteneur de vues '{1}'
it: Una visualizzazione con ID `{0}` è già registrata nel contenitore di visualizzazioni `{1}`
ja: ビュー ID `{0}` はビュー コンテナー `{1}` に既に登録されています
ko: ID가 '{0}'인 뷰가 뷰 컨테이너 '{1}'에 이미 등록되어 있습니다.
pt_br: Uma exibição com a id '{0}' já está registrada no contêiner de exibição '{1}'
zh_hans: 视图容器“{1}”中已注册有 ID 为“{0}”的视图

# extension.contributes.dataExplorer
source: Contributes views to the editor
de: Stellt Sichten für den Editor zur Verfügung.
es: Aporta vistas al editor
fr: Ajoute des vues à l'éditeur
it: Aggiunge come contributo le visualizzazioni all'editor
ja: ビューをエディターに提供します
ko: 뷰를 편집기에 적용합니다.
pt_br: Contribui com exibições para o editor
zh_hans: 向编辑器提供视图

# extension.dataExplorer
source: Contributes views to Data Explorer container in the Activity bar
de: Stellt Sichten für den Data Explorer-Container in der Aktivitätsleiste zur Verfügung.
es: Aporta vistas al contenedor del Explorador de datos en la barra de la actividad
fr: Ajoute des vues au conteneur Explorateur de données dans la barre d'activités
it: Aggiunge come contributo le visualizzazioni al contenitore Esplora dati nella barra attività
ja: アクティビティ バーのデータ エクスプローラー コンテナーにビューを提供します
ko: 뷰를 작업 막대의 Data Explorer 컨테이너에 적용합니다.
pt_br: Contribui com exibições para o contêiner do Data Explorer na barra de Atividade
zh_hans: 向“活动”栏中的“数据资源管理器”容器提供视图

# optstring
source: property `{0}` can be omitted or must be of type `string`
de: Die Eigenschaft "{0}" kann ausgelassen werden oder muss vom Typ "string" sein.
es: la propiedad "{0}" se puede omitir o debe ser de tipo "string"
fr: La propriété '{0}' peut être omise ou doit être de type 'string'
it: la proprietà `{0}` può essere omessa o deve essere di tipo `string`
ja: プロパティ `{0}` は省略するか、`string` 型にする必要があります
ko: 속성 '{0}'은(는) 생략할 수 있으며 'string' 형식이어야 합니다.
pt_br: a propriedade `{0}` pode ser omitida ou deve ser do tipo `string`
zh_hans: 属性“{0}”可以省略，否则其类型必须是 "string"

# requirearray
source: views must be an array
de: Sichten müssen als Array vorliegen.
es: Las vistas deben ser una matriz
fr: les vues doivent figurer dans un tableau
it: le visualizzazioni devono essere una matrice
ja: ビューは配列にする必要があります
ko: 뷰는 배열이어야 합니다.
pt_br: as exibições devem ser uma matriz
zh_hans: 视图必须为数组

# requirestring
source: property `{0}` is mandatory and must be of type `string`
de: Die Eigenschaft "{0}" ist erforderlich und muss vom Typ "string" sein.
es: la propiedad "{0}" es obligatoria y debe ser de tipo "string"
fr: la propriété '{0}' est obligatoire et doit être de type 'string'
it: la proprietà `{0}` è obbligatoria e deve essere di tipo `string`
ja: プロパティ `{0}` は必須で、`string` 型でなければなりません
ko: 속성 '{0}'은(는) 필수이며 'string' 형식이어야 합니다.
pt_br: a propriedade `{0}` é obrigatória e deve ser do tipo `string`
zh_hans: 属性“{0}”是必需的，其类型必须是 "string"

# vscode.extension.contributes.view.id
source: Identifier of the view. Use this to register a data provider through `vscode.window.registerTreeDataProviderForView` API. Also to trigger activating your extension by registering `onView:${id}` event to `activationEvents`.
de: Bezeichner der Sicht. Hiermit können Sie einen Datenanbieter über die API "vscode.window.registerTreeDataProviderForView" registrieren. Dient auch zum Aktivieren Ihrer Erweiterung, indem Sie das Ereignis "onView:${id}" für "activationEvents" registrieren.
es: Identificador de la vista. Úselo para registrar un proveedor de datos mediante la API "vscode.window.registerTreeDataProviderForView". También para desencadenar la activación de su extensión al registrar el evento "onView:${id}" en "activationEvents".
fr: Identificateur de la vue. Utilisez-le pour inscrire un fournisseur de données au moyen de l'API 'vscode.window.registerTreeDataProviderForView', ainsi que pour déclencher l'activation de votre extension en inscrivant l'événement 'onView:${id}' dans 'activationEvents'.
it: Identificatore della visualizzazione. Usare questa impostazione per registrare un provider di dati tramite l'API `vscode.window.registerTreeDataProviderForView`, nonché per avviare l'attivazione dell'estensione tramite la registrazione dell'evento `onView:${id}` in `activationEvents`.
ja: ビューの識別子。`vscode.window.registerTreeDataProviderForView` API を介してデータ プロバイダーを登録するには、これを使用します。また、`onView:${id}` イベントを `activationEvents` に登録することによって、拡張機能のアクティブ化をトリガーするためにも使用できます。
ko: 뷰의 식별자입니다. 'vscode.window.registerTreeDataProviderForView' API를 통해 데이터 공급자를 등록하는 데 사용합니다. 'onView:${id}' 이벤트를 'activationEvents'에 등록하여 확장 활성화를 트리거하는 데도 사용합니다.
pt_br: Identificador da exibição. Use isso para registrar um provedor de dados por meio da API 'vscode.window.registerTreeDataProviderForView'. Também para ativar sua extensão registrando o evento 'onView: ${id}' para 'activationEvents'.
zh_hans: 视图的标识符。使用标识符通过 "vscode.window.registerTreeDataProviderForView" API 注册数据提供程序。同时将 "onView:${id}" 事件注册到 "activationEvents" 以触发激活扩展。

# vscode.extension.contributes.view.name
source: The human-readable name of the view. Will be shown
de: Der lesbare Name der Sicht. Dieser wird angezeigt.
es: Nombre de la vista en lenguaje natural. Se mostrará
fr: Nom de la vue, contrôlable de visu. À afficher
it: Nome leggibile della visualizzazione. Verrà visualizzato
ja: ビューの判読できる名前。これが表示されます
ko: 사용자가 읽을 수 있는 뷰 이름입니다. 표시됩니다.
pt_br: O nome legível para humanos da exibição. Será mostrado
zh_hans: 用户可读的视图名称。将显示它

# vscode.extension.contributes.view.when
source: Condition which must be true to show this view
de: Eine Bedingung, die TRUE lauten muss, damit diese Sicht angezeigt wird.
es: Condición que se debe cumplir para mostrar esta vista
fr: Condition qui doit être true pour afficher cette vue
it: Condizione che deve essere vera per mostrare questa visualizzazione
ja: このビューを表示するために満たす必要がある条件
ko: 이 뷰를 표시하기 위해 true여야 하는 조건
pt_br: A condição que deve ser true para mostrar esta exibição
zh_hans: 为真时才显示此视图的条件

# dataExplorer.servers
source: Servers
de: Server
es: Servidores
fr: Serveurs
it: Server
ja: サーバー
ko: 서버
pt_br: Servidores
zh_hans: 服务器

# dataexplorer.name
source: Connections
de: Verbindungen
es: Conexiones
fr: Connexions
it: Connessioni
ja: 接続
ko: 연결
pt_br: Conexões
zh_hans: 连接

# showDataExplorer
source: Show Connections
de: Verbindungen anzeigen
es: Mostrar conexiones
fr: Afficher les connexions
it: Mostra connessioni
ja: 接続の表示
ko: 연결 표시
pt_br: Mostrar Conexões
zh_hans: 显示连接

source: Disconnect
de: Trennen
es: Desconectar
fr: Déconnecter
it: Disconnetti
ja: 切断
ko: 연결 끊기
pt_br: Desconectar
zh_hans: 断开连接

source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
zh_hans: 刷新

source: Show Edit Data SQL pane on startup
de: SQL-Bereich zum Bearbeiten von Daten beim Start anzeigen
es: Mostrar panel de edición de datos de SQL al iniciar
fr: Afficher le volet Modifier les données SQL au démarrage
it: Mostra riquadro Modifica dati SQL all'avvio
ja: 起動時にデータ SQL の編集ペインを表示する
ko: 시작 시 데이터 SQL 편집 창 표시
pt_br: Mostrar painel do SQL Editar Dados na inicialização
zh_hans: 启动时显示“编辑数据 SQL”窗格

# disposeEditFailure
source: Dispose Edit Failed With Error:
de: Fehler beim Verwerfen der Bearbeitung:
es: Eliminar edición con error:
fr: La modification de Dispose a échoué avec l'erreur :
it: Modifica del metodo Dispose non riuscita. Errore:
ja: 編集内容の破棄がエラーで失敗しました:
ko: 오류를 나타내며 편집 내용 삭제 실패:
pt_br: Editar descarte falhou com o erro:
zh_hans: 释放编辑失败，出现错误:

# editData.closeSql
source: Close SQL Pane
de: SQL-Bereich schließen
es: Cerrar el panel de SQL
fr: Fermer le volet SQL
it: Chiudi riquadro SQL
ja: SQL ペインを閉じる
ko: SQL 창 닫기
pt_br: Fechar Painel do SQL
zh_hans: 关闭 SQL 窗格

# editData.run
source: Run
de: Ausführen
es: Ejecutar
fr: Exécuter
it: Esegui
ja: 実行
ko: 실행
pt_br: Executar
zh_hans: 运行

# editData.showSql
source: Show SQL Pane
de: SQL-Bereich anzeigen
es: Mostrar el panel de SQL
fr: Afficher le volet SQL
it: Mostra riquadro SQL
ja: SQL ペインの表示
ko: SQL 창 표시
pt_br: Mostrar Painel do SQL
zh_hans: 显示 SQL 窗格

# editData.stop
source: Stop
de: Beenden
es: Detener
fr: Arrêter
it: Arresta
ja: 停止
ko: 중지
pt_br: Parar
zh_hans: 停止

# maxRowTaskbar
source: Max Rows:
de: Max. Zeilen:
es: Máximo de filas:
fr: Nombre maximal de lignes :
it: Numero massimo di righe:
ja: 最大行数:
ko: 최대 행 수:
pt_br: Máximo de Linhas:
zh_hans: 最大行数:

source: Delete Row
de: Zeile löschen
es: Eliminar fila
fr: Supprimer la ligne
it: Elimina riga
ja: 行の削除
ko: 행 삭제
pt_br: Excluir Linha
zh_hans: 删除行

# revertRow
source: Revert Current Row
de: Aktuelle Zeile zurücksetzen
es: Revertir la fila actual
fr: Rétablir la ligne actuelle
it: Ripristina la riga corrente
ja: 現在の行を元に戻す
ko: 현재 행 되돌리기
pt_br: Desfazer Linha Atual
zh_hans: 还原当前行

# copySelection
source: Copy
de: Kopieren
es: Copiar
fr: Copier
it: Copia
ja: コピー
ko: 복사
pt_br: Copiar
zh_hans: 复制

source: Copy With Headers
de: Mit Headern kopieren
es: Copiar con encabezados
fr: Copier avec les en-têtes
it: Copia con intestazioni
ja: ヘッダー付きでコピー
ko: 복사(머리글 포함)
pt_br: Copiar com Cabeçalhos
zh_hans: 带标头复制

source: Save As CSV
de: Als CSV speichern
es: Guardar como CSV
fr: Enregistrer au format CSV
it: Salva in formato CSV
ja: CSV として保存
ko: CSV로 저장
pt_br: Salvar Como CSV
zh_hans: 另存为 CSV

source: Save As Excel
de: Als Excel speichern
es: Guardar como Excel
fr: Enregistrer au format Excel
it: Salva in formato Excel
ja: Excel として保存
ko: Excel로 저장
pt_br: Salvar Como Excel
zh_hans: 另存为 Excel

source: Save As JSON
de: Als JSON speichern
es: Guardar como JSON
fr: Enregistrer au format JSON
it: Salva in formato JSON
ja: JSON として保存
ko: JSON으로 저장
pt_br: Salvar Como JSON
zh_hans: 另存为 JSON

source: Save As XML
de: Als XML speichern
es: Guardar como XML
fr: Enregistrer au format XML
it: Salva in formato XML
ja: XML として保存
ko: XML로 저장
pt_br: Salvar Como XML
zh_hans: 另存为 XML

source: Select All
de: Alle auswählen
es: Seleccionar todo
fr: Tout sélectionner
it: Seleziona tutto
ja: すべて選択
ko: 모두 선택
pt_br: Selecionar Tudo
zh_hans: 全选

# insight condition
source: When
de: Zeitpunkt
es: Cuándo
fr: Quand
it: Quando
ja: タイミング
ko: 시기
pt_br: Quando
zh_hans: 时间

# insights
source: Dashboard Insights ({0})
de: Dashboarderkenntnisse ({0})
es: Información del panel ({0})
fr: Insights de tableau de bord ({0})
it: Dati analitici dashboard ({0})
ja: ダッシュボード分析情報 ({0})
ko: 대시보드 인사이트({0})
pt_br: Painel de Insights ({0})
zh_hans: 仪表板见解({0})

source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称

# tabDescription
source: Description
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
pt_br: Descrição
zh_hans: 说明

# tabTitle
source: Title
de: Titel
es: Título
fr: Titre
it: Titolo
ja: タイトル
ko: 제목
pt_br: Título
zh_hans: 标题

# tabs
source: Dashboard Tabs ({0})
de: Dashboardregisterkarten ({0})
es: Pestañas del panel ({0})
fr: Onglets de tableau de bord ({0})
it: Schede del dashboard ({0})
ja: ダッシュボード タブ ({0})
ko: 대시보드 탭({0})
pt_br: Guias do Painel ({0})
zh_hans: 仪表板选项卡({0})

# notFound
source: Extension '{0}' not found.
de: Die Erweiterung '{0}' wurde nicht gefunden.
es: La extensión '{0}' no se encontró.
fr: Extension '{0}' introuvable.
it: L'estensione '{0}' non è stata trovata.
ja: 拡張機能 '{0}' が見つかりませんでした。
ko: '{0}' 확장을 찾을 수 없습니다.
pt_br: Extensão '{0}' não encontrada.
zh_hans: 找不到扩展“{0}”。

# workbench.extensions.getExtensionFromGallery.arg.name
source: Extension id
de: Erweiterungs-ID
es: Id. de extensión
fr: ID d'extension
it: ID estensione
ja: 拡張機能 ID
ko: 확장 ID
pt_br: ID de Extensão
zh_hans: 扩展 ID

# workbench.extensions.getExtensionFromGallery.description
source: Gets extension information from the gallery
de: Ruft Erweiterungsinformationen aus dem Katalog ab.
es: Obtiene información de extensión de la galería
fr: Obtient des informations d’extension à partir de la galerie
it: Recupera informazioni sull'estensione dalla raccolta
ja: ギャラリーから拡張機能情報を取得します
ko: 갤러리에서 확장 정보를 가져옵니다.
pt_br: Obtém informações de extensão na galeria
zh_hans: 从库中获取扩展信息

source: Install Extensions
de: Erweiterungen installieren
es: Instalar extensiones
fr: Installer les extensions
it: Installa estensioni
ja: 拡張機能のインストール
ko: 확장 설치
pt_br: Instalar Extensões
zh_hans: 安装扩展

# openExtensionAuthoringDocs
source: Author an Extension...
de: Erweiterung erstellen...
es: Crear una extensión...
fr: Créer une extension...
it: Crea un'estensione...
ja: 拡張機能の作成...
ko: 확장 제작...
pt_br: Criar uma Extensão...
zh_hans: 创作扩展...

source: Show Recommendations
de: Empfehlungen anzeigen
es: Mostrar recomendaciones
fr: Afficher les recommandations
it: Mostra elementi consigliati
ja: 推奨事項を表示
ko: 권장 사항 표시
pt_br: Mostrar Recomendações
zh_hans: 显示建议

# ExtensionsRecommended
source: Azure Data Studio has extension recommendations.
de: Azure Data Studio enthält Erweiterungsempfehlungen.
es: Azure Data Studio cuenta con extensiones recomendadas.
fr: Azure Data Studio a des recommandations d'extension.
it: Azure Data Studio include estensioni consigliate.
ja: Azure Data Studio には拡張機能の推奨事項があります。
ko: Azure Data Studio에는 확장 권장 사항이 있습니다.
pt_br: O Azure Data Studio tem recomendações de extensão.
zh_hans: Azure Data Studio 具有扩展建议。

# VisualizerExtensionsRecommended
source: Azure Data Studio has extension recommendations for data visualization. Once installed, you can select the Visualizer icon to visualize your query results.
de: Azure Data Studio enthält Erweiterungsempfehlungen für die Datenvisualisierung. Nach der Installation können Sie das Schnellansichtssymbol auswählen, um Ihre Abfrageergebnisse zu visualisieren.
es: Azure Data Studio cuenta con extensiones recomendadas para la visualización de datos. Una vez instaladas, podrá seleccionar el icono Visualizador para ver los resultados de las consultas.
fr: Azure Data Studio a des recommandations d'extension pour la visualisation des données. Après l'avoir installé, vous pouvez sélectionner l'icône Visualiseur pour visualiser les résultats de votre requête.
it: Azure Data Studio include estensioni consigliate per la visualizzazione dei dati. Una volta installato, è possibile selezionare l'icona del visualizzatore per visualizzare i risultati della query.
ja: Azure Data Studio には、データ可視化の拡張機能の推奨事項があります。 インストールすると、ビジュアライザー アイコンを選択して、クエリ結果を視覚化できます。
ko: Azure Data Studio에는 데이터 시각화를 위한 확장 권장 사항이 있습니다. 설치한 후에는 시각화 도우미 아이콘을 선택하여 쿼리 결과를 시각화할 수 있습니다.
pt_br: O Azure Data Studio tem recomendações de extensão para a visualização de dados. Quando ele estiver, você poderá selecionar o ícone Visualizador para visualizar os resultados da consulta.
zh_hans: Azure Data Studio 具有针对数据可视化的扩展建议。 安装后，你可以选择“可视化工具”图标来可视化查询结果。

source: Install All
de: Alle installieren
es: Instalar todo
fr: Tout installer
it: Installa tutto
ja: すべてをインストール
ko: 모두 설치
pt_br: Instalar Tudo
zh_hans: 全部安装

# neverShowAgain
source: Don't Show Again
de: Nicht mehr anzeigen
es: No volver a mostrar
fr: Ne plus afficher
it: Non visualizzare più questo messaggio
ja: 今後表示しない
ko: 다시 표시 안 함
pt_br: Não Mostrar Novamente
zh_hans: 不再显示

# defaultRecommendations
source: This extension is recommended by Azure Data Studio.
de: Diese Erweiterung wird von Azure Data Studio empfohlen.
es: Azure Data Studio recomienda esta extensión.
fr: Cette extension est recommandée par Azure Data Studio.
it: Questa estensione è consigliata da Azure Data Studio.
ja: この拡張機能は Azure Data Studio で推奨されます。
ko: 이 확장은 Azure Data Studio에서 추천됩니다.
pt_br: Esta extensão é recomendada pelo Azure Data Studio.
zh_hans: Azure Data Studio 建议使用此扩展。

# jobview.Alerts
source: Alerts
de: Warnungen
es: Alertas
fr: Alertes
it: Avvisi
ja: アラート
ko: 경고
pt_br: Alertas
zh_hans: 警报

# jobview.Jobs
source: Jobs
de: Aufträge
es: Trabajos
fr: Travaux
it: Processi
ja: ジョブ
ko: 작업
pt_br: Trabalhos
zh_hans: 作业

# jobview.Notebooks
source: Notebooks
ja: ノートブック
ko: Notebook
zh_hans: 笔记本

# jobview.Operators
source: Operators
de: Operatoren
es: Operadores
fr: Opérateurs
it: Operatori
ja: 演算子
ko: 연산자
pt_br: Operadores
zh_hans: 运算符

# jobview.Proxies
source: Proxies
de: Proxys
es: Servidores proxy
fr: Proxys
it: Proxy
ja: プロキシ
ko: 프록시
zh_hans: 代理

# jobAlertColumns.categoryName
source: Category Name
de: Kategoriename
es: Nombre de la categoría
fr: Nom de catégorie
it: Nome della categoria
ja: カテゴリ名
ko: 범주 이름
pt_br: Nome da Categoria
zh_hans: 类别名称

# jobAlertColumns.delayBetweenResponses
source: Delay Between Responses (in secs)
de: Verzögerung zwischen Antworten (in Sek.)
es: Retraso entre las respuestas (en segundos)
fr: Délai entre les réponses (en secondes)
it: Ritardo tra le risposte (in sec)
ja: 応答間の遅延 (秒)
ko: 응답 간격(초)
pt_br: Atraso Entre as Respostas (em segundos)
zh_hans: 响应之间的延迟(秒)

# jobAlertColumns.enabled
source: Enabled
de: Aktiviert
es: Habilitado
fr: Activé
it: Abilitata
ja: 有効
ko: 사용
pt_br: Habilitado
zh_hans: 已启用

# jobAlertColumns.lastOccurrenceDate
source: Last Occurrence
de: Letztes Vorkommen
es: Última aparición
fr: Dernière occurrence
it: Ultima occorrenza
ja: 最後の発生
ko: 마지막 발생
pt_br: Última Ocorrência
zh_hans: 上一个匹配项

# jobAlertColumns.name
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pt_br: Nome
zh_hans: 名称

# joaction.deletedOperator
source: The operator was deleted successfully
de: Der Operator wurde erfolgreich gelöscht.
es: El operador se eliminó correctamente
fr: L'opérateur a été supprimé
it: L'operatore è stato eliminato
ja: 演算子が正常に削除されました
ko: 연산자를 삭제했습니다.
pt_br: O operador foi excluído com êxito
zh_hans: 已成功删除运算符

# jobSuccessfullyStarted
source: : The job was successfully started.
de: : Der Auftrag wurde erfolgreich gestartet.
es: : El trabajo se inició correctamente.
fr: : Le travail a été démarré.
it: : il processo è stato avviato.
ja: : ジョブが正常に開始されました。
ko: : 작업을 시작했습니다.
pt_br: : O trabalho foi iniciado com êxito.
zh_hans: : 作业已成功启动。

# jobSuccessfullyStopped
source: : The job was successfully stopped.
de: : Der Auftrag wurde erfolgreich beendet.
es: : El trabajo se detuvo correctamente.
fr: : Le travail a été arrêté.
it: : il processo è stato arrestato.
ja: : ジョブが正常に停止されました。
ko: : 작업을 중지했습니다.
pt_br: : O trabalho foi interrompido com êxito.
zh_hans: : 作业已成功停止。

# jobaction.Cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# jobaction.deleteAlert
source: Delete Alert
de: Warnung löschen
es: Eliminar alerta
fr: Supprimer l'alerte
it: Elimina avviso
ja: アラートの削除
ko: 경고 삭제
pt_br: Excluir Alerta
zh_hans: 删除警报

# jobaction.deleteAlertConfirm
source: Are you sure you'd like to delete the alert '{0}'?
de: Möchten Sie die Warnung "{0}" löschen?
es: ¿Seguro que desea eliminar la alerta "{0}"?
fr: Voulez-vous vraiment supprimer l'alerte '{0}' ?
it: Eliminare l'avviso '{0}'?
ja: アラート '{0}' を削除してよろしいですか?
ko: '{0}' 경고를 삭제하시겠습니까?
pt_br: Tem certeza de que gostaria de excluir o alerta '{0}'?
zh_hans: 确定要删除警报“{0}”吗?

# jobaction.deleteJob
source: Delete Job
de: Auftrag löschen
es: Eliminar trabajo
fr: Supprimer le travail
it: Elimina processo
ja: ジョブの削除
ko: 작업 삭제
pt_br: Excluir Trabalho
zh_hans: 删除作业

# jobaction.deleteJobConfirm
source: Are you sure you'd like to delete the job '{0}'?
de: Möchten Sie den Auftrag "{0}" löschen?
es: ¿Seguro que desea eliminar el trabajo "{0}"?
fr: Voulez-vous vraiment supprimer le travail '{0}' ?
it: Eliminare il processo '{0}'?
ja: ジョブ '{0}' を削除してよろしいですか?
ko: '{0}' 작업을 삭제하시겠습니까?
pt_br: Tem certeza de que gostaria de excluir o trabalho '{0}'?
zh_hans: 确定要删除作业“{0}”吗?

# jobaction.deleteNotebookConfirm
source: Are you sure you'd like to delete the notebook '{0}'?
de: Möchten Sie das Notebook "{0}" löschen?
es: ¿Seguro que desea eliminar el cuaderno "{0}"?
fr: Voulez-vous vraiment supprimer le notebook '{0}' ?
it: Eliminare il notebook '{0}'?
ja: ノートブック '{0}' を削除してよろしいですか?
ko: '{0}' Notebook을 삭제하시겠습니까?
pt_br: Tem certeza de que gostaria de excluir o notebook '{0}'?
zh_hans: 确定要删除笔记本“{0}”吗?

# jobaction.deleteOperator
source: Delete Operator
de: Operator löschen
es: Eliminar operador
fr: Supprimer l'opérateur
it: Elimina operatore
ja: 演算子の削除
ko: 연산자 삭제
pt_br: Excluir Operador
zh_hans: 删除运算符

# jobaction.deleteOperatorConfirm
source: Are you sure you'd like to delete the operator '{0}'?
de: Möchten Sie den Operator "{0}" löschen?
es: ¿Seguro que desea eliminar el operador "{0}"?
fr: Voulez-vous vraiment supprimer l'opérateur '{0}' ?
it: Eliminare l'operatore '{0}'?
ja: 演算子 '{0}' を削除してよろしいですか?
ko: '{0}' 연산자를 삭제하시겠습니까?
pt_br: Tem certeza de que gostaria de excluir o operador '{0}'?
zh_hans: 确定要删除运算符“{0}”吗?

# jobaction.deleteProxy
source: Delete Proxy
de: Proxy löschen
es: Eliminar proxy
fr: Supprimer le proxy
it: Elimina proxy
ja: プロキシの削除
ko: 프록시 삭제
pt_br: Excluir Proxy
zh_hans: 删除代理

# jobaction.deleteProxyConfirm
source: Are you sure you'd like to delete the proxy '{0}'?
de: Möchten Sie den Proxy "{0}" löschen?
es: ¿Seguro que desea borrar el proxy "{0}"?
fr: Voulez-vous vraiment supprimer le proxy '{0}' ?
it: Eliminare il proxy '{0}'?
ja: プロキシ '{0}' を削除してよろしいですか?
ko: '{0}' 프록시를 삭제하시겠습니까?
pt_br: Tem certeza de que gostaria de excluir o proxy '{0}'?
zh_hans: 确定要删除代理“{0}”吗?

# jobaction.deleteStep
source: Delete Step
de: Schritt löschen
es: Eliminar paso
fr: Supprimer l'étape
it: Elimina passaggio
ja: ステップの削除
ko: 단계 삭제
pt_br: Excluir Etapa
zh_hans: 删除步骤

# jobaction.deleteStepConfirm
source: Are you sure you'd like to delete the step '{0}'?
de: Möchten Sie den Schritt "{0}" löschen?
es: ¿Seguro que desea eliminar el paso "{0}"?
fr: Voulez-vous vraiment supprimer l'étape '{0}' ?
it: Eliminare il passaggio '{0}'?
ja: ステップ '{0}' を削除してよろしいですか?
ko: '{0}' 단계를 삭제하시겠습니까?
pt_br: Tem certeza de que gostaria de excluir a etapa '{0}'?
zh_hans: 确定要删除步骤“{0}”吗?

# jobaction.deletedAlert
source: The alert was successfully deleted
de: Die Warnung wurde erfolgreich gelöscht.
es: La alerta se eliminó correctamente
fr: L'alerte a été supprimée
it: L'avviso è stato eliminato
ja: アラートは正常に削除されました
ko: 경고를 삭제했습니다.
pt_br: O alerta foi excluído com êxito
zh_hans: 已成功删除警报

# jobaction.deletedJob
source: The job was successfully deleted
de: Der Auftrag wurde erfolgreich gelöscht.
es: El trabajo se eliminó correctamente
fr: Le travail a été supprimé
it: Il processo è stato eliminato
ja: ジョブは正常に削除されました
ko: 작업을 삭제했습니다.
pt_br: O trabalho foi excluído com êxito
zh_hans: 已成功删除作业

# jobaction.deletedNotebook
source: The notebook was successfully deleted
de: Das Notebook wurde erfolgreich gelöscht.
es: El cuaderno se eliminó correctamente
fr: Le notebook a été supprimé
it: Il notebook è stato eliminato
ja: ノートブックが正常に削除されました
ko: Notebook을 삭제했습니다.
pt_br: O notebook foi excluído com sucesso
zh_hans: 已成功删除笔记本

# jobaction.deletedProxy
source: The proxy was deleted successfully
de: Der Proxy wurde erfolgreich gelöscht.
es: El proxy se eliminó correctamente
fr: Le proxy a été supprimé
it: Il proxy è stato eliminato
ja: プロキシが正常に削除されました
ko: 프록시를 삭제했습니다.
pt_br: O proxy foi excluído com êxito
zh_hans: 已成功删除代理

# jobaction.deletedStep
source: The job step was successfully deleted
de: Der Auftragsschritt wurde erfolgreich gelöscht.
es: El paso del trabajo se eliminó correctamente
fr: L'étape de travail a été supprimée
it: Il passaggio del processo è stato eliminato
ja: ジョブ ステップが正常に削除されました
ko: 작업 단계를 삭제했습니다.
pt_br: A etapa do trabalho foi excluída com êxito
zh_hans: 已成功删除作业步骤

# jobaction.editAlert
source: Edit Alert
de: Warnung bearbeiten
es: Editar alerta
fr: Modifier l'alerte
it: Modifica avviso
ja: アラートの編集
ko: 경고 편집
pt_br: Editar Alerta
zh_hans: 编辑警报

# jobaction.editJob
source: Edit Job
de: Auftrag bearbeiten
es: Editar trabajo
fr: Modifier le travail
it: Modifica processo
ja: ジョブの編集
ko: 작업 편집
pt_br: Editar Trabalho
zh_hans: 编辑作业
