Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# welcomePage.powershellDescription
source: Write and execute PowerShell scripts using Azure Data Studio's rich query editor
de: Hiermit werden PowerShell-Skripts mithilfe des umfangreichen Abfrage-Editors von Azure Data Studio geschrieben und ausgeführt.
es: Escriba y ejecute scripts de PowerShell con el editor de consultas enriquecidas de Azure Data Studio.
fr: Écrire et exécuter des scripts PowerShell à l'aide de l'éditeur de requêtes complet d'Azure Data Studio
it: Consente di scrivere ed eseguire script di PowerShell usando l'editor di query avanzato di Azure Data Studio
ja: Azure Data Studio のリッチ クエリ エディターを使用して PowerShell スクリプトを作成して実行します
ko: Azure Data Studio에 제공되는 다양한 기능의 쿼리 편집기를 사용하여 PowerShell 스크립트 작성 및 실행
pt_br: Grave e execute scripts do PowerShell usando o editor de consultas avançado do Azure Data Studio
zh_hans: 使用 Azure Data Studio 功能丰富的查询编辑器编写和执行 PowerShell 脚本

# welcomePage.showAdminPack
source: SQL Admin Pack
de: SQL-Administratorpaket
es: Paquete de administración de SQL
fr: Pack d'administration SQL
it: Admin Pack di SQL
ja: SQL 管理パック
ko: SQL 관리 팩
pt_br: Admin Pack do SQL
zh_hans: SQL 管理包

# welcomePage.sqlServerAgent
source: SQL Server Agent
es: Agente SQL Server
ja: SQL Server エージェント
ko: SQL Server 에이전트
zh_hans: SQL Server 代理

# welcomePage.sqlServerImport
source: SQL Server Import
es: Importación de SQL Server
fr: Importation SQL Server
it: Importazione di SQL Server
ja: SQL Server のインポート
ko: SQL Server 가져오기
pt_br: Importação do SQL Server
zh_hans: SQL Server 导入

# welcomePage.sqlServerProfiler
source: SQL Server Profiler
ko: SQL Server 프로파일러

# welcomePage.startTour
source: Start Tour
de: Tour starten
es: Iniciar paseo
fr: Démarrer la visite guidée
it: Inizia la presentazione
ja: ツアーの開始
ko: 둘러보기 시작
pt_br: Iniciar Tour
zh_hans: 开始教程

# welcomePage.willReloadAfterInstallingExtensionPack
source: The window will reload after installing additional support for {0}.
de: Nach dem Installieren zusätzlicher Unterstützung für {0} wird das Fenster neu geladen.
es: La ventana se volverá a cargar después de instalar compatibilidad adicional con {0}.
fr: La fenêtre se recharge après l'installation d'un support supplémentaire pour {0}.
it: La finestra verrà ricaricata dopo l'installazione di supporto aggiuntivo per {0}.
ja: {0} に追加のサポートをインストールしたあと、ウィンドウが再度読み込まれます。
ko: {0}에 대한 추가 지원을 설치한 후 창이 다시 로드됩니다.
pt_br: A janela será recarregada após a instalação do suporte adicional para {0}.
zh_hans: 安装对 {0} 的额外支持后，将重载窗口。

# welcomePage.azdataBlog
source: Discover what's new in the latest release
de: Neuerungen in der aktuellen Version erkunden
es: Descubra las novedades de esta última versión
fr: Découvrir les nouveautés de la dernière version
it: Novità della release più recente
ja: 最新リリースの新機能を見る
ko: 최신 릴리스의 새로운 기능 알아보기
pt_br: Descubra o que há de novo na versão mais recente
zh_hans: 了解最新版本中的新增功能

# welcomePage.azdataBlogDescription
source: New monthly blog posts each month showcasing our new features
de: Monatliche Vorstellung neuer Features in Blogbeiträgen
es: Nuevas entradas del blog mensuales que muestran nuestras nuevas características
fr: Nouveaux billets de blog mensuels mettant en avant nos nouvelles fonctionnalités
it: Ogni mese nuovi post di blog che illustrano le nuove funzionalità
ja: 毎月新機能を紹介する新しいブログ記事
ko: 매월 새로운 기능을 보여주는 새로운 월간 블로그 게시물
pt_br: Novas postagens mensais do blog apresentando nossos novos recursos
zh_hans: 每月推出新的月度博客文章，展示新功能

# welcomePage.colorTheme
source: Color theme
de: Farbdesign
es: Tema de color
fr: Thème de couleur
it: Tema colori
ja: 配色テーマ
ko: 색 테마
pt_br: Tema de cores
zh_hans: 颜色主题

# welcomePage.colorThemeDescription
source: Make the editor and your code look the way you love
de: Passen Sie das Aussehen von Editor und Code an Ihre Wünsche an.
es: Modifique a su gusto la apariencia del editor y el código
fr: Personnalisez l'apparence de l'éditeur et de votre code
it: Tutto quel che serve per configurare editor e codice nel modo desiderato
ja: エディターとコードの外観を自由に設定します
ko: 편집기 및 코드를 원하는 방식으로 표시
pt_br: Faça com que o editor e seu código tenham a aparência que você mais gosta
zh_hans: 使编辑器和代码呈现你喜欢的外观

# welcomePage.customize
source: Customize
de: Anpassen
es: Personalizar
fr: Personnaliser
it: Personalizza
ja: カスタマイズ
ko: 사용자 지정
pt_br: Personalizar
zh_hans: 自定义

# welcomePage.deploy
source: Deploy
de: Bereitstellen
es: Implementar
fr: Déployer
it: Distribuisci
ja: デプロイ
ko: 배포
pt_br: Implantar
zh_hans: 部署

# welcomePage.extensionDescription
source: Download extensions that you need, including the SQL Server Admin pack and more
de: Laden Sie die von Ihnen benötigten Erweiterungen herunter, z. B. die SQL Server-Verwaltungsprogramme und mehr.
es: Descargue las extensiones que necesite, incluido el paquete de administración de SQL Server y mucho más
fr: Téléchargez les extensions dont vous avez besoin, notamment le pack d'administration SQL Server
it: Download delle estensioni necessarie, tra cui il pacchetto di amministrazione di SQL Server
ja: SQL Server 管理パックなど、必要な拡張機能をダウンロードする
ko: SQL Server 관리자 팩 등을 포함하여 필요한 확장 다운로드
pt_br: Baixe as extensões necessárias, incluindo o pacote de Administrador do SQL Server e muito mais
zh_hans: 下载所需的扩展，包括 SQL Server 管理包等

# welcomePage.followTwitter
source: Follow us on Twitter
de: Folgen Sie uns auf Twitter
es: Síganos en Twitter
fr: Suivez-nous sur Twitter
it: Seguici su Twitter
ja: Twitter でフォローする
ko: Twitter에서 팔로우
pt_br: Siga-nos no Twitter
zh_hans: 在 Twitter 上关注我们

# welcomePage.followTwitterDescription
source: Keep up to date with how the community is using Azure Data Studio and to talk directly with the engineers.
de: Informieren Sie sich darüber, wie die Community Azure Data Studio verwendet, und kommunizieren Sie direkt mit den Technikern.
es: Manténgase al día sobre cómo la comunidad usa Azure Data Studio y hable directamente con los ingenieros.
fr: Informez-vous de la façon dont la communauté utilise Azure Data Studio et discutez directement avec les ingénieurs.
it: È possibile tenersi aggiornati sull'utilizzo di Azure Data Studio nella community e parlare direttamente con i tecnici.
ja: コミュニティがどのように Azure Data Studio を使用しているかについて、最新情報を把握し、エンジニアと直接話し合います。
ko: 커뮤니티가 Azure Data Studio를 사용하는 방식과 엔지니어와 직접 대화하는 방법을 최신 상태로 유지하세요.
pt_br: Mantenha-se atualizado com a forma como a Comunidade está usando o Azure Data Studio e converse diretamente com os engenheiros.
zh_hans: 保持了解社区如何使用 Azure Data Studio 并与工程师直接交谈。

# welcomePage.gettingStarted
source: Getting started
de: Erste Schritte
es: Introducción
fr: Démarrer
it: Attività iniziali
ja: はじめに
ko: 시작
pt_br: Introdução
zh_hans: 开始使用

# welcomePage.gitHubRepository
source: GitHub repository
es: Repositorio de GitHub
fr: Dépôt GitHub
it: Repository GitHub
ja: GitHub リポジトリ
ko: GitHub 리포지토리
pt_br: Repositório GitHub
zh_hans: GitHub 存储库

# welcomePage.help
source: Help
de: Hilfe
es: Ayuda
fr: Aide
it: Guida
ja: ヘルプ
ko: 도움말
pt_br: Ajuda
zh_hans: 帮助

# welcomePage.keyboardShortcut
source: Keyboard Shortcuts
de: Tastenkombinationen
es: Métodos abreviados de teclado
fr: Raccourcis clavier
it: Tasti di scelta rapida
ja: キーボード ショートカット
ko: 바로 가기 키
pt_br: Atalhos de Teclado
zh_hans: 键盘快捷方式

# welcomePage.keyboardShortcutDescription
source: Find your favorite commands and customize them
de: Bevorzugte Befehle finden und anpassen
es: Encuentre sus comandos favoritos y personalícelos
fr: Rechercher vos commandes préférées et les personnaliser
it: Ricerca e personalizzazione dei comandi preferiti
ja: お気に入りのコマンドを見つけてカスタマイズする
ko: 즐겨 찾는 명령을 찾아 사용자 지정
pt_br: Encontre seus comandos favoritos e personalize-os
zh_hans: 查找你喜欢的命令并对其进行自定义

# welcomePage.learn
source: Learn
de: Informationen
es: Información
fr: Apprendre
it: Informazioni
ja: 詳細
ko: 학습
zh_hans: 了解

# welcomePage.moreRecent
source: More...
de: Mehr...
es: Más...
fr: Plus...
it: Altro...
ja: その他...
ko: 자세히...
pt_br: Mais...
zh_hans: 更多...

# welcomePage.newDeployment
source: New Deployment…
de: Neue Bereitstellung…
es: Nueva implementación...
fr: Nouveau déploiement...
it: Nuova distribuzione…
ja: 新しいデプロイ…
ko: 새 배포...
pt_br: Nova Implantação…
zh_hans: 新建部署…

# welcomePage.noRecentFolders
source: No recent folders
de: Keine kürzlich verwendeten Ordner
es: No hay ninguna carpeta reciente.
fr: Aucun dossier récent
it: Non ci sono cartelle recenti
ja: 最近使用したフォルダーなし
ko: 최근 폴더 없음
pt_br: Não há pastas recentes
zh_hans: 没有最近使用的文件夹

# welcomePage.openFileLinuxPC
source: Open file
de: Datei öffnen
es: Abrir archivo
fr: Ouvrir un fichier
it: Apri file
ja: ファイルを開く
ko: 파일 열기
pt_br: Abrir arquivo
zh_hans: 打开文件

# welcomePage.openFileMac
source: Open file
de: Datei öffnen
es: Abrir archivo
fr: Ouvrir un fichier
it: Apri file
ja: ファイルを開く
ko: 파일 열기
pt_br: Abrir arquivo
zh_hans: 打开文件

# welcomePage.productDocumentation
source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
ja: ドキュメント
ko: 설명서
pt_br: Documentação
zh_hans: 文档

# welcomePage.recent
source: Recent
de: Zuletzt verwendet
es: Reciente
fr: Récent
it: Recenti
ja: 最近
ko: 최근 항목
pt_br: Recente
zh_hans: 最近使用

# welcomePage.releaseNotes
source: Release notes
de: Versionshinweise
es: Notas de la versión
fr: Notes de publication
it: Note sulla versione
ja: リリース ノート
ko: 릴리스 정보
pt_br: Notas sobre a versão
zh_hans: 发行说明

# welcomePage.reportIssue
source: Report issue or feature request
de: Problem melden oder Feature anfragen
es: Notificar problema o solicitud de características
fr: Signaler un problème ou une demande de fonctionnalité
it: Segnala problema o invia richiesta di funzionalità
ja: 問題または機能要求を報告する
ko: 문제 또는 기능 요청 보고
pt_br: Relatar problema ou solicitação de recurso
zh_hans: 报告问题或功能请求

# welcomePage.showCommands
source: Find and run all commands
de: Alle Befehle suchen und ausführen
es: Encontrar y ejecutar todos los comandos
fr: Rechercher et exécuter toutes les commandes
it: Trova ed esegui tutti i comandi
ja: すべてのコマンドの検索と実行
ko: 모든 명령 찾기 및 실행
pt_br: Encontrar e executar todos os comandos
zh_hans: 查找并运行所有命令

# welcomePage.showCommandsDescription
source: Rapidly access and search commands from the Command Palette ({0})
de: Über die Befehlspalette ({0}) können Sie schnell auf Befehle zugreifen und nach Befehlen suchen.
es: Acceda rápidamente a los comandos y búsquelos desde la paleta de comandos ({0})
fr: La palette de commandes ({0}) permet d'accéder rapidement aux commandes pour en rechercher une
it: Accesso e ricerca rapida di comandi dal riquadro comandi ({0})
ja: コマンド パレット ({0}) にすばやくアクセスしてコマンドを検索します
ko: 명령 팔레트({0})에서 명령을 빠른 액세스 및 검색
pt_br: Acesse e pesquise rapidamente comandos na Paleta de Comandos ({0})
zh_hans: 使用命令面板快速访问和搜索命令 ({0})

# welcomePage.start
source: Start
de: Starten
es: Inicio
fr: Démarrer
it: Avvia
ja: 開始
ko: 시작
pt_br: Início
zh_hans: 开始

# accountDialog.addConnection
source: Add an account
de: Konto hinzufügen
es: Agregar una cuenta
fr: Ajouter un compte
it: Aggiungi un account
ja: アカウントを追加する
ko: 계정 추가
pt_br: Adicionar uma conta
zh_hans: 添加帐户

# accountDialog.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# accountDialog.didNotPickAuthProvider
source: You didn't select any authentication provider. Please try again.
de: Sie haben keinen Authentifizierungsanbieter ausgewählt. Versuchen Sie es noch mal.
es: No ha seleccionado ningún proveedor de autenticación. Vuelva a intentarlo.
fr: Vous n'avez sélectionné aucun fournisseur d'authentification. Réessayez.
it: Non è stato selezionato alcun provider di autenticazione. Riprovare.
ja: 認証プロバイダーを選択していません。もう一度お試しください。
ko: 인증 공급자를 선택하지 않았습니다. 다시 시도하세요.
pt_br: Você não selecionou nenhum provedor de autenticação. Tente novamente.
zh_hans: 你没有选择任何身份验证提供程序。请重试。

# accountDialog.noAccountLabel
source: There is no linked account. Please add an account.
de: Es ist kein verknüpftes Konto vorhanden. Fügen Sie ein Konto hinzu.
es: No hay ninguna cuenta vinculada. Agregue una cuenta.
fr: Aucun compte lié. Ajoutez un compte.
it: Non sono presenti account collegati. Aggiungere un account.
ja: リンクされているアカウントはありません。アカウントを追加してください。
ko: 연결된 계정이 없습니다. 계정을 추가하세요.
pt_br: Não há nenhuma conta vinculada. Adicione uma conta.
zh_hans: 没有链接的帐户。请添加一个帐户。

# accountDialog.noCloudsRegistered
source: You have no clouds enabled. Go to Settings -> Search Azure Account Configuration -> Enable at least one cloud
de: Es sind keine Clouds aktiviert. Wechseln Sie zu "Einstellungen", durchsuchen Sie die Azure-Kontokonfiguration, und aktivieren Sie mindestens eine Cloud.
es: No tiene ninguna nube habilitada. Vaya a la configuración, busque la configuración de la cuenta de Azure y habilite por lo menos una nube.
fr: Aucun cloud n'est activé. Accéder à Paramètres -> Rechercher dans la configuration de compte Azure -> Activer au moins un cloud
it: Nessun cloud abilitato. Passa a Impostazioni -> Cerca configurazione dell'account Azure -> Abilita almeno un cloud
ja: 有効にされているクラウドがありません。[設定] -> [Azure アカウント構成の検索] に移動し、 少なくとも 1 つのクラウドを有効にしてください
ko: 클라우드를 사용할 수 없습니다. [설정] -> [Azure 계정 구성 검색] -> [하나 이상의 클라우드 사용]으로 이동합니다.
pt_br: Você não tem nuvens habilitadas. Acesse Configurações-> Pesquisar Configuração de Conta do Azure-> Habilitar pelo menos uma nuvem
zh_hans: 你没有启用云。请转到“设置”-> 搜索 Azure 帐户配置 -> 至少启用一个云

# accountExplorer.name
source: Accounts
de: Konten
es: Cuentas
fr: Comptes
it: Account
ja: アカウント
ko: 계정
pt_br: Contas
zh_hans: 帐户

source: Linked accounts
de: Verknüpfte Konten
es: Cuentas vinculadas
fr: Comptes liés
it: Account collegati
ja: リンクされたアカウント
ko: 연결된 계정
pt_br: Contas vinculadas
zh_hans: 链接的帐户

# accountDialog.addAccountErrorTitle
source: Error adding account
de: Fehler beim Hinzufügen des Kontos
es: Error al agregar la cuenta
fr: Erreur d'ajout de compte
it: Errore di aggiunta account
ja: アカウントの追加でのエラー
ko: 계정 추가 오류
pt_br: Erro ao adicionar a conta
zh_hans: 添加帐户时出错

# refreshCredentials
source: You need to refresh the credentials for this account.
de: Die Anmeldeinformationen für dieses Konto müssen aktualisiert werden.
es: Debe actualizar las credenciales para esta cuenta.
fr: Vous devez actualiser les informations d'identification de ce compte.
it: È necessario aggiornare le credenziali per questo account.
ja: このアカウントの資格情報を更新する必要があります。
ko: 이 계정의 자격 증명을 새로 고쳐야 합니다.
pt_br: Você precisa atualizar as credenciais para esta conta.
zh_hans: 需要刷新此帐户的凭据。

# accountManagementService.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# loggingIn
source: Adding account...
de: Konto wird hinzugefügt...
es: Adición de cuenta en curso...
fr: Ajout du compte...
it: Aggiunta dell'account...
ja: アカウントを追加しています...
ko: 계정 추가...
pt_br: Adicionando conta...
zh_hans: 正在添加帐户...

# refreshFailed
source: Refresh account was canceled by the user
de: Die Kontoaktualisierung wurde durch den Benutzer abgebrochen.
es: El usuario canceló la actualización de la cuenta
fr: L'actualisation du compte a été annulée par l'utilisateur
it: L'aggiornamento dell'account è stato annullato dall'utente
ja: ユーザーがアカウントの更新をキャンセルしました
ko: 사용자가 계정 새로 고침을 취소했습니다.
pt_br: A conta de atualização foi cancelada pelo usuário
zh_hans: 用户已取消刷新帐户

source: Azure account
de: Azure-Konto
es: Cuenta de Azure
fr: Compte Azure
it: Account Azure
ja: Azure アカウント
ko: Azure 계정
pt_br: Conta do Azure
zh_hans: Azure 帐户

source: Azure tenant
de: Azure-Mandant
es: Inquilino de Azure
fr: Locataire Azure
it: Tenant di Azure
ja: Azure テナント
ko: Azure 테넌트
pt_br: Locatário do Azure
zh_hans: Azure 租户

# copyAndOpen
source: Copy & Open
de: Kopieren und öffnen
es: Copiar y abrir
fr: Copier et ouvrir
it: Copia e apri
ja: コピーして開く
ko: 복사 및 열기
pt_br: Copiar e Abrir
zh_hans: 复制并打开

# oauthDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

source: User code
de: Benutzercode
es: Código de usuario
fr: Code utilisateur
it: Codice utente
ja: ユーザー コード
ko: 사용자 코드
pt_br: Código do usuário
zh_hans: 用户代码

source: Website
es: Sitio web
fr: Site web
it: Sito Web
ja: Web サイト
ko: 웹 사이트
pt_br: Site
zh_hans: 网站

# oauthFlyoutIsAlreadyOpen
source: Cannot start auto OAuth. An auto OAuth is already in progress.
de: Starten einer automatischen OAuth-Authentifizierung nicht möglich. Es wird bereits eine automatische OAuth-Authentifizierung ausgeführt.
es: No se puede iniciar OAuth automático. Ya hay un OAuth automático en curso.
fr: Impossible de démarrer une authentification OAuth automatique. Il y en a déjà une en cours.
it: Non è possibile avviare un OAuth automatico perché ne è già in corso uno.
ja: 自動 OAuth を開始できません。自動 OAuth は既に進行中です。
ko: 자동 OAuth를 시작할 수 없습니다. 자동 OAuth가 이미 진행 중입니다.
pt_br: Não é possível iniciar o OAuth automático. Um OAuth automático já está em andamento.
zh_hans: 无法启动自动 OAuth。自动 OAuth 已在进行中。

# adminService.noHandlerRegistered
source: No Handler Registered
de: Kein Handler registriert.
es: Ningún controlador registrado
fr: Aucun gestionnaire inscrit
it: Non ci sono gestori registrati
ja: 登録されているハンドラーがありません
ko: 등록된 처리기 없음
pt_br: Nenhum manipulador registrado
zh_hans: 未注册处理程序

# adminService.providerIdNotValidError
source: Connection is required in order to interact with adminservice
de: Für eine Interaktion mit dem Verwaltungsdienst ist eine Verbindung erforderlich.
es: Se necesita la conexión para interactuar con el servicio de administración
fr: La connexion est nécessaire pour interagir avec adminservice
it: Per interagire con adminservice, è richiesta la connessione
ja: 管理サービスとの対話には接続が必須です
ko: adminservice와 상호 작용하려면 연결이 필요합니다.
pt_br: A conexão é necessária para interagir com adminservice
zh_hans: 需要连接才能与 adminservice 交互

# asmt.noHandlerRegistered
source: No Handler Registered
de: Kein Handler registriert.
es: No hay ningún controlador registrado.
fr: Aucun gestionnaire inscrit
it: Non ci sono gestori registrati
ja: 登録されているハンドラーがありません
ko: 등록된 처리기 없음
pt_br: Nenhum Manipulador Registrado
zh_hans: 未注册处理程序

# asmt.providerIdNotValidError
source: Connection is required in order to interact with Assessment Service
de: Für die Interaktion mit dem Bewertungsdienst ist eine Verbindung erforderlich.
es: Para interactuar con el servicio de evaluación, se necesita una conexión.
fr: La connexion est nécessaire pour interagir avec le service d'évaluation
it: Per interagire con il servizio valutazione è necessaria una connessione
ja: 評価サービスとの対話には接続が必要です
ko: 평가 서비스와 상호 작용하려면 연결이 필요합니다.
pt_br: A conexão é necessária para interagir com o Serviço de Avaliação
zh_hans: 需要连接才能与评估服务交互

# advancedProperties.discard
source: Discard
de: Verwerfen
es: Descartar
fr: Abandonner
it: Rimuovi
ja: 破棄
ko: 삭제
pt_br: Descartar
zh_hans: 放弃

# connectionAdvancedProperties
source: Advanced Properties
de: Erweiterte Eigenschaften
es: Propiedades avanzadas
fr: Propriétés avancées
it: Proprietà avanzate
ja: 詳細プロパティ
ko: 고급 속성
pt_br: Propriedades Avançadas
zh_hans: 高级属性

# serverDescription
source: Server Description (optional)
de: Serverbeschreibung (optional)
es: Descripción del servidor (opcional)
fr: Description du serveur (facultatif)
it: Descrizione del server (facoltativa)
ja: サーバーの説明 (省略可能)
ko: 서버 설명(옵션)
pt_br: Descrição do Servidor (opcional)
zh_hans: 服务器说明(可选)

# ClearRecentlyUsedLabel
source: Clear List
de: Liste löschen
es: Borrar lista
fr: Effacer la liste
it: Cancella elenco
ja: リストのクリア
ko: 목록 지우기
pt_br: Limpar Lista
zh_hans: 清空列表

# ClearedRecentConnections
source: Recent connections list cleared
de: Die Liste der zuletzt verwendeten Verbindungen wurde gelöscht.
es: Lista de conexiones recientes borrada
fr: Liste des dernières connexions effacée
it: L'elenco delle connessioni recenti è stato cancellato
ja: 最近の接続履歴をクリアしました
ko: 최근 연결 목록을 삭제함
pt_br: Lista de conexões recentes limpa
zh_hans: 已清空最新连接列表

# clearRecentConnectionMessage
source: Are you sure you want to delete all the connections from the list?
de: Möchten Sie alle Verbindungen aus der Liste löschen?
es: ¿Está seguro que desea eliminar todas las conexiones de la lista?
fr: Voulez-vous vraiment supprimer toutes les connexions de la liste ?
it: Eliminare tutte le connessioni dall'elenco?
ja: 一覧からすべての接続を削除してよろしいですか?
ko: 목록에서 모든 연결을 삭제하시겠습니까?
pt_br: Tem certeza de que deseja excluir todas as conexões da lista?
zh_hans: 确定要删除列表中的所有连接吗?

# connectionAction.GetCurrentConnectionString
source: Get Current Connection String
de: Aktuelle Verbindungszeichenfolge abrufen
es: Obtener la cadena de conexión actual
fr: Obtenir la chaîne de connexion actuelle
it: Ottieni la stringa di connessione corrente
ja: 現在の接続文字列を取得する
ko: 현재 연결 문자열 가져오기
pt_br: Obter a Cadeia de Conexão Atual
zh_hans: 获取当前连接字符串

# connectionAction.connectionString
source: Connection string not available
de: Die Verbindungszeichenfolge ist nicht verfügbar.
es: La cadena de conexión no está disponible
fr: Chaîne de connexion non disponible
it: La stringa di connessione non è disponibile
ja: 接続文字列は使用できません
ko: 연결 문자열을 사용할 수 없음
pt_br: A cadeia de conexão não está disponível
zh_hans: 连接字符串不可用

# connectionAction.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否

# connectionAction.noConnection
source: No active connection available
de: Keine aktive Verbindung verfügbar.
es: Ninguna conexión activa disponible
fr: Aucune connexion active disponible
it: Non sono disponibili connessioni attive
ja: 使用できるアクティブな接続がありません
ko: 사용 가능한 활성 연결이 없음
pt_br: Nenhuma conexão ativa disponível
zh_hans: 没有可用的活动连接

# connectionAction.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
zh_hans: 是

# connectionDialog.no
source: No
de: Nein
fr: Non
ja: いいえ
ko: 아니요
pt_br: Não
zh_hans: 否

# connectionDialog.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
zh_hans: 是

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除

source: Connection Browser Tree
de: Struktur des Verbindungsbrowsers
es: Árbol del explorador de conexiones
fr: Arborescence du navigateur de connexion
it: Albero del visualizzatore connessioni
ja: 接続ブラウザー ツリー
ko: 연결 브라우저 트리
pt_br: Árvore do Navegador de Conexão
zh_hans: 连接浏览器树

# connectionDialog.ApplyingFilter
source: Applying filter
de: Filter wird angewendet.
es: Aplicación de filtro en curso
fr: Application du filtre
it: Applicazione filtro
ja: フィルターを適用しています
ko: 필터 적용
pt_br: Aplicando filtro
zh_hans: 正在应用筛选器

# connectionDialog.FilterApplied
source: Filter applied
de: Filter angewendet
es: Filtro aplicado
fr: Filtre appliqué
it: Filtro applicato
ja: フィルター適用済み
ko: 필터가 적용됨
pt_br: Filtro aplicado
zh_hans: 已应用筛选器

# connectionDialog.FilterInputTitle
source: Filter connections
de: Verbindungen filtern
es: Filtrado de conexiones
fr: Filtrer les connexions
it: Filtra connessioni
ja: 接続のフィルター
ko: 연결 필터링
pt_br: Filtrar conexões
zh_hans: 筛选器连接

# connectionDialog.FilterPlaceHolder
source: Type here to filter the list
de: Geben Sie hier Text ein, um die Liste zu filtern
es: Escriba aquí para filtrar la lista
fr: Tapez ici pour filtrer la liste
it: Digitare qui per filtrare l'elenco
ja: 一覧にフィルターをかけるには、ここに入力します
ko: 목록을 필터링하려면 여기에 입력하세요.
pt_br: Digite aqui para filtrar a lista
zh_hans: 在此处键入以筛选列表

# connectionDialog.FilterRemoved
source: Filter removed
de: Filter entfernt
es: Filtro quitado
fr: Filtre supprimé
it: Filtro rimosso
ja: フィルターが削除されました
ko: 필터가 제거됨
pt_br: Filtro removido
zh_hans: 已删除筛选器

# connectionDialog.RemovingFilter
source: Removing filter
de: Filter wird entfernt.
es: Eliminación del filtro en curso
fr: Suppression du filtre
it: Rimozione filtro
ja: フィルターを削除しています
ko: 필터 제거
pt_br: Removendo filtro
zh_hans: 正在删除筛选器

# connectionDialog.browser
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
it: Sfoglia
ja: 参照
ko: 찾아보기
pt_br: Procurar
zh_hans: 浏览

# savedConnection
source: Saved Connections
de: Gespeicherte Verbindungen
es: Conexiones guardadas
fr: Connexions enregistrées
it: Connessioni salvate
ja: 保存された接続
ko: 저장된 연결
pt_br: Conexões Salvas
zh_hans: 保存的连接
