Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# agentUtilities.yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
pt_br: Sim
zh_hans: 是

source: No Handler Registered
de: Kein Handler registriert.
es: No hay ningún controlador registrado.
fr: Aucun gestionnaire inscrit
it: Non ci sono gestori registrati
ja: 登録されているハンドラーがありません
ko: 등록된 처리기 없음
pt_br: Nenhum Manipulador Registrado
zh_hans: 未注册处理程序

# providerIdNotValidError
source: Connection is required in order to interact with JobManagementService
de: Für die Interaktion mit "JobManagementService" ist eine Verbindung erforderlich.
es: Se necesita conexión para interactuar con JobManagementService
fr: Une connexion est nécessaire pour interagir avec JobManagementService
it: Per interagire con JobManagementService, è richiesta la connessione
ja: JobManagementService と対話するには接続が必須です
ko: JobManagementService와 상호 작용하려면 연결이 필요합니다.
pt_br: A conexão é necessária para interagir com JobManagementService
zh_hans: 需要连接才能与 JobManagementService 交互

# commandSuccessful
source: Command executed successfully
de: Der Befehl wurde erfolgreich ausgeführt.
es: Comando ejecutado correctamente
fr: Commande exécutée
it: Comando eseguito correttamente
ja: コマンドは正常に実行されました
ko: 명령이 실행됨
pt_br: Comando executado com êxito
zh_hans: 已成功执行命令

# executionCanceled
source: Query execution was canceled
de: Die Abfrageausführung wurde abgebrochen.
es: Se canceló la ejecución de la consulta
fr: L'exécution de requête a été annulée
it: L'esecuzione della query è stata annullata
ja: クエリの実行が取り消されました
ko: 쿼리 실행을 취소했습니다.
pt_br: A execução da consulta foi cancelada
zh_hans: 查询执行已取消

# noDefaultKernel
source: No kernel is available for this notebook
de: Für dieses Notebook ist kein Kernel verfügbar.
es: No hay ningún kernel disponible para este cuaderno
fr: Aucun noyau disponible pour ce notebook
it: Non è disponibile alcun kernel per questo notebook
ja: このノートブックで使用できるカーネルはありません
ko: 이 Notebook에 사용할 수 있는 커널이 없습니다.
pt_br: Nenhum kernel está disponível para este notebook
zh_hans: 此笔记本没有可用的内核

# notebookNotReady
source: The session for this notebook is not yet ready
de: Die Sitzung für dieses Notebook ist noch nicht bereit.
es: La sesión para este cuaderno aún no está lista
fr: La session de ce notebook n'est pas encore prête
it: La sessione per questo notebook non è ancora pronta
ja: このノートブックのセッションは準備がまだ整っていません
ko: 이 Notebook의 세션이 아직 준비되지 않았습니다.
pt_br: A sessão para este notebook ainda não está pronta
zh_hans: 此笔记本的会话尚未准备就绪

# runCellCancelled
source: Cell execution cancelled
de: Die Zellenausführung wurde abgebrochen.
es: Ejecución de celdas cancelada
fr: Exécution de cellule annulée
it: Esecuzione della cella annullata
ja: セルの実行が取り消されました
ko: 셀 실행을 취소함
pt_br: Execução da célula cancelada
zh_hans: 单元格执行已取消

# sessionNotReady
source: The session for this notebook will start momentarily
de: Die Sitzung für dieses Notebook wird in Kürze gestartet.
es: La sesión para este cuaderno comenzará momentáneamente
fr: La session de ce notebook va commencer dans un instant
it: La sessione per questo notebook verrà avviata tra qualche istante
ja: このノートブックのセッションが間もなく開始されます
ko: 이 Notebook의 세션이 곧 시작됩니다.
pt_br: A sessão para este notebook vai começar em breve
zh_hans: 此笔记本的会话即将启动

# addCellEdit
source: Add Cell
de: Zelle hinzufügen
it: Aggiungi cella
ja: セルの追加
ko: 셀 추가

# convertCellTypeEdit
source: Convert Cell Type
de: Zellentyp konvertieren
it: Converti tipo di cella
ja: セルの種類の変換
ko: 셀 유형 변환

# deleteCellEdit
source: Delete Cell
de: Zelle löschen
it: Elimina cella
ja: セルの削除
ko: 셀 삭제

# moveCellEdit
source: Move Cell
de: Zelle verschieben
it: Sposta cella
ja: セルの移動
ko: 셀 이동

# splitCellEdit
source: Split Cell
de: Zelle teilen
it: Dividi cella
ja: セルの分割
ko: 셀 분할

# ServerNotStarted
source: Server did not start for unknown reason
de: Der Server wurde aus unbekannten Gründen nicht gestartet.
es: El servidor no se pudo iniciar por una razón desconocida
fr: Le serveur n'a pas démarré pour une raison inconnue
it: Il server non è stato avviato per motivi sconosciuti
ja: 不明な理由によりサーバーが起動しませんでした
ko: 알 수 없는 이유로 서버가 시작되지 않았습니다.
pt_br: O servidor não foi iniciado por uma razão desconhecida
zh_hans: 由于未知原因，服务器未启动

# clientSession.unknownError
source: An error occurred while starting the notebook session
de: Fehler beim Starten der Notebook-Sitzung.
es: Error al iniciar la sesión del cuaderno
fr: Une erreur s'est produite au démarrage d'une session de notebook
it: Si è verificato un errore durante l'avvio della sessione del notebook
ja: ノートブック セッションの開始中にエラーが発生しました。
ko: Notebook 세션을 시작하는 동안 오류가 발생했습니다.
pt_br: Ocorreu um erro ao iniciar a sessão do notebook
zh_hans: 启动笔记本会话时出错

# kernelRequiresConnection
source: Kernel {0} was not found. The default kernel will be used instead.
de: Der Kernel "{0}" wurde nicht gefunden. Es wird stattdessen der Standardkernel verwendet.
es: No se encontró el kernel {0}. En su lugar, se utilizará el kernel predeterminado.
fr: Noyau {0} introuvable. Le noyau par défaut est utilisé à la place.
it: Il kernel {0} non è stato trovato. Verrà usato il kernel predefinito.
ja: カーネル {0} が見つかりませんでした。既定のカーネルが代わりに使用されます。
ko: {0} 커널을 찾을 수 없습니다. 대신 기본 커널이 사용됩니다.
pt_br: O kernel {0} não foi encontrado. O kernel padrão será usado em seu lugar.
zh_hans: 未找到内核 {0}。将改为使用默认内核。

# ProviderNoManager
source: Can't find notebook manager for provider {0}
de: Der Notebook-Manager für den Anbieter "{0}" wurde nicht gefunden.
es: No puede encontrar el administrador de cuadernos para el proveedor {0}
fr: Gestionnaire de notebook introuvable pour le fournisseur {0}
it: Non è possibile trovare il gestore di notebook per il provider {0}
ja: プロバイダー {0} のノートブック マネージャーが見つかりません
ko: {0} 공급자의 Notebook 관리자를 찾을 수 없습니다.
pt_br: Não é possível encontrar o gerenciador de notebook do provedor {0}
zh_hans: 未找到提供程序 {0} 的笔记本管理器

# changeContextFailed
source: Changing context failed: {0}
de: Fehler beim Ändern des Kontexts: {0}
es: Error en el cambio de contexto: {0}
fr: Le changement de contexte a échoué : {0}
it: La modifica del contesto non è riuscita: {0}
ja: コンテキストの変更に失敗しました: {0}
ko: {0} 컨텍스트를 변경하지 못했습니다.
pt_br: Falha ao alterar o contexto: {0}
zh_hans: 更改上下文失败: {0}

# changeKernelFailed
source: Failed to change kernel due to error: {0}
de: Der Kernel konnte aufgrund des folgenden Fehlers nicht geändert werden: {0}
es: No se pudo cambiar el kernel debido al error: {0}
fr: Le changement de noyau a échoué en raison de l'erreur : {0}
it: Non è stato possibile modificare il kernel a causa dell'errore: {0}
ja: 次のエラーにより、カーネルの変更に失敗しました: {0}
ko: 오류로 인해 커널을 변경하지 못했습니다. {0}
pt_br: Falha ao alterar o kernel devido ao erro: {0}
zh_hans: 由于以下错误而未能更改内核: {0}

# changeKernelFailedRetry
source: Failed to change kernel. Kernel {0} will be used. Error was: {1}
de: Der Kernel konnte nicht geändert werden. Es wird der Kernel "{0}" verwendet. Fehler: {1}
es: Error al cambiar de kernel. Se utilizará el kernel {0}. Error: {1}
fr: Le changement de noyau a échoué. Le noyau {0} est utilisé. Erreur : {1}
it: Non è stato possibile modificare il kernel. Verrà usato il kernel {0}. Errore: {1}
ja: カーネルの変更に失敗しました。カーネル {0} が使用されます。エラー: {1}
ko: 커널을 변경하지 못했습니다. {0} 커널이 사용됩니다. 오류: {1}
pt_br: Falha ao alterar o kernel. O kernel {0} será usado. O erro foi: {1}
zh_hans: 未能更改内核。将使用内核 {0}。错误为: {1}

# deleteCellFailed
source: Failed to delete cell.
de: Fehler beim Löschen der Zelle.
es: No se pudo eliminar la celda.
fr: La suppression de la cellule a échoué.
it: Non è stato possibile eliminare la cella.
ja: セルの削除に失敗しました。
ko: 셀을 삭제하지 못했습니다.
pt_br: Falha ao excluir a célula.
zh_hans: 未能删除单元格。

# injectedParametersMsg
source: # Injected-Parameters
de: # Eingefügte Parameter
es: N.º de parámetros insertados
fr: # Paramètres injectés
it: N. parametri inseriti
ko: # 삽입된 매개 변수
zh_hans: # 个注入参数

# kernelRequiresConnection
source: Please select a connection to run cells for this kernel
de: Wählen Sie eine Verbindung zum Ausführen von Zellen für diesen Kernel aus.
es: Seleccione una conexión para ejecutar celdas para este kernel
fr: Sélectionnez une connexion afin d'exécuter les cellules pour ce noyau
it: Selezionare una connessione per eseguire le celle per questo kernel
ja: このカーネルのセルを実行する接続を選択してください
ko: 이 커널에 대해 셀을 실행하려면 연결을 선택하세요.
pt_br: Selecione uma conexão para executar células para este kernel
zh_hans: 请选择一个连接来运行此内核的单元格

# shutdownClientSessionError
source: A client session error occurred when closing the notebook: {0}
de: Clientsitzungsfehler beim Schließen des Notebooks "{0}".
es: Se ha producido un error en la sesión del cliente al cerrar el cuaderno: {0}
fr: Une erreur de session du client s'est produite pendant la fermeture du notebook : {0}
it: Si è verificato un errore della sessione client durante la chiusura del notebook: {0}
ja: ノートブックを閉じるときにクライアント セッション エラーが発生しました: {0}
ko: Notebook을 닫는 동안 클라이언트 세션 오류가 발생했습니다. {0}
pt_br: Ocorreu um erro de sessão de cliente ao fechar o notebook: {0}
zh_hans: 关闭笔记本时发生客户端会话错误: {0}

# startSessionFailed
source: Could not start session: {0}
de: Sitzung konnte nicht gestartet werden: {0}
es: No se pudo iniciar sesión: {0}
fr: Impossible de démarrer la session : {0}
it: Non è stato possibile avviare la sessione: {0}
ja: セッションを開始できませんでした: {0}
ko: {0} 세션을 시작할 수 없습니다.
pt_br: Não foi possível iniciar a sessão: {0}
zh_hans: 无法启动会话: {0}

# notebookServiceNoProvider
source: Notebook provider does not exist
de: Der Notebook-Anbieter ist nicht vorhanden.
es: El proveedor de cuadernos no existe
fr: Le fournisseur de notebooks n'existe pas
it: Il provider di notebook non esiste
ja: ノートブック プロバイダーが存在しません
ko: Notebook 공급자가 없습니다.
pt_br: O provedor de notebooks não existe
zh_hans: 笔记本提供程序不存在

# notebookUriNotDefined
source: No URI was passed when creating a notebook manager
de: Bei der Erstellung eines Notebook-Managers wurde kein URI übergeben.
es: No se pasó ninguna URI al crear el administrador de cuadernos
fr: Aucun URI passé pendant la création d'un gestionnaire de notebook
it: Non è stato passato alcun URI durante la creazione di un gestore di notebook
ja: ノートブック マネージャーを作成するときに URI が渡されませんでした
ko: Notebook 관리자를 만들 때 URI가 전달되지 않았습니다.
pt_br: Nenhum URI foi passado ao criar um gerenciador de notebooks
zh_hans: 创建笔记本管理器时未传递 URI

# notebookView.nameTaken
source: A view with the name {0} already exists in this notebook.
de: Eine Ansicht mit dem Namen {0} ist in diesem Notizbuch bereits vorhanden.
es: Ya existe una vista con el nombre {0} en este cuaderno.
fr: Une vue portant le nom {0} existe déjà dans ce bloc-notes.
it: Una vista con il nome {0} esiste già in questo notebook.
ja: このノートブックには、 {0} という名前のビューが既に存在します。
ko: 이름이 {0}인 보기가 이 전자 필기장에 이미 있습니다.
pt_br: Já existe uma exibição com o nome {0} nesse bloco de anotações.
zh_hans: 此笔记本中已存在名为 {0} 的视图。

# notebookView.untitledView
source: Untitled View
de: Ansicht ohne Titel
es: Vista sin título
fr: Affichage sans titre
it: Visualizzazione senza nome
ja: 無題のビュー
ko: 제목 없는 보기
pt_br: Modo de Exibição Sem Título
zh_hans: 无标题视图

# connectionRequired
source: A connection must be chosen to run notebook cells
de: Sie müssen eine Verbindung auswählen, um Notebook-Zellen auszuführen.
es: Se debe elegir una conexión para ejecutar celdas de cuaderno
fr: Une connexion doit être choisie pour exécuter des cellules de notebook
it: Per eseguire le celle del notebook, è necessario scegliere una connessione
ja: ノートブックのセルを実行するには、接続を選択する必要があります
ko: Notebook 셀을 실행하려면 연결을 선택해야 합니다.
pt_br: Uma conexão precisa ser escolhida para executar as células do notebook
zh_hans: 必须选择连接才能运行笔记本单元格

source: SQL kernel error
de: SQL-Kernelfehler
es: Error del kernel SQL
fr: Erreur de noyau SQL
it: Errore del kernel SQL
ja: SQL カーネル エラー
ko: SQL 커널 오류
pt_br: Erro no kernel do SQL
zh_hans: SQL 内核错误

# sqlMaxRowsDisplayed
source: Displaying Top {0} rows.
de: Die ersten {0} Zeilen werden angezeigt.
es: Mostrando las primeras {0} filas.
fr: Affichage des {0} premières lignes.
it: Visualizzazione delle prime {0} righe.
ja: 上位 {0} 行を表示しています。
ko: 상위 {0}개 행을 표시합니다.
pt_br: Exibindo as Primeiras {0} linhas.
zh_hans: 显示了前 {0} 行。

# notebook.richTextEditMode
source: Rich Text
es: Texto enriquecido
fr: Texte riche
it: RTF
ja: リッチ テキスト
ko: 서식있는 텍스트
zh_hans: 格式文本

# notebook.splitViewEditMode
source: Split View
de: Geteilte Ansicht
es: Vista en dos paneles
fr: Mode fractionné
it: Doppia visualizzazione
ja: 分割ビュー
ko: 분할 보기
pt_br: Modo Divisão
zh_hans: 拆分视图

# invalidMimeData
source: Data for {0} is expected to be a string or an Array of strings
de: Als Daten für "{0}" wird eine Zeichenfolge oder ein Array aus Zeichenfolgen erwartet.
es: Se espera que los datos para {0} sean una cadena o una matriz de cadenas
fr: Les données de {0} doivent être une chaîne ou un tableau de chaînes
it: I dati per {0} devono essere una stringa o una matrice di stringhe
ja: {0} のデータは、文字列または文字列の配列である必要があります
ko: {0}의 데이터는 문자열 또는 문자열 배열이어야 합니다.
pt_br: Espera-se que os dados de {0} sejam uma cadeia de caracteres ou uma matriz de cadeia de caracteres
zh_hans: {0} 的数据应为字符串或字符串数组

# nbNotSupported
source: This file does not have a valid notebook format
de: Diese Datei weist kein gültiges Notebook-Format auf.
es: Este archivo no tiene un formato válido de cuaderno
fr: Ce fichier n'a pas un format de notebook valide
it: Il formato di notebook di questo file non è valido
ja: このファイルは有効なノートブック形式ではありません
ko: 이 파일에 유효한 Notebook 형식이 없습니다.
pt_br: Este arquivo não tem um formato de notebook válido
zh_hans: 此文件没有有效的笔记本格式

# nbformatNotRecognized
source: nbformat v{0}.{1} not recognized
de: nbformat v{0}.{1} nicht erkannt.
es: nbformat v{0}. {1} no reconocido
fr: nbformat v{0}.{1} non reconnu
it: nbformat v{0}.{1} non riconosciuto
ja: 認識されない nbformat v{0}.{1}
ko: nbformat v{0}.{1}이(가) 인식되지 않습니다.
pt_br: nbformat v{0}.{1} não reconhecido
zh_hans: 无法识别 nbformat v{0}.{1}

# unknownCellType
source: Cell type {0} unknown
de: Unbekannter Zellentyp "{0}".
es: Celda de tipo {0} desconocido
fr: Type de cellule {0} inconnu
it: Il tipo di cella {0} è sconosciuto
ja: セルの種類 {0} が不明
ko: 알 수 없는 셀 형식 {0}
pt_br: Tipo de célula {0} desconhecido
zh_hans: 单元格类型 {0} 未知

# unrecognizedOutput
source: Output type {0} not recognized
de: Der Ausgabetyp "{0}" wurde nicht erkannt.
es: Tipo de salida {0} no reconocido
fr: Type de sortie {0} non reconnu
it: Il tipo di output {0} non è riconosciuto
ja: 出力の種類 {0} を認識できません
ko: 출력 형식 {0}을(를) 인식할 수 없습니다.
pt_br: Tipo de saída {0} não reconhecido
zh_hans: 无法识别输出类型 {0}

# unrecognizedOutputType
source: Output type {0} not recognized
de: Der Ausgabetyp "{0}" wurde nicht erkannt.
es: Tipo de salida {0} no reconocido
fr: Type de sortie {0} non reconnu
it: Il tipo di output {0} non è riconosciuto
ja: 出力の種類 {0} を認識できません
ko: 출력 형식 {0}을(를) 인식할 수 없습니다.
pt_br: Tipo de saída {0} não reconhecido
zh_hans: 无法识别输出类型 {0}

# carbon.extension.contributes.notebook.executionTarget
source: Optional execution target this magic indicates, for example Spark vs SQL
de: Optionales Ausführungsziel, das von diesem Magic-Befehl angegeben wird, z. B. Spark oder SQL
es: Objetivo de ejecución opcional indicado por este magic, por ejemplo Spark vs SQL
fr: Cible d'exécution facultative que cette commande magique indique, par exemple, Spark vs. SQL
it: Destinazione di esecuzione facoltativa indicata da questo comando magic, ad esempio Spark rispetto a SQL
ja: Spark / SQL など、このマジックが示すオプションの実行対象
ko: 이 매직이 나타내는 선택적 실행 대상(예: Spark 및 SQL)
pt_br: Destino de execução opcional que essa mágic indica, por exemplo, Spark versus SQL
zh_hans: 此魔术方法指示的可选执行目标，例如 Spark 和 SQL

# carbon.extension.contributes.notebook.fileExtensions
source: What file extensions should be registered to this notebook provider
de: Gibt an, welche Dateierweiterungen für diesen Notebook-Anbieter registriert werden sollen.
es: Extensiones de archivo que deben estar registradas en este proveedor de cuadernos
fr: Extensions de fichier à inscrire dans ce fournisseur de notebooks
it: Indica le estensioni di file da registrare in questo provider di notebook
ja: このノートブック プロバイダーにどのファイル拡張子を登録する必要があるか
ko: 이 Notebook 공급자에 등록해야 하는 파일 확장명
pt_br: Quais extensões de arquivo devem ser registradas para este provedor de notebook?
zh_hans: 应向此笔记本提供程序注册哪些文件扩展名

# carbon.extension.contributes.notebook.kernels
source: Optional set of kernels this is valid for, e.g. python3, pyspark, sql
de: Optionaler Kernelsatz, auf den dies zutrifft, z. B. python3, pyspark, sql
es: Conjunto opcional de kernels para los que esto es válido, por ejemplo python3, pyspark, sql
fr: Ensemble facultatif de noyaux, valable, par exemple, pour python3, pyspark, sql
it: Set facoltativo di kernel per cui è valida questa impostazione, ad esempio python3, pyspark, sql
ja: これが有効なカーネルのオプションのセット (python3、pyspark、sql など)
ko: 유효한 선택적 커널 세트(예: python3, pyspark, sql)
pt_br: Conjunto opcional de kernels que é válido para, por exemplo, python3, pyspark, SQL
zh_hans: 可选内核集，对于 python3、pyspark 和 sql 等有效

# carbon.extension.contributes.notebook.language
source: The cell language to be used if this cell magic is included in the cell
de: Die zu verwendende Zellensprache, wenn dieser Zellen-Magic-Befehl in der Zelle enthalten ist.
es: El lenguaje de celda que se usará si este magic de celda se incluye en la celda
fr: Langage de cellule à utiliser si cette commande magique est incluse dans la cellule
it: Lingua da usare per la cella se questo comando magic è incluso nella cella
ja: このセル マジックがセルに含まれる場合に使用されるセルの言語
ko: 이 셀 매직이 셀에 포함되는 경우 사용되는 셀 언어
pt_br: A linguagem de célula a ser usada se esta magic da célula estiver incluída na célula
zh_hans: 单元格中包含此单元格魔术方法时要使用的单元格语言

# carbon.extension.contributes.notebook.magic
source: Name of the cell magic, such as '%%sql'.
de: Name des Magic-Befehls für die Zelle, z. B. "%%sql".
es: Nombre del magic de celda, como "%%sql".
fr: Nom de la cellule magique, par exemple, '%%sql'.
it: Nome del comando magic per la cella, ad esempio '%%sql'.
ja: '%%sql' などのセル マジックの名前。
ko: '%%sql'과(와) 같은 셀 매직의 이름입니다.
pt_br: Nome do magic da célula, como '%%sql'.
zh_hans: 单元格魔术方法的名称，如 "%%sql"。

# carbon.extension.contributes.notebook.provider
source: Identifier of the notebook provider.
de: Bezeichner des Notebook-Anbieters.
es: Identificador del proveedor del cuaderno.
fr: Identificateur du fournisseur de notebooks.
it: Identificatore del provider di notebook.
ja: ノートブック プロバイダーの識別子。
ko: Notebook 공급자의 식별자입니다.
pt_br: Identificador do provedor de notebook.
zh_hans: 笔记本提供程序的标识符。

# carbon.extension.contributes.notebook.standardKernels
source: What kernels should be standard with this notebook provider
de: Gibt an, welche Kernel für diesen Notebook-Anbieter als Standard festgelegt werden sollen.
es: Núcleos que deben ser estándar con este proveedor de cuadernos
fr: Noyaux devant être standard avec ce fournisseur de notebooks
it: Indica i kernel che devono essere standard con questo provider di notebook
ja: このノートブック プロバイダーへの標準装備が必要なカーネル
ko: 이 Notebook 공급자에서 표준이어야 하는 커널
pt_br: Quais kernels devem ser padrão com este provedor de notebook?
zh_hans: 此笔记本提供程序应标配哪些内核

# vscode.extension.contributes.notebook.languagemagics
source: Contributes notebook language.
de: Stellt die Notebook-Sprache zur Verfügung.
es: Aporta el lenguaje del cuaderno.
fr: Ajoute un langage de notebook.
it: Aggiunge come contributo la lingua del notebook.
ja: ノートブックの言語を提供します。
ko: Notebook 언어를 적용합니다.
pt_br: Contribui com a linguagem do notebook.
zh_hans: 提供笔记本语言。

# vscode.extension.contributes.notebook.providersDescriptions
source: Contributes notebook provider descriptions.
de: Steuert Beschreibungen des Notebookanbieters bei.
es: Aporta descripciones del proveedor de cuadernos.
fr: Contribue à la description des fournisseurs de blocs-notes.
it: Aggiunge come contributo le descrizioni del provider di notebook.
ja: ノートブック プロバイダーの説明を提供します。
ko: 전자 필기장 공급자 설명을 제공합니다.
pt_br: Contribui com as descrições dos fornecedores de bloco de anotações.
zh_hans: 提供笔记本提供程序说明。

source: Loading...
de: Wird geladen...
es: Carga en curso...
fr: Chargement...
it: Caricamento...
ja: 読み込んでいます...
ko: 로드 중...
pt_br: Carregando...
zh_hans: 正在加载...

# DisconnectAction
source: Disconnect
de: Trennen
es: Desconectar
fr: Déconnecter
it: Disconnetti
ja: 切断
ko: 연결 끊기
pt_br: Desconectar
zh_hans: 断开连接

# activeConnections
source: Show Active Connections
de: Aktive Verbindungen anzeigen
es: Mostrar conexiones activas
fr: Afficher les connexions actives
it: Mostra connessioni attive
ja: アクティブな接続を表示
ko: 활성 연결 표시
pt_br: Mostrar Conexões Ativas
zh_hans: 显示活动连接

# connectionTree.addConnection
source: New Connection
de: Neue Verbindung
es: Nueva conexión
fr: Nouvelle connexion
it: Nuova connessione
ja: 新しい接続
ko: 새 연결
pt_br: Nova Conexão
zh_hans: 新建连接

# connectionTree.addServerGroup
source: New Server Group
de: Neue Servergruppe
es: Nuevo grupo de servidores
fr: Nouveau groupe de serveurs
it: Nuovo gruppo di server
ja: 新しいサーバー グループ
ko: 새 서버 그룹
pt_br: Novo Grupo de Servidores
zh_hans: 新建服务器组

# connectionTree.editConnection
source: Edit Connection
de: Verbindung bearbeiten
es: Editar conexión
fr: Modifier la connexion
it: Modifica connessione
ja: 接続の編集
ko: 연결 편집
pt_br: Editar Conexão
zh_hans: 编辑连接

# connectionTree.editServerGroup
source: Edit Server Group
de: Servergruppe bearbeiten
es: Editar grupo de servidores
fr: Modifier le groupe de serveurs
it: Modifica gruppo di server
ja: サーバー グループの編集
ko: 서버 그룹 편집
pt_br: Editar Grupo de Servidores
zh_hans: 编辑服务器组

# connectionTree.refresh
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
zh_hans: 刷新

source: Delete Connection
de: Verbindung löschen
es: Eliminar conexión
fr: Supprimer la connexion
it: Elimina connessione
ja: 接続の削除
ko: 연결 삭제
pt_br: Excluir Conexão
zh_hans: 删除连接

# deleteConnectionGroup
source: Delete Group
de: Gruppe löschen
es: Eliminar grupo
fr: Supprimer le groupe
it: Elimina gruppo
ja: グループの削除
ko: 그룹 삭제
pt_br: Excluir Grupo
zh_hans: 删除组

source: Show All Connections
de: Alle Verbindungen anzeigen
es: Mostrar todas las conexiones
fr: Afficher toutes les connexions
it: Mostra tutte le connessioni
ja: すべての接続を表示
ko: 모든 연결 표시
pt_br: Mostrar Todas as Conexões
zh_hans: 显示所有连接

# OeSessionFailedError
source: Failed to create Object Explorer session
de: Fehler beim Erstellen der Objekt-Explorer-Sitzung.
es: Error al crear la sesión del Explorador de objetos
fr: La création d'une session de l'Explorateur d'objets a échoué
it: Non è stato possibile creare la sessione di Esplora oggetti
ja: オブジェクト エクスプローラー セッションを作成できませんでした
ko: 개체 탐색기 세션을 만들지 못함
pt_br: Falha ao criar a sessão do Pesquisador de Objetos
zh_hans: 未能创建对象资源管理器会话

# nodeExpansionError
source: Multiple errors:
de: Mehrere Fehler:
es: Varios errores:
fr: Plusieurs erreurs :
it: Più errori:
ja: 複数のエラー:
ko: 여러 오류:
pt_br: Múltiplos erros:
zh_hans: 多个错误:

# firewallCanceled
source: Firewall dialog canceled
de: Firewalldialogfeld abgebrochen
es: Diálogo de firewall cancelado
fr: Boîte de dialogue de pare-feu annulée
it: Finestra di dialogo del firewall annullata
ja: ファイアウォール ダイアログが取り消されました
ko: 방화벽 대화 상자를 취소함
pt_br: Caixa de diálogo do Firewall cancelada
zh_hans: 防火墙对话已取消

# loginCanceled
source: User canceled
de: Vom Benutzer abgebrochen
es: Cancelado por el usuario
fr: Annulé par l'utilisateur
it: Annullato dall'utente
ja: ユーザーによる取り消し
ko: 사용자가 취소함
pt_br: Usuário cancelado
zh_hans: 用户已取消

# noProviderFound
source: Cannot expand as the required connection provider '{0}' was not found
de: Erweiterung nicht möglich, weil der erforderliche Verbindungsanbieter "{0}" nicht gefunden wurde.
es: No se puede expandir porque no se encontró el proveedor de conexiones necesario "{0}"
fr: Développement impossible, car le fournisseur de connexion nécessaire '{0}' est introuvable
it: Non è possibile eseguire l'espansione perché il provider di connessione richiesto '{0}' non è stato trovato
ja: 必要な接続プロバイダー '{0}' が見つからないため、展開できません
ko: 필요한 연결 공급자 '{0}'을(를) 찾을 수 없으므로 확장할 수 없습니다.
pt_br: Não é possível expandir, pois o provedor de conexão necessário '{0}' não foi encontrado
zh_hans: 无法展开，因为未找到所需的连接提供程序“{0}”
