Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# errNoSerializationProvider
source: No notebook serialization provider found
de: Es wurde kein Anbieter für die Notebook-Serialisierung gefunden
es: No se encontró ningún proveedor de serialización de cuadernos
fr: Aucun fournisseur de sérialisation de bloc-notes trouvé
it: Non è stato trovato alcun provider di serializzazione notebook
ja: ノートブック シリアル化プロバイダーが見つかりません
ko: 전자 필기장 serialization 공급자를 찾을 수 없습니다.
pt_br: Nenhum provedor de serialização do bloco de anotações encontrado
zh_hans: 找不到笔记本序列化提供程序

# executeProviderRequired
source: A NotebookExecuteProvider with valid providerId must be passed to this method
de: Ein NotebookExecuteProvider mit gültiger Provider-ID muss an diese Methode übergeben werden
es: Un NotebookExecuteProvider con un id. de proveedor válido debe pasarse a este método
fr: Un NotebookExecuteProvider avec un providerId valide doit être passé à cette méthode.
it: È necessario passare a questo metodo un elemento NotebookExecuteProvider con providerId valido
ja: 有効な providerId を持つ NotebookExecuteProvider をこのメソッドに渡す必要があります
ko: 유효한 providerId가 있는 NotebookExecuteProvider를 이 메서드에 전달해야 합니다.
pt_br: Um NotebookExecuteProvider com fornecedor válidoDeve ser passado para este método
zh_hans: 必须向此方法传递具有有效 providerId 的 NotebookExecuteProvider

# noContentManager
source: Notebook Manager for notebook {0} does not have a content manager. Cannot perform operations on it
de: Der Notebook-Manager für das Notebook "{0}" umfasst keinen Inhalts-Manager. Es können keine Aktionen ausgeführt werden.
es: La instancia de Notebook Manager para el cuaderno {0} no tiene un administrador de contenido. No se pueden realizar operaciones en él
fr: Le gestionnaire du notebook {0} n'a pas de gestionnaire de contenu. Impossible d'y effectuer des opérations
it: Il gestore del notebook {0} non include un gestore di contenuti. Non è possibile eseguirvi operazioni
ja: ノートブック {0} の Notebook Manager にコンテンツ マネージャーがありません。それに対して操作を実行できません
ko: {0} Notebook의 Notebook 관리자에 콘텐츠 관리자가 없습니다. 작업을 수행할 수 없습니다.
pt_br: O Notebook Manager do notebook {0} não tem um gerenciador de conteúdo. Não é possível executar operações nele
zh_hans: 笔记本 {0} 的笔记本管理器没有内容管理器。无法对其执行操作

# noServerManager
source: Notebook Manager for notebook {0} does not have a server manager. Cannot perform operations on it
de: Der Notebook-Manager für das Notebook "{0}" umfasst keinen Server-Manager. Es können keine Aktionen ausgeführt werden.
es: La instancia de Notebook Manager para el cuaderno {0} no tiene un administrador de servidores. No se pueden realizar operaciones en él
fr: Le gestionnaire du notebook {0} n'a pas de gestionnaire de serveur. Impossible d'y effectuer des opérations
it: Il gestore del notebook {0} non include un gestore di server. Non è possibile eseguirvi operazioni
ja: ノートブック {0} の Notebook Manager にサーバー マネージャーがありません。それに対して操作を実行できません
ko: {0} Notebook의 Notebook 관리자에 서버 관리자가 없습니다. 작업을 수행할 수 없습니다.
pt_br: O Notebook Manager para o notebook {0} não tem um gerenciador de servidores. Não é possível executar operações nele
zh_hans: 笔记本 {0} 的笔记本管理器没有服务器管理器。无法对其执行操作

# noSessionManager
source: Notebook Manager for notebook {0} does not have a session manager. Cannot perform operations on it
de: Der Notebook-Manager für das Notebook "{0}" umfasst keinen Sitzungs-Manager. Es können keine Aktionen ausgeführt werden.
es: La instancia de Notebook Manager para el cuaderno {0} no tiene un administrador de sesiones. No se pueden realizar operaciones en él.
fr: Le gestionnaire du notebook {0} n'a pas de gestionnaire de session. Impossible d'y exécuter des opérations
it: Il gestore del notebook {0} non include un gestore di sessioni. Non è possibile eseguirvi operazioni
ja: ノートブック {0} の Notebook Manager にセッション マネージャーがありません。それに対して操作を実行できません
ko: {0} Notebook의 Notebook 관리자에 세션 관리자가 없습니다. 작업을 수행할 수 없습니다.
pt_br: O Notebook Manager do notebook {0} não tem um gerenciador de sessão. Não é possível executar operações nele
zh_hans: 笔记本 {0} 的笔记本管理器没有会话管理器。无法对其执行操作

# serializationProviderRequired
source: A NotebookSerializationProvider with valid providerId must be passed to this method
de: Ein NotebookSerializationProvider mit gültiger Provider-ID muss an diese Methode übergeben werden
es: Un NotebookSerializationProvider con un id. de proveedor válido debe pasarse a este método
fr: Un NotebookSerializationProvider avec un providerId valide doit être passé à cette méthode.
it: È necessario passare a questo metodo un elemento NotebookSerializationProvider con providerId valido
ja: 有効な providerId を持つ NotebookSerializationProvider をこのメソッドに渡す必要があります
ko: 유효한 providerId가 있는 NotebookSerializationProvider를 이 메서드에 전달해야 합니다.
pt_br: Um provedor de serialização de blocos de anotações com um provedor válidoDeve ser passado para este método
zh_hans: 必须向此方法传递具有有效 providerId 的 NotebookSerializationProvider

# navigationProviderRequired
source: A NavigationProvider with valid providerId must be passed to this method
de: Ein NavigationProvider mit gültiger Provider-ID muss an diese Methode übergeben werden
es: Se debe pasar un NavigationProvider con un id. de proveedor válido a este método
fr: Un NavigationProvider avec un providerId valide doit être passé à cette méthode.
it: È necessario passare a questo metodo un elemento NavigationProvider con providerId valido
ja: 有効な providerId を持つ NavigationProvider をこのメソッドに渡す必要があります
ko: 유효한 providerId가 있는 NavigationProvider가 이 메서드에 전달되어야 합니다.
pt_br: Um provedor de navegação com provedor válidoDeve ser passado para este método
zh_hans: 必须向此方法传递具有有效 providerId 的 NavigationProvider

# clearSavedAccounts
source: Clear all saved accounts
de: Alle gespeicherten Konten löschen
es: Borrar todas las cuentas guardadas
fr: Effacer tous les comptes enregistrés
it: Cancella tutti gli account salvati
ja: 保存されているすべてのアカウントのクリア
ko: 저장된 모든 계정 지우기
pt_br: Limpar todas as contas salvas
zh_hans: 清除所有保存的帐户

# configureDashboardLearnMore
source: Learn More
de: Weitere Informationen
es: Más información
fr: En savoir plus
it: Altre informazioni
ja: 詳細情報
ko: 자세한 정보
pt_br: Saiba Mais
zh_hans: 了解更多

source: Manage
de: Verwalten
es: Administrar
fr: Gérer
it: Gestisci
ja: 管理
ko: 관리
pt_br: Gerenciar
zh_hans: 管理

source: Show Details
de: Details anzeigen
es: Mostrar detalles
fr: Afficher les détails
it: Mostra dettagli
ja: 詳細の表示
ko: 세부 정보 표시
pt_br: Mostrar Detalhes
zh_hans: 显示详细信息

# enableObsoleteApiUsageNotification
source: Enable/disable obsolete API usage notification
de: Benachrichtigung bei Verwendung veralteter APIs aktivieren/deaktivieren
es: Activar/desactivar la notificación de uso de API obsoleta
fr: Activer/désactiver la notification d'utilisation d'API obsolète
it: Abilita/disabilita la notifica di utilizzo di API obsolete
ja: 古い API 使用状況通知を有効または無効にする
ko: 사용되지 않는 API 사용 알림 사용/사용 안 함
pt_br: Habilitar/desabilitar a notificação de uso de API obsoleta
zh_hans: 启用/禁用过时的 API 使用通知

# enableObsoleteApiUsageNotificationTitle
source: Obsolete API Notification
de: Benachrichtigung zu veralteter API
es: Notificación de API obsoleta
fr: Notification d'API obsolète
it: Notifica API obsolete
ja: 古い API 通知
ko: 사용되지 않는 API 알림
pt_br: Notificação de API obsoleta
zh_hans: 过时的 API 通知

# previewFeatures.configEnable
source: Enable unreleased preview features
de: Nicht veröffentlichte Vorschaufeatures aktivieren
es: Habilitar las características de la versión preliminar sin publicar
fr: Activer les fonctionnalités en préversion non publiées
it: Abilita le funzionalità di anteprima non rilasciate
ja: 未リリースのプレビュー機能を有効にする
ko: 해제되지 않은 미리 보기 기능 사용
pt_br: Habilitar versões prévias dos recursos não liberadas
zh_hans: 启用未发布的预览功能

# previewFeatures.configTitle
source: Preview Features
de: Vorschaufeatures
es: Características en versión preliminar
fr: Fonctionnalités en préversion
it: Funzionalità di anteprima
ja: プレビュー機能
ko: 미리 보기 기능
pt_br: Versões prévias dos recursos
zh_hans: 预览功能

source: Show connect dialog on startup
de: Beim Start Verbindungsdialogfeld anzeigen
es: Mostrar diálogo de conexión al inicio
fr: Afficher la boîte de dialogue de connexion au démarrage
it: Mostra la finestra di dialogo della connessione all'avvio
ja: 起動時に接続ダイアログを表示
ko: 시작 시 연결 대화 상자 표시
pt_br: Mostrar caixa de diálogo de conexão na inicialização
zh_hans: 在启动时显示连接对话框

# designer.generalGroupName
source: General
de: Allgemein
it: Generale
ja: 全般
ko: 일반

# designer.loadingDesigner
source: Loading designer...
de: Designer wird geladen...
it: Caricamento della finestra di progettazione in corso
ja: デザイナーの読み込み中...
ko: 디자이너를 로드하는 중...

# designer.loadingDesignerCompleted
source: Designer is loaded
de: Designer ist geladen
it: La finestra di progettazione è caricata
ja: デザイナーが読み込まれます
ko: 디자이너가 로드되었습니다.

# designer.newRowText
source: Add New
de: Neue/s/n hinzufügen
it: Aggiungi nuovo
ja: 新規追加
ko: 새로 추가

# designer.processingChanges
source: Processing changes...
de: Änderungen werden verarbeitet...
it: Elaborazione delle modifiche in corso...
ja: 変更の処理中...
ko: 변경 내용 처리 중...

# designer.processingChangesCompleted
source: Changes have been processed
de: Änderungen wurden verarbeitet
it: Le modifiche sono state elaborate
ja: 変更が処理されました
ko: 변경 내용이 처리되었습니다.

# designer.removeRowText
source: Remove
de: Entfernen
it: Rimuovi
ja: 削除
ko: 제거

# designer.savingChanges
source: Saving changes...
de: Änderungen werden gespeichert...
it: Salvataggio modifiche in corso...
ja: 変更を保存しています...
ko: 변경 내용 저장 중...

# designer.savingChangesCompleted
source: Changes have been saved
de: Änderungen wurden gespeichert
it: Le modifiche sono state salvate.
ja: 変更が保存されました。
ko: 변경 내용이 저장되었습니다.

# tableDesigner.unknownComponentType
source: The component type: {0} is not supported
de: Komponententyp: {0} wird nicht unterstützt
it: Il tipo di componente: {0} non è supportato
ja: コンポーネントの種類: {0} はサポートされていません
ko: 구성 요소 형식: {0}이(가) 지원되지 않음

# tableDesigner.propertiesPaneTitle
source: Properties
de: Eigenschaften
it: Proprietà
ja: プロパティ
ko: 속성

# tableDesigner.propertiesPaneTitleWithContext
source: {0} Properties
de: {0}-Eigenschaften
it: Proprietà di {0}
ja: {0} のプロパティ
ko: {0} 속성

# designer.textEditorAriaLabel
source: Designer text editor.
it: Editor di testo della finestra di progettazione.
ja: デザイナー テキスト エディター。
ko: 디자이너 텍스트 편집기.

# connectionFailure
source: Edit Data Session Failed To Connect
de: Fehler beim Verbinden der Datenbearbeitungssitzung.
es: Error al conectar la sesión de edición de datos
fr: La connexion à la session de modification des données a échoué
it: Connessione alla sessione di modifica dati non riuscita
ja: 編集データ セッションの接続に失敗しました
ko: 연결하지 못한 데이터 세션 편집
pt_br: Falha ao conectar sessão de dados
zh_hans: 编辑数据会话连接失败

# profiler.eventsLost
source: The XEvent Profiler session for {0} has lost events.
de: Die XEvent Profiler-Sitzung für "{0}" hat Ereignisse verloren.
es: La sesión de XEvent Profiler para {0} tiene eventos perdidos.
fr: La session XEvent Profiler pour {0} a des événements perdus.
it: Sono presenti eventi persi per la sessione del profiler XEvent per {0}.
ja: {0} の XEvent Profiler セッションのイベントが失われました。
ko: {0}의 XEvent Profiler 세션에서 이벤트가 손실되었습니다.
pt_br: A sessão do XEvent Profiler para {0} perdeu eventos.
zh_hans: {0} 的 XEvent 探查器会话缺失事件。

# profiler.sessionCreationError
source: Error while starting new session
de: Fehler beim Starten der neuen Sitzung.
es: Error al iniciar nueva sesión
fr: Erreur au démarrage d'une nouvelle session
it: Si è verificato un errore durante l'avvio della nuova sessione
ja: 新しいセッションを開始中にエラーが発生しました
ko: 새로운 세션을 시작하는 동안 오류가 발생했습니다.
pt_br: Erro ao iniciar nova sessão
zh_hans: 启动新会话时出错

# profiler.sessionStopped
source: XEvent Profiler Session stopped unexpectedly on the server {0}.
de: Die XEvent Profiler-Sitzung wurde auf dem Server "{0}" unerwartet beendet.
es: La sesión de XEvent Profiler se detuvo inesperadamente en el servidor {0}.
fr: La session XEvent Profiler s'est arrêtée de manière inattendue sur le serveur {0}.
it: La sessione del profiler XEvent è stata arrestata in modo imprevisto nel server {0}.
ja: サーバー {0} で XEvent Profiler セッションが予期せず停止しました。
ko: {0} 서버에서 XEvent Profiler 세션이 예기치 않게 중지되었습니다.
pt_br: A sessão do XEvent Profiler parou inesperadamente no servidor {0}.
zh_hans: XEvent 探查器会话在服务器 {0} 上意外停止。

# profilerInput.notConnected
source: Not connected
de: Nicht verbunden
es: No conectado
fr: Non connecté
it: Non connesso
ja: 未接続
ko: 연결되지 않음
pt_br: Não conectado
zh_hans: 未连接

# resourceViewer.showActions
source: Show Actions
de: Aktionen anzeigen
es: Mostrar acciones
fr: Afficher les actions
it: Mostra azioni
ja: アクションの表示
ko: 작업 표시
pt_br: Mostrar Ações
zh_hans: 显示操作

# resourceViewerInput.resourceViewer
source: Resource Viewer
de: Ressourcen-Viewer
es: Visor de recursos
fr: Visionneuse de ressources
it: Visualizzatore risorse
ja: リソース ビューアー
ko: 리소스 뷰어
pt_br: Visualizador de Recursos
zh_hans: 资源查看器

# tableDesigner.newTable
source: New Table
de: Neue Tabelle
it: Nuova tabella
ja: 新しいテーブル
ko: 새 테이블

# closeMessage
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
zh_hans: 关闭

# copyMessage
source: Copy
de: Kopieren
es: Copiar
fr: Copier
it: Copia
ja: コピー
ko: 복사
pt_br: Copiar
zh_hans: 复制

# errorAltText
source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pt_br: Erro
zh_hans: 错误

# hideMessageDetails
source: Hide Details
de: Details ausblenden
es: Ocultar detalles
fr: Masquer les détails
it: Nascondi dettagli
ja: 詳細を表示しない
ko: 세부 정보 숨기기
pt_br: Ocultar Detalhes
zh_hans: 隐藏详细信息

# infoAltText
source: Information
es: Información
fr: Informations
it: Informazioni
ja: 情報
ko: 정보
pt_br: Informações
zh_hans: 信息

# modal.back
source: Back
de: Zurück
es: Atrás
fr: Précédent
it: Indietro
ja: 戻る
ko: 뒤로
pt_br: Voltar
zh_hans: 返回

# showMessageDetails
source: Show Details
de: Details anzeigen
es: Mostrar detalles
fr: Afficher les détails
it: Mostra dettagli
ja: 詳細の表示
ko: 세부 정보 표시
pt_br: Mostrar Detalhes
zh_hans: 显示详细信息

# warningAltText
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
it: Avviso
ja: 警告
ko: 경고
pt_br: Aviso
zh_hans: 警告

# optionsDialog.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# optionsDialog.ok
source: OK
es: Aceptar
ko: 확인
zh_hans: 确定

# optionsDialog.defaultGroupName
source: General
de: Allgemein
fr: Général
it: Generale
ja: 全般
ko: 일반
pt_br: Geral
zh_hans: 常规

# optionsDialog.invalidInput
source: Invalid input. Numeric value expected.
de: Ungültige Eingabe. Es wird ein numerischer Wert erwartet.
es: Entrada no válida. Se espera un valor numérico.
fr: Entrée non valide. Valeur numérique attendue.
it: Input non valido. È previsto un valore numerico.
ja: 無効な入力です。数値が必要です。
ko: 잘못된 입력입니다. 숫자 값이 필요합니다.
pt_br: Entrada inválida. Valor numérico esperado.
zh_hans: 输入无效。预期值为数值。

# optionsDialog.missingRequireField
source: is required.
de: ist erforderlich.
es: se requiere.
fr: est nécessaire.
it: è obbligatorio.
ja: が必須です。
ko: 이(가) 필요합니다.
pt_br: é necessário.
zh_hans: 是必需的。

# blankValue
source: blank
de: Leer
es: vacío
fr: vide
it: vuoto
ja: 空白
ko: 비어 있음
pt_br: branco
zh_hans: 空白

# checkAllColumnLabel
source: check all checkboxes in column: {0}
de: Alle Kontrollkästchen in folgender Spalte aktivieren: {0}
es: Marque todas las casillas de la columna: {0}
fr: cocher toutes les cases dans la colonne : {0}
it: selezionare tutte le caselle di controllo nella colonna: {0}
ja: 列 {0} のすべてのチェック ボックスをオンにする
ko: 열의 모든 확인란 선택: {0}
pt_br: marcar todas as caixas de seleção na coluna: {0}
zh_hans: 选中列中的所有复选框: {0}

# declarativeTable.showActions
source: Show Actions
de: Aktionen anzeigen
es: Mostrar acciones
fr: Afficher les actions
it: Mostra azioni
ja: アクションの表示
ko: 작업 표시
pt_br: Mostrar ações
zh_hans: 显示操作

# defaultDropdownErrorMessage
source: Please fill out this field.
de: Füllen Sie dieses Feld aus.
es: Rellene este campo.
fr: Remplissez ce champ.
it: Compilare questo campo.
ja: このフィールドに入力してください。
ko: 이 필드를 입력하세요.
pt_br: Preencha este campo.
zh_hans: 请填写此字段。

# invalidValueError
source: Invalid value
de: Ungültiger Wert.
es: Valor no válido
fr: Valeur non valide
it: Valore non valido
ja: 無効な値
ko: 잘못된 값
pt_br: Valor inválido
zh_hans: 值无效

# queryTextEditorAriaLabel
source: modelview code editor for view model.
de: Modellansichts-Code-Editor für Ansichtsmodell.
es: Editor de código de modelview para modelo de vista.
fr: éditeur de code vue modèle pour le modèle de vue.
it: editor del codice modelview per il modello di visualizzazione.
ja: ビュー モデル用のモードビュー コード エディター。
ko: 뷰 모델용 modelview 코드 편집기입니다.
pt_br: Editor de código modelview para modelo de exibição.
zh_hans: 用于视图模型的模型视图代码编辑器。

# componentTypeNotRegistered
source: Could not find component for type {0}
de: Die Komponente für den Typ "{0}" wurde nicht gefunden.
es: No pudo encontrar el componente para el tipo {0}
fr: Composant introuvable pour le type {0}
it: Non è stato possibile trovare il componente per il tipo {0}
ja: 型 {0} のコンポーネントが見つかりませんでした
ko: {0} 형식의 구성 요소를 찾을 수 없습니다.
pt_br: Não foi possível localizar o componente para o tipo {0}
zh_hans: 找不到类型 {0} 的组件

# languageChangeUnsupported
source: Changing editor types on unsaved files is unsupported
de: Das Ändern von Editor-Typen für nicht gespeicherte Dateien wird nicht unterstützt.
es: No se admite el cambio de tipos de editor en archivos no guardados
fr: Le changement des types d'éditeur pour les fichiers non enregistrés n'est pas pris en charge
it: La modifica dei tipi di editor per file non salvati non è supportata
ja: 保存されていないファイルでの編集者の種類の変更はサポートされていません
ko: 저장하지 않은 파일의 경우 편집기 유형을 변경할 수 없습니다.
pt_br: Não há suporte para alterar os tipos de editor em arquivos não salvos
zh_hans: 不支持更改未保存文件的编辑器类型

source: Edit Data
de: Daten bearbeiten
es: Editar datos
fr: Modifier les données
it: Modifica dati
ja: データの編集
ko: 데이터 편집
pt_br: Editar Dados
zh_hans: 编辑数据

# scriptAlter
source: Script as Alter
de: Skripterstellung als ALTER
es: Script como modificar
fr: Script de modification
it: Genera script come ALTER
ja: 変更としてのスクリプト
ko: Alter로 스크립트
pt_br: Script como Alterar
zh_hans: 执行 Alter 脚本

# scriptCreate
source: Script as Create
de: Skripterstellung als CREATE
es: Script como crear
fr: Script de création
it: Genera script come CREATE
ja: 作成としてのスクリプト
ko: Create로 스크립트
pt_br: Script como Criar
zh_hans: 执行 Create 脚本

# scriptDelete
source: Script as Drop
de: Skripterstellung als DROP
es: Script como borrar
fr: Script de suppression
it: Genera script come DROP
ja: ドロップとしてのスクリプト
ko: Drop으로 스크립트
pt_br: Script como Soltar
zh_hans: 执行 Drop 脚本

# scriptExecute
source: Script as Execute
de: Skripterstellung als EXECUTE
es: Script como ejecutar
fr: Script d'exécution
it: Genera script come EXECUTE
ja: 実行としてのスクリプト
ko: Execute로 스크립트
pt_br: Script como Executar
zh_hans: 执行 Execute 脚本

# scriptSelect
source: Select Top 1000
de: Oberste 1000 auswählen
es: Seleccionar el top 1000
fr: Sélectionnez les 1000 premiers
it: Genera script come SELECT TOP 1000
ja: 上位 1000 を選択する
ko: 상위 1,000개 선택
pt_br: Selecione Top 1000
zh_hans: 选择前 1000 项

# createOperationName
source: Create
de: Erstellen
es: Crear
fr: Créer
it: Crea
ja: 作成
ko: 만들기
pt_br: Criar
zh_hans: 创建

# deleteOperationName
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
pt_br: Excluir
zh_hans: 删除

# insertOperationName
source: Insert
de: Einfügen
es: Insertar
fr: Insérer
it: Inserisci
ja: 挿入
ko: 삽입
pt_br: Inserir
zh_hans: 插入

# scriptNotFound
source: No script was returned when scripting as {0}
de: Bei der Skripterstellung als "{0}" wurde kein Skript zurückgegeben.
es: No se devolvió ningún script al ejecutar el script como {0}
fr: Aucun script n'a été retourné pendant la création du script {0}
it: Non è stato restituito alcuno script durante la generazione dello script come {0}
ja: {0} としてスクリプトを作成したときに返されたスクリプトはありません
ko: {0}(으)로 스크립팅했으나 스크립트가 반환되지 않았습니다.
pt_br: Nenhum script foi retornado ao criar scripts como {0}
zh_hans: 执行 {0} 脚本时未返回脚本

# scriptNotFoundForObject
source: No script was returned when scripting as {0} on object {1}
de: Bei der Skripterstellung als "{0}" für Objekt "{1}" wurde kein Skript zurückgegeben.
es: No se devolvió ningún script al escribir como {0} en el objeto {1}
fr: Aucun script n'a été retourné pendant la création du script {0} sur l'objet {1}
it: Non è stato restituito alcuno script durante la generazione dello script come {0} sull'oggetto {1}
ja: オブジェクト {1} に対する {0} としてスクリプトを作成したときに返されたスクリプトはありません
ko: 개체 {1}에서 {0}(으)로 스크립팅했으나 스크립트가 반환되지 않았습니다.
pt_br: Nenhum script foi retornado durante o script como {0} no objeto {1}
zh_hans: 在对象 {1} 上执行 {0} 脚本时未返回脚本

# scriptSelectNotFound
source: No script was returned when calling select script on object
de: Beim Aufruf des ausgewählten Skripts für das Objekt wurde kein Skript zurückgegeben.
es: No se devolvió ningún script al llamar al script de selección en el objeto
fr: Aucun script n'a été retourné pendant l'appel du script sélectionné sur l'objet
it: Non è stato restituito alcuno script durante la chiamata dello script di selezione sull'oggetto
ja: オブジェクトに対するスクリプトの選択を呼び出したときに返されたスクリプトはありません
ko: 개체에 대해 스크립트 선택을 호출할 때 스크립트가 반환되지 않았습니다.
pt_br: Nenhum script foi retornado ao chamar o script select no objeto
zh_hans: 在对象上调用 select 脚本时没有返回脚本

source: Scripting Failed
de: Fehler bei Skripterstellung.
es: Error de scripting
fr: Échec des scripts
it: Generazione dello script non riuscita
ja: スクリプト作成に失敗しました
ko: 스크립트 실패
pt_br: O script falhou
zh_hans: 执行脚本失败

# selectOperationName
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
ko: 선택
pt_br: Selecionar
zh_hans: 选择

# updateOperationName
source: Update
de: Aktualisieren
es: Actualizar
fr: Mettre à jour
it: Aggiorna
ja: 更新
ko: 업데이트
pt_br: Atualizar
zh_hans: 更新

source: disconnected
de: Getrennt
es: desconectado
fr: déconnecté
it: disconnesso
ja: 切断されました
ko: 연결 끊김
pt_br: desconectado
zh_hans: 已断开连接

# extensionsInputName
source: Extension
de: Erweiterung
es: Extensión
it: Estensione
ja: 拡張
ko: 확장
pt_br: Extensão
zh_hans: 扩展

# dashboardBorder
source: Color for borders in dashboard
de: Farbe für Rahmen im Dashboard
es: Color de los bordes en el panel
fr: Couleur des bordures du tableau de bord
it: Colore per i bordi nel dashboard
ja: ダッシュボードの境界線の色
ko: 대시보드의 테두리 색
pt_br: Cor das bordas no painel
zh_hans: 仪表板中边框的颜色

# dashboardWidget
source: Color of dashboard widget title
de: Farbe des Titels des Dashboardgadgets
es: Color del título del widget de panel
fr: Couleur du titre du widget de tableau de bord
it: Colore del titolo del widget del dashboard
ja: ダッシュボード ウィジェットのタイトルの色
ko: 대시보드 위젯 제목 색
pt_br: Cor do título do widget do painel
zh_hans: 仪表板小组件标题的颜色

# dashboardWidgetSubtext
source: Color for dashboard widget subtext
de: Farbe für Dashboard-Widget-Subtext
es: Color del subtexto del widget de panel
fr: Couleur du sous-texte du widget de tableau de bord
it: Colore per il sottotesto del widget del dashboard
ja: ダッシュボード ウィジェット サブテキストの色
ko: 대시보드 위젯 하위 텍스트 색
pt_br: Cor do subtexto do widget de painel
zh_hans: 仪表板小组件子文本的颜色

# propertiesContainerPropertyName
source: Color for property names displayed in the properties container component
de: Farbe für Eigenschaftennamen, die in der Eigenschaftencontainerkomponente angezeigt werden
es: Color de los nombres de la propiedad que se muestran en el componente del contenedor de propiedades
fr: Couleur des noms de propriété affichées dans le composant conteneur des propriétés
it: Colore per i nomi proprietà visualizzati nel componente del contenitore delle proprietà
ja: プロパティ コンテナー コンポーネントに表示されるプロパティ名の色
ko: 속성 컨테이너 구성 요소에 표시되는 속성 이름의 색
pt_br: Cor dos nomes de propriedade exibidos no componente contêiner de propriedades
zh_hans: 属性容器组件中显示的属性名称的颜色
