Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

# viewNotFound
source: Unable to find view: {0}
de: Ansicht nicht gefunden: {0}
es: No se encuentra la vista: {0}
fr: Affichage introuvable : {0}
it: Non è possibile trovare la visualizzazione: {0}
ja: ビューが見つかりません: {0}
ko: 뷰 '{0}'을(를) 찾을 수 없습니다.
pt_br: Não é possível encontrar o modo de exibição: {0}
zh_hans: 找不到视图: {0}

# notebookEditor.name
source: Notebook Editor
es: Editor de Notebook
fr: Éditeur de notebook
it: Editor di notebook
ja: ノートブック エディター
ko: Notebook 편집기
pt_br: Editor do Notebook
zh_hans: 笔记本编辑器

# notebookExplorer.name
source: Notebooks
es: Cuadernos
it: Notebook
ja: ノートブック
ko: Notebook
zh_hans: 笔记本

# notebookExplorer.searchResults
source: Search Results
de: Suchergebnisse
es: Resultados de la búsqueda
fr: Résultats de la recherche
it: Risultati della ricerca
ja: 検索結果
ko: 검색 결과
pt_br: Resultados da Pesquisa
zh_hans: 搜索结果

# searchPathNotFoundError
source: Search path not found: {0}
de: Der Suchpfad wurde nicht gefunden: {0}.
es: No se encuentra la ruta de búsqueda: {0}
fr: Chemin de recherche introuvable : {0}
it: Percorso di ricerca non trovato: {0}
ja: 検索パスが見つかりません: {0}
ko: 검색 경로를 찾을 수 없음: {0}
pt_br: Caminho de pesquisa não encontrado: {0}
zh_hans: 找不到搜索路径: {0}

# CancelSearchAction.label
source: Cancel Search
de: Suche abbrechen
es: Cancelar búsqueda
fr: Annuler la recherche
it: Annulla ricerca
ja: 検索のキャンセル
ko: 검색 취소
pt_br: Cancelar Pesquisa
zh_hans: 取消搜索

# ClearSearchResultsAction.label
source: Clear Search Results
de: Suchergebnisse löschen
es: Borrar resultados de la búsqueda
fr: Effacer les résultats de la recherche
it: Cancella risultati della ricerca
ja: 検索結果のクリア
ko: 검색 결과 지우기
pt_br: Limpar os Resultados da Pesquisa
zh_hans: 清除搜索结果

# CollapseDeepestExpandedLevelAction.label
source: Collapse All
de: Alle reduzieren
es: Contraer todo
fr: Tout réduire
it: Comprimi tutto
ja: すべて折りたたむ
ko: 모두 축소
pt_br: Recolher Tudo
zh_hans: 全部折叠

# ExpandAllAction.label
source: Expand All
de: Alle erweitern
es: Expandir todo
fr: Tout développer
it: Espandi tutto
ja: すべて展開
ko: 모두 확장
pt_br: Expandir Tudo
zh_hans: 全部展开

# ToggleCollapseAndExpandAction.label
source: Toggle Collapse and Expand
de: Zu- und Aufklappen umschalten
es: Alternar Contraer y expandir
fr: Activer/désactiver les options Réduire et Développer
it: Attiva/Disattiva Comprimi ed espandi
ja: 折りたたみと展開の切り替え
ko: 축소 및 확장 전환
pt_br: Ativar/Desativar Recolhimento e Expansão
zh_hans: 切换折叠和展开

# ariaSearchResultsStatus
source: Search returned {0} results in {1} files
de: Die Suche hat {0} Ergebnisse in {1} Dateien zurückgegeben.
es: La búsqueda devolvió {0} resultados en {1} archivos
fr: La recherche a retourné {0} résultats dans {1} fichiers
it: La ricerca ha restituito {0} risultati in {1} file
ja: 検索により {1} 個のファイル内の {0} 件の結果が返されました
ko: 검색에서 {1}개의 파일에 {0}개의 결과를 반환했습니다.
pt_br: A pesquisa retornou {0} resultados em {1} arquivos
zh_hans: 搜索 {1} 文件中返回的 {0} 个结果

# noResultsExcludes
source: No results found excluding '{0}' -
de: Keine Ergebnisse gefunden, die "{0}" ausschließen –
es: No se encontraron resultados con exclusión de '{0}' -
fr: Résultats introuvables avec l'exclusion de '{0}' -
it: Non sono stati trovati risultati escludendo '{0}' -
ja: '{0}' を除外した結果はありませんでした -
ko: '{0}'을(를) 제외하는 결과가 없음 -
pt_br: Nenhum resultado encontrado, exceto '{0}' –
zh_hans: 除“{0}”外，未找到任何结果 -

# noResultsFound
source: No results found. Review your settings for configured exclusions and check your gitignore files -
de: Es wurden keine Ergebnisse gefunden. Überprüfen Sie die Einstellungen für konfigurierte Ausschlüsse, und überprüfen Sie Ihre gitignore-Dateien -
es: No se encontraron resultados. Revise la configuración para configurar exclusiones y verificar sus archivos gitignore -
fr: Aucun résultat. Vérifiez les exclusions configurées dans vos paramètres et examinez vos fichiers gitignore -
it: Non sono stati trovati risultati. Rivedere le impostazioni relative alle esclusioni configurate e verificare i file gitignore -
ja: 結果がありません。除外構成の設定を確認し、gitignore ファイルを調べてください -
ko: 결과가 없습니다. 구성된 제외에 대한 설정을 검토하고 gitignore 파일을 확인하세요. -
pt_br: Nenhum resultado encontrado. Examine suas configurações para obter exclusões configuradas e verifique os arquivos do gitignore –
zh_hans: 未找到结果。查看您的设置配置排除, 并检查您的 gitignore 文件-

# noResultsIncludes
source: No results found in '{0}' -
de: Keine Ergebnisse in "{0}" gefunden –
es: No se encontraron resultados en '{0}' -
fr: Résultats introuvables dans '{0}' -
it: Non sono stati trovati risultati in '{0}' -
ja: '{0}' に結果はありません -
ko: '{0}'에 결과 없음 -
pt_br: Nenhum resultado encontrado em '{0}' –
zh_hans: “{0}”中未找到任何结果 -

# noResultsIncludesExcludes
source: No results found in '{0}' excluding '{1}' -
de: Keine Ergebnisse in "{0}" unter Ausschluss von "{1}" gefunden –
es: No se encontraron resultados en '{0}' con exclusión de '{1}' -
fr: Résultats introuvables pour '{0}' excluant '{1}' -
it: Non sono stati trovati risultati in '{0}' escludendo '{1}' -
ja: '{0}' に '{1}' を除外した結果はありません -
ko: '{0}'에 '{1}'을(를) 제외한 결과 없음 -
pt_br: Nenhum resultado encontrado em '{0}', exceto '{1}' –
zh_hans: 在“{0}”中找不到结果(“{1}”除外) -

# openNotebookFolder
source: Open Notebooks
de: Notebooks öffnen
es: Abrir cuaderno
fr: Ouvrir les notebooks
it: Apri notebook
ja: ノートブックを開く
ko: Notebook 열기
pt_br: Abrir os Notebooks
zh_hans: 打开笔记本

# openSettings.message
source: Open Settings
de: Einstellungen öffnen
es: Abrir configuración
fr: Ouvrir les paramètres
it: Apri impostazioni
ja: 設定を開く
ko: 설정 열기
pt_br: Abrir as Configurações
zh_hans: 打开设置

# rerunSearch.message
source: Search again
de: Erneut suchen
es: Vuelva a realizar la búsqueda.
fr: Chercher à nouveau
it: Cerca di nuovo
ja: もう一度検索
ko: 다시 검색
pt_br: Pesquisar novamente
zh_hans: 重新搜索

# rerunSearchInAll.message
source: Search again in all files
de: Erneut in allen Dateien suchen
es: Buscar de nuevo en todos los archivos
fr: Rechercher à nouveau dans tous les fichiers
it: Cerca di nuovo in tutti i file
ja: すべてのファイルでもう一度検索してください
ko: 모든 파일에서 다시 검색
pt_br: Pesquisar novamente em todos os arquivos
zh_hans: 在所有文件中再次搜索

source: Search in progress... -
de: Suche wird durchgeführt... –
es: Búsqueda en curso...
fr: Recherche en cours... -
it: Ricerca in corso -
ja: 検索中です...
ko: 검색 진행 중... -
pt_br: Pesquisa em andamento... –
zh_hans: 正在搜索... -

# searchMaxResultsWarning
source: The result set only contains a subset of all matches. Please be more specific in your search to narrow down the results.
de: Das Resultset enthält nur eine Teilmenge aller Übereinstimmungen. Verfeinern Sie Ihre Suche, um die Ergebnisse einzugrenzen.
es: El conjunto de resultados solo contiene un subconjunto de todas las coincidencias. Sea más específico en la búsqueda para acotar los resultados.
fr: Le jeu de résultats contient uniquement un sous-ensemble de toutes les correspondances. Soyez plus précis dans votre recherche de façon à limiter les résultats retournés.
it: Il set di risultati contiene solo un subset di tutte le corrispondenze. Eseguire una ricerca più specifica per ridurre il numero di risultati.
ja: 結果セットにはすべての一致項目のサブセットのみが含まれています。より限定的な検索条件を入力して、検索結果を絞り込んでください。
ko: 결과 집합에는 모든 일치 항목의 하위 집합만 포함됩니다. 결과 범위를 좁히려면 검색을 더 세분화하세요.
pt_br: O conjunto de resultados contém apenas um subconjunto de todas as correspondências. Faça uma pesquisa mais específica para restringir os resultados.
zh_hans: 结果集仅包含所有匹配项的子集。请使你的搜索更加具体，减少结果。

# searchWithoutFolder
source: You have not opened any folder that contains notebooks/books.
de: Sie haben keinen Ordner geöffnet, der Notebooks/Bücher enthält.
es: No ha abierto ninguna carpeta que contenga cuadernos o libros.
fr: Vous n'avez ouvert aucun dossier contenant des notebooks/books.
it: Non è stata aperta alcuna cartella contenente notebook/libri.
ja: ノートブックまたはブックを格納するフォルダーを開いていません。
ko: Notebook/Book이 포함된 폴더를 열지 않았습니다.
pt_br: Você não abriu nenhuma pasta que contenha notebooks/livros.
zh_hans: 你尚未打开任何包含笔记本/工作簿的文件夹。

# label.Search
source: Search: Type Search Term and press Enter to search or Escape to cancel
de: Suche: Geben Sie den Suchbegriff ein, und drücken Sie die EINGABETASTE, um zu suchen, oder ESC, um den Vorgang abzubrechen.
es: Búsqueda: Escriba el término de búsqueda y presione Entrar para buscar o Esc para cancelar
fr: Rechercher : tapez le terme de recherche, puis appuyez sur Entrée pour lancer la recherche, ou sur Échap pour l'annuler
it: Cerca: digitare il termine di ricerca e premere INVIO per cercare oppure ESC per annullare
ja: 検索: 検索語句を入力し Enter を押して検索するか、Esc を押して取り消します
ko: 검색: 검색어를 입력하고 Enter 키를 눌러서 검색하세요. 취소하려면 Esc 키를 누르세요.
pt_br: Pesquisar: digite o termo de pesquisa e pressione Enter para pesquisar ou Escape para cancelar
zh_hans: 搜索: 键入搜索词，然后按 Enter 键搜索或按 Esc 键取消

# search.placeHolder
source: Search
de: Suchen
es: Buscar
fr: Recherche
it: Cerca
ja: 検索
ko: 검색
pt_br: Pesquisar
zh_hans: 搜索

# insertCellsModal.Cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

# insertCellsModal.Insert
source: Insert
de: Einfügen
es: Insertar
fr: Insérer
it: Inserisci
ja: 挿入
ko: 삽입
pt_br: Inserir
zh_hans: 插入

# insertCellsModal.cellTitle
source: Cell {0}
de: Zelle {0}
es: Celda {0}
fr: Cellule {0}
it: Cella {0}
ja: セル {0}
ko: 셀 {0}
pt_br: Célula: {0}
zh_hans: 单元格 {0}

# insertCellsModal.thumbnailError
source: Error: Unable to generate thumbnails.
de: Fehler: Miniaturansichten können nicht generiert werden.
es: Error: no se pueden generar miniaturas.
fr: Erreur : impossible de générer des miniatures.
it: Errore: non è possibile generare le anteprime.
ja: エラー: サムネイルを生成できません。
ko: 오류: 미리 보기를 생성할 수 없습니다.
pt_br: Erro: não é possível gerar miniaturas.
zh_hans: 错误: 无法生成缩略图。

# insertCellsModal.title
source: Insert cells
de: Zellen einfügen
es: Insertar celdas
fr: Insérer des cellules
it: Inserisci celle
ja: セルの挿入
ko: 셀 삽입
pt_br: Inserir células
zh_hans: 插入单元格

# insertCellsModal.untitled
source: Untitled Cell : {0}
de: Zelle ohne Titel: {0}
es: Celda sin título: {0}
fr: Cellule sans titre : {0}
it: Cella senza nome: {0}
ja: 無題のセル: {0}
ko: 제목 없는 셀: {0}
pt_br: Célula Sem Título: {0}
zh_hans: 无标题单元格: {0}

# cellAwaitingInputTitle
source: Cell Awaiting Input
de: Zelle wartet auf Eingabe
es: Celda en espera de entrada
fr: Cellule en attente d’entrée
it: Cella in attesa di input
ja: 入力を待機しているセル
ko: 입력 대기 중인 셀
pt_br: Célula Aguardando Entrada
zh_hans: 等待输入的单元格

source: Loading
de: Wird geladen
es: Cargando
fr: Chargement
it: Caricamento
ja: 読み込み中
ko: 로드 중
pt_br: Carregando
zh_hans: 正在加载

# runningCell
source: Running cell {0} of {1}
de: Die Zelle {0} von {1} wird ausgeführt
es: Ejecutando celda {0} de {1}
fr: Exécution de la cellule {0}de {1}
it: Esecuzione della cella {0} di {1}
ja: {0}/{1} セルを実行中
ko: {1}의 {0} 셀 실행 중
pt_br: Executando célula {0} de {1}
zh_hans: 正在运行单元格 {0} (共 {1} 个)

source: Starting execution
de: Ausführung wird gestartet
es: Iniciando ejecución
fr: Démarrage de l’exécution
it: Avvio dell'esecuzione
ja: 実行を開始しています
ko: 실행을 시작하는 중
pt_br: iniciando execução
zh_hans: 正在开始执行

# confirmDelete
source: Are you sure you want to delete view "{0}"?
de: Möchten Sie die Ansicht "{0}" löschen?
es: ¿Está seguro de que desea eliminar la vista "{0}"?
fr: Voulez-vous vraiment supprimer la vue « {0} »0?
it: Eliminare la visualizzazione "{0}"?
ja: ビュー "{0}" を削除しますか?
ko: '{0}' 보기를 삭제할까요?
pt_br: Tem certeza de que deseja excluir a exibição "{0}"
zh_hans: 确定要删除视图“{0}”?

source: &&Delete
de: &&Löschen
es: &&Eliminar
fr: &&Supprimer
it: &&Elimina
ja: 削除(&D)
ko: 삭제(&&D)
pt_br: &&Excluir
zh_hans: 删除(&&D)

source: Insert Cells
de: Zellen einfügen
es: Insertar celdas
fr: Insérer des cellules
it: Inserisci celle
ja: セルの挿入
ko: 셀 삽입
pt_br: Inserir Células
zh_hans: 插入单元格

# unableToNavigateToCell
source: Unable to navigate to notebook cell.
de: Die Navigation zur Notebook-Zelle ist nicht möglich.
es: No se puede navegar a la celda del Bloc de notas.
fr: Impossible d’accéder à la cellule du bloc-notes.
it: Non è possibile passare alla cella del notebook.
ja: ノートブックのセルに移動できません。
ko: 전자 필기장 셀로 이동할 수 없습니다.
pt_br: Não é possível navegar até a célula do bloco de anotações.
zh_hans: 无法导航到笔记本单元格。

source: View Cell In Notebook
de: Zelle in Notebook anzeigen
es: Ver celda en Bloc de notas
fr: Afficher la cellule dans le bloc-notes
it: Visualizza cella nel notebook
ja: ノートブックのセルの表示
ko: 전자 필기장의 셀 보기
pt_br: Exibir Célula no Bloco de Anotações
zh_hans: 在笔记本中查看单元格

# viewsUnableToRemove
source: Unable to remove view
de: Die Ansicht kann nicht entfernt werden.
es: No se puede quitar la vista
fr: Impossible de supprimer la vue
it: Non è possibile rimuovere la visualizzazione
ja: ビューを削除できません
ko: 뷰를 제거할 수 없음
pt_br: Não foi possível remover o modo de exibição
zh_hans: 无法删除视图

# viewsCodeCell.emptyCellText
source: Please run this cell to view outputs.
de: Führen Sie diese Zelle aus, um Ausgaben anzuzeigen.
es: Ejecute esta celda para ver las salidas.
fr: Exécutez cette cellule pour afficher les sorties.
it: Eseguire questa cella per visualizzare gli output.
ja: 出力を表示するには、このセルを実行してください。
ko: 출력을 보려면 이 셀을 실행하세요.
pt_br: Execute essa célula para exibir as saídas.
zh_hans: 请运行此单元格以查看输出。

# emptyText
source: This view is empty. Add a cell to this view by clicking the Insert Cells button.
de: Diese Ansicht ist leer. Fügen Sie dieser Ansicht eine Zelle hinzu, indem Sie auf die Schaltfläche „Zellen einfügen“ klicken.
es: Esta vista está vacía. Agregue una celda a esta vista haciendo clic en el botón Insertar celdas.
fr: Cette vue est vide. Ajoutez une cellule à cette vue en cliquant sur le bouton Insérer des cellules.
it: Questa vista è vuota. Aggiungere una cella a questa vista facendo clic sul pulsante Inserisci celle.
ja: このビューは空です。[セルの挿入] ボタンをクリックして、このビューにセルを追加します。
ko: 이 보기는 비어 있습니다. 셀 삽입 단추를 클릭하여 이 보기에 셀을 추가합니다.
pt_br: Essa exibição está vazia. Adicione uma célula a essa exibição clicando no botão Inserir células.
zh_hans: 此视图为空。请单击“插入单元格”按钮，将单元格添加到此视图。

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
zh_hans: 取消

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ja: 保存
ko: 저장
pt_br: Salvar
zh_hans: 保存

# viewOptionsModal.missingRequireField
source: This field is required.
de: Dieses Feld ist ein Pflichtfeld.
es: Este campo es obligatorio.
fr: Ce champ est obligatoire.
it: Questo campo è obbligatorio.
ja: このフィールドは必須です。
ko: 이 필드는 필수입니다.
pt_br: Este campo é obrigatório.
zh_hans: 此字段是必需的。

# viewOptionsModal.name
source: View Name
de: Ansichtsname
es: Nombre de vista
fr: Nom de la vue
it: Nome visualizzazione
ja: ビュー名
ko: 뷰 이름
pt_br: Nome do Modo de Exibição
zh_hans: 视图名称

# viewOptionsModal.nameTaken
source: This view name has already been taken.
de: Dieser Ansichtsname wird bereits verwendet.
es: Este nombre de vista ya se está usando.
fr: Ce nom de vue a déjà été pris.
it: Questo nome della visualizzazione è già usato.
ja: このビュー名は既に取得されています。
ko: 이 보기 이름은 이미 사용되었습니다.
pt_br: Este nome de exibição já foi usado.
zh_hans: 此视图名称已被占用。

# viewOptionsModal.title
source: Configure View
de: Ansicht konfigurieren
es: Configurar vista
fr: Configurer la vue
it: Configura visualizzazione
ja: ビューの構成
ko: 보기 구성
pt_br: Configurar Modo de Exibição
zh_hans: 配置视图

# copyFailed
source: Copy failed with error {0}
de: Fehler beim Kopieren: {0}
es: Error de copia {0}
fr: La copie a échoué avec l'erreur {0}
it: La copia non è riuscita. Errore: {0}
ja: エラー {0} でコピーに失敗しました
ko: {0} 오류를 나타내며 복사 실패
pt_br: Falha na cópia com o erro {0}
zh_hans: 复制失败，出现错误 {0}

# notebook.showChart
source: Show chart
de: Diagramm anzeigen
es: Mostrar gráfico
fr: Afficher le graphique
it: Mostra grafico
ja: グラフの表示
ko: 차트 표시
pt_br: Mostrar gráfico
zh_hans: 显示图表

# notebook.showTable
source: Show table
de: Tabelle anzeigen
es: Mostrar tabla
fr: Afficher la table
it: Mostra tabella
ja: テーブルの表示
ko: 테이블 표시
pt_br: Mostrar tabela
zh_hans: 显示表

# noRendererFound
source: No {0} renderer could be found for output. It has the following MIME types: {1}
de: Für die Ausgabe wurde kein {0}-Renderer gefunden. Folgende MIME-Typen sind enthalten: {1}
es: No se ha encontrado ningún representador de {0} para la salida. Tiene los siguientes tipos MIME: {1}
fr: Aucun renderer {0} pour la sortie. Elle a les types MIME suivants : {1}
it: Non è stato possibile trovare alcun renderer {0} per l'output. Include i tipi MIME seguenti: {1}
ja: 出力用の {0} レンダラーが見つかりませんでした。次の MIME の種類があります: {1}。
ko: 출력의 {0} 렌더러를 찾을 수 없습니다. MIME 형식이 {1}입니다.
pt_br: Nenhum renderizador {0} foi encontrado para saída. Ele tem os seguintes tipos MIME: {1}
zh_hans: 未找到 {0} 呈现器用于输出。它具有以下 MIME 类型: {1}

source: (safe)
de: (sicher)
es: (seguro)
fr: (sécurisé)
it: (sicuro)
ja: (安全)
ko: (안전)
pt_br: (seguro)
zh_hans: (安全)

# plotlyError
source: Error displaying Plotly graph: {0}
de: Fehler beim Anzeigen des Plotly-Graphen: {0}
es: Error al mostrar el gráfico de Plotly: {0}
fr: Erreur d'affichage du graphe Plotly : {0}
it: Si è verificato un errore durante la visualizzazione del grafo Plotly: {0}
ja: Plotly グラフの表示エラー: {0}
ko: 플롯 그래프 {0}을(를) 표시하는 동안 오류가 발생했습니다.
pt_br: Erro ao exibir o gráfico Plotly: {0}
zh_hans: 显示 Plotly 图形时出错: {0}

# serverTree.addConnection
source: Add Connection
de: Verbindung hinzufügen
es: Agregar conexión
fr: Ajouter une connexion
it: Aggiungi connessione
ja: 接続の追加
ko: 연결 추가
pt_br: Adicionar Conexão
zh_hans: 添加连接

# servers.noConnections
source: No connections found.
de: Keine Verbindungen gefunden.
es: No se ha encontrado una conexión.
fr: Aucune connexion.
it: Non sono state trovate connessioni.
ja: 接続が見つかりません。
ko: 연결이 없습니다.
pt_br: Nenhuma conexão encontrada.
zh_hans: 未找到连接。

# serverGroup.autoExpand
source: Auto-expand Server Groups in the Object Explorer viewlet.
de: Servergruppen im Objekt-Explorer-Viewlet automatisch erweitern
es: Expanda automáticamente los grupos de servidores en el viewlet del Explorador de Objetos.
fr: Développez automatiquement les groupes de serveurs dans la viewlet Explorateur d'objets.
it: Espande automaticamente i gruppi di server nel viewlet di Esplora oggetti.
ja: オブジェクト エクスプローラー ビューレットの自動展開サーバー グループ。
ko: 개체 탐색기 뷰렛에서 서버 그룹을 자동으로 확장합니다.
pt_br: Expanda automaticamente grupos de servidores no viewlet do Pesquisador de Objetos.
zh_hans: 在对象资源管理器 viewlet 中自动展开服务器组。

# serverGroup.colors
source: Server Group color palette used in the Object Explorer viewlet.
de: Farbpalette für die Servergruppe, die im Objekt-Explorer-Viewlet verwendet wird.
es: Paleta de colores del grupo de servidores utilizada en el viewlet del Explorador de objetos.
fr: Palette de couleurs du groupe de serveurs utilisée dans la viewlet Explorateur d'objets.
it: Tavolozza dei colori del gruppo di server usata nel viewlet Esplora oggetti.
ja: オブジェクト エクスプローラー ビューレットで使用するサーバー グループ カラー パレット。
ko: 개체 탐색기 뷰렛에서 사용되는 서버 그룹 색상표입니다.
pt_br: Paleta de cores do grupo de servidores usada no viewlet do Pesquisador de Objetos.
zh_hans: 在对象资源管理器 viewlet 中使用的服务器组面板。

# serverTree.useAsyncServerTree
source: (Preview) Use the new async server tree for the Servers view and Connection Dialog with support for new features such as dynamic node filtering.
de: (Vorschau) Verwenden Sie die neue asynchrone Serverstruktur für die Serveransicht und das Verbindungsdialogfeld. Sie bietet Unterstützung für neue Features wie die dynamische Knotenfilterung.
es: (Versión preliminar) Use el nuevo árbol de servidores asincrónicos para la vista Servidores y el cuadro de diálogo Conexión, con compatibilidad con nuevas características como el filtrado de nodos dinámicos.
fr: (Préversion) Utilisez la nouvelle arborescence de serveur asynchrone pour la vue des serveurs et la boîte de dialogue de connexion avec prise en charge des nouvelles fonctionnalités, comme le filtrage dynamique de nœuds.
it: (Anteprima) Usare il nuovo albero del server asincrono per la visualizzazione Server e la finestra di dialogo di connessione con il supporto di nuove funzionalità come i filtri dinamici dei nodi.
ja: (プレビュー) 動的ノード フィルターなどの新機能をサポートする、新しい非同期サーバー ツリーをサーバー ビューおよび接続ダイアログに使用します。
ko: (미리 보기) 동적 노드 필터링과 같은 새로운 기능 지원을 사용하여 서버 보기 및 연결 대화 상자에 새 비동기 서버 트리를 사용합니다.
pt_br: (Versão Prévia) Use a nova árvore de servidor assíncrono para o modo de exibição Servidores e a caixa de diálogo Conexão com suporte para novos recursos, como filtragem dinâmica de nós.
zh_hans: (预览)使用“服务器”视图和“连接”对话框的新异步服务器树，支持动态节点筛选等新功能。

source: Built-in Charts
de: Integrierte Diagramme
es: Gráficos integrados
fr: Graphiques intégrés
it: Grafici predefiniti
ja: 組み込みグラフ
ko: 기본 제공 차트
pt_br: Gráficos Integrados
zh_hans: 内置图表

source: Connection
de: Verbindung
es: Conexión
fr: Connexion
it: Connessione
ja: 接続
ko: 연결
pt_br: Conexão
zh_hans: 连接

source: Dashboard
es: Panel
fr: Tableau de bord
ja: ダッシュボード
ko: 대시보드
pt_br: Painel
zh_hans: 仪表板

source: Data
de: Daten
es: Datos
fr: Données
it: Dati
ja: データ
ko: 데이터
pt_br: Dados
zh_hans: 数据

source: Query Editor
de: Abfrage-Editor
es: Editor de Power Query
fr: Éditeur de requêtes
it: Editor di query
ja: クエリ エディター
ko: 쿼리 편집기
pt_br: Editor de Consultas
zh_hans: 查询编辑器

source: Table Designer
de: Tabellen-Designer
it: Progettazione tabelle
ja: テーブル デザイナー
ko: 테이블 디자이너

# profiler.settings.Filters
source: Profiler Filters
de: Profilerfilter
es: Filtros de Profiler
fr: Filtres Profiler
it: Filtri profiler
ja: Profiler フィルター
ko: Profiler 필터
pt_br: Filtros do Profiler
zh_hans: 探查器筛选器

# profiler.settings.sessionTemplates
source: Specifies session templates
de: Gibt Sitzungsvorlagen an.
es: Especifica plantillas de sesión
fr: Spécifie les modèles de session
it: Specifica i modelli di sessione
ja: セッション テンプレートを指定する
ko: 세션 템플릿 지정
pt_br: Especifica os modelos de sessão
zh_hans: 指定会话模板

# profiler.settings.viewTemplates
source: Specifies view templates
de: Gibt Ansichtsvorlagen an.
es: Especifica plantillas de vista
fr: Spécifie des modèles de vue
it: Specifica i modelli di visualizzazione
ja: ビュー テンプレートを指定する
ko: 뷰 템플릿 지정
pt_br: Especifica os modelos de exibição
zh_hans: 指定视图模板

# create
source: New Session
de: Neue Sitzung
es: Nueva sesión
fr: Nouvelle session
it: Nuova sessione
ja: 新しいセッション
ko: 새 세션
pt_br: Nova Sessão
zh_hans: 新建会话

# profiler.clear
source: Clear Data
de: Daten löschen
es: Borrar los datos
fr: Effacer les données
it: Cancella dati
ja: データのクリア
ko: 데이터 지우기
pt_br: Limpar Dados
zh_hans: 清除数据

# profiler.clearDataPrompt
source: Are you sure you want to clear the data?
de: Möchten Sie die Daten löschen?
es: ¿Está seguro de que quiere borrar los datos?
fr: Voulez-vous vraiment effacer les données ?
it: Cancellare i dati?
ja: データをクリアしますか?
ko: 데이터를 지우시겠습니까?
pt_br: Tem certeza de que deseja limpar os dados?
zh_hans: 是否确实要清除数据?

# profiler.clearFilter
source: Clear Filter
de: Filter löschen
es: Borrar filtro
fr: Effacer le filtre
it: Cancella filtro
ja: フィルターのクリア
ko: 필터 지우기
pt_br: Limpar Filtro
zh_hans: 清除筛选器

# profiler.clearFilterPrompt
source: Are you sure you want to clear the filters?
de: Möchten Sie die Filter löschen?
es: ¿Está seguro de que quiere borrar los filtros?
fr: Voulez-vous vraiment effacer les filtres ?
it: Cancellare i filtri?
ja: フィルターをクリアしますか?
ko: 필터를 지우시겠습니까?
pt_br: Tem certeza de que deseja limpar os filtros?
zh_hans: 是否确实要清除筛选器?

# profiler.editColumns
source: Edit Columns
de: Spalten bearbeiten
es: Editar columnas
fr: Modifier les colonnes
it: Modifica colonne
ja: 列の編集
ko: 열 편집
pt_br: Editar Colunas
zh_hans: 编辑列

# profiler.filter
source: Filter…
de: Filtern...
es: Filtrar...
fr: Filtrer...
it: Filtro…
ja: フィルター...
ko: 필터...
pt_br: Filtro...
zh_hans: 筛选器…

# profiler.findNext
source: Find Next String
de: Nächste Zeichenfolge suchen
es: Buscar la cadena siguiente
fr: Rechercher la chaîne suivante
it: Trova la stringa successiva
ja: 次の文字列を検索
ko: 다음 문자열 찾기
pt_br: Encontrar Próxima Cadeia de Caracteres
zh_hans: 查找下一个字符串
