Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/sql.*.xlf
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans

source: Collapse Widget
de: Widget reduzieren
es: Contraer widget
fr: Réduire le widget
it: Comprimi widget
ja: ウィジェットの折りたたみ
ko: 위젯 축소
pt_br: Recolher Widget
zh_hans: 折叠小组件

source: Delete Widget
de: Widget löschen
es: Eliminar widget
fr: Supprimer le widget
it: Elimina widget
ja: ウィジェットの削除
ko: 위젯 삭제
pt_br: Excluir Widget
zh_hans: 删除小组件

# editDashboard
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
pt_br: Editar
zh_hans: 编辑

# editDashboardExit
source: Exit
de: Beenden
es: Salir
fr: Quitter
it: Esci
ja: 終了
ko: 끝내기
pt_br: Sair
zh_hans: 退出

source: Expand Widget
de: Widget erweitern
es: Expandir widget
fr: Développer le widget
it: Espandi widget
ja: ウィジェットの展開
ko: 위젯 확장
pt_br: Expandir Widget
zh_hans: 展开小组件

# refreshWidget
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
ko: 새로 고침
pt_br: Atualizar
zh_hans: 刷新

# toggleMore
source: Show Actions
de: Aktionen anzeigen
es: Mostrar acciones
fr: Afficher les actions
it: Mostra azioni
ja: アクションの表示
ko: 작업 표시
pt_br: Mostrar Ações
zh_hans: 显示操作

# unknownDashboardContainerError
source: {0} is an unknown container.
de: "{0}" ist ein unbekannter Container.
es: {0} es un contenedor desconocido.
fr: {0} est un conteneur inconnu.
it: {0} è un contenitore sconosciuto.
ja: {0} は不明なコンテナーです。
ko: {0}은(는) 알 수 없는 컨테이너입니다.
pt_br: {0} é um contêiner desconhecido.
zh_hans: {0} 是未知容器。

# dashboard.generalTabGroupHeader
source: General
de: Allgemein
fr: Général
it: Generale
ja: 全般
ko: 일반
pt_br: Geral
zh_hans: 常规

source: Home
de: Start
es: Inicio
fr: Accueil
it: Home page
ja: ホーム
ko: 홈
pt_br: Página Inicial
zh_hans: 主页

# missingConnectionInfo
source: No connection information could be found for this dashboard
de: Für dieses Dashboard wurden keine Verbindungsinformationen gefunden.
es: No se encontró información de conexión para este panel
fr: Aucune information de connexion pour ce tableau de bord
it: Non è stato possibile trovare le informazioni di connessione per questo dashboard
ja: このダッシュ ボードには接続情報が見つかりませんでした
ko: 이 대시보드의 연결 정보를 찾을 수 없습니다.
pt_br: Nenhuma informação de conexão foi encontrada para este painel
zh_hans: 未找到此仪表板的连接信息

# administrationTabGroup
source: Administration
de: Verwaltung
es: Administración
it: Amministrazione
ja: 管理
ko: 관리
pt_br: Administração
zh_hans: 管理

# azdata.extension.contributes.dashboard.tab.alwaysShow
source: Whether or not this tab should always be shown or only when the user adds it.
de: Legt fest, ob diese Registerkarte immer angezeigt werden soll oder nur dann, wenn der Benutzer sie hinzufügt.
es: Si esta pestaña se debe mostrar siempre, o sólo cuando el usuario la agrega.
fr: Indique si cet onglet doit toujours apparaître ou uniquement quand l'utilisateur l'ajoute.
it: Indica se questa scheda deve essere sempre visualizzata oppure solo quando viene aggiunta dall'utente.
ja: このタブを常に表示するか、またはユーザーが追加したときにのみ表示するかどうか。
ko: 이 탭을 항상 표시할지 또는 사용자가 추가할 때만 표시할지입니다.
pt_br: Se esta guia deve ou não ser sempre exibida ou apenas quando o usuário a adiciona.
zh_hans: 是始终显示此选项卡还是仅当用户添加时显示。

# azdata.extension.contributes.dashboard.tab.container
source: The container that will be displayed in this tab.
de: Der Container, der auf dieser Registerkarte angezeigt wird.
es: El contenedor que se mostrará en esta pestaña.
fr: Conteneur à afficher sous cet onglet.
it: Contenitore che verrà visualizzato in questa scheda.
ja: このタブに表示されるコンテナー。
ko: 이 탭에 표시할 컨테이너입니다.
pt_br: O contêiner que será exibido nesta guia.
zh_hans: 将在此选项卡中显示的容器。

# azdata.extension.contributes.dashboard.tab.description
source: Description of this tab that will be shown to the user.
de: Beschreibung dieser Registerkarte, die dem Benutzer angezeigt werden.
es: Descripción de esta pestaña que se mostrará al usuario.
fr: Description de cet onglet à montrer à l'utilisateur.
it: Descrizione di questa scheda che verrà mostrata all'utente.
ja: ユーザーに表示されるこのタブの説明。
ko: 사용자에게 표시할 이 탭에 대한 설명입니다.
pt_br: Descrição desta guia que será mostrada ao usuário.
zh_hans: 将向用户显示的此选项卡的说明。

# azdata.extension.contributes.dashboard.tab.group
source: The unique identifier of the group this tab belongs to, value for home group: home.
de: Der eindeutige Bezeichner der Gruppe, zu der diese Registerkarte gehört. Wert für Startgruppe: Start.
es: Id. único del grupo al que pertenece esta pestaña; valor para el grupo de inicio: Inicio.
fr: Identificateur unique du groupe auquel appartient cet onglet, valeur du groupe d'accueil : accueil.
it: Identificatore univoco del gruppo a cui appartiene questa scheda, valore per il gruppo home: home.
ja: このタブが属しているグループの一意識別子。ホーム グループの値: home。
ko: 이 탭이 속한 그룹의 고유 식별자이며 홈 그룹의 값은 home입니다.
pt_br: O identificador exclusivo do grupo ao qual esta guia pertence. Valor do grupo doméstico: página inicial.
zh_hans: 此选项卡所属组的唯一标识符，主页组的值: 主页。

# azdata.extension.contributes.dashboard.tab.icon.dark
source: Icon path when a dark theme is used
de: Symbolpfad, wenn ein dunkles Design verwendet wird
es: Ruta de icono cuando se usa un tema oscuro
fr: Chemin de l'icône quand un thème foncé est utilisé
it: Percorso dell'icona quando viene usato un tema scuro
ja: 暗いテーマを使用した場合のアイコンのパス
ko: 어두운 테마를 사용하는 경우의 아이콘 경로
pt_br: Caminho de ícone quando um tema escuro é usado
zh_hans: 使用深色主题时的图标路径

# azdata.extension.contributes.dashboard.tab.icon.light
source: Icon path when a light theme is used
de: Symbolpfad, wenn ein helles Design verwendet wird
es: Ruta del icono cuando se usa un tema ligero
fr: Chemin de l'icône quand un thème clair est utilisé
it: Percorso dell'icona quando viene usato un tema chiaro
ja: 明るいテーマを使用した場合のアイコンのパス
ko: 밝은 테마를 사용하는 경우의 아이콘 경로
pt_br: Caminho do ícone quando um tema leve é usado
zh_hans: 使用浅色主题时的图标路径

# azdata.extension.contributes.dashboard.tab.id
source: Unique identifier for this tab. Will be passed to the extension for any requests.
de: Eindeutiger Bezeichner für diese Registerkarte. Wird bei allen Anforderungen an die Erweiterung übergeben.
es: Identificador único para esta pestaña. Se pasará a la extensión para cualquier solicitud.
fr: Identificateur unique pour cet onglet. Est transmis à l'extension pour toutes les demandes.
it: Identificatore univoco per questa scheda. Verrà passato all'estensione per eventuali richieste.
ja: このタブの一意の識別子。すべての要求で拡張機能に渡されます。
ko: 이 탭의 고유 식별자입니다. 모든 요청에서 확장으로 전달됩니다.
pt_br: Identificador exclusivo para esta guia. Será passado para a extensão para quaisquer solicitações.
zh_hans: 此选项卡的唯一标识符。将传递到任何请求的扩展。

# azdata.extension.contributes.dashboard.tab.isHomeTab
source: Whether or not this tab should be used as the Home tab for a connection type.
de: Legt fest, ob diese Registerkarte als Startseite für einen Verbindungstyp verwendet werden soll.
es: Si esta pestaña se debe usar o no como la pestaña Inicio para un tipo de conexión.
fr: Indique si cet onglet doit être utilisé comme onglet d'accueil pour un type de connexion.
it: Indica se questa scheda deve essere usata come scheda iniziale per un tipo di connessione.
ja: このタブを接続の種類の [ホーム] タブとして使用するかどうか。
ko: 이 탭을 연결 형식의 홈 탭으로 사용할지 여부입니다.
pt_br: Se esta guia deve ou não ser usada como guia da Página Inicial para um tipo de conexão.
zh_hans: 此选项卡是否应用作连接类型的“开始”选项卡。

# azdata.extension.contributes.dashboard.tab.title
source: Title of the tab to show the user.
de: Titel der Registerkarte, die dem Benutzer angezeigt wird.
es: Título de la pestaña para mostrar al usuario.
fr: Titre de l'onglet à montrer à l'utilisateur.
it: Titolo della scheda da mostrare all'utente.
ja: ユーザーを表示するタブのタイトル。
ko: 사용자에게 표시할 탭의 제목입니다.
pt_br: Título da guia para mostrar ao usuário.
zh_hans: 将向用户显示的选项卡标题。

# azdata.extension.contributes.dashboard.tabGroup.id
source: Unique identifier for this tab group.
de: Eindeutiger Bezeichner für diese Registerkartengruppe.
es: Identificador único para este grupo de pestañas.
fr: Identificateur unique de ce groupe d'onglets.
it: Identificatore univoco per questo gruppo di schede.
ja: このタブ グループの一意識別子。
ko: 이 탭 그룹의 고유 식별자입니다.
pt_br: Identificador exclusivo deste grupo de guias.
zh_hans: 此选项卡组的唯一标识符。

# azdata.extension.contributes.dashboard.tabGroup.title
source: Title of the tab group.
de: Titel der Registerkartengruppe.
es: Título del grupo de pestañas.
fr: Titre du groupe d'onglets.
it: Titolo del gruppo di schede.
ja: タブ グループのタイトル。
ko: 탭 그룹의 제목입니다.
pt_br: Título do grupo de guias.
zh_hans: 选项卡组的标题。

# azdata.extension.contributes.tab.provider
source: Defines the connection types this tab is compatible with. Defaults to 'MSSQL' if not set
de: Definiert die Verbindungstypen, mit denen diese Registerkarte kompatibel ist. Der Standardwert lautet "MSSQL", wenn kein anderer Wert festgelegt wird.
es: Define los tipos de conexión con los que esta pestaña es compatible. El valor predeterminado es "MSSQL" si no se establece
fr: Définit les types de connexion avec lesquels cet onglet est compatible. La valeur par défaut est 'MSSQL' si aucune valeur n'est définie
it: Definisce i tipi di connessione con cui è compatibile questa scheda. Se non viene impostato, il valore predefinito è 'MSSQL'
ja: このタブと互換性のある接続の種類を定義します。設定されていない場合、既定値は 'MSSQL' に設定されます
ko: 이 탭과 호환되는 연결 형식을 정의합니다. 설정하지 않으면 기본 연결 형식은 'MSSQL'입니다.
pt_br: Define os tipos de conexão com os quais essa guia é compatível. O padrão será 'MSSQL' se essa opção não for definida
zh_hans: 定义此选项卡兼容的连接类型。如果未设置，则默认为 "MSSQL"

# azdata.extension.contributes.tab.when
source: Condition which must be true to show this item
de: Eine Bedingung, die TRUE lauten muss, damit dieses Element angezeigt wird.
es: Condición que se debe cumplir para mostrar este elemento
fr: Condition qui doit être true pour afficher cet élément
it: Condizione che deve essere vera per mostrare questo elemento
ja: この項目を表示するために true にする必要がある条件
ko: 이 항목을 표시하기 위해 true여야 하는 조건
pt_br: A condição deve ser true para mostrar este item
zh_hans: 此条件必须为 true 才能显示此项

# azdata.extension.contributes.tabGroups
source: Contributes a single or multiple tab groups for users to add to their dashboard.
de: Stellt eine einzelne oder mehrere Registerkartengruppen zur Verfügung, die Benutzer ihrem Dashboard hinzufügen können.
es: Aporta uno o varios grupos de pestañas que los usuarios pueden agregar a su panel.
fr: Fournit un ou plusieurs groupes d'onglets que les utilisateurs peuvent ajouter à leur tableau de bord.
it: Fornisce uno o più gruppi di schede che gli utenti possono aggiungere al proprio dashboard.
ja: ユーザーがダッシュボードに追加するための 1 つまたは複数のタブ グループを提供します。
ko: 사용자가 대시보드에 추가할 하나 이상의 탭 그룹을 제공합니다.
pt_br: Contribui com um ou vários grupos de guias para os usuários adicionarem ao painel.
zh_hans: 为用户提供一个或多个选项卡组以添加到他们的仪表板。

# azdata.extension.contributes.tabs
source: Contributes a single or multiple tabs for users to add to their dashboard.
de: Stellt eine einzelne oder mehrere Registerkarten zur Verfügung, die Benutzer zu ihrem Dashboard hinzufügen können.
es: Aporta una o varias pestañas que los usuarios pueden agregar a su panel.
fr: Fournit un ou plusieurs onglets que les utilisateurs peuvent ajouter à leur tableau de bord.
it: Aggiunge come contributo una o più schede che gli utenti possono aggiungere al proprio dashboard.
ja: ユーザーがダッシュボードに追加する 1 つまたは、複数のタブを提供します。
ko: 사용자가 대시보드 추가할 단일 또는 다중 탭을 적용합니다.
pt_br: Contribui com uma única ou várias guias para que os usuários adicionem ao painel.
zh_hans: 提供一个或多个选项卡，让用户添加到其仪表板。

# dashboardTab.contribution.moreThanOneDashboardContainersError
source: Exactly 1 dashboard container must be defined per space
de: Pro Bereich muss genau 1 Dashboardcontainer definiert werden.
es: Debe definirse exactamente 1 contenedor de paneles por espacio
fr: 1 seul conteneur de tableau de bord doit être défini par espace
it: Per ogni spazio è necessario definire un solo container di dashboard
ja: 空間ごとにダッシュボード コンテナーを 1 つだけ定義する必要があります
ko: 공란 1개에 정확히 1개의 대시보드 컨테이너를 정의해야 합니다.
pt_br: Exatamente 1 contêiner de painéis deve ser definido por espaço
zh_hans: 必须在每个空间定义恰好 1 个仪表板容器

# dashboardTab.contribution.noContainerError
source: No container specified for extension.
de: Für die Erweiterung wurde kein Container angegeben.
es: No se ha especificado ningún contenedor para la extensión.
fr: Aucun conteneur spécifié pour l'extension.
it: Non è stato specificato alcun contenitore per l'estensione.
ja: 拡張機能にコンテナーが指定されていません。
ko: 확장용으로 지정한 컨테이너가 없습니다.
pt_br: Nenhum contêiner especificado para a extensão.
zh_hans: 没有为扩展指定容器。

# dashboardTab.contribution.noDescriptionWarning
source: No description specified to show.
de: Es wurde keine Beschreibung zur Anzeige angegeben.
es: No se ha especificado ninguna descripción para mostrar.
fr: Aucune description spécifiée à afficher.
it: Non è stata specificata alcuna descrizione da mostrare.
ja: 表示するよう指定された説明はありません。
ko: 표시하도록 지정한 설명이 없습니다.
pt_br: Nenhuma descrição especificada para mostrar.
zh_hans: 没有可显示的已指定说明。

# dashboardTab.contribution.noTitleError
source: No title specified for extension.
de: Für die Erweiterung wurde kein Titel angegeben.
es: No se ha especificado ningún título para la extensión.
fr: Aucun titre spécifié pour l'extension.
it: Non è stato specificato alcun titolo per l'estensione.
ja: 拡張機能にタイトルが指定されていません。
ko: 확장용으로 지정한 제목이 없습니다.
pt_br: Nenhum título especificado para a extensão.
zh_hans: 没有为扩展指定标题。

# dashboardTabGroup.contribution.noIdError
source: No id specified for tab group.
de: Für die Registerkartengruppe wurde keine ID angegeben.
es: No se ha especificado ningún id. para el grupo de pestañas.
fr: Aucun ID spécifié pour le groupe d'onglets.
it: Nessun ID specificato per il gruppo di schede.
ja: タブ グループの ID が指定されていません。
ko: 탭 그룹에 ID가 지정되지 않았습니다.
pt_br: Nenhuma ID foi especificada para o grupo de guias.
zh_hans: 没有为选项卡组指定 ID。

# dashboardTabGroup.contribution.noTitleError
source: No title specified for tab group.
de: Für die Registerkartengruppe wurde kein Titel angegeben.
es: No se ha especificado ningún título para el grupo de pestañas.
fr: Aucun titre spécifié pour le groupe d'onglets.
it: Nessun titolo specificato per il gruppo di schede.
ja: タブ グループのタイトルが指定されていません。
ko: 탭 그룹에 제목을 지정하지 않았습니다.
pt_br: Nenhum título foi especificado para o grupo de guias.
zh_hans: 没有为选项卡组指定标题。

# databasesTabDescription
source: databases tab
de: Registerkarte "Datenbanken"
es: pestaña de bases de datos
fr: onglet de bases de données
it: scheda database
ja: データベース タブ
ko: 데이터베이스 탭
pt_br: guia de bancos de dados
zh_hans: 数据库选项卡

# databasesTabTitle
source: Databases
de: Datenbanken
es: Bases de datos
fr: Bases de données
it: Database
ja: データベース
ko: 데이터베이스
pt_br: Bancos de Dados
zh_hans: 数据库

# dazdata.extension.contributes.dashboard.tab.icon
source: (Optional) Icon which is used to represent this tab in the UI. Either a file path or a themeable configuration
de: (Optional) Symbol zur Darstellung dieser Registerkarte in der Benutzeroberfläche. Erfordert einen Dateipfad oder eine Konfiguration, der ein Design zugeordnet werden kann.
es: (Opcional) Icono que se utiliza para representar esta pestaña en la interfaz de usuario; puede ser una ruta de acceso al archivo o una configuración con temas.
fr: (Facultatif) Icône utilisée pour représenter cet onglet dans l'interface utilisateur (chemin de fichier ou configuration à thèmes)
it: (Facoltativo) Icona usata per rappresentare questa scheda nell'interfaccia utente. Percorso di file o configurazione che supporta i temi
ja: (省略可能) UI でこのタブを表すために使用されるアイコン。ファイル パスまたはテーマを設定可能な構成のいずれかです
ko: (선택 사항) UI에서 이 탭을 나타내는 데 사용되는 아이콘입니다. 파일 경로 또는 테마 지정 가능 구성입니다.
pt_br: (Opcional) Ícone usado para representar esta guia na interface do usuário. Um caminho de arquivo ou uma configuração com tema
zh_hans: (可选) UI 中用于表示此选项卡的图标。可以是文件路径或可设置主题的配置

# monitoringTabGroup
source: Monitoring
de: Überwachung
es: Supervisión
fr: Supervision
it: Monitoraggio
ja: 監視中
ko: 모니터링
pt_br: Monitoramento
zh_hans: 监视

# performanceTabGroup
source: Performance
de: Leistung
es: Rendimiento
fr: Performances
it: Prestazioni
ja: パフォーマンス
ko: 성능
pt_br: Desempenho
zh_hans: 性能

# securityTabGroup
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
it: Sicurezza
ja: セキュリティ
ko: 보안
pt_br: Segurança
zh_hans: 安全性

# settingsTabGroup
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
ko: 설정
pt_br: Configurações
zh_hans: 设置

# troubleshootingTabGroup
source: Troubleshooting
de: Problembehandlung
es: Solución de problemas
fr: Résolution des problèmes
it: Risoluzione dei problemi
ja: トラブルシューティング
ko: 문제 해결
pt_br: Solução de Problemas
zh_hans: 疑难解答

# dashboard.editor.label
source: Dashboard
es: Panel
fr: Tableau de bord
ja: ダッシュボード
ko: 대시보드
pt_br: Painel
zh_hans: 仪表板

# ManageAction
source: Manage
de: Verwalten
es: Administrar
fr: Gérer
it: Gestisci
ja: 管理
ko: 관리
pt_br: Gerenciar
zh_hans: 管理

# opticon
source: property `icon` can be omitted or must be either a string or a literal like `{dark, light}`
de: Die Eigenschaft "icon" kann ausgelassen werden oder muss eine Zeichenfolge oder ein Literal wie "{dark, light}" sein.
es: la propiedad "icon" puede omitirse o debe ser una cadena o un literal como "{dark, light}"
fr: la propriété 'icon' peut être omise, ou doit être une chaîne ou un littéral de type '{dark, light}'
it: la proprietà `icon` può essere omessa o deve essere una stringa o un valore letterale come `{dark, light}`
ja: プロパティ `icon` は省略するか、文字列または `{dark, light}` などのリテラルにする必要があります
ko: 'icon' 속성은 생략하거나, '{dark, light}' 같은 문자열 또는 리터럴이어야 합니다.
pt_br: propriedade `ícone` pode ser omitida ou deve ser uma cadeia de caracteres ou um literal como `{escuro, claro}`
zh_hans: 可以省略属性 "icon"，若不省略则必须是字符串或文字，例如 "{dark, light}"

# carbon.extension.dashboard
source: Defines that this provider supports the dashboard
de: Hiermit wird definiert, dass dieser Anbieter das Dashboard unterstützt.
es: Define que este proveedor admite el panel de información
fr: Définit que ce fournisseur prend en charge le tableau de bord
it: Definisce se questo provider supporta il dashboard
ja: このプロバイダーがダッシュボードをサポートすることを定義します
ko: 이 공급자가 대시보드를 지원함을 정의합니다.
pt_br: Define que este provedor oferece suporte para o painel
zh_hans: 定义此提供程序支持仪表板

# dashboard.id
source: Provider id (ex. MSSQL)
de: Anbieter-ID (z. B. MSSQL)
es: Id. de proveedor (por ejemplo MSSQL)
fr: ID de fournisseur (par ex., MSSQL)
it: ID provider, ad esempio MSSQL
ja: プロバイダー ID (例: MSSQL)
ko: 공급자 ID(예: MSSQL)
pt_br: Id do provedor (ex. MSSQL)
zh_hans: 提供程序 ID (如 MSSQL)

# dashboard.properties
source: Property values to show on dashboard
de: Eigenschaftswerte, die im Dashboard angezeigt werden sollen
es: Valores de las propiedades para mostrar en el panel
fr: Valeurs de propriété à afficher sur le tableau de bord
it: Valori di proprietà da mostrare nel dashboard
ja: ダッシュボードに表示するプロパティ値
ko: 대시보드에 표시할 속성 값
pt_br: Valores de propriedade a serem exibidos no painel
zh_hans: 要在仪表板上显示的属性值

# dashboard.properties.databaseProperties
source: Properties to show for database page
de: Eigenschaften, die für die Datenbankseite angezeigt werden sollen
es: Propiedades para mostrar por página de base de datos
fr: Propriétés à afficher pour la page de base de données
it: Proprietà da mostrare per la pagina del database
ja: データベース ページに表示するプロパティ
ko: 표시할 데이터베이스 페이지 속성
pt_br: Propriedades a serem exibidas na página de banco de dados
zh_hans: 数据库页面要显示的属性

# dashboard.properties.flavor
source: A flavor for defining dashboard properties
de: Eine Variante für das Definieren von Dashboardeigenschaften
es: Estilo para definir propiedades en un panel
fr: Saveur pour définir les propriétés de tableau de bord
it: Versione per la definizione delle proprietà del dashboard
ja: ダッシュボードのプロパティを定義するためのフレーバー
ko: 대시보드 속성을 정의하기 위한 특성
pt_br: Uma variante para definir as propriedades do painel
zh_hans: 用于定义仪表板属性的风格

# dashboard.properties.flavor.condition
source: Condition to use this flavor
de: Bedingung für die Verwendung dieser Variante
es: Condición para utilizar este tipo
fr: Condition pour utiliser cette saveur
it: Condizione per usare questa versione
ja: このフレーバーを使用する条件
ko: 이 특성을 사용할 조건
pt_br: Condição para usar essa variante
zh_hans: 使用这种风格的条件

# dashboard.properties.flavor.condition.field
source: Field to compare to
de: Feld für Vergleich
es: Campo con el que comparar
fr: Champ à comparer
it: Campo da usare per il confronto
ja: 比較するフィールド
ko: 비교할 필드
pt_br: Campo para comparar a
zh_hans: 用于比较的字段

# dashboard.properties.flavor.condition.operator
source: Which operator to use for comparison
de: Hiermit wird angegeben, welcher Operator für den Vergleich verwendet werden soll.
es: Operador para utilizar en la comparación
fr: Opérateur à utiliser pour la comparaison
it: Indica l'operatore da usare per il confronto
ja: 比較に使用する演算子
ko: 비교에 사용할 연산자
pt_br: Qual operador usar para comparação
zh_hans: 用于比较的运算符

# dashboard.properties.flavor.condition.value
source: Value to compare the field to
de: Wert, mit dem das Feld verglichen werden soll
es: Valor con el que comparar el campo
fr: Valeur avec laquelle comparer le champ
it: Valore con cui confrontare il campo
ja: フィールドを比較する値
ko: 필드를 비교할 값
pt_br: Valor para comparar o campo com
zh_hans: 用于和字段比较的值

# dashboard.properties.flavor.id
source: Id of the flavor
de: ID der Variante
es: Id. del estilo
fr: ID de la saveur
it: ID della versione
ja: フレーバーの ID
ko: 특성의 ID
pt_br: Id da variante
zh_hans: 风格的 ID

# dashboard.properties.property
source: Defines a property to show on the dashboard
de: Definiert eine Eigenschaft, die im Dashboard angezeigt werden soll
es: Define una propiedad para mostrar en el panel
fr: Définit une propriété à afficher sur le tableau de bord
it: Definisce una proprietà da mostrare nel dashboard
ja: ダッシュ ボードに表示するプロパティを定義します
ko: 대시보드에 표시할 속성을 정의합니다.
pt_br: Define uma propriedade para mostrar no painel
zh_hans: 定义要在仪表板上显示的属性

# dashboard.properties.property.default
source: Default value to show if ignored or no value
de: Standardwert, der angezeigt werden soll, wenn der Wert ignoriert wird oder kein Wert angegeben ist
es: Valor predeterminado para mostrar si se omite o no hay valor
fr: Valeur par défaut à afficher en cas d'omission ou d'absence de valeur
it: Valore predefinito da mostrare se l'impostazione viene ignorata o non viene indicato alcun valore
ja: 無視されるか値がない場合に表示される既定値です
ko: 무시되거나 값이 없는 경우 표시할 기본값
pt_br: Valor padrão para mostrar se ignorado ou sem valor
zh_hans: 在忽略或没有值时显示的默认值

# dashboard.properties.property.displayName
source: What value to use as a label for the property
de: Gibt an, welcher Wert soll als Beschriftung für die Eigenschaft verwendet werden soll.
es: Qué valor utilizar como etiqueta de la propiedad
fr: Valeur à utiliser comme étiquette de la propriété
it: Indica il valore da usare come etichetta per la proprietà
ja: プロパティのラベルとして使用する値
ko: 속성의 레이블로 사용할 값
pt_br: Qual o valor a ser usado como um rótulo para a propriedade
zh_hans: 用作属性标签的值

# dashboard.properties.property.ignore
source: Specify values to be ignored
de: Geben Sie Werte an, die ignoriert werden sollen.
es: Especificar los valores que se ignorarán
fr: Spécifier les valeurs à ignorer
it: Specifica i valori da ignorare
ja: 無視される値を指定します
ko: 무시할 값 지정
pt_br: Especifique os valores a serem ignorados
zh_hans: 指定要忽略的值

# dashboard.properties.property.value
source: What value in the object to access for the value
de: Gibt an, auf welchen Wert im Objekt zugegriffen werden soll, um den Wert zu ermitteln.
es: Valor en el objeto al que acceder para el valor
fr: Valeur à atteindre dans l'objet
it: Indica il valore nell'oggetto per accedere al valore
ja: 値にアクセスするためのオブジェクト内の値
ko: 값을 위해 액세스할 개체의 값
pt_br: Qual o valor do objeto para acessar o valor
zh_hans: 对象中要针对该值访问的值
