Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# view.workbench.scm.missing.mac
source: [Download Git for macOS](https://git-scm.com/download/mac) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
de: [Git für macOS herunterladen](https://git-scm.com/download/mac) Nach der Installation bitte [neu laden](command:workbench.action.reloadWindow) (oder [Fehlerbehebung](command:git.showOutput)). Zusätzliche Quellcodeverwaltungsanbieter können [aus dem Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) installiert werden.
it: [Download Git for macOS](https://git-scm.com/download/mac) Dopo l'installazione, [reload](command:workbench.action.reloadWindow) (o [troubleshoot](command:git.showOutput)). È possibile installare altri provider del controllo del codice sorgente [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20provider%5C%22%22).
ja: [macOS 用 Git のダウンロード](https://git-scm.com/download/mac) インストール後、[再読み込み](command:workbench.action.reloadWindow) (または [トラブルシューティング](command:git.showOutput)) してください。追加のソース管理プロバイダーを [Marketplace から](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) インストールできます。
pt_br: [Baixe o Git para macOS](https://git-scm.com/download/mac) Depois de instalar, [recarregue](command:workbench.action.reloadWindow) (ou [solucione o probleme](command:git.showOutput)). Provedores de controle do código-fonte adicionais podem ser instalados [a partir do Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
zh_hant: [下載適用於 macOS 的 Git](https://git-scm.com/download/mac) 安裝之後，請[重新載入](command:workbench.action.reloadWindow)(或[疑難排解](command:git.showOutput))。可[從 Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) 安裝其他原始檔控制提供者。
