Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# config.repositoryScanIgnoredFolders
source: List of folders that are ignored while scanning for Git repositories when `#git.autoRepositoryDetection#` is set to `true` or `subFolders`.
de: Liste der Ordner, die beim Scannen nach Git-Repositorys ignoriert werden, wenn „#git.autoRepositoryDetection#“ auf „TRUE“ oder „subFolders“ festgelegt ist.
it: Elenco di cartelle ignorate durante l'analisi dei repository GIT quando '#git.autoRepositoryDetection#' è impostato su 'true' o 'subFolders'.
ja: `#git.autoRepositoryDetection#` が `true` または `subFolders` に設定されている場合に Git リポジトリのスキャン中に無視されるフォルダーのリスト。
pt_br: Lista de pastas ignoradas durante a verificação de repositórios Git quando '#git.autoRepositoryDetection#' está definido como 'true' ou 'subFolders'.
zh_hant: 若 `#git.autoRepositoryDetection#` 設為 `true` 或 `subFolders`，掃描 Git 儲存機制時忽略的資料夾清單。

# config.commandsToLog
source: List of git commands (ex: commit, push) that would have their `stdout` logged to the [git output](command:git.showOutput). If the git command has a client-side hook configured, the client-side hook's `stdout` will also be logged to the [git output](command:git.showOutput).
de: Liste der Git-Befehle (z. B. Commit, Push), deren „stdout“ in der [Git-Ausgabe](command:git.showOutput) protokolliert werden würde. Wenn für den Git-Befehl ein clientseitiger Hook konfiguriert ist, wird „stdout“ des clientseitigen Hooks auch in der [Git-Ausgabe](command:git.showOutput) protokolliert.
it: Elenco di comandi GIT (ad esempio commit, push) per i quali verrebbe registrato il relativo 'stdout' nel [git output](command:git.showOutput). Se per il comando GIT è configurato un hook lato client, verrà registrato anche il valore 'stdout' dell'hook lato client nel [git output](command:git.showOutput).
ja: 'stdout' のログが[git output](command:git.showOutput) に記録される Git コマンドの一覧 (commit、push など)。Git コマンドでクライアント側フックが構成されている場合、クライアント側フックの 'stdout' のログも[git output](command:git.showOutput) に記録されます。
pt_br: Lista de comandos git (por exemplo: commit, push) que teriam seu 'stdout' registrado no [git output](command:git.showOutput). Se o comando git tiver um gancho do lado do cliente configurado, o 'stdout' do gancho do lado do cliente também será registrado no [git output](command:git.showOutput).
zh_hant: GIT 命令列表 (例如: commit、push)，這些命令的 `stdout` 將被記錄到 [git 輸出](command:git.showOutput)。如果 GIT 命令設定了用戶端勾點，那麼用戶端勾點的 `stdout` 也將被記錄到 [git 輸出](command:git.showOutput)。

# config.ignoredRepositories
source: List of git repositories to ignore.
de: Liste der zu ignorierenden Git-Repositorys.
it: Elenco dei repository GIT da ignorare.
ja: 無視する git リポジトリの一覧。
pt_br: Lista de repositórios git a serem ignorados.
zh_hant: 要忽略的 Git 儲存庫清單。

# config.scanRepositories
source: List of paths to search for git repositories in.
de: Liste mit Pfaden, an denen nach Git-Repositorys gesucht wird.
it: Elenco dei percorsi in cui cercare i repository GIT.
ja: Git リポジトリを検索するパスのリスト。
pt_br: Lista de caminhos nos quais pesquisar repositórios git.
zh_hant: 要在其中搜尋 git 存放庫的路徑清單。

# config.branchProtection
source: List of protected branches. By default, a prompt is shown before changes are committed to a protected branch. The prompt can be controlled using the `#git.branchProtectionPrompt#` setting.
de: Liste der geschützten Verzweigungen. Standardmäßig wird eine Eingabeaufforderung angezeigt, bevor ein Commit für Änderungen für eine geschützte Verzweigung ausgeführt wird. Die Eingabeaufforderung kann mithilfe der Einstellung „#git.branchProtectionPrompt#“ gesteuert werden.
it: Elenco di rami protetti. Per impostazione predefinita, viene visualizzato un prompt prima del commit delle modifiche in un ramo protetto. È possibile controllare la richiesta usando l'impostazione '#git.branchProtectionPrompt#'.
ja: 保護されたブランチのリスト。既定では、変更が保護されたブランチにコミットされる前にプロンプトが表示されます。プロンプトは、'#git.branchProtectionPrompt#' 設定を使用して制御できます。
pt_br: Lista de branches protegidos. Por padrão, um prompt é mostrado antes que as alterações sejam confirmadas em um branch protegido. O prompt pode ser controlado usando a configuração `#git.branchProtectionPrompt#`.
zh_hant: 受保護分支的清單。根據預設，在將變更提交到受保護的分支之前，會先顯示提示。可使用 `#git.branchProtectionPrompt#` 設定控制提示。

# config.checkoutType.local
source: Local branches
de: Lokale Branches
it: Rami locali
ja: ローカル ブランチ
pt_br: Branches locais
zh_hant: 本機分支

# command.manageUnsafeRepositories
source: Manage Unsafe Repositories
de: Unsichere Repositorys verwalten
it: Gestire repository non sicuri
ja: 安全でないリポジトリの管理
pt_br: Gerenciar Repositórios Não Seguros
zh_hant: 管理不安全的存放庫

# command.merge
source: Merge Branch...
de: Branch zusammenführen...
it: Merge ramo...
ja: ブランチをマージ...
pt_br: Mesclar Ramificação...
zh_hant: 合併分支...

# config.openRepositoryInParentFolders.never
source: Never open a repository in parent folders of workspaces or open files.
de: Öffnen Sie niemals ein Repository in übergeordneten Ordnern von Arbeitsbereichen, oder öffnen Sie Dateien.
it: Non aprire mai un repository in cartelle padre di aree di lavoro o file aperti.
ja: ワークスペースの親フォルダーまたは開いているファイルでリポジトリを開きません。
pt_br: Nunca abra um repositório em pastas pai de workspaces ou arquivos abertos.
zh_hant: 永不在工作區或開啟檔案上層資料夾中開啟存放庫。

# config.publishBeforeContinueOn.never
source: Never publish unpublished git state when using Continue Working On from a git repository
de: Veröffentlichen Sie niemals den nicht veröffentlichten Git-Status, wenn Sie "Weiterarbeiten an" aus einem Git-Repository verwenden.
it: Non pubblicare mai lo stato GIT non pubblicato quando si usa Continua a lavorare da un repository GIT
ja: Git リポジトリから Continue Working On を使用する場合、未発行の Git 状態を公開しない
pt_br: Nunca publicar o estado git não publicado ao usar Continuar Trabalhando a partir de um repositório git
zh_hant: 使用 Git 存放庫的 [繼續工作] 時，永不發佈未發佈的 Git 狀態

# config.openAfterClone.whenNoFolderOpen
source: Only open in current window when no folder is opened.
de: Öffnet Elemente nur dann im aktuellen Fenster, wenn kein Ordner geöffnet ist.
it: Apri solo nella finestra corrente quando non è alcuna cartella.
ja: 開いているフォルダーがない場合は現在のウィンドウでのみ開きます。
pt_br: Abrir somente na janela atual quando não for aberta nenhuma pasta.
zh_hant: 只有在未開啟任何資料夾時，才在目前視窗中開啟。

# command.openAllChanges
source: Open All Changes
de: Alle Änderungen öffnen
it: Apri tutte le modifiche
ja: すべての変更を開く
pt_br: Abrir Todas as Alterações
zh_hant: 開啟所有變更

# command.timelineOpenDiff
source: Open Changes
de: Offene Änderungen
it: Apri modifiche
ja: 変更を開く
pt_br: Abrir as Alterações
zh_hant: 開啟變更

# command.openChange
source: Open Changes
de: Offene Änderungen
it: Apri modifiche
ja: 変更を開く
pt_br: Abrir as Alterações
zh_hant: 開啟變更

# command.revealFileInOS.linux
source: Open Containing Folder
de: Enthaltenden Ordner öffnen
it: Apri cartella superiore
ja: このアイテムのフォルダーを開く
pt_br: Abrir Pasta Continente
zh_hant: 開啟收納資料夾

# command.openFile
source: Open File
de: Datei öffnen
it: Apri file
ja: ファイルを開く
pt_br: Abrir o Arquivo
zh_hant: 開啟檔案

# command.openHEADFile
source: Open File (HEAD)
de: Datei öffnen (HEAD)
it: Apri File (HEAD)
ja: ファイル (HEAD) を開く
pt_br: Abrir Arquivo (HEAD)
zh_hant: 開啟檔案 (HEAD)

# command.openRepositoriesInParentFolders
source: Open Repositories In Parent Folders
de: Repositorys in übergeordneten Ordnern öffnen
it: Apri repository nelle cartelle padre
ja: 親フォルダーでリポジトリを開く
pt_br: Abrir Repositórios em Pastas Pai
zh_hant: 開啟上層資料夾中的存放庫

# command.openRepository
source: Open Repository
de: Repository öffnen
it: Apri repository
ja: リポジトリを開く
pt_br: Abrir o Repositório
zh_hant: 開啟存放庫

# config.mergeEditor
source: Open the merge editor for files that are currently under conflict.
de: Den Zusammenführungseditor für Dateien öffnen, die derzeit in Konflikt stehen.
it: Apri l'editor merge per i file attualmente in conflitto.
ja: 現在競合しているファイルのマージ エディターを開きます。
pt_br: Abra o editor de mesclagem para arquivos que estão atualmente em conflito.
zh_hant: 針對目前發生衝突的檔案開啟合併編輯器。

# config.path
source: Path and filename of the git executable, e.g. `C:\Program Files\Git\bin\git.exe` (Windows). This can also be an array of string values containing multiple paths to look up.
de: Der Pfad und der Dateiname der ausführbaren Git-Datei, beispielsweise „C:\Programme\Git\bin\git.exe“ (Windows). Hierbei kann es sich auch um Array mit Zeichenfolgenwerten handeln, die mehrere Pfade für die Suche enthalten.
it: Percorso e nome file dell'eseguibile GIT, ad esempio `C:\Programmi\Git\bin\git.exe` (Windows). Può trattarsi di una matrice di valori stringa che contengono più percorsi da cercare.
ja: Git 実行可能ファイルのパスとファイル名 (例: Windows の場合は `C:\Program Files\Git\bin\git.exe`)。検索する複数のパスを含む文字列値の配列を指定することもできます。
pt_br: Caminho e nome de arquivo do executável git, por exemplo, `C:\Program Files\Git\bin\git.exe` (Windows). Isso também pode ser uma matriz de valores de cadeia de caracteres contendo vários caminhos para pesquisar.
zh_hant: Git 可執行檔的路徑與檔案名稱，例如 `C:\Program Files\Git\bin\git.exe` (Windows)。此亦可為包含多個待查閱路徑的字串值陣列。

# command.stashPopLatest
source: Pop Latest Stash
de: Pop für letzten Stash ausführen
it: Preleva accantonamento più recente
ja: 最新のスタッシュをポップ
pt_br: Aplicar e Remover Stash Mais Recente
zh_hant: 取回最近的擱置

# command.stashPop
source: Pop Stash...
de: Pop für Stash ausführen...
it: Preleva accantonamento...
ja: スタッシュをポップする...
pt_br: Aplicar e Remover Stash...
zh_hant: 取回擱置... (Pop Stash)

# config.branchPrefix
source: Prefix used when creating a new branch.
de: Präfix, das beim Erstellen einer neuen Verzweigung verwendet wird.
it: Prefisso usato per la creazione di un nuovo ramo.
ja: 新しいブランチを作成するときに使用されるプレフィックス。
pt_br: Prefixo usado ao criar um novo branch.
zh_hant: 建立新分支時使用的首碼。

# config.openRepositoryInParentFolders.prompt
source: Prompt before opening a repository the parent folders of workspaces or open files.
de: Fordern Sie vor dem Öffnen eines Repositorys die übergeordneten Ordner von Arbeitsbereichen an, oder öffnen Sie Dateien.
it: Chiedere conferma prima di aprire un repository nelle cartelle padre dell'area di lavoro o dei file aperti.
ja: ワークスペースの親フォルダーまたは開いているファイルでリポジトリを開く前に、ダイアログを表示します。
pt_br: Avise antes de abrir um repositório nas pastas pai dos workspaces ou arquivos abertos.
zh_hant: 在工作區或開啟檔案上層資料夾中開啟存放庫前提示。

# config.publishBeforeContinueOn.prompt
source: Prompt to publish unpublished git state when using Continue Working On from a git repository
de: Eingabeaufforderung zum Veröffentlichen des nicht veröffentlichten Git-Status bei Verwendung von "Weiterarbeiten an" aus einem Git-Repository
it: Chiedi conferma per pubblicare lo stato GIT non pubblicato quando si usa Continua a lavorare da un repository GIT
ja: Git リポジトリから作業を続行する場合に、未発行の Git 状態を発行するように求めるメッセージ
pt_br: Solicitar a publicação do estado git não publicado ao usar Continuar Trabalhando em um repositório git
zh_hant: 使用 Git 存放庫的 [繼續工作] 時，提示發佈未發佈的 Git 狀態

# config.pruneOnFetch
source: Prune when fetching.
de: Löscht Elemente beim Abrufen.
it: Elimina durante il recupero.
ja: フェッチ時に取り除きます。
pt_br: Fazer a remoção durante a busca.
zh_hant: 擷取時剪除。

# command.publish
source: Publish Branch...
de: Branch veröffentlichen...
it: Pubblica ramo...
ja: ブランチを発行...
pt_br: Publicar Ramificação...
zh_hant: 發行分支...

# command.pull
source: Pull
it: Esegui pull
ja: プル
pt_br: Efetuar Pull
zh_hant: 提取

# command.pullRebase
source: Pull (Rebase)
it: Esegui pull (Riassegna)
ja: プル (リベース)
pt_br: Efetuar Pull (Trocar Base)
zh_hant: 提取 (重訂基底)

# command.pullFrom
source: Pull from...
de: Pullen von...
it: Pull da...
ja: 指定元からプル...
pt_br: Efetuar Pull de...
zh_hant: 從...提取

# submenu.pullpush
source: Pull, Push
it: Esegui pull/push
ja: プル、プッシュ
pt_br: Efetuar Pull, Enviar por Push
zh_hant: 提取、推送

# command.push
source: Push
it: Esegui push
ja: プッシュ
pt_br: Enviar por Push
zh_hant: 推送

# command.pushFollowTags
source: Push (Follow Tags)
de: Push (Tags folgen)
it: Esegui push (segui tag)
ja: プッシュ (タグをフォロー)
pt_br: Enviar por push (Seguir Marcas)
zh_hant: 推送 (跟隨標籤)

# command.pushFollowTagsForce
source: Push (Follow Tags, Force)
de: Push (Tags folgen, Erzwingen)
it: Esegui push (segui tag, forzato)
ja: プッシュ (タグをフォロー、強制)
pt_br: Enviar por Push (Seguir Marcas, Forçar)
zh_hant: 推送 (跟隨標籤，強制)

# command.pushForce
source: Push (Force)
de: Push (Erzwingen)
it: Esegui push (Forza)
ja: プッシュ (強制)
pt_br: Enviar por Push (Forçar)
zh_hant: 推送(強制更新)

# command.pushTags
source: Push Tags
de: Tags pushen
it: Esegui push dei tag
ja: タグをプッシュ
pt_br: Tags de Push
zh_hant: 推送標籤

# config.followTagsWhenSync
source: Push all annotated tags when running the sync command.
de: Übertragen Sie alle annotierten Tags per Push, wenn der Synchronisierungsbefehl ausgeführt wird.
it: Eseguire il push di tutti i tag durante l'esecuzione del comando di sincronizzazione.
ja: 同期コマンドを実行するときに、注釈付きタグをすべてプッシュします。
pt_br: Envie todas as tags anotadas ao executar o comando de sincronização.
zh_hant: 執行 sync 命令時，推送所有附註標籤。

# command.pushTo
source: Push to...
de: Push zu...
it: Esegui push in...
ja: プッシュ先...
pt_br: Enviar por push para...
zh_hant: 推送至...

# command.pushToForce
source: Push to... (Force)
de: Push zu... (Erzwingen)
it: Push in... (Forza)
ja: プッシュ先... (強制)
pt_br: Enviar por push para... (Forçar)
zh_hant: 推送至...(強制更新)

# command.rebase
source: Rebase Branch...
de: Rebase für Branch ausführen...
it: Riassegna ramo...
ja: ブランチのリベース...
pt_br: Trocar Base para a Ramificação...
zh_hant: 重訂基底分支...

# command.refresh
source: Refresh
de: Aktualisieren
it: Aggiorna
ja: 最新の情報に更新
pt_br: Atualizar
zh_hant: 重新整理

# config.rememberPostCommitCommand
source: Remember the last git command that ran after a commit.
de: Den letzten Git-Befehl speichern, der nach einem Commit ausgeführt wurde.
it: Ricorda l'ultimo comando Git eseguito dopo un commit.
ja: コミット後に最後に実行された git コマンドを覚えておいてください。
pt_br: Lembre-se do último comando git executado após um commit.
zh_hant: 記住提交後執行的最後一個 git 命令。

# submenu.remotes
source: Remote
it: Repository remoto
ja: リモート
pt_br: Remoto
zh_hant: 遠端

# config.checkoutType.remote
source: Remote branches
it: Rami remoti
ja: リモート ブランチ
pt_br: Branches remotos
zh_hant: 遠端分支

# command.removeRemote
source: Remove Remote
de: Remote entfernen
it: Rimuovi repository remoto
ja: リモートの削除
pt_br: Remover Remoto
zh_hant: 移除遠端存放庫

# command.rename
source: Rename
de: Umbenennen
it: Rinomina
ja: 名前の変更
pt_br: Renomear
zh_hant: 重新命名

# command.renameBranch
source: Rename Branch...
de: Branch umbenennen...
it: Rinomina Branch...
ja: ブランチ名の変更...
pt_br: Renomear Ramificação...
zh_hant: 重新命名分支...

# command.reopenClosedRepositories
source: Reopen Closed Repositories...
de: Geschlossene Repositorys erneut öffnen...
it: Riapri repository chiusi...
ja: 閉じたリポジトリを再度開く...
pt_br: Reabrir Repositórios Fechados...
zh_hant: 重新開啟已關閉的存放庫...

# command.git.openMergeEditor
source: Resolve in Merge Editor
de: Im Merge-Editor auflösen
it: Risolvi nell'editor di merge
ja: マージ エディターで解決
pt_br: Resolver no Editor de Mesclagem
zh_hant: 在合併編輯器中解析

# command.restoreCommitTemplate
source: Restore Commit Template
de: Commitvorlage wiederherstellen
it: Ripristina il modello di Commit
ja: コミット テンプレートを復元する
pt_br: Restaurar Modelo de Confirmação
zh_hant: 還原認可範本

# command.revealInExplorer
source: Reveal in Explorer View
de: In Explorer-Ansicht anzeigen
it: Visualizza nella vista Esplora risorse
ja: エクスプローラー ビューで表示
pt_br: Modo de exibição Revelar no Explorer
zh_hant: 在 [總管檢視] 中顯示

# command.revealFileInOS.windows
source: Reveal in File Explorer
de: Im Datei-Explorer anzeigen
it: Visualizza in Esplora file
ja: エクスプローラーで表示する
pt_br: Revelar no Explorador de Arquivos
zh_hant: 在檔案總管中顯示

# command.revealFileInOS.mac
source: Reveal in Finder
de: Im Finder anzeigen
it: Visualizzare in Finder
ja: Finder で表示します
pt_br: Revelar no Localizador
zh_hant: 在 Finder 中顯示

# command.revertChange
source: Revert Change
de: Änderung zurücksetzen
it: Annulla modifica
ja: 変更を元に戻す
pt_br: Reverter Alteração
zh_hant: 還原變更

# command.revertSelectedRanges
source: Revert Selected Ranges
de: Ausgewählte Bereiche zurücksetzen
it: Ripristina intervalli selezionati
ja: 選択範囲を元に戻す
pt_br: Reverter Intervalos Selecionados
zh_hant: 還原選取的範圍

# config.postCommitCommand.sync
source: Run 'git pull' and 'git push' after a successful commit.
de: "Git pull" und "git push" nach einem erfolgreichen Commit ausführen.
it: Esegui 'Git Pull' e 'Git Push' dopo un commit riuscito.
ja: コミットが成功した後、'git pull' と 'git push' を実行します。
pt_br: Execute 'git pull' e 'git push' após um commit bem-sucedido.
zh_hant: 成功提交後執行 'git pull' 和 'git push'。

# config.postCommitCommand.push
source: Run 'git push' after a successful commit.
de: "Git push" nach einem erfolgreichen Commit ausführen.
it: Esegui 'Git Push' dopo un commit riuscito.
ja: コミットの成功後、'git push' を実行します。
pt_br: Execute 'git push' após um commit bem-sucedido.
zh_hant: 成功提交後執行 'git push'。

# config.postCommitCommand
source: Run a git command after a successful commit.
de: Git-Befehl nach erfolgreichem Commit ausführen.
it: Esegui un comando Git dopo un commit riuscito.
ja: コミットの成功後、git コマンドを実行します。
pt_br: Execute um comando git após um commit bem-sucedido.
zh_hant: 成功提交後執行 git 命令。

# config.autoRepositoryDetection.true
source: Scan for both subfolders of the current opened folder and parent folders of open files.
de: Sowohl nach Unterordnern des aktuell geöffneten Ordners als auch nach übergeordneten Ordnern von geöffneten Dateien suchen.
it: Esegue la scansione per individuare le sottocartelle della cartella attualmente aperta e le cartelle padre dei file aperti.
ja: 現在開いているフォルダーのサブフォルダーと、開いているファイルの親フォルダーの両方をスキャンします。
pt_br: Examinar as duas subpastas da pasta aberta no momento e das pastas pai de arquivos abertos.
zh_hant: 掃描目前已開啟資料夾的子資料夾與開啟檔案的父資料夾。

# config.autoRepositoryDetection.openEditors
source: Scan for parent folders of open files.
de: Nach übergeordneten Ordnern von geöffneten Dateien suchen.
it: Esegue la scansione per individuare le cartelle padre dei file aperti.
ja: 開いているファイルの親フォルダーをスキャンします。
pt_br: Examinar pastas pai de arquivos abertos.
zh_hant: 掃描開啟檔案的父資料夾。

# config.autoRepositoryDetection.subFolders
source: Scan for subfolders of the currently opened folder.
de: Nach Unterordnern des aktuell geöffneten Ordners suchen.
it: Esegue la scansione per individuare le sottocartelle della cartella attualmente aperta.
ja: 現在開いているフォルダーのサブフォルダーをスキャンします。
pt_br: Examinar subpastas da pasta aberta no momento.
zh_hant: 掃描目前已開啟資料夾的子資料夾。

# view.workbench.scm.scanFolderForRepositories
source: Scanning folder for git repositories...
de: Der Ordner wird auf Git-Repositorys überprüft...
it: Analisi della cartella per i repository GIT in corso...
ja: Git リポジトリのフォルダーをスキャンしています...
pt_br: Verificando pasta para repositórios git...
zh_hant: 正在掃描 Git 存放庫的資料夾...

# view.workbench.scm.scanWorkspaceForRepositories
source: Scanning workspace for git repositories...
de: Arbeitsbereich wird auf Git-Repositorys überprüft...
it: Analisi dell'area di lavoro per i repository GIT in corso...
ja: ワークスペースで Git リポジトリをスキャンしています...
pt_br: Verificando espaço de trabalho para repositórios git...
zh_hant: 正在掃描 Git 存放庫的工作區...

# command.timelineSelectForCompare
source: Select for Compare
de: Für Vergleich auswählen
it: Seleziona per il confronto
ja: 比較対象の選択
pt_br: Selecionar para Comparar
zh_hant: 選取以進行比較

# command.showOutput
source: Show Git Output
de: Git-Ausgabe anzeigen
it: Mostra output GIT
ja: Git 出力の表示
pt_br: Mostrar Saída do Git
zh_hant: 顯示 Git 輸出

# config.showActionButton.commit
source: Show an action button to commit changes when the local branch has modified files ready to be committed.
de: Zeigen Sie eine Aktionsschaltfläche zum Übertragen von Änderungen an, wenn der lokale Zweig geänderte Dateien enthält, die zum Übertragen bereit sind.
it: Mostrare un pulsante di azione per eseguire il commit delle modifiche quando il ramo locale ha modificato i file pronti per il commit.
ja: ローカル ブランチがコミットする準備ができているファイルを変更したときに、変更をコミットするアクション ボタンを表示します。
pt_br: Mostre um botão de ação para confirmar as alterações quando a ramificação local tiver modificado os arquivos prontos para serem confirmados.
zh_hant: 當本地分支有可提交的修改檔案時，顯示提交變更的動作按鈕。

# config.showActionButton.publish
source: Show an action button to publish the local branch when it does not have a tracking remote branch.
de: Zeigen Sie eine Aktionsschaltfläche an, um den lokalen Branch zu veröffentlichen, wenn er keinen verfolgenden Remote Branch hat.
it: Mostrare un pulsante di azione per pubblicare il ramo locale quando non è disponibile un ramo remoto di rilevamento.
ja: 追跡リモート ブランチがない場合にローカル ブランチを発行するアクション ボタンを表示します。
pt_br: Mostre um botão de ação para publicar a ramificação local quando ela não tiver uma ramificação remota de rastreamento.
zh_hant: 當本地分支沒有追蹤遠端分支時，顯示發佈的動作按鈕。

# config.showActionButton.sync
source: Show an action button to synchronize changes when the local branch is either ahead or behind the remote branch.
de: Zeigen Sie eine Aktionsschaltfläche zum Synchronisieren von Änderungen an, wenn der lokale Zweig entweder vor oder hinter dem entfernten Zweig liegt.
it: Mostrare un pulsante di azione per sincronizzare le modifiche quando il ramo locale è avanti o dietro il ramo remoto.
ja: ローカル ブランチがリモート ブランチの前方または背後にある場合に、変更を同期するアクション ボタンを表示します。
pt_br: Mostre um botão de ação para sincronizar as alterações quando a ramificação local estiver à frente ou atrás da ramificação remota.
zh_hant: 當本地分支位於遠端分支前後時，顯示同步變更的動作按鈕。

# submenu.commit.signoff
source: Sign Off
de: Abmelden
it: Approva
ja: サインオフ
pt_br: Desconectar
zh_hant: 登出

# view.workbench.scm.missing.linux
source: Source control depends on Git being installed. [Download Git for Linux](https://git-scm.com/download/linux) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
de: Die Quellcodeverwaltung hängt davon ab, ob Git installiert wird. [Git für Linux herunterladen](https://git-scm.com/download/linux) Nach der Installation bitte [neu laden](command:workbench.action.reloadWindow) (oder [troubleshoot](command:git.showOutput)). Zusätzliche Quellcodeanbieter können [aus dem Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) installiert werden.
it: Il controllo del codice sorgente dipende dall'installazione di Git. [Download Git for Linux](https://git-scm.com/download/linux) Dopo l'installazione, si prega di [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). È possibile installare altri provider del controllo del codice sorgente [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
ja: ソース管理は、インストールされている Git に依存しています。 [Linux 用 Git のダウンロード](https://git-scm.com/download/linux) インストール後、[再読み込み](command:workbench.action.reloadWindow) (または [トラブルシューティング](command:git.showOutput)) してください。追加のソース管理プロバイダーを [Marketplace から](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) インストールできます。
pt_br: O controle do código-fonte depende da instalação do Git. [Baixe o Git para Linux](https://git-scm.com/download/linux) Depois de instalar, [recarregue](command:workbench.action.reloadWindow) (ou [solucione o problema](command:git.showOutput)). Provedores de controle do código-fonte adicionais podem ser instalados [a partir do Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
zh_hant: 原始檔控制必須安裝 Git。 [下載適用於 Linux 的 Git](https://git-scm.com/download/linux) 安裝之後，請 [重新載入](command:workbench.action.reloadWindow) (或 [疑難排解](command:git.showOutput))。[可從 Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) 安裝其他原始檔控制提供者。
