Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# config.requireGitUserConfig
source: Controls whether to require explicit Git user configuration or allow Git to guess if missing.
de: Steuert, ob eine explizite Git-Benutzerkonfiguration erforderlich ist oder ob Git Annahmen treffen soll, falls die Konfiguration fehlt.
it: Controlla se richiedere la configurazione esplicita dell'utente GIT o lasciare che sia GIT a indovinarla se non è presente.
ja: 明示的な Git ユーザーの構成が必要かどうかを制御するか、指定されていない場合は Git による推測を許可します。
pt_br: Controla se a configuração explícita do usuário do Git deve ser exigida ou se o Git pode adivinhar a configuração quando ela estiver ausente.
zh_hant: 控制要在沒有組態時要求明確的 Git 使用者組態，還是允許 Git 進行猜測。

# config.showPushSuccessNotification
source: Controls whether to show a notification when a push is successful.
de: Legt fest, ob bei einem erfolgreichen Push eine Benachrichtigung angezeigt werden soll.
it: Controlla se visualizzare una notifica quando un push è avvenuto con successo.
ja: プッシュが成功したときに通知を表示するかどうかを制御します。
pt_br: Controla se uma notificação deve ser mostrada quando um envio por push é bem-sucedido.
zh_hant: 控制是否要在推送成功時顯示通知。

# config.showInlineOpenFileAction
source: Controls whether to show an inline Open File action in the Git changes view.
de: Steuert, ob eine Inlineaktion zum Öffnen der Datei in der Ansicht „Git-Änderungen“ angezeigt wird.
it: Controlla se visualizzare un'azione Apri file inline nella visualizzazione modifiche GIT.
ja: Git 変更の表示内にインラインのファイルを開くアクションを表示するかどうかを制御します。
pt_br: Controla se uma ação de abertura de arquivo embutida deve ser mostrada no modo de exibição de alterações do Git.
zh_hant: 控制是否在Git變更列表中的檔名旁顯示“開啟檔案”的動作按鈕。

# config.timeline.showAuthor
source: Controls whether to show the commit author in the Timeline view.
de: Steuert, ob der Commitautor in der Zeitachsenansicht angezeigt wird.
it: Controlla se visualizzare l'autore del commit nella visualizzazione Sequenza temporale.
ja: タイムライン ビューにコミット作成者を表示するかどうかを制御します。
pt_br: Controla se o autor do commit deve ser mostrado na exibição Linha do tempo.
zh_hant: 控制是否要在 [時間軸] 檢視中顯示認可作者。

# config.showCommitInput
source: Controls whether to show the commit input in the Git source control panel.
de: Steuert, ob die Commiteingabe im Panel für die Git-Quellcodeverwaltung angezeigt wird.
it: Controlla se mostrare l'input del commit nel pannello del controllo del codice sorgente GIT.
ja: Git ソース管理パネルにコミットの入力を表示するかどうかを制御します。
pt_br: Controla se a entrada de confirmação deve ser mostrada no painel de controle do código-fonte do Git.
zh_hant: 控制是否要在 Git 原始檔控制台中顯示認可輸入。

# config.timeline.showUncommitted
source: Controls whether to show uncommitted changes in the Timeline view.
de: Steuert, ob der Commitautor in der Zeitachsenansicht angezeigt wird.
it: Controlla se visualizzare le modifiche di cui non è stato eseguito il commit nella visualizzazione Sequenza temporale.
ja: コミットされていない変更をタイムライン ビューに表示するかどうかを制御します。
pt_br: Controla se as alterações não confirmadas devem ser mostradas no modo de exibição de Linha do Tempo.
zh_hant: 控制是否要在 [時間表] 檢視中顯示未提交的變更。

# config.useCommitInputAsStashMessage
source: Controls whether to use the message from the commit input box as the default stash message.
de: Steuert, ob die Nachricht aus dem Commiteingabefeld als Standardstashnachricht verwendet wird.
it: Controlla se usare il messaggio della casella di input di commit come messaggio predefinito per l'accantonamento.
ja: コミット入力ボックスからのメッセージを既定のスタッシュ メッセージとして使用するかどうかを制御します。
pt_br: Controla se a mensagem da caixa de entrada de commit deve ser usada como a mensagem de stash padrão.
zh_hant: 控制是否使用認可輸入方塊中的訊息作為預設隱藏訊息。

# config.timeline.date
source: Controls which date to use for items in the Timeline view.
de: Steuert, welches Datum für Elemente in der Zeitachsenansicht verwendet werden soll.
it: Controlla la data da usare per gli elementi nella visualizzazione Sequenza temporale.
ja: タイムライン ビューでアイテムに使用する日付を制御します。
pt_br: Controla qual data deve ser usada para os itens na exibição Linha do tempo.
zh_hant: 控制 [時間軸] 檢視中的項目要使用哪個日期。

# command.timelineCopyCommitId
source: Copy Commit ID
de: Commit-ID kopieren
it: Copia ID commit
ja: コミット ID のコピー
pt_br: Copiar ID de Confirmação
zh_hant: 複製認可識別碼

# command.timelineCopyCommitMessage
source: Copy Commit Message
de: Commitnachricht kopieren
it: Copia messaggio di commit
ja: コミット メッセージのコピー
pt_br: Copiar Mensagem de Confirmação
zh_hant: 複製認可訊息

# config.countBadge.all
source: Count all changes.
de: Alle Änderungen zählen.
it: Esegue il conteggio di tutte le modifiche.
ja: すべての変更をカウントします。
pt_br: Contar todas as alterações.
zh_hant: 計算所有變更的數目。

# config.countBadge.tracked
source: Count only tracked changes.
de: Nur nachverfolgte Änderungen zählen.
it: Esegue il conteggio solo delle revisioni.
ja: 追跡済みの変更のみカウントします。
pt_br: Contar somente as alterações controladas.
zh_hant: 僅計算追蹤的變更數目。

# command.branchFrom
source: Create Branch From...
de: Branch erstellen aus...
it: Crea ramo da...
ja: ブランチの作成元...
pt_br: Criar Ramificação de...
zh_hant: 從下列來源建立分支…

# command.branch
source: Create Branch...
de: Branch wird erstellt...
it: Crea ramo...
ja: 分岐の作成...
pt_br: Criar Ramificação...
zh_hant: 建立分支...

# command.createTag
source: Create Tag
de: Tag erstellen
it: Crea tag
ja: タグを作成
pt_br: Criar Rótulo
zh_hant: 建立標籤

# command.deleteBranch
source: Delete Branch...
de: Branch löschen...
it: Elimina ramo...
ja: ブランチの削除...
pt_br: Excluir Ramificação...
zh_hant: 刪除分支...

# command.deleteRemoteTag
source: Delete Remote Tag
de: Remotetag löschen
it: Elimina tag remoto
ja: リモート タグの削除
pt_br: Excluir Tag Remota
zh_hant: 刪除遠端標籤

# command.deleteTag
source: Delete Tag
de: Tag löschen
it: Elimina tag
ja: タグの削除
pt_br: Excluir Rótulo
zh_hant: 刪除標記

# config.autoRepositoryDetection.false
source: Disable automatic repository scanning.
de: Automatisches Durchsuchen von Repositorys deaktiveren.
it: Disabilita la scansione automatica del repository.
ja: リポジトリの自動的なスキャンを無効にします。
pt_br: Desabilitar verificação automática do repositório.
zh_hant: 停用自動儲存庫掃描。

# config.promptToSaveFilesBeforeCommit.never
source: Disable this check.
de: Deaktiviert diese Prüfung.
it: Disabilita questo controllo.
ja: このチェックを無効にします。
pt_br: Desabilitar esta verificação.
zh_hant: 停用此檢查。

# config.promptToSaveFilesBeforeStash.never
source: Disable this check.
de: Hiermit wird diese Prüfung deaktiviert.
it: Disabilita questo controllo.
ja: このチェックを無効にします。
pt_br: Desabilitar essa verificação.
zh_hant: 停用此檢查。

# command.cleanAll
source: Discard All Changes
de: Alle Änderungen verwerfen
it: Rimuovi tutte le modifiche
ja: すべての変更を破棄
pt_br: Descartar Todas as Alterações
zh_hant: 捨棄所有變更

# command.cleanAllTracked
source: Discard All Tracked Changes
de: Alle nachverfolgten Änderungen verwerfen
it: Rimuovi tutte le modifiche tracciate
ja: 変更履歴をすべて破棄
pt_br: Descartar Todas as Alterações Controladas
zh_hant: 捨棄所有追蹤修訂

# command.cleanAllUntracked
source: Discard All Untracked Changes
de: Alle nicht nachverfolgten Änderungen verwerfen
it: Rimuovi tutte le modifiche non tracciate
ja: 追跡対象外のすべての変更を破棄
pt_br: Descartar Todas as Alterações Não Controladas
zh_hant: 捨棄所有未追蹤修訂

# command.clean
source: Discard Changes
de: Änderungen verwerfen
it: Rimuovi modifiche
ja: 変更を破棄
pt_br: Descartar as Alterações
zh_hant: 捨棄變更

# command.commitMessageDiscard
source: Discard Commit Message
de: Commit-Nachricht verwerfen
it: Rimuovere messaggio di commit
ja: コミット メッセージの破棄
pt_br: Descartar Mensagem de Confirmação
zh_hant: 捨棄提交訊息

# config.postCommitCommand.none
source: Don't run any command after a commit.
de: Führen Sie keinen Befehl nach einem Commit aus.
it: Non eseguire alcun comando dopo un commit.
ja: コミット後、任意のコマンドを実行しません。
pt_br: Não executar nenhum comando após uma confirmação.
zh_hant: 認可後不要執行任何命令。

# command.stashDropAll
source: Drop All Stashes...
de: Alle Stashes löschen...
it: Rimuovi tutti gli accantonamenti...
ja: すべてのスタッシュを削除...
pt_br: Descartar Todos os Stashes...
zh_hant: 卸除所有隱藏項目...

# command.stashDrop
source: Drop Stash...
de: Stash löschen...
it: Rimuovi accantonamento...
ja: スタッシュを削除する...
pt_br: Remover Stash...
zh_hant: 卸除隱藏項目...

# config.autofetchPeriod
source: Duration in seconds between each automatic git fetch, when `#git.autofetch#` is enabled.
de: Dauer in Sekunden zwischen jeder automatischen Git-Abrufung, wenn „#git.autofetch#“ aktiviert ist.
it: Durata in secondi tra ogni git fetch automatico, quando è abilitata l'opzione `#git.autofetch#`.
ja: `#git.autofetch#` が有効な場合の git の自動フェッチ間隔 (秒単位)。
pt_br: Duração em segundos entre cada busca automática de git, quando `#git.autofetch#` está habilitado.
zh_hant: 當啟用 `#git.autofetch#` 時，每個自動 git 擷取的間隔時間 (秒)。

# config.verboseCommit
source: Enable verbose output when `#git.useEditorAsCommitInput#` is enabled.
de: Aktivieren Sie die ausführliche Ausgabe, wenn "#git.useEditorAsCommitInput#" aktiviert ist.
it: Abilita l'output dettagliato quando '#git.useEditorAsCommitInput#' è abilitato.
ja: 「#git.useEditorAsCommitInput#」が有効になっている場合は、冗長出力を有効化してください。
pt_br: Habilite a saída detalhada quando `#git.useEditorAsCommitInput#` estiver habilitado.
zh_hant: 啟用 '#git.useEditorAsCommitInput#' 時，啟用詳細資訊輸出。

# config.enableCommitSigning
source: Enables commit signing with GPG or X.509.
de: Aktiviert die Commitsignierung mit GPG oder X.509.
it: Abilita la firma del commit con GPG o X.509.
ja: GPG または X.509 によるコミットの署名を有効にします。
pt_br: Habilita a assinatura de confirmação com GPG ou X.509.
zh_hant: 允許使用 GPG 或 X.509 簽署認可。

# config.experimental.installGuide
source: Experimental improvements for the git setup flow.
de: Experimentelle Verbesserungen für den Git-Setupfluss.
it: Miglioramenti sperimentali per il flusso di installazione di GIT.
ja: Git のセットアップ フローの試験的な改善。
pt_br: Melhorias experimentais para o fluxo de configuração do Git.
zh_hant: Git 安裝流程的實驗性改進。

# command.fetch
source: Fetch
de: Abrufen
it: Recupera
ja: フェッチ
pt_br: Buscar
zh_hant: 擷取

# command.fetchPrune
source: Fetch (Prune)
de: Abrufen (Prune)
it: Recupera (elimina)
ja: フェッチ (Prune)
pt_br: Buscar (Remover)
zh_hant: 擷取 (剪除)

# command.fetchAll
source: Fetch From All Remotes
de: Von allen Remotes holen
it: Recupera da tutti gli elementi remoti
ja: すべてのリモートからフェッチ
pt_br: Buscar de Todos os Remotos
zh_hant: 從所有遠端擷取

# config.pullTags
source: Fetch all tags when pulling.
de: Hiermit werden alle Tags beim Pullvorgang abgerufen.
it: Recupera tutti i tag durante il pull.
ja: プルするときにすべてのタグをフェッチします。
pt_br: Buscar todas as marcas ao efetuar pull.
zh_hant: 於提取時擷取所有標籤。

# config.rebaseWhenSync
source: Force git to use rebase when running the sync command.
de: Erzwingen, dass Git „rebase“ verwendet, wenn der Synchronisierungsbefehl ausgeführt wird.
it: Forza git a usare rebase durante l'esecuzione del comando di sincronizzazione.
ja: 同期コマンドを実行するときに、Git リベースを強制します。
pt_br: Forçar o git a usar a troca de base ao executar o comando de sincronização.
zh_hant: 當執行同步命令時強制 git 使用 rebase。

# command.api.getRemoteSources
source: Get Remote Sources
de: Remotequellen abrufen
it: Ottieni Origini remote
ja: リモート ソースの取得
pt_br: Obter Fontes Remotas
zh_hant: 取得遠端來源

# command.api.getRepositories
source: Get Repositories
de: Repositorys abrufen
it: Ottieni Repository
ja: リポジトリの取得
pt_br: Obter Repositórios
zh_hant: 取得存放庫

# command.api.getRepositoryState
source: Get Repository State
de: Repositorystatus abrufen
it: Ottieni Stato repository
ja: リポジトリ状態の取得
pt_br: Obter Estado do Repositório
zh_hant: 取得存放庫狀態

# description
source: Git SCM Integration
it: Integrazione SCM su Git
ja: Git SCM統合
pt_br: Integração SCM do Git
zh_hant: Git SCM 整合

# view.workbench.scm.repositoriesInParentFolders
source: Git repositories were found in the parent folders of the workspace or the open file(s). [Open Repository](command:git.openRepositoriesInParentFolders) Use the [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) setting to control whether git repositories in parent folders of workspace or open files are opened. To learn more [read our docs](https://aka.ms/vscode-git-repository-in-parent-folders).
de: Git-Repositorys wurden in den übergeordneten Ordnern des Arbeitsbereichs oder der geöffneten Datei(en) gefunden. [Repository öffnen](command:git.openRepositoriesInParentFolders) Verwenden Sie die Einstellung [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D), um zu steuern, ob Git-Repositorys in übergeordneten Ordnern von Arbeitsbereichen oder offenen Dateien geöffnet werden. Weitere Informationen finden Sie [in unserer Dokumentation](https://aka.ms/vscode-git-repository-in-parent-folders).
it: Repository git sono stati trovati nelle cartelle padre dell'area di lavoro o dei file aperti. [Apri repository](command:git.openRepositoriesInParentFolders) Usare l'impostazione [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) per controllare se i repository Git nelle cartelle padre delle aree di lavoro o dei file aperti sono aperti. Per altre informazioni [leggere la documentazione](https://aka.ms/vscode-git-repository-in-parent-folders).
ja: ワークスペースの親フォルダーまたは開いているファイルで、複数の Git リポジトリが見つかりました。 [リポジトリを開く](command:git.openRepositoriesInParentFolders) [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) 設定を使用して、ワークスペースの親フォルダーまたは開いているファイルのどちらで Git リポジトリを開くかを制御します。詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-git-repository-in-parent-folders)。
pt_br: Repositórios Git foram encontrados nas pastas pai do workspace ou no(s) arquivo(s) aberto(s). [Abrir Repositório](command:git.openRepositoriesInParentFolders) Use the [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) para controlar se os repositórios Git em pastas pai do workspace ou arquivos abertos são abertos. Para saber mais [leia nossos documentos](https://aka.ms/vscode-git-repository-in-parent-folders).
zh_hant: 在工作區或開啟檔案的上層目錄中發現 Git 存放庫。 [開啟存放庫](command:git.openRepositoriesInParentFolders) 請使用 [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) 設定控制工作區或開啟檔案上層目錄中 Git 存放庫是否開啟。若要深入了解 [請閱讀我們的文件](https://aka.ms/vscode-git-repository-in-parent-folders)。

# view.workbench.scm.closedRepositories
source: Git repositories were found that were previously closed. [Reopen Closed Repositories](command:git.reopenClosedRepositories) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Es wurden Git-Repositorys gefunden, die zuvor geschlossen wurden. [Geschlossene Repositorys erneut öffnen](command:git.reopenClosedRepositories) Weitere Informationen zur Verwendung von Git und Quellcodeverwaltung in Azure Data Studio [finden Sie in unserer Dokumentation](https://aka.ms/vscode-scm).
it: Sono stati trovati repository Git chiusi in precedenza. [Riapri i repository chiusi](command:git.reopenClosedRepositories) Per altre informazioni su come usare GIT e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: 以前に閉じられた Git リポジトリが見つかりました。 [閉じたリポジトリを再度開く](command:git.reopenClosedRepositories) Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: Foram encontrados repositórios Git que estavam previamente fechados. [Reabrir repositórios fechados](command:git.reopenClosedRepositories) Para saber mais sobre como usar o git e o controle de origem no Azure Data Studio [leia nossos documentos](https://aka.ms/vscode-scm).
zh_hant: 找到先前已關閉的 Git 存放庫。 [重新開啟已關閉的存放庫](command:git.reopenClosedRepositories) 若要深入了解如何在 Azure Data Studio 中使用 git 和原始檔控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# view.workbench.scm.disabled
source: If you would like to use git features, please enable git in your [settings](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Wenn Sie Git-Features verwenden möchten, aktivieren Sie Git in Ihren [Einstellungen](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). Weitere Informationen zur Verwendung von Git und Quellcodeverwaltung in Azure Data Studio [finden Sie in unserer Dokumentation](https://aka.ms/vscode-scm).
it: Per usare le funzionalità Git, abilitare git in [impostazioni](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). Per altre informazioni su come usare GIT e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: git 機能を使用する場合、[設定](command:workbench.action.openSettings?%5B%22git.enabled%22%5D) で git を有効にしてください。 Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: Se você quiser usar os recursos do git, habilite o git em suas [configurações](command:workbench.action.openSettings?%5B%22git.enabled%22%5D). Para saber mais sobre como usar o git e o controle de origem no Azure Data Studio [leia nossos documentos](https://aka.ms/vscode-scm).
zh_hant: 如果您想要使用 git 功能，請在 [設定](command:workbench.action.openSettings?%5B%22git.enabled%22%5D) 中啟用 git。 若要深入了解如何在 Azure Data Studio 中使用 git 和原始檔控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# config.ignoreSubmodules
source: Ignore modifications to submodules in the file tree.
de: Ignoriert Änderungen an Untermodulen in der Dateistruktur.
it: Ignora le modifiche apportate ai moduli secondari nell'albero dei file.
ja: ファイル ツリーでのサブモジュールの変更を無視します。
pt_br: Ignorar as modificações em submódulos na árvore de arquivos.
zh_hant: 忽略檔案樹狀目錄中子模組的修改。

# config.ignoreLegacyWarning
source: Ignores the legacy Git warning.
de: Ignoriert die Legacy-Git-Warnung.
it: Ignora l'avvertimento legacy di Git.
ja: 古い Git である警告を無視します。
pt_br: Ignora o aviso de Git herdado.
zh_hant: 略過舊的 Git 警告。

# config.ignoreWindowsGit27Warning
source: Ignores the warning when Git 2.25 - 2.26 is installed on Windows.
de: Ignoriert die Warnung, wenn Git 2.25–2.26 unter Windows installiert ist.
it: Ignora il messaggio di avviso quando Git 2.25 - 2.26 è installato in Windows.
ja: Git 2.25 - 2.26 が Windows にインストールされている場合は警告を無視します。
pt_br: Ignora o aviso quando as versões 2.25 – 2.26 do Git estão instaladas no Windows.
zh_hant: 當 Windows 上安裝了 Git 2.25 - 2.26 時，忽略警告。

# config.ignoreMissingGitWarning
source: Ignores the warning when Git is missing.
de: Ignoriert die Warnung, wenn Git nicht vorhanden ist.
it: Ignora il messaggio di avviso quando manca GIT.
ja: Git が見つからない場合の警告を無視します。
pt_br: Ignora o aviso quando o Git está ausente.
zh_hant: 忽略遺漏 Git 時的警告。

# config.ignoreRebaseWarning
source: Ignores the warning when it looks like the branch might have been rebased when pulling.
de: Ignoriert die Warnung beim Pullvorgang, wenn für den Branch möglicherweise ein Rebase ausgeführt wurde.
it: Ignora l'avviso quando il ramo potrebbe essere stato riassegnato durante il pull.
ja: ブランチがプル時にリベースされた可能性があると思われる場合、警告を無視します。
pt_br: Ignora o aviso quando parece que a base do branch pode ter sido trocada ao efetuar pull.
zh_hant: 當分支在提取時可能已重訂基底時，忽略警告。

# config.ignoreLimitWarning
source: Ignores the warning when there are too many changes in a repository.
de: Ignoriert die Warnung bei zu hoher Anzahl von Änderungen in einem Repository.
it: Ignora il messaggio di avviso quando ci sono troppe modifiche in un repository.
ja: リポジトリ内に変更が多い場合の警告を無視します。
pt_br: Ignora o aviso quando há muitas alterações em um repositório.
zh_hant: 當儲存庫中有過多變更時，略過警告。

# view.workbench.scm.empty
source: In order to use git features, you can open a folder containing a git repository or clone from a URL. [Open Folder](command:vscode.openFolder) [Clone Repository](command:git.clone) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Zum Verwenden von Git-Features können Sie einen Ordner mit einem Git-Repository öffnen oder das Repository von einer URL klonen. [Ordner öffnen](command:vscode.openFolder) [Repository klonen](command:git.clone) Weitere Informationen zur Verwendung von Git und der Quellcodeverwaltung in Azure Data Studio [finden Sie in unserer Dokumentation](https://aka.ms/vscode-scm).
it: Per usare le funzionalità GIT, è possibile aprire una cartella contenente un repository GIT o clonarlo da un URL. [Open Folder](command:vscode.openFolder) [Clone Repository](command:git.clone) Per altre informazioni su come usare GIT e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: Git 機能を使用するために、Git リポジトリを含むフォルダーを開くか、URL からクローンを作成することができます。 [フォルダーを開く](command:vscode.openFolder) [リポジトリのクローン](command:git.clone) Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: Para usar os recursos do git, você pode abrir uma pasta contendo um repositório git ou clonar de um URL. [Abrir Pasta](command:vscode.openFolder) [Clonar Repositório](command:git.clone) Para saber mais sobre como usar o git e o controle do código-fonte no Azure Data Studio [leia a nossa documentação](https://aka.ms/vscode-scm).
zh_hant: 如果要使用 git 功能，您可以開啟包含 git 存放庫的資料夾或從 URL 複製。 [開啟資料夾](command:vscode.openFolder) [複製存放庫](command:git.clone) 若要深入了解如何在 Azure Data Studio 中使用 git 和原始檔控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# command.init
source: Initialize Repository
de: Repository initialisieren
it: Inizializza repository
ja: リポジトリの初期化
pt_br: Inicializar o Repositório
zh_hant: 初始化存放庫

# view.workbench.scm.missing
source: Install Git, a popular source control system, to track code changes and collaborate with others. Learn more in our [Git guides](https://aka.ms/vscode-scm).
de: Installieren Sie Git, ein beliebtes Quellcodeverwaltungssystem, um Codeänderungen nachzuverfolgen und mit anderen zusammenzuarbeiten. Weitere Informationen finden Sie in unseren [Git-Leitfäden](https://aka.ms/vscode-scm).
it: Installare Git, un sistema di controllo del codice sorgente più richiesto, per tenere traccia delle modifiche al codice e collaborare con altri utenti. Per altre informazioni, vedere le [Git guides](https://aka.ms/vscode-scm).
ja: 一般的なソース管理システムである Git をインストールして、コードの変更を追跡し、他のユーザーと共同作業を行います。詳細については、[Git ガイド](https://aka.ms/vscode-scm) を参照してください。
pt_br: Instale o Git, um sistema de controle do código-fonte popular, para acompanhar alterações de código e colaborar com outras pessoas. Saiba mais em nossos [guias do Git](https://aka.ms/vscode-scm).
zh_hant: 安裝 Git，這是熱門的原始檔控制系統，以追蹤程式碼變更並與其他人共同作業。在我們的[Git指南](https://aka.ms/vscode-scm)中深入了解。

# config.branchRandomNameDictionary
source: List of dictionaries used for the randomly generated branch name. Each value represents the dictionary used to generate the segment of the branch name. Supported dictionaries: `adjectives`, `animals`, `colors` and `numbers`.
de: Liste der Wörterbücher, die für den zufällig generierten Zweignamen verwendet werden. Jeder Wert stellt das Wörterbuch dar, das zum Generieren des Segments des Zweignamens verwendet wird. Unterstützte Wörterbücher: „Adjektive“, „Tiere“, „Farben“ und „Zahlen“.
it: Elenco di dizionari usati per il nome del ramo generato in modo casuale. Ogni valore rappresenta il dizionario utilizzato per generare il segmento del nome del ramo. Dizionari supportati: 'aggettivi', 'animali', 'colori' e 'numeri'.
ja: ランダムに生成されたブランチ名に使用されるディクショナリの一覧。各値は、ブランチ名のセグメントを生成するために使用されるディクショナリを表します。サポートされている辞書: `adjectives`, `animals`, `colors`, `numbers`。
pt_br: Lista de dicionários usados para o nome do branch gerado aleatoriamente. Cada valor representa o dicionário usado para gerar o segmento do nome da ramificação. Dicionários suportados: `adjetivos`, `animais`, `cores` e `números`.
zh_hant: 隨機產生的分支名稱所使用的字典清單。每個值代表用來產生分支名稱區段的字典。支援的字典: '形容詞'、'動物'、'色彩' 和 '數字'。
