Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# ++CODE++75fba89ae3e3799730e92c23de5c58ee0ea959aa5da12542326144c238174630
source: Pick workspace folder to initialize git repo in
de: Arbeitsbereichsordner auswählen, in dem das Git-Repository initialisiert wird
it: Selezionare la cartella dell'area di lavoro in cui inizializzare il Git repo
ja: Git リポジトリを初期化するワークスペース フォルダーを選択してください
pt_br: Selecionar pasta do workspace na qual inicializar o repositório git
zh_hant: 選擇工作區資料夾以初始化 git 儲存庫

# ++CODE++3fa8ce1777f7ddc400c486a158fcb785fe326b88693300df8417d8cb7747cc52
source: Please check out a branch to push to a remote.
de: Wählen Sie ein Branch für den Push zu einem Remoteelement aus.
it: Estrarre un ramo per eseguire il push in un elemento remoto.
ja: リモートにプッシュするブランチをチェックアウトしてください。
pt_br: Confira uma ramificação para enviar por push a um remoto.
zh_hant: 請簽出分支以推送到遠端。

# ++CODE++afd39827f783ddaf8c31a86ba2a80713ab112800005041f8819c14f5a121d6e1
source: Please clean your repository working tree before checkout.
de: Bereinigen Sie Ihre Repository-Arbeitsstruktur vor Auftragsabschluss.
it: Pulire l'albero di lavoro del repository prima dell'estrazione.
ja: チェックアウトの前に、リポジトリの作業ツリーを消去してください。
pt_br: Limpe sua árvore de trabalho do repositório antes do check-out.
zh_hant: 請先清除您的存放庫工作樹狀再簽出。

# ++CODE++ec5aa3af193303194748ccfa4adc86db1954ea441cb3ca754747829c73082e55
source: Please provide a commit message
de: Geben Sie eine Commit-Nachrichte ein.
it: Specificare un messaggio di commit
ja: コミット メッセージを入力してください
pt_br: Forneça uma mensagem de confirmação
zh_hant: 請提供認可訊息

# ++CODE++e1ac5b25ecf9376124ae3505bdd6ffea60e96fb3744db2d6b08b9ec5dbbabd72
source: Please provide a message to annotate the tag
de: Geben Sie eine Meldung ein, um das Tag mit einer Anmerkung zu versehen.
it: Specificare un messaggio per aggiungere un'annotazione per il tag
ja: 注釈付きタグにつけるメッセージを入力してください
pt_br: Forneça uma mensagem para anotar a marca
zh_hant: 請提供訊息以標註標籤

# ++CODE++90aebb5a363734633e81d596dbc87a7083af97c15029ec4ed00ed85d3018c20e
source: Please provide a new branch name
de: Bitte geben Sie einen neuen Branchnamen an.
it: Specificare un nuovo nome di ramo
ja: 新しいブランチ名を入力してください
pt_br: Forneça um novo nome de ramificação
zh_hant: 請提供新的分支名稱

# ++CODE++a0d728e7c6fd83c9267a9b4bf25b543be6cded7d82d72c9d958ea552ddcaf1c7
source: Please provide a remote name
de: Remotenamen angeben
it: Specificare un nome di repository remoto
ja: リモート名を入力してください。
pt_br: Forneça um nome de remoto
zh_hant: 請提供遠端存放庫名稱

# ++CODE++fc2a1795716d5b38e136f05edebeea54359088832fc36dcf048a92deba47971d
source: Please provide a tag name
de: Geben Sie einen Tagnamen an.
it: Specificare un nome di tag
ja: タグ名を入力してください
pt_br: Forneça um nome de marca
zh_hant: 請提供標籤名稱

# ++CODE++00b3526ea21a69a7bbd09c6f006cce721c78be5995e2eb6c3cb8f0c2ede22879
source: Please provide the commit hash
de: Geben Sie den Commithash an.
it: Specificare l'hash del commit
ja: コミット ハッシュを指定してください
pt_br: Forneça o hash de commit
zh_hant: 請提供認可雜湊

# ++CODE++fe4e7d8ab1a693b8d287c28b1fe5b6f772a2afbaa5063ebbd0766c52e54f161a
source: Publish Branch
de: Verzweigung veröffentlichen
it: Pubblica Ramo
ja: ブランチを発行...
pt_br: Publicar Ramificação
zh_hant: 發佈分支

# ++CODE++c293a1d51314232c4ec79dce0e0ba928b4fc287124feb00c8c5cd98914a0f9ab
source: Publish Branch
de: Branch veröffentlichen
it: Pubblica Branch
ja: Branch を発行
pt_br: Publicar Branch
zh_hant: 發佈 Branch

# ++CODE++7b7fce492a49fe2194302f4d5f2d1b1d22fe41602d876524174f6c819d9d05da
source: Publish Branch "{0}"
de: Branch „{0}“ veröffentlichen
it: Pubblica Branch "{0}"
ja: Branch "{0}" の発行
pt_br: Publicar Branch "{0}"
zh_hant: 發佈 Branch "{0}"

# ++CODE++260304d6c22e64ea2f796f4f4a3ff96dcf866e99b747e759b12bcd31e8b52c0a
source: Publish to {0}
de: In „{0}“ veröffentlichen
it: Pubblica in {0}
ja: {0} に発行する
pt_br: Publicar em {0}
zh_hant: 發佈至 {0}

# ++CODE++095bbfcf66c550a934f58c2bf959ecdcde72853a70196b86e619503c41b3dbdc
source: Publish to...
de: Veröffentlichen in...
it: Pubblica in...
ja: 以下に発行する...
pt_br: Publicar em...
zh_hant: 發佈至...

# ++CODE++0dd87f831d7eff59524e2c4567b7ef14f691d2956d887315793bd818f29cfca0
source: Publishing Branch "{0}"...
de: Branch „{0}“ wird veröffentlicht...
it: Pubblicazione del Branch "{0}"...
ja: Branch "{0}" を発行しています...
pt_br: Publicando do Branch "{0}"...
zh_hant: 正在發佈 Branch "{0}"...

# ++CODE++f401b998c2c5d9bcffc048b2e4ab1484559b14e6d232742a05671ca3e75cf311
source: Publishing Branch...
de: Branch wird veröffentlicht...
it: Pubblicazione Branch in corso...
ja: Branch を公開しています...
pt_br: Ramificação de Branch...
zh_hant: 正在發布 Branch...

# ++CODE++b66d044181a0e29642a958723512a8706ae494ccf63552c08cddca418d1cf097
source: Pull
it: Esegui il pull
ja: プル
pt_br: Efetuar Pull
zh_hant: 提取

# ++CODE++2fa67ee4b98c8e901e1c778121ae4ffded7b1b732bbea170aa7f751847aa399f
source: Pull {0} and push {1} commits between {2}/{3}
de: {0} Commits per Pull und {1} Commits per Push zwischen {2}/{3} übertragen
it: Esegui il pull di {0} e il push di {1} commit tra {2}/{3}
ja: {2}/{3} の間で {0} 件のコミットをプルし、{1} 件のコミットをプッシュします
pt_br: Efetuar pull de {0} e efetuar push de {1} commits entre {2}/{3}
zh_hant: 從 {2}/{3} 間提取 {0} 個認可，並推送 {1} 個認可

# ++CODE++02f3c611e65bc29302de5c9875f7ff07a7ce87d0d0452f9daa175b8fdcc8ad5f
source: Pull {0} commits from {1}/{2}
de: {0} Commits aus {1}/{2} per Pull übertragen
it: Esegui il pull di {0} commit da {1}/{2}
ja: {1}/{2} から {0} 件のコミットをプルします
pt_br: Efetuar pull de {0} commits de {1}/{2}
zh_hant: 從 {1}/{2} 提取 {0} 個認可

# ++CODE++591937c4982b465f47118b1e37d9e2eac87a8d8d43125721e347585ec544f12a
source: Push {0} commits to {1}/{2}
de: {0} Commits per Push nach {1}/{2} übertragen
it: Esegui il push di {0} commit in {1}/{2}
ja: {1}/{2} に {0} 件のコミットをプッシュします
pt_br: Efetuar push de {0} commits para {1}/{2}
zh_hant: 將 {0} 個認可推送到 {1}/{2}

# ++CODE++276cd31a44092264bf1967b71011e0bf264668edf0e6872bf767b75cf60ec3a0
source: Rebasing
de: Rebase wird ausgeführt
it: Rebase in corso
ja: リベースしています
pt_br: Trocando base
zh_hant: 正在重訂基底

# ++CODE++c780499abfa9079473c8de8595fd16c2f601d0695e95f691a5abe35286604b1d
source: Remote "{0}" already exists.
de: Remote "{0}" ist bereits vorhanden.
it: Il repository remoto "{0}" esiste già.
ja: リモート "{0}" は既に存在します。
pt_br: O remoto ''{0}'' já existe.
zh_hant: 遠端存放庫 "{0}" 已存在。

# ++CODE++bd5bc169c6e722863058ba5e309b4a9a775d3419563c2a06a6c147291a81055d
source: Remote branch at {0}
de: Remotebranch unter {0}
it: Ramo remoto in {0}
ja: {0} でのリモート ブランチ
pt_br: Ramificação remota em {0}
zh_hant: 位於 {0} 的遠端分支

# ++CODE++96c1a5aafd493223d4edf01cfcd541cfbb69b57c438ed03db51bc3ee2510a377
source: Remote name
it: Nome del repository remoto
ja: リモート名
pt_br: Nome do remoto
zh_hant: 遠端存放庫名稱

# ++CODE++2e141cb8b2a2a6376c496e0068e12538b13e4b1e7a12386b9e9907699866cf45
source: Remote name format invalid
de: Ungültiges Format des Remotenamens
it: Il formato del nome di repository remoto non è valido
ja: リモート名の形式が無効です
pt_br: Formato de nome do remoto inválido
zh_hant: 遠端存放庫名稱格式無效

# ++CODE++382638de5d12f729cec7910b1bb7998999342f9ab710360306bd29bdd8d89ca3
source: Reopen Closed Repositories
de: Geschlossene Repositorys erneut öffnen
it: Riapri repository chiusi
ja: 閉じたリポジトリを再度開く
pt_br: Reabrir Repositórios Fechados
zh_hant: 重新開啟已關閉的存放庫

# ++CODE++25202086021659225a6b0065ed7ea55875f99c94859e62037b4e00bf1aead47b
source: Replace Local Tag(s)
de: Lokale Tags ersetzen
it: Sostituisci tag locali
ja: ローカル タグの置換
pt_br: Substituir Tags Locais
zh_hant: 取代本機標籤

# ++CODE++79b6a575a54e574a842c9e02e87858cb7596b721ae632a41755f20726c9aa23f
source: Restore file
de: Datei wiederherstellen
it: Ripristina il file
ja: ファイルを復元
pt_br: Restaurar arquivo
zh_hant: 還原檔案

# ++CODE++7e420ff8a2ebf63aa024db900f0707a6d4f457c8048f6cc72523b2f709e8e0f1
source: Restore files
de: Dateien wiederherstellen
it: Ripristina i file
ja: 複数のファイルを復元
pt_br: Restaurar arquivos
zh_hant: 還原檔案

# ++CODE++9a67de1b5740e2d935f5bab0d89233b2b75a777a7ea3b57c7e53ac29427c91c6
source: Save All & Commit Changes
de: Alles speichern und Änderungen committen
it: Salva tutto ed esegui il commit delle modifiche
ja: すべて保存して変更をコミットする
pt_br: Salvar Tudo e Confirmar Alterações
zh_hant: 全部儲存並提交變更

# ++CODE++73bd1493a71408520de7d84d0c500708f92ae677a49fe1cec7350d5363f1088e
source: Save All & Stash
de: Alle speichern und stashen
it: Salva tutto e accantona
ja: すべてを保存してスタッシュする
pt_br: Salvar Tudo e Fazer Stash
zh_hant: 全部儲存並隱藏

# ++CODE++037c1c212912fcec15b3d4126ce0e79c0593c0f74cf8668451ca698b7bc52475
source: Select a branch or tag to checkout
de: Wählen Sie einen Branch oder ein Tag zum Auschecken aus.
it: Selezionare un ramo o un tag di cui eseguire il checkout
ja: チェックアウトするブランチまたはタグを選択します
pt_br: Selecione um branch ou uma tag para finalizar compra
zh_hant: 選取要簽出的分支或標籤

# ++CODE++be8e59066232b90b3820f1ad5bafd5d609e5d3ab42d30fb11a27c7e6cd8e2448
source: Select a branch to checkout in detached mode
de: Wählen Sie einen Branch zum Auschecken im getrennten Modus aus.
it: Selezionare un ramo da estrarre in modalità scollegata
ja: デタッチ モードでチェックアウトするブランチを選択します
pt_br: Selecionar uma filial para fazer check-out no modo separado
zh_hant: 選取要在中斷連結模式簽出的分支

# ++CODE++5410dd4e0d2b06155ae6bd36e52b58b7358ce288ef781b45e9852016e2394b7a
source: Select a branch to delete
de: Wählen Sie einen Branch zum Löschen aus
it: Seleziona un ramo da cancellare
ja: 削除するブランチの選択
pt_br: Selecionar uma ramificação para excluir
zh_hant: 選擇分支進行刪除

# ++CODE++92529e041289d83949ecddfbff14a45431a230e115bea765a0b8757bba4a8d9b
source: Select a branch to merge from
de: Branch für die Zusammenführung auswählen
it: Selezionare un ramo da cui eseguire il merge
ja: マージ元のブランチを選択
pt_br: Selecionar uma ramificação da qual mesclar
zh_hant: 選擇要合併的分支。

# ++CODE++6f8226b637c0f77b71ff88c5ec433a57f3ce11bbe7053bc43d1aa8a6589e75a2
source: Select a branch to rebase onto
de: Branch für Rebase auswählen
it: Selezionare un ramo in base a cui eseguire la riassegnazione
ja: リベース先のブランチを選択
pt_br: Selecionar uma ramificação para a qual trocar base
zh_hant: 選取要重訂為基底的分支

# ++CODE++34412b9ae0d9a8f1243ae6c065eacf2f2d3febce0e38f5df0b6e8d8cdbed0c20
source: Select a ref to create the branch from
de: Wählen Sie einen Verweis aus, aus dem der Branch erstellt werden soll.
it: Selezionare un riferimento da cui creare il ramo
ja: ブランチの作成元 ref を選択
pt_br: Selecionar uma referência da qual criar o branch de
zh_hant: 選取用來建立分支的來源參考

# ++CODE++9fd471b3f11fb4a7e5f87c9f2a87aee1c38c65ff43a596cb75a23f605bc43b17
source: Select a remote to delete a tag from
de: Wählen Sie ein Remoteelement aus, aus dem ein Tag gelöscht werden soll.
it: Selezionare un telecomando da cui eliminare un tag
ja: タグを削除するリモートを選択します
pt_br: Selecione um remoto do qual excluir uma marca
zh_hant: 選取要從中刪除標籤的遠端

# ++CODE++f549e4b0d6b56de82dafefee73dd06920cc27a791ad66fa19d99017abae64158
source: Select a remote to fetch
de: Remote zum Abrufen auswählen
it: Selezionare un repository remoto da recuperare
ja: リモートを選択して取得
pt_br: Selecione um remoto para buscar
zh_hant: 選取要擷取的遠端

# ++CODE++28c2080e378f1d291ab790609682492e0a165b461868f8546b32bc1aa497c3da
source: Select a tag to delete
de: Zu löschendes Tag auswählen
it: Selezionare un tag da eliminare
ja: 削除するタグを選択する
pt_br: Selecionar uma marca para excluir
zh_hant: 選取要刪除的標記

# ++CODE++a2f33e4d476de1d0148d5cdc59a5d6d85769b8980e454594cb34dde1372ab35c
source: Select as Repository Destination
de: Als Repositoryziel auswählen
it: Seleziona come destinazione del repository
ja: リポジトリの宛先として選択
pt_br: Selecionar como Destino do Repositório
zh_hant: 選取為存放庫目的地

# ++CODE++edd969c69f64aff645b3027bab51746e3b4b8bbafdc573981df42125e9e85dbe
source: Show Changes
de: Änderungen anzeigen
it: Mostra modifiche
ja: 変更の表示
pt_br: Mostrar Alterações
zh_hant: 顯示變更

# ++CODE++6b6f44c50d93c59d9c56dce2d44335706fc24ecf4e926d7eabbb6e34c226ae47
source: Show Command Output
de: Befehlsausgabe anzeigen
it: Mostra output del comando
ja: コマンド出力を表示する
pt_br: Mostrar a Saída do Comando
zh_hant: 顯示命令輸出

# ++CODE++3b9a10ffe5b4930c1891d29191418182fd5334195fedd2ce60dfd04c721d3b69
source: Skipped found git in: "{0}"
de: Gefundenes Git wurde übersprungen in: "{0}"
it: {0} Il Git trovato in "{0}" è stato ignorato
ja: Git のスキップが検出されました: "{0}"
pt_br: Git encontrado ignorado em: ''{0}''
zh_hant: 已略過在下列位置找到的 Git: "{0}"

# ++CODE++b5ff1947b664c6719dfbb25602ff832dd7fcfc5068944fa750a36fad11a9f7e6
source: Staged Changes
de: Gestagete Änderungen
it: Modifiche preparate per il commit
ja: ステージされている変更
pt_br: Alterações Preparadas
zh_hant: 暫存的變更

# ++CODE++1b0a609aede05f4f39c423b8a4b57d004741211ef76980e4a37179df32d731a5
source: Stash & Checkout
de: Stashen und auschecken
it: Accantona ed esegui checkout
ja: スタッシュしてチェックアウト
pt_br: Fazer Stash e Check-out
zh_hant: 隱藏並簽出

# ++CODE++9af34d9f6e18cfc2c71f9bfa484d075cda9121682aba174a6fca7a915f403ff1
source: Stash Anyway
de: Dennoch stashen
it: Accantona comunque
ja: このままスタッシュ
pt_br: Fazer Stash Mesmo Assim
zh_hant: 仍要隱藏

# ++CODE++ec8df3d159f741b74f7099bbd10d817aa40b3df5b7ae075629351f950cd462ff
source: Stash message
de: Stash-Nachricht
it: Messaggio di accantonamento
ja: スタッシュ メッセージ
pt_br: Mensagem stash
zh_hant: 擱置變更訊息

# ++CODE++3601420ab6a0cf864306d9d83b2714b1b2c7976e1affe639d813d280267aa3e2
source: Stashed Changes
de: Gestashte Änderungen
it: Modifiche archiviate
ja: 一時退避された変更
pt_br: Alterações armazenadas temporariamente
zh_hant: 隱藏的變更

# ++CODE++376ab71f351b85d3afac0fcbd859636e97909a7fe85d5c049dff55139600db27
source: Successfully pushed.
de: Push wurde erfolgreich ausgeführt.
it: Push avvenuto con successo.
ja: 正常にプッシュされました。
pt_br: Enviado por push com êxito.
zh_hant: 推送成功。

# ++CODE++e8cd388771e552260257ad74ec3080faa98ffa7598b8e782b2a8c08ae1f8107a
source: Synchronize Changes
de: Änderungen synchronisieren
it: Sincronizza modifiche
ja: 変更の同期
pt_br: Sincronizar as Alterações
zh_hant: 同步處理變更

# ++CODE++720bccb504d6429a9e4ec1f87fae45a608701f32f298c17a874e884064b0b9cc
source: Synchronizing Changes...
de: Änderungen werden synchronisiert...
it: Sincronizzazione delle modifiche in corso...
ja: 変更を同期しています...
pt_br: Sincronizando Alterações...
zh_hant: 正在同步處理變更...

# ++CODE++c620cca03e560f7ed57a468dddc1935ece81ff2095dda0f98d987226857b60cc
source: Syncing. Cancelling may cause serious damages to the repository
de: Synchronisierung wird durchgeführt. Das Abbrechen des Vorgangs kann zu schweren Schäden am Repository führen.
it: Sincronizzazione in corso. L'annullamento dell'operazione può causare gravi danni al repository
ja: 同期中です。キャンセルすると、リポジトリに重大な損傷を与える可能性があります
pt_br: Sincronizando. O cancelamento pode causar sérios danos ao repositório
zh_hant: 正在同步。取消可能會對存放庫造成嚴重的損害

# ++CODE++44b333daa4f9e6decfc3260fee4c03285e7b4d9c5315de608d5710283e49e54a
source: Tag at {0}
de: Tag bei {0}
it: Tag in {0}
ja: {0} のタグ
pt_br: Marca na {0}
zh_hant: 位於 {0} 的標籤

# ++CODE++1ace926bc7cdee5323e297d439d2d268286749252b1c7f5e332d5003681d092d
source: Tag name
it: Nome tag
ja: タグ名
pt_br: Nome da marca
zh_hant: 標籤名稱

# ++CODE++3bb614b0a444e925eb3e24b58dda2d4cc23de94c0968d0db2340b60acefdeab2
source: The "{0}" repository has {1} submodules which won\'t be opened automatically. You can still open each one individually by opening a file within.
de: Das Repository „{0}“ enthält {1} Submodule, die nicht automatisch geöffnet werden. Sie können jede Datei dennoch einzeln öffnen, indem Sie darin eine Datei öffnen.
it: Il repository "{0}" ha {1} sottomoduli che non verranno aperti automaticamente. È possibile comunque aprirli individualmente aprendo il file all\'interno.
ja: "{0}" リポジトリに {1} 個のサブモジュールがあり、自動では開かれません。 ファイルを開くことで、それぞれを個別に開くことができます。
pt_br: O repositório “{0}” tem {1} submódulos que não serão abertos automaticamente. Você ainda pode abrir cada um individualmente abrindo um arquivo dentro dele.
zh_hant: "{0}" 儲存庫有 {1} 個無法自動開啟的子模組。您仍可在其中開啟檔案來個別開啟子模組。

# ++CODE++a19a357466e3cc3926579645f74ec7860df52578196b7b4147b221046f946d8d
source: The branch "{0}" has no remote branch. Would you like to publish this branch?
de: Der Branch "{0}" weist keinen Remotebranch auf. Möchten Sie diesen Branch veröffentlichen?
it: Il ramo "{0}" non dispone di un ramo remoto. Pubblicare questo ramo?
ja: "{0}" ブランチにリモート ブランチはありません。このブランチを公開しますか?
pt_br: O branch ''{0}'' não tem branch remoto. Você gostaria de publicar este branch?
zh_hant: 分支 "{0}" 沒有任何遠端分支。您仍想發佈這個分支嗎?

# ++CODE++a213b755cc8239f62a4220d72ca8756a1ef91aec1ca885d2ddec7604f9718675
source: The branch "{0}" is not fully merged. Delete anyway?
de: Der Branch "{0}" ist nicht vollständig zusammengeführt. Trotzdem löschen?
it: Il merge del ramo "{0}" non è completo. Eliminare comunque?
ja: ブランチ '{0}' はマージされていません。それでも削除しますか?
pt_br: O branch ''{0}'' não foi totalmente mesclado. Excluir assim mesmo?
zh_hant: 分支 "{0}" 尚未完整合併. 確定要刪除嗎?

# ++CODE++96bbc2b6d0b5fa5726a6c8930a2bbcd4cfb8a4b95edd9f2a6666260ec402564d
source: The current branch is not published to the remote. Would you like to publish it to access your changes elsewhere?
de: Der aktuelle Branch wird nicht auf dem Remotecomputer veröffentlicht. Möchten Sie ihn veröffentlichen, um an anderer Stelle auf Ihre Änderungen zuzugreifen?
it: Il ramo corrente non è pubblicato nel repository remoto. Pubblicarlo per accedere alle modifiche in un'altra posizione?
ja: 現在のブランチはリモートに発行されません。他の場所の変更にアクセスするために公開しますか?
pt_br: O branch atual não está publicado no remoto. Deseja publicá-lo para acessar suas alterações em outro lugar?
zh_hant: 最新分支未發佈至遠端。您要將其發佈以存取您在其他地方所做的變更嗎?

# ++CODE++31ac359d3ec1d704b0100940cf5eea360a13749b909afeff6fd6afac9944de77
source: The following file has unsaved changes which won\'t be included in the commit if you proceed: {0}.\n\nWould you like to save it before committing?
de: Die folgende Datei umfasst noch nicht gespeicherte Änderungen, die beim Fortsetzen des Vorgangs nicht in den Commit einbezogen werden: {0}.\n\nMöchten Sie vor dem Commit speichern?
it: Il file seguente contiene modifiche non salvate che non verranno incluse nel commit se si procede: {0}.\n\nSalvarlo prima del commit?
ja: 次のファイルには保存されていない変更があり、続行するとコミットに含まれません: {0}。\n\nコミットする前に保存しますか?
pt_br: O arquivo a seguir tem alterações não salvas que não serão incluídas na confirmação se você prosseguir: {0}.\n\nGostaria de salvá-lo antes de cometer?
zh_hant: 下列檔案有未儲存的變更，若您繼續，變更將不會包含在提交中: {0}。\n\n要先儲存再提交嗎?

# ++CODE++a04370991d0a37372ec445bf861013866402b3caf1379a06445405c80a53712c
source: The following file has unsaved changes which won\'t be included in the stash if you proceed: {0}.\n\nWould you like to save it before stashing?
de: Die folgende Datei umfasst nicht gespeicherte Änderungen, die beim Fortsetzen des Vorgangs nicht in den Stash einbezogen werden: {0}.\n\nMöchten Sie sie vor dem Stashen speichern?
it: Il file seguente contiene modifiche non salvate che non verranno incluse nell\'accantonamento se si procede: {0}.\n\nSalvarlo prima dell\'accantonamento?
ja: 次のファイルには保存されていない変更があり、続行するとスタッシュに含められません: {0}。\n\nスタッシュする前に保存しますか?
pt_br: O seguinte arquivo tem alterações não salvas que não serão incluídas no stash se você continuar: {0}.\n\nDeseja salvá-lo antes de fazer stash?
zh_hant: 下列檔案有未儲存的變更，若您繼續，變更將不會包含在隱藏項目中: {0}。\n\n要先儲存檔案再隱藏嗎?

# ++CODE++23ba98146c9e50555dba1090bfd5e783e2ed2dd0823bb47fbe5f67ce258a9eb5
source: The following untracked file will be DELETED FROM DISK if discarded: {0}.
de: Die folgende nicht verfolgte Datei wird VOM DATENTRÄGER GELÖSCHT, wenn sie verworfen wird: {0}.
it: Se rimosso, il file seguente di cui non viene tenuta traccia verrà ELIMINATO DAL DISCO: {0}.
ja: 破棄すると次の未追跡ファイルがディスクから削除されます: {0}。
pt_br: O seguinte arquivo não controlado será EXCLUÍDO DO DISCO se descartado: {0}.
zh_hant: 下列未追蹤檔案若被捨棄，將會從磁碟中刪除: {0}。

# ++CODE++e109d755dd32053afa001e1e366b7a51561c73d2fcea81e79cdb7a46dc7fc47a
source: The git repositories in the current folder are potentially unsafe as the folders are owned by someone other than the current user.
de: Die Git-Repositorys im aktuellen Ordner sind potenziell unsicher, weil sich die Ordner im Besitz einer anderen Person als dem aktuellen Benutzer befinden.
it: I repository Git nella cartella corrente potrebbe non essere sicuro perché le cartelle sono di proprietà di un utente diverso dall'utente corrente.
ja: 現在のフォルダー内の Git リポジトリは、現在のユーザー以外のユーザーによって所有されているため、安全でない可能性があります。
pt_br: Os repositórios git na pasta atual são potencialmente não seguros, pois as pastas pertencem a alguém diferente do usuário atual.
zh_hant: 目前資料夾中的 Git 存放庫可能不安全，因為資料夾是由目前使用者外的人所擁有。

# ++CODE++02c2cdd6b3ac71010ce7c47a400c9719fead4aa3269d72b8f462ff61a45d4ab3
source: The git repository at "{0}" has too many active changes, only a subset of Git features will be enabled.
de: Das Git-Repository unter "{0}" weist zu viele aktive Änderungen auf. Es wird nur eine Teilmenge der Git-Features aktiviert.
it: Il repository Git "{0}" ha troppe modifiche attive. Verrà attivato solo un sottoinsieme delle funzionalità di Git.
ja: "{0}" のGit リポジトリにアクティブな変更が多いため、 Git 機能の一部のみが有効になります。
pt_br: O repositório do git em ''{0}'' tem muitas alterações ativas, apenas um subconjunto de recursos do Git será habilitado.
zh_hant: 位於 "{0}" 的 Git 儲存庫有過多使用中的變更，只有部份 Git 功能會被啟用。

# ++CODE++8d01c87529131c0fe41305b68799b99052dc4a274a4affcc1cea877cc14346d7
source: The git repository in the current folder is potentially unsafe as the folder is owned by someone other than the current user.
de: Das Git-Repository im aktuellen Ordner ist potenziell unsicher, weil sich der Ordner im Besitz einer anderen Person als dem aktuellen Benutzer befindet.
it: Il repository Git nella cartella corrente potrebbe non essere sicuro perché la cartella è di proprietà di un utente diverso dall'utente corrente.
ja: 現在のフォルダー内の Git リポジトリは、現在のユーザー以外のユーザーによって所有されているため、安全でない可能性があります。
pt_br: O repositório git na pasta atual é potencialmente não seguro, pois a pasta pertence a alguém diferente do usuário atual.
zh_hant: 目前資料夾中的 Git 存放庫可能不安全，因為資料夾是由目前使用者外的人所擁有。

# ++CODE++5fd10738fc1c6f99d48f2d972e7a4c4fa0ffa39ff4f89ae5cba4055c08eb98d4
source: The last commit was a merge commit. Are you sure you want to undo it?
de: Der letzte Commit war ein Mergecommit. Möchten Sie den Vorgang wirklich rückgängig machen?
it: L'ultimo commit è stato un commit di merge. Annullarlo?
ja: 最後のコミットはマージ コミットでした。元に戻しますか?
pt_br: A última confirmação foi uma confirmação de mesclagem. Tem certeza de que deseja desfazê-la?
zh_hant: 最後一個認可是合併認可。確定要復原嗎?

# ++CODE++b45f0ffa9a6ab73edb905b626d6fe3ed00854ca7abf7303b919cf686315b9f99
source: The new branch will be "{0}"
de: Der neue Branch lautet "{0}".
it: Il nuovo ramo sarà "{0}"
ja: 新しいブランチは "{0}" になります
pt_br: O novo branch será ''{0}''
zh_hant: 新分支會是 "{0}"

# ++CODE++4360153c542717595a316b4979c6bba0e30dd9ccd312e1c4c852a00bdd6366d6
source: The repository does not have any commits. Please make an initial commit before creating a stash.
de: Das Repository weist keine Commits auf. Führen Sie einen ersten Commit aus, bevor Sie einen Stash erstellen.
it: Il repository non contiene commit. Effettuare un commit iniziale prima di creare un accantonamento.
ja: リポジトリにコミットがありません。一時退避を作成する前に、初期コミットを行ってください。
pt_br: O repositório não tem nenhum commit. Faça um commit inicial antes de criar um stash.
zh_hant: 存放庫沒有任何認可。請先進行初始認可，再建立隱藏。

# ++CODE++27ee389973941a5e4c33938ada96f71810852631100b4c853fde3b8ff00a4b5c
source: The selection range does not contain any changes.
de: Der Auswahlbereich enthält keine Änderungen.
it: L\'intervallo di selezione non contiene modifiche.
ja: 選択範囲に変更が含まれていません。
pt_br: O intervalo de seleção não possui nenhuma alteração.
zh_hant: 選取範圍未包含任何變更。

# ++CODE++abbd48f372807f93e0988532fd3acb1f1eb758ec9a414c4a0bbde208ca64ea73
source: There are merge conflicts. Resolve them before committing.
de: Es liegen Zusammenführungskonflikte vor. Beheben Sie die Konflikte vor dem Committen.
it: Ci sono conflitti di merge. Risolverli prima di eseguire commit.
ja: マージの競合があります。コミットする前にこれを解決してください。
pt_br: Há conflitos de mesclagem. Resolva-os antes de confirmar.
zh_hant: 合併衝突。提交前請解決衝突。
