Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# view.workbench.scm.repositoryInParentFolders
source: A git repository was found in the parent folders of the workspace or the open file(s). [Open Repository](command:git.openRepositoriesInParentFolders) Use the [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) setting to control whether git repositories in parent folders of workspaces or open files are opened. To learn more [read our docs](https://aka.ms/vscode-git-repository-in-parent-folders).
de: Ein Git-Repository wurde in den übergeordneten Ordnern des Arbeitsbereichs oder der geöffneten Datei(en) gefunden. [Repository öffnen](command:git.openRepositoriesInParentFolders) Verwenden Sie die Einstellung [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D), um zu steuern, ob Git-Repositorys in übergeordneten Ordnern von Arbeitsbereichen oder offenen Dateien geöffnet werden. Weitere Informationen finden Sie [in unserer Dokumentation](https://aka.ms/vscode-git-repository-in-parent-folders).
it: Un repository git è stato trovato nelle cartelle padre dell'area di lavoro o dei file aperti. [Apri repository](command:git.openRepositoriesInParentFolders) Usare l'impostazione [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) per controllare se i repository Git nelle cartelle padre delle aree di lavoro o dei file aperti sono aperti. Per altre informazioni [leggere la documentazione](https://aka.ms/vscode-git-repository-in-parent-folders).
ja: ワークスペースの親フォルダーまたは開いているファイルで、1 つの Git リポジトリが見つかりました。 [リポジトリを開く](command:git.openRepositoriesInParentFolders) [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) 設定を使用して、ワークスペースの親フォルダーまたは開いているファイルのどちらで Git リポジトリを開くかを制御します。詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-git-repository-in-parent-folders)。
pt_br: Um repositório Git foi encontrado nas pastas pai do workspace ou no(s) arquivo(s) aberto(s). [Abrir Repositório](command:git.openRepositoriesInParentFolders) Use a configuração [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) para controlar se os repositórios Git em pastas pai de workspaces ou arquivos abertos são abertos. Para saber mais [leia nossos documentos](https://aka.ms/vscode-git-repository-in-parent-folders).
zh_hant: 在工作區或開啟檔案的上層目錄中發現 Git 存放庫。 [開啟存放庫](command:git.openRepositoriesInParentFolders) 請使用 [git.openRepositoryInParentFolders](command:workbench.action.openSettings?%5B%22git.openRepositoryInParentFolders%22%5D) 設定控制工作區或開啟檔案上層目錄中 Git 存放庫是否開啟。若要深入了解 [請閱讀我們的文件](https://aka.ms/vscode-git-external-repository)。

# view.workbench.scm.closedRepository
source: A git repository was found that was previously closed. [Reopen Closed Repository](command:git.reopenClosedRepositories) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Es wurde ein Git-Repository gefunden, das zuvor geschlossen war. [Geschlossene Repository erneut öffnen](command:git.reopenClosedRepositories) Weitere Informationen zur Verwendung von Git und Quellcodeverwaltung in Azure Data Studio [finden Sie in unserer Dokumentation](https://aka.ms/vscode-scm).
it: È stato trovato un repository GIT chiuso in precedenza. [Riapri repository chiuso](command:git.reopenClosedRepositories) Per altre informazioni su come usare GIT e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: 以前に閉じられた Git リポジトリが見つかりました。 [閉じたリポジトリを再度開く](command:git.reopenClosedRepositories) Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: Foi encontrado um repositório git que estava fechado anteriormente. [Reabrir Repositório Fechado](command:git.reopenClosedRepositories) Para saber mais sobre como usar o git e o controle de origem no Azure Data Studio [leia nossos documentos](https://aka.ms/vscode-scm).
zh_hant: 找到先前已關閉的 Git 存放庫。 [重新開啟已關閉的存放庫](command:git.reopenClosedRepositories) 若要深入了解如何在 Azure Data Studio 中使用 git 和原始檔控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# config.branchRandomNameDictionary.adjectives
source: A random adjective
de: Ein zufälliges Adjektiv
it: Aggettivo casuale
ja: ランダムな形容詞
pt_br: Um adjetivo aleatório
zh_hant: 隨機形容詞

# config.branchRandomNameDictionary.animals
source: A random animal name
de: Ein zufälliger Tiername
it: Nome animale casuale
ja: ランダムな動物の名前
pt_br: Um nome de animal aleatório
zh_hant: 隨機動物名稱

# config.branchRandomNameDictionary.colors
source: A random color name
de: Ein zufälliger Farbname
it: Nome colore casuale
ja: ランダムな色の名前
pt_br: Um nome de cor aleatório
zh_hant: 隨機色彩名稱

# config.branchRandomNameDictionary.numbers
source: A random number between 100 and 999
de: Eine Zufallszahl zwischen 100 und 999
it: Un un numero casuale compreso tra 100 e 999
ja: 100 と 999 の間のランダムな数
pt_br: Um número aleatório entre 100 e 999
zh_hant: 介於 100 到 999 之間的隨機數字

# config.branchValidationRegex
source: A regular expression to validate new branch names.
de: Regulärer Ausdruck zum Validieren neuer Branch-Namen.
it: Un'espressione regolare per validare i nomi delle nuove branch.
ja: 新しいブランチ名を検証するための正規表現。
pt_br: Uma expressão regular para validar novos nomes de branch.
zh_hant: 用於驗證新分支名稱的正規表達式。

# command.mergeAbort
source: Abort Merge
de: Merge abbrechen
it: Interrompi merge
ja: マージの中止
pt_br: Anular Mesclagem
zh_hant: 中止合併

# command.rebaseAbort
source: Abort Rebase
de: Rebase abbrechen
it: Interrompi riassegnazione
ja: リベースを中止する
pt_br: Abortar Troca de Base
zh_hant: 中止重訂基底

# command.commitMessageAccept
source: Accept Commit Message
de: Commit-Nachricht akzeptieren
it: Accettare messaggio di commit
ja: コミット メッセージを受け入れる
pt_br: Aceitar Mensagem de Confirmação
zh_hant: 接受提交訊息

# command.addRemote
source: Add Remote...
de: Remoterepository hinzufügen...
it: Aggiungi repository remoto...
ja: リモートの追加...
pt_br: Adicionar Remoto...
zh_hant: 新增遠端存放庫...

# command.ignore
source: Add to .gitignore
de: Zu .gitignore hinzufügen
it: Aggiungi a .gitignore
ja: .gitignore に追加
pt_br: Adicionar a .gitignore
zh_hant: 新增到 .gitignore

# config.untrackedChanges.mixed
source: All changes, tracked and untracked, appear together and behave equally.
de: Alle Änderungen (nachverfolgte und nicht nachverfolgte) werden zusammen angezeigt und verhalten sich identisch.
it: Tutte le modifiche, tracciate e non tracciate, vengono visualizzate insieme e si comportano allo stesso modo.
ja: 追跡対象および追跡対象外のすべての変更は、一緒に表示され、均等に動作します。
pt_br: Todas as alterações, controladas e não controladas, aparecem juntas e se comportam igualmente.
zh_hant: 所有修訂 (追蹤和未追蹤) 會同時出現並以同等方式運作。

# config.branchProtectionPrompt.alwaysCommitToNewBranch
source: Always commit changes to a new branch.
de: Der Commit für Änderungen muss immer für eine neue Verzweigung ausgeführt werden.
it: Eseguire il commit delle modifiche apportate a un nuovo ramo.
ja: 新しいブランチへの変更をコミットします。
pt_br: Sempre fazer commit nas alterações em um novo branch.
zh_hant: 一律提交新分支的變更。

# config.branchProtectionPrompt.alwaysCommit
source: Always commit changes to the protected branch.
de: Der Commit für Änderungen muss immer für die geschützte Verzweigung ausgeführt werden.
it: Eseguire sempre il commit delle modifiche nel ramo protetto.
ja: 常に保護されたブランチに変更をコミットします。
pt_br: Sempre faça commit nas alterações no branch protegido.
zh_hant: 一律提交至受保護分支的變更。

# config.confirmEmptyCommits
source: Always confirm the creation of empty commits for the 'Git: Commit Empty' command.
de: Bestätigen Sie die Erstellung leerer Commits für den Befehl „Git: Commit Empty“ immer.
it: Conferma sempre la creazione di commit vuoti per il comando 'Git: Commit vuoto'.
ja: 'Git: Commit Empty' コマンドの空のコミットの作成を常に確認します。
pt_br: Sempre confirmar a criação de confirmações vazias para o comando 'Git: Commit Empty'.
zh_hant: 一律確認 'Git: Commit Empty' 命令的空白認可建立。

# config.openRepositoryInParentFolders.always
source: Always open a repository in parent folders of workspaces or open files.
de: Öffnen Sie immer ein Repository in übergeordneten Ordnern von Arbeitsbereichen, oder öffnen Sie Dateien.
it: Aprire sempre un repository in cartelle padre di aree di lavoro o file aperti.
ja: 常にワークスペースの親フォルダーまたは開いているファイルでリポジトリを開きます。
pt_br: Sempre abra um repositório em pastas pai de workspaces ou arquivos abertos.
zh_hant: 永遠在工作區或開啟檔案的上層資料夾中開啟存放庫。

# config.openAfterClone.alwaysNewWindow
source: Always open in a new window.
de: Öffnet Elemente immer in einem neuen Fenster.
it: Apri sempre in una nuova finestra.
ja: 常に新しいウィンドウで開きます。
pt_br: Sempre abrir o repositório em uma nova janela.
zh_hant: 永遠在新視窗中開啟。

# config.openAfterClone.always
source: Always open in current window.
de: Öffnet Elemente immer im aktuellen Fenster.
it: Apri sempre nella finestra corrente.
ja: 常に現在のウィンドウで開きます。
pt_br: Sempre abrir o repositório na janela atual.
zh_hant: 永遠在目前視窗中開啟。

# config.branchProtectionPrompt.alwaysPrompt
source: Always prompt before changes are committed to a protected branch.
de: Immer fragen, bevor für Änderungen ein Commit für eine geschützte Verzweigung ausgeführt wird.
it: Chiedere sempre conferma prima di eseguire il commit delle modifiche in un ramo protetto.
ja: 変更が保護されたブランチにコミットされる前に、常にプロンプトを表示します。
pt_br: Sempre solicitar antes que as alterações sejam confirmadas em um branch protegido.
zh_hant: 在變更提交至受保護的分支之前一律提示。

# config.openAfterClone.prompt
source: Always prompt for action.
de: Fordert immer eine Aktion an.
it: Richiedi sempre l'azione da eseguire.
ja: 常にアクションを確認します。
pt_br: Sempre solicitar uma ação.
zh_hant: 永遠提示採取動作。

# config.publishBeforeContinueOn.always
source: Always publish unpublished git state when using Continue Working On from a git repository
de: Unveröffentlichten Git-Status immer veröffentlichen, wenn Sie "Weiterarbeiten an" aus einem Git-Repository verwenden
it: Pubblica sempre lo stato GIT non pubblicato quando si usa Continua a lavorare da un repository GIT
ja: Git リポジトリから Continue Working On を使用する場合は、発行されていない Git 状態を常に発行する
pt_br: Sempre publicar o estado git não publicado ao usar Continuar Trabalhando em um repositório git
zh_hant: 使用 Git 存放庫的 [繼續工作] 時，一律發佈未發佈的 Git 狀態

# config.alwaysShowStagedChangesResourceGroup
source: Always show the Staged Changes resource group.
de: Ressourcengruppe für gestagete Änderungen immer anzeigen.
it: Mostra sempre il gruppo di risorse Modifiche preparate per il commit.
ja: ステージ済み変更のリソース グループを常に表示します。
pt_br: Sempre mostrar o grupo de recursos Alterações em Etapas.
zh_hant: 一律顯示「暫存變更」的資源群組。

# submenu.commit.amend
source: Amend
de: Korrigieren
it: Modifica
ja: 修正
pt_br: Corrigir
zh_hant: 修改

# command.stashApplyLatest
source: Apply Latest Stash
de: Neuesten Stash anwenden
it: Applica ultimo Stash
ja: 最新のスタッシュを適用
pt_br: Aplicar Stash Mais Recente
zh_hant: 套用最新擱置 (Apply Latest Stash)

# command.stashApply
source: Apply Stash...
de: Stash anwenden...
it: Applica Stash...
ja: スタッシュを適用...
pt_br: Aplicar Stash...
zh_hant: 套用擱置... (Apply Stash)

# config.smartCommitChanges.all
source: Automatically stage all changes.
de: Hiermit werden alle Änderungen automatisch gestaget.
it: Prepara automaticamente tutte le modifiche per il commit.
ja: すべての変更を自動的にステージします。
pt_br: Preparar automaticamente todas as alterações.
zh_hant: 自動暫存所有變更。

# config.smartCommitChanges.tracked
source: Automatically stage tracked changes only.
de: Es wurden nur nachverfolgte Änderungen automatisch gestaget.
it: Solo modifiche tracciate automaticamente preparate per il commit.
ja: 自動的にステージングされた変更箇所のみ。
pt_br: Somente preparar automaticamente as alterações controladas.
zh_hant: 僅自動暫存追蹤的變更。

# submenu.branch
source: Branch
it: Crea ramo
ja: ブランチ
pt_br: Ramificação
zh_hant: 分支

# submenu.changes
source: Changes
de: Änderungen
it: Modifiche
ja: 変更
pt_br: Alterações
zh_hant: 變更

# config.promptToSaveFilesBeforeCommit.always
source: Check for any unsaved files.
de: Hiermit prüfen Sie auf nicht gespeicherte Dateien.
it: Verifica la presenza di eventuali file non salvati.
ja: 保存されていないファイルがないか確認します。
pt_br: Verificar se há arquivos não salvos.
zh_hant: 檢查任何未存檔的檔案。

# config.promptToSaveFilesBeforeStash.always
source: Check for any unsaved files.
de: Hiermit prüfen Sie auf nicht gespeicherte Dateien.
it: Verifica la presenza di eventuali file non salvati.
ja: 保存されていないファイルがないか確認します。
pt_br: Verificar se há arquivos não salvos.
zh_hant: 檢查任何未存檔的檔案。

# config.promptToSaveFilesBeforeCommit.staged
source: Check only for unsaved staged files.
de: Hiermit prüfen Sie nur auf nicht gespeicherte gestagete Dateien.
it: Verificare solo la presenza di file di stage non salvati.
ja: 保存されていないステージング済みファイルのみを確認します。
pt_br: Verificar somente os arquivos preparados não salvos.
zh_hant: 僅檢查未儲存的暫存檔案。

# config.promptToSaveFilesBeforeStash.staged
source: Check only for unsaved staged files.
de: Hiermit prüfen Sie nur auf nicht gespeicherte gestagete Dateien.
it: Verificare solo la presenza di file di stage non salvati.
ja: 保存されていないステージング済みファイルのみを確認します。
pt_br: Verificar somente os arquivos preparados não salvos.
zh_hant: 僅檢查未儲存的暫存檔案。

# command.checkoutDetached
source: Checkout to (Detached)...
de: Auschecken an (getrennt)...
it: Esegui checkout in (modalità scollegata)...
ja: チェックアウト先 (デタッチ済み)...
pt_br: Check-out para (Desanexado)...
zh_hant: 簽出至 (已中斷連結)...

# command.checkout
source: Checkout to...
de: Auschecken an...
it: Esegui checkout in...
ja: チェックアウト先...
pt_br: Sair para...
zh_hant: 簽出至...

# command.cherryPick
source: Cherry Pick...
it: Esegui cherry-pick...
ja: チェリーピック...
zh_hant: 揀選...

# command.clone
source: Clone
de: Klonen
it: Clona
ja: クローン
pt_br: Clonar
zh_hant: 複製

# command.cloneRecursive
source: Clone (Recursive)
de: Klonen (rekursiv)
it: Clona (ricorsivo)
ja: 複製 (再帰)
pt_br: Clonar (Recursivo)
zh_hant: 複製 (遞迴)

# command.continueInLocalClone
source: Clone Repository Locally and Open on Desktop...
de: Repository lokal klonen und auf Desktop öffnen...
it: Clona repository in locale e apri sul desktop...
ja: リポジトリをローカルにクローンしてデスクトップで開く...
pt_br: Clonar Repositório Localmente e Abrir na Área de Trabalho...
zh_hant: 在桌面上複製存放庫並開啟...

# command.closeAllDiffEditors
source: Close All Diff Editors
de: Alle Diff-Editoren schließen
it: Chiudi tutti gli editor diff
ja: すべての差分エディターを閉じる
pt_br: Fechar Todos os Editores de Comparação
zh_hant: 關閉所有 Diff 編輯器

# command.close
source: Close Repository
de: Repository schließen
it: Chiudi repository
ja: リポジトリを閉じる
pt_br: Fechar Repositório
zh_hant: 關閉儲存庫

# colors.added
source: Color for added resources.
de: Farbe für hinzugefügte Ressourcen.
it: Colore delle risorse aggiunte.
ja: 追加したリソースの配色。
pt_br: Cor dos recursos adicionados.
zh_hant: 已新增資源的顏色。

# colors.stageDeleted
source: Color for deleted resources which have been staged.
de: Farbe für gelöschte Ressourcen, die gestaget wurden.
it: Colore per le risorse eliminate che sono state preparate per il commit.
ja: ステージングされた削除済みリソースの色。
pt_br: Cor dos recursos excluídos que foram preparados.
zh_hant: 已刪除之資源的色彩。

# colors.deleted
source: Color for deleted resources.
de: Farbe für gelöschte Ressourcen.
it: Colore delle risorse eliminate.
ja: リソースを検出した場合の配色
pt_br: Cor dos recursos excluídos.
zh_hant: 刪除資源的顏色

# colors.ignored
source: Color for ignored resources.
de: Farbe für ignorierte Ressourcen.
it: Colore delle risorse ignorate.
ja: リソースを無視する場合の配色
pt_br: Cor dos recursos ignorados.
zh_hant: 忽略資源的顏色。

# colors.stageModified
source: Color for modified resources which have been staged.
de: Farbe für geänderte Ressourcen, die gestaget wurden.
it: Colore per le risorse modificate che sono state preparate per il commit.
ja: ステージングされた変更済みリソースの色。
pt_br: Cor dos recursos modificados que foram preparados.
zh_hant: 已修改之資源的色彩。

# colors.modified
source: Color for modified resources.
de: Farbe für geänderte Ressourcen.
it: Colore delle risorse modificate.
ja: リソースを改変した場合の配色
pt_br: Cor dos recursos modificados.
zh_hant: 修改資源的顏色。

# colors.renamed
source: Color for renamed or copied resources.
de: Farbe für umbenannte oder kopierte Ressourcen.
it: Colore delle risorse rinominate o copiate.
ja: 名前変更またはコピーされたリソースの色。
pt_br: Cor dos recursos renomeados ou copiados.
zh_hant: 重新命名或已複製資源的色彩。

# colors.conflict
source: Color for resources with conflicts.
de: Farbe für Ressourcen mit Konflikten.
it: Colore delle risorse con conflitti.
ja: リソースが競合する場合の配色
pt_br: Cor dos recursos com conflitos.
zh_hant: 帶有衝突資源的顏色。

# colors.submodule
source: Color for submodule resources.
de: Farbe für Submodul-Ressourcen.
it: Colore delle risorse sottomodulo.
ja: サブモジュールの配色。
pt_br: Cor dos recursos do submódulo.
zh_hant: 子模組資源的顏色

# colors.untracked
source: Color for untracked resources.
de: Farbe für nicht verfolgte Ressourcen.
it: Colore delle risorse non tracciate.
ja: リソースを追跡しない場合の配色
pt_br: Cor dos recursos não controlados.
zh_hant: 未追蹤資源的顏色。

# submenu.commit
source: Commit
it: Esegui commit
ja: コミット
pt_br: Confirmar
zh_hant: 認可

# command.commit
source: Commit
it: Esegui commit
ja: コミット
pt_br: Confirmar
zh_hant: 認可

# command.commitAmend
source: Commit (Amend)
de: Committen (Korrigieren)
it: Commit (modifica)
ja: コミット (修正)
pt_br: Confirmar (Corrigir)
zh_hant: 認可 (修改)

# command.commitAmendNoVerify
source: Commit (Amend, No Verify)
de: Committen (Korrigieren, keine Überprüfung)
it: Esegui commit (modifica, nessuna verifica)
ja: コミット (修正、確認なし)
pt_br: Confirmar (Corrigir, Sem Verificação)
zh_hant: 認可 (修改，未驗證)

# command.commitNoVerify
source: Commit (No Verify)
de: Commit ausführen (keine Überprüfung)
it: Esegui commit (nessuna verifica)
ja: コミット (確認なし)
pt_br: Confirmar (Sem Verificação)
zh_hant: 認可 (未驗證)

# command.commitSigned
source: Commit (Signed Off)
de: Committen (Abgemeldet)
it: Commit (disconnesso)
ja: コミット (サインオフ)
pt_br: Confirmar (Desconectado)
zh_hant: 認可 (已登出)

# command.commitSignedNoVerify
source: Commit (Signed Off, No Verify)
de: Committen (Abgemeldet, keine Überprüfung)
it: Esegui commit (approvazione, nessuna verifica)
ja: コミット (サインオフ、確認なし)
pt_br: Confirmar (Desconectado, Sem Verificação)
zh_hant: 認可 (已登出，未驗證)

# command.commitAll
source: Commit All
de: Commit für alle ausführen
it: Esegui commit di tutto
ja: すべてコミット
pt_br: Confirmar Tudo
zh_hant: 全部認可

# command.commitAllAmend
source: Commit All (Amend)
de: Commit für alle ausführen (Ändern)
it: Esegui commit di tutto (modifica)
ja: すべてコミット (修正)
pt_br: Confirmar Tudo (Corrigir)
zh_hant: 全部認可 (修改)

# command.commitAllAmendNoVerify
source: Commit All (Amend, No Verify)
de: Alle committen (ändern, keine Überprüfung)
it: Esegui commit di tutto (modifica, nessuna verifica)
ja: すべてコミット (修正、確認なし)
pt_br: Confirmar Tudo (Corrigir, Não Verificar)
zh_hant: 全部認可 (修改，未驗證)

# command.commitAllNoVerify
source: Commit All (No Verify)
de: Alle committen (keine Überprüfung)
it: Esegui commit di tutto (nessuna verifica)
ja: すべてコミット (確認なし)
pt_br: Confirmar Todos (Sem Verificação)
zh_hant: 全部認可 (未驗證)

# command.commitAllSigned
source: Commit All (Signed Off)
de: Alle committen (unterzeichnet)
it: Esegui commit di tutto (approvazione)
ja: すべてコミット (Signed Off)
pt_br: Confirmar Tudo (Assinar)
zh_hant: 全部認可 (已簽章)

# command.commitAllSignedNoVerify
source: Commit All (Signed Off, No Verify)
de: Alle committen (abgemeldet, keine Überprüfung)
it: Esegui commit di tutto (approvazione, nessuna verifica)
ja: すべてコミット (サインオフ、確認なし)
pt_br: Confirmar Todos (Assinados, Não Verificar)
zh_hant: 全部認可 (已登出，未驗證)

# command.commitEmpty
source: Commit Empty
de: Leer committen
it: Commit vuoto
ja: 空のコミット
pt_br: Confirmar Vazio
zh_hant: 認可空白

# command.commitEmptyNoVerify
source: Commit Empty (No Verify)
de: Commit leer (keine Überprüfung)
it: Commit vuoto (nessuna verifica)
ja: 空のコミット (確認なし)
pt_br: Confirmar Vazio (Sem Verificação)
zh_hant: 認可空白 (未驗證)

# command.commitStaged
source: Commit Staged
de: Gestagetes committen
it: Esegui commit dei file preparati
ja: ステージング済みをコミット
pt_br: Confirmar Preparadas
zh_hant: 認可暫存

# command.commitStagedAmend
source: Commit Staged (Amend)
de: Gestagetes committen (Ändern)
it: Esegui commit dei file preparati (modifica)
ja: ステージング済をコミット (修正)
pt_br: Confirmar Preparadas (Corrigir)
zh_hant: 認可暫存 (修改)

# command.commitStagedAmendNoVerify
source: Commit Staged (Amend, No Verify)
de: Commit gestaget (ändern, keine Überprüfung)
it: Esegui commit dei file preparati (modifica, nessuna verifica)
ja: ステージング済みをコミット (修正、確認なし)
pt_br: Confirmar Preparadas (Corrigir, Não Verificar)
zh_hant: 認可暫存 (修改，未驗證)

# command.commitStagedNoVerify
source: Commit Staged (No Verify)
de: Commit gestaget (keine Überprüfung)
it: Esegui commit dei file preparati (nessuna verifica)
ja: ステージング済みをコミット (確認なし)
pt_br: Confirmar Preparadas (Sem Verificação)
zh_hant: 認可暫存 (未驗證)

# command.commitStagedSigned
source: Commit Staged (Signed Off)
de: Gestagetes committen (signiert)
it: Esegui commit dei file preparati (approvazione)
ja: コミットしてステージング (サインオフ)
pt_br: Confirmar Preparadas (Assinar)
zh_hant: 認可暫存 (已登出)

# command.commitStagedSignedNoVerify
source: Commit Staged (Signed Off, No Verify)
de: Commit gestaget (abgemeldet, keine Überprüfung)
it: Esegui commit dei file preparati (approvazione, nessuna verifica)
ja: ステージング済みをコミット (サインオフ、確認なし)
pt_br: Confirmar Preparadas (Assinar, Sem Verificação)
zh_hant: 認可暫存 (已登出，未驗證)

# config.enableSmartCommit
source: Commit all changes when there are no staged changes.
de: Alle Änderungen committen, wenn keine gestageten Änderungen vorhanden sind.
it: Eseguire il commit di tutte le modifiche quando non ci sono modifiche preparate.
ja: ステージされた変更がない場合はすべての変更をコミットします。
pt_br: Confirmar todas as alterações quando não houver alterações preparadas.
zh_hant: 無暫存變更時提交所有變更。

# command.timelineCompareWithSelected
source: Compare with Selected
de: Mit Auswahl vergleichen
it: Confronta con selezionati
ja: 選択項目と比較
pt_br: Comparar com o Selecionado
zh_hant: 與選取項目比較

# command.git.acceptMerge
source: Complete Merge
de: Zusammenführen abschließen
it: Completa merge
ja: マージの完了
pt_br: Executar Mesclagem
zh_hant: 完成合併

# command.git.runGitMerge
source: Compute Conflicts With Git
de: Computekonflikte mit Git
it: Conflitti di calcolo con Git
ja: Git とのコンピューティングの競合
pt_br: Calcular conflitos com o Git
zh_hant: 計算與 Git 的衝突

# command.git.runGitMergeDiff3
source: Compute Conflicts With Git (Diff3)
de: Computekonflikte mit Git (Diff3)
it: Conflitti di calcolo con GIT (Diff3)
ja: Git とのコンピューティングの競合 (Diff3)
pt_br: Conflitos de computação com Git (Diff3)
zh_hant: 計算與 Git (Diff3) 的衝突

# config.autoRepositoryDetection
source: Configures when repositories should be automatically detected.
de: Legt fest, in welchen Fällen Repositorys automatisch erkannt werden sollen.
it: Configura quando il repository dovrebbe essere rilevato automaticamente.
ja: レポジトリを自動的に検出するかどうかを構成します。
pt_br: Configura quando os repositórios devem ser detectados automaticamente.
zh_hant: 設定何時自動偵測存放庫。

# config.confirmSync
source: Confirm before synchronizing git repositories.
de: Vor dem Synchronisieren von Git-Repositorys bestätigen.
it: Confermare prima di sincronizzare i repository GIT.
ja: Git リポジトリを同期する前に確認します。
pt_br: Confirmar antes de sincronizar os repositórios git.
zh_hant: 請先確認再同步處理 GIT 存放庫。

# command.continueInLocalClone.qualifiedName
source: Continue Working in New Local Clone
de: Weiterarbeiten im neuen lokalen Klon
it: Continuare a lavorare nel nuovo clone locale
ja: 新しいローカル クローンで作業を続ける
pt_br: Continuar Trabalhando no Novo Clone Local
zh_hant: 繼續在新的 [本機複製] 中工作
