Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# ++CODE++313cc973de4d5d23fd082327d53acce5fc69559e3a717dbac4fde62c7033f1bf
source: Conflict: Deleted By Us
de: Konflikt: von uns gelöscht
it: Conflitto: eliminato da Microsoft
ja: 競合: こちらが削除
pt_br: Conflito: Excluído por Nós
zh_hant: 衝突: 由我們刪除

# ++CODE++c38d012d028807fe8d3ac2fbc2fc2458388aeae57372a45be95c4357f48d3c34
source: Continue Rebase
de: Rebase fortsetzen
it: Continua riassegnazione
ja: リベースを続行する
pt_br: Continuar Troca de base
zh_hant: 繼續重訂基底

# ++CODE++416df53dc1046300db7c7db89015858f86d148ea5e66f0152592e046c04a100d
source: Continuing Rebase...
de: Rebase wird fortgesetzt...
it: Continuazione della riassegnazione...
ja: リベースを続行しています...
pt_br: Continuando troca de base...
zh_hant: 繼續重訂基底...

# ++CODE++c5422e509267a427656ce69d6d0aed53ffcfe5eb313def9a960db7cb5b8c9c4d
source: Could not clone your repository as Git is not installed.
de: Ihr Repository konnte nicht geklont werden, da Git nicht installiert ist.
it: Non è stato possibile clonare il repository perché Git non è installato.
ja: Git がインストールされていないため、リポジトリをクローンできませんでした。
pt_br: Não foi possível clonar seu repositório porque o Git não está instalado.
zh_hant: 因為未安裝 Git，所以無法複製您的存放庫。

# ++CODE++978fa11dc34a758c8d99fce0d36a97740cb8abe19bd39a1be049b57bb9a98e57
source: Create Empty Commit
de: Leeren Commit erstellen
it: Crea commit vuoto
ja: 空のコミットの作成
pt_br: Criar um Commit Vazio
zh_hant: 建立空白認可

# ++CODE++fb35e61360cb5fe2fbdef3c15a4ac4ae3edd46fc19913a84305f8e128b441c3d
source: Create new branch from...
de: Neuen Branch erstellen aus...
it: Crea nuovo ramo da...
ja: 新しい分岐の作成元...
pt_br: Criar ramificação de...
zh_hant: 從以下位置建立新分支...

# ++CODE++3c198f713861e91b8d3bf53ff23b4fd65849b602ba85b3e2397b09aa65597b61
source: Create new branch...
de: Neuen Branch erstellen...
it: Crea nuovo ramo...
ja: 新しい分岐の作成...
pt_br: Criar ramificação...
zh_hant: 建立新分支...

# ++CODE++e0d1b68224bf0b31ef16b206c65b5f8f6b89d18161f4a7cdcb8d0ac8d952549a
source: Current
de: Aktuell
it: Corrente
ja: 現在のマシン
pt_br: Atual
zh_hant: 目前

# ++CODE++d2c753607fd4607a83f71c14f48c474f08562ccb59c23e8799cfebaa2d15c655
source: Current commit message only contains whitespace characters
de: Die aktuelle Commitnachricht enthält nur Leerzeichen.
it: Il messaggio di commit corrente contiene solo spazi vuoti
ja: 現在のコミット メッセージには空白文字のみが含めています
pt_br: A mensagem de confirmação atual contém somente caracteres de espaço em branco
zh_hant: 目前認可訊息只包含空白字元

# ++CODE++06da38448937c5ca3cf8a9a4e91edb8a50fcfb20885e7d93d5019bf591fdc5c0
source: Delete Branch
de: Branch löschen
it: Elimina ramo
ja: ブランチの削除
pt_br: Excluir Ramificação
zh_hant: 刪除分支

# ++CODE++e1e5fe2043bd3003147a785a42a5edddccbf57d465ca32ad0f033cf7b64f04c8
source: Delete File
de: Datei löschen
it: Elimina file
ja: ファイルを削除
pt_br: Excluir Arquivo
zh_hant: 刪除檔案

# ++CODE++93617a8503951c38871d9a8a3152d84ff1671eb5dfe9c240595b24ec55c4492e
source: Delete Files
de: Dateien löschen
it: Elimina file
ja: 複数のファイルを削除
pt_br: Excluir Arquivos
zh_hant: 刪除檔案

# ++CODE++28e18dc9db382d81d5c2e056abe2655575404a55828822b0757419101a346de2
source: Delete file
de: Datei löschen
it: Elimina file
ja: ファイルを削除
pt_br: Excluir arquivo
zh_hant: 刪除檔案

# ++CODE++b48ff39c2e0f5451b9b29b09c2a74d2760db230749ffd48a6e901cc91fef9a8d
source: Deleted
de: Gelöscht
it: Eliminato
ja: 削除済み
pt_br: Excluído
zh_hant: 已刪除

# ++CODE++ecf1d885169c7d720890312e456270950a4fb8436c6c29132559f44398a81641
source: Discard 1 File
de: Eine Datei verwerfen
it: Rimuovi 1 file
ja: 1 つのファイルを破棄
pt_br: Descartar 1 Arquivo
zh_hant: 捨棄1個檔案

# ++CODE++92cbd25a58021e00fde8fe8247b6a62746304c19327ce600b1e3408922d43c10
source: Discard 1 Tracked File
de: 1 verfolgte Datei verwerfen
it: Rimuovi 1 file di cui viene tenuta traccia
ja: 1 つの追跡ファイルを破棄
pt_br: Descartar 1 Arquivo Controlado
zh_hant: 捨棄 1 個追蹤的檔案

# ++CODE++da0cd4de5d64172a4fffefb1068f8644fb1c91e7247d3ad433f2d6b98a2d1a90
source: Discard All {0} Files
de: Alle {0} Dateien verwerfen
it: Rimuovi tutti i {0} file
ja: {0} 個のファイルをすべて破棄
pt_br: Descartar Todos os {0} Arquivos
zh_hant: 捨棄所有 {0} 檔案

# ++CODE++e07e053c2e10b3f1b6aef657d937cd91d45df4e40242788d7d621faea3380c27
source: Discard Changes
de: Änderungen verwerfen
it: Rimuovi modifiche
ja: 変更を破棄
pt_br: Descartar as Alterações
zh_hant: 捨棄變更

# ++CODE++0208f13819883488a07422dacea98808be6cea4cc2e67d5e52b6c3ca33a95113
source: Discard {0} Tracked Files
de: {0} verfolgte Dateien verwerfen
it: Rimuovi {0} file di cui viene tenuta traccia
ja: {0} 個の追跡ファイルを破棄
pt_br: Descartar {0} Arquivos Controlados
zh_hant: 捨棄 {0} 個追蹤的檔案

# ++CODE++ff334811c3daeb430bf1fc25d912064178fbd14eab61e156e8c1c08bc8e7d8ce
source: Don\'t Pull
de: Nicht pullen
it: Non eseguire il pull
ja: プルしない
pt_br: Não Efetuar Pull
zh_hant: 不要提取

# ++CODE++acfa223353d8377425be54cf045adeac692b65ffd91850a365d508179cb64ac5
source: Don\'t Show Again
de: Nicht mehr anzeigen
it: Non visualizzare più questo messaggio
ja: 今後は表示しない
pt_br: Não Mostrar Novamente
zh_hant: 不要再顯示

# ++CODE++64488bcdbc42e52d74ab9bb817297e8e3c66c04011677d381ca0428664bb5f03
source: Download Git
de: Git herunterladen
it: Scarica GIT
ja: Git のダウンロード
pt_br: Baixar Git
zh_hant: 下載 Git

# ++CODE++969ccbd3cf6300ecd5c880459d81ae9027df7517563184a1b8b15282db230621
source: Email
it: Messaggio di posta elettronica
ja: 電子メール
zh_hant: 電子郵件

# ++CODE++975dd75001ae0d7c535f15e85326be3fc636a908ef77dcd64931d0564b64c7f5
source: Enables the following features: {0}
de: Folgende Features werden aktivieren: {0}
it: Abilita le funzionalità seguenti: {0}
ja: 次の機能を有効にします： {0}
pt_br: Habilita os seguintes recursos: {0}
zh_hant: 啟用下列功能: {0}

# ++CODE++f9e38e00f92b08ea1873eb83b3a80656bca1da49a4b862e70d1a34d654a052dd
source: Failed to authenticate to git remote.
de: Fehler bei der Authentifizierung beim Git-Remoterepository.
it: Non è stato possibile eseguire l'autenticazione al repository remoto GIT.
ja: Git リモートに対して認証できませんでした。
pt_br: Falha ao autenticar no remoto do git.
zh_hant: 無法從遠端向 git 驗證。

# ++CODE++f4154fae85d6442f7aa7a5d154396ecb33eedeb2a5b2b66927e0e5caf5d208fb
source: Failed to authenticate to git remote:\n\n{0}
de: Fehler bei der Authentifizierung beim Git-Remoterepository:\n\n{0}
it: Non è stato possibile eseguire l\'autenticazione al repository remoto GIT:\n\n{0}
ja: Git リモートに対して認証できませんでした:\n\n{0}
pt_br: Falha ao autenticar no remoto do git:\n\n{0}
zh_hant: 無法從遠端向 git 驗證:\n\n{0}

# ++CODE++6a66e0c4a1187c2d6f73bfdcb24f18ae955a7605966123ca96e3de6867ab2630
source: File "{0}" was deleted by them and modified by us.\n\nWhat would you like to do?
de: Die Datei „{0}“ wurde von ihnen gelöscht und von uns geändert.\n\nWas möchten Sie tun?
it: Il file \'{0}\' è stato eliminato da altri utenti e modificato dall\'utente corrente.\n\nCome si desidera procedere?
ja: ファイル "{0}" は、他者が削除し、こちらが変更しました。\n\nどのように処理しますか?
pt_br: O arquivo “{0}” foi excluído por eles e modificado por nós.\n\nO que você deseja fazer?
zh_hant: 檔案 "{0}" 已由對方刪除，但由我們修改。\n\n要執行什麼動作?

# ++CODE++46d6d9362c923eaebd6cee4e18bd246f1da95871cf454e96d99d989d2be68cca
source: File "{0}" was deleted by us and modified by them.\n\nWhat would you like to do?
de: Die Datei „{0}“ wurde von uns gelöscht und von ihnen geändert.\n\nWas möchten Sie tun?
it: Il file\'{0}\' è stato eliminato dall\'utente corrente e modificato da altri utenti.\n\nCome si desidera procedere?
ja: ファイル "{0}" は、こちらが削除し、他者が変更しました。\n\nどのように処理しますか?
pt_br: O arquivo "{0}" foi excluído por nós e modificado por eles.\n\nO que você deseja fazer?
zh_hant: 檔案 "{0}" 已由我們刪除，但由對方修改。\n\n要執行什麼動作?

# ++CODE++c801735bdcbaef47f4f9fdc4e6db3ef65f65738dd91850477f7a4c89d4b5b60b
source: Force Checkout
de: Auschecken erzwingen
it: Forza checkout
ja: チェックアウトの強制
pt_br: Forçar o Check-out
zh_hant: 強制簽出

# ++CODE++dea241f37f7b03284af862a9376f0b02d561af0bcaa05f80bec1226bc26c8bca
source: Force push is not allowed, please enable it with the "git.allowForcePush" setting.
de: Push erzwingen ist nicht zulässig. Aktivieren Sie es mit der Einstellung "git.allowForcePush".
it: Il push forzato non è consentito. Per abilitarlo, usare l'impostazione "git.allowForcePush".
ja: 強制的なプッシュは禁止されています。"git.allowForcePush" 設定で有効にしてください。
pt_br: Não é permitido forçar push. Habilite-o com a configuração ''git.allowForcePush''.
zh_hant: 不允許強制更新，請啟用 "git.allowForcePush" 設定。

# ++CODE++a39de9d1a73052f9e82004d14cd2ac6cf1a4da3f959a50b5f5a7a9507c094ef8
source: Git History
de: Git-Verlauf
it: Cronologia GIT
ja: Git 履歴
pt_br: Histórico de Git
zh_hant: Git 歷程記錄

# ++CODE++6030c83165fb700fcca51c74a9940aeefaf8084c612f5b57eea3723737c5f57d
source: Git error
de: Git-Fehler
it: Errore GIT
ja: Git エラー
pt_br: Erro de git
zh_hant: Git 錯誤

# ++CODE++0b6123eb22cd4cf46d32366cda6edad66e902cb5f5865aa4c2a93697a497ca11
source: Git local working changes
de: Lokale Git-Arbeitsänderungen
it: Modifiche di lavoro locali di Git
ja: Git ローカル作業の変更
pt_br: Alterações do trabalho local do Git
zh_hant: Git 本機工作變更

# ++CODE++6a29332d3557881b20eb99f45dcbce35edccdb3f47128fbf67b1795e1b8c75c9
source: Git repositories were found in the parent folders of the workspace or the open file(s). Would you like to open the repositories?
de: Git-Repositorys wurden in den übergeordneten Ordnern des Arbeitsbereichs oder in den geöffneten Dateien gefunden. Möchten Sie die Repositorys öffnen?
it: I repository Git sono stati trovati nelle cartelle padre dell'area di lavoro o dei file aperti. Aprire i repository?
ja: ワークスペースまたは開いているファイルの親フォルダーに Git リポジトリが見つかりました。リポジトリを開きますか?
pt_br: Repositórios Git foram encontrados nas pastas pai do workspace ou nos arquivos abertos. Deseja abrir os repositórios?
zh_hant: 在工作區或開啟檔案的上層資料夾中找到 Git 存放庫。您要開啟存放庫嗎?

# ++CODE++0c3b2f01bfd0bbe594a1e89ebf29c9ba17e93abd909f66330bf0ab7320d2b482
source: HEAD version of "{0}" is not available.
de: Es ist keine HEAD-Version von "{0}" verfügbar.
it: La versione HEAD di "{0}" non è disponibile.
ja: "{0}" の HEAD バージョンは利用できません。
pt_br: A versão CABEÇALHO de ''{0}'' não está disponível.
zh_hant: "{0}" 的 HEAD 版本無法使用。

# ++CODE++7d648f5b47f34afb32946011a07e32176ad966f44ad9efff8380c73dfc5c5b87
source: Ignored
de: Ignoriert
it: Ignorato
ja: 無視
pt_br: Ignorado
zh_hant: 已忽略

# ++CODE++e301820ac83931005088b32674481b184df58276cd0e79f0c8c8f7615dc023a6
source: Incoming
de: Eingehend
it: In ingresso
ja: 受信中
pt_br: Entrada
zh_hant: 傳入

# ++CODE++4bc49b7e3107933d6c3033c90e34518e26bf9af94ce830042b13eee60f0134d6
source: Index Added
de: Index hinzugefügt
it: Indice aggiunto
ja: インデックスの追加
pt_br: Índice Adicionado
zh_hant: 已新增索引

# ++CODE++39520d0f752236ebe985a9ab539075bb3961e0b2b3d54494689e724aa460dbc7
source: Index Copied
de: Index kopiert
it: Indice copiato
ja: インデックスをコピー
pt_br: Índice Copiado
zh_hant: 已複製索引

# ++CODE++606a5aedaa4178761d620b63ca8f7ddabd6cc481415cdbf64bc952f6a3d6fc8b
source: Index Deleted
de: Index gelöscht
it: Indice eliminato
ja: 削除されたインデックス
pt_br: Índice Excluído
zh_hant: 已刪除索引

# ++CODE++26f13b9c8050f9ac86037d900a1aa7e429efa319836c75edcb5eb0857a1da984
source: Index Modified
de: Index geändert
it: Indice modificato
ja: 変更されたインデックス
pt_br: Índice Modificado
zh_hant: 已修改索引

# ++CODE++0fab3d719bfe30418fa5b3301a3d2ea05178de4451bfe358cad5fc22ebdad0e6
source: Index Renamed
de: Index umbenannt
it: Indice rinominato
ja: インデックスの名前変更
pt_br: Índice Renomeado
zh_hant: 已重新命名索引

# ++CODE++905dd9958f630cdc089ae37a56c186841863cb5192c59c886dede1fa4eba71ed
source: Initialize Repository
de: Repository initialisieren
it: Inizializza repository
ja: リポジトリの初期化
pt_br: Inicializar o Repositório
zh_hant: 初始化存放庫

# ++CODE++da5494fdeba5f3b5e1dd5b73c79aeab8c5d28830990fa85d01210710cfc805d5
source: Intent to Add
de: Hinzuzufügende Absicht
it: Finalità da aggiungere
ja: 追加する目的
pt_br: Intenção de Adicionar
zh_hant: 要新增的意圖

# ++CODE++93c86a252e562f412c0322b6348bae591b3c1fe7f09460fb40083f9ec8011981
source: Intent to Rename
de: Absicht zum Umbenennen
it: Finalità di ridenominazione
ja: 名前を変更する意図
pt_br: Intenção de Renomear
zh_hant: 要重新命名的意圖

# ++CODE++96fb1f951270c90a70612cc71ad71290be1afd46011b51131a4954b898d66dcf
source: Invalid branch name
de: Ungültiger Branchname
it: Nome di branch non valido
ja: 無効なブランチ名
pt_br: Nome de ramificação inválido
zh_hant: 分支名稱無效

# ++CODE++cd20f59f1dd9f869d17a79e25727c8fb29fa0fb4514d93857985bde8ea3d0c8a
source: It looks like the current branch "{0}" might have been rebased. Are you sure you still want to pull into it?
de: Es sieht so aus, als wäre der aktuelle Branch "{0}" möglicherweise rebasiert worden. Möchten Sie den Pullvorgang wirklich fortsetzen?
it: Il ramo corrente "{0}" potrebbe essere stato riassegnato. Eseguire comunque il pull nel ramo?
ja: 現在のブランチ "{0}" がリベースされた可能性があります。そこへプルしますか?
pt_br: Parece que a base do branch atual ''{0}'' pode ter sido trocada. Tem certeza de que ainda deseja efetuar pull nele?
zh_hant: 目前的分支 "{0}" 可能已重訂基底。確定仍要提取至其中嗎?

# ++CODE++5d5cabe4050fdd7a47b6188df4bb4137acc7d06474495edcfa62d7a8fc4aad70
source: It looks like the current branch might have been rebased. Are you sure you still want to pull into it?
de: Offenbar wurde für den aktuellen Branch ein Rebase ausgeführt. Möchten Sie ihn dennoch als Ziel für den Pullvorgang verwenden?
it: Il ramo corrente potrebbe essere stato riassegnato. Eseguire comunque il pull in esso?
ja: 現在のブランチがリベースされた可能性があります。そこへプルしますか?
pt_br: Parece que a base do branch atual pode ter sido trocada. Tem certeza de que ainda deseja efetuar pull nele?
zh_hant: 目前的分支可能已重訂基底。確定仍要提取至其中嗎?

# ++CODE++59666b50ef3b41a833f9d754d1880bfcdc934fe14df5930556c87663f39d7de9
source: It\'s not possible to change the commit message in the middle of a rebase. Please complete the rebase operation and use interactive rebase instead.
de: Die Commit-Nachricht kann während der Rebase-Ausführung nicht geändert werden. Verwenden Sie stattdessen den interaktiven Rebase-Vorgang und schließen Sie die Rebase-Ausführung ab.
it: Non è possibile modificare il messaggio di commit durante una riassegnazione. Completare l\'operazione corrente e usare invece una riassegnazione interattiva.
ja: リベースの最中にコミット メッセージは変更できません。リベースの操作を終了してから、代わりに interactive rebase を使用してください。
pt_br: Não é possível alterar a mensagem de confirmação no meio de uma troca de base. Conclua a operação de troca de base e use a troca de base interativa.
zh_hant: 在重訂基底的過程中，無法變更提交訊息。請完成重訂基底作業，並改用互動式重訂基底。

# ++CODE++60c138e94a1d502e1392e9ca62e5393e93e280a7f28e4f5a3ff4a575d56c388b
source: Keep Our Version
de: Unsere Version beibehalten
it: Mantieni la versione dell'utente corrente
ja: 自分 (Our) を維持する
pt_br: Manter Nossa Versão
zh_hant: 保留我們的版本

# ++CODE++e9f8f78f902c9e4bbe0a5c91eb57172bbc53f6698bb4521006df79aa6b280dbe
source: Keep Their Version
de: Deren Version beibehalten
it: Mantieni la versione degli altri utenti
ja: 相手 (Their) を維持する
pt_br: Manter Versão Deles
zh_hant: 保留它們的版本

# ++CODE++8d8cd546b58d91c300d3149ef40b8d98d3061dc38f15ea937d2ed785a3f25771
source: Learn More
de: Weitere Informationen
it: Altre informazioni
ja: 詳細情報
pt_br: Saiba Mais
zh_hant: 深入了解

# ++CODE++e3e4bd64cdeb80cce6901d2b155f16e51b36db5d01952c893be3e7fa3eb1b094
source: Log level: {0}
de: Protokolliergrad: {0}
it: Livello log: {0}
ja: ログ レベル: {0}
pt_br: Nível de log: {0}
zh_hant: 記錄層級: {0}

# ++CODE++fa0f601f537c892e522505a224c5996f94857505214c507f5745273c327b3333
source: Make sure you configure your "user.name" and "user.email" in git.
de: Stellen Sie sicher, dass Sie Ihre "user.name" und "user.email" in Git konfigurieren.
it: Assicurarsi di configurare "user.name" e "user.email" in GIT.
ja: Git の "user.name" と "user.email" を構成していることを確認してください。
pt_br: Verifique se você configurou ''user.name'' e ''user.email'' no git.
zh_hant: 請確認您的 Git "user.name" 及 "user.email"。

# ++CODE++4eaae38d7115a0c0cb42e2c87cc2043f6897eab74e688450588c109cbb2496ed
source: Manage Unsafe Repositories
de: Unsichere Repositorys verwalten
it: Gestire repository non sicuri
ja: 安全でないリポジトリの管理
pt_br: Gerenciar Repositórios Não Seguros
zh_hant: 管理不安全的存放庫

# ++CODE++c08f87c6bf2a44ca177005eb990385dde9b14cc5289bc4420a45c199ec474e90
source: Merge Changes
de: Änderungen zusammenführen
it: Esegui merge delle modifiche
ja: 変更のマージ
pt_br: Mesclar Alterações
zh_hant: 合併變更

# ++CODE++2f77668a9dfbf8d5848b9eeb4a7145ca94c6ed9236e4a773f6dcafa5132b2f91
source: Message
de: Meldung
it: Messaggio
ja: メッセージ
pt_br: Mensagem
zh_hant: 訊息

# ++CODE++ad33f83890a4c1ba0086d4d728279e8e61d185c14352ea3d6663449460aad18d
source: Message (commit on "{0}")
de: Nachricht (Commit auf "{0}")
it: Messaggio (commit in "{0}")
ja: メッセージ ("{0}" でコミット)
pt_br: Mensagem (fazer commit em ''{0}'')
zh_hant: 訊息 (在 "{0}" 上提交)

# ++CODE++2ee8b430941cdf1bf2209d255c8463471ba4c3de2d94129c257ab035a1d42a8e
source: Message ({0} to commit on "{1}")
de: Nachricht ({0} für "{1}" committen)
it: Messaggio ({0} per eseguire il commit in "{1}")
ja: メッセージ ("{1}" でコミットするための{0})
pt_br: Mensagem ({0} para fazer commit em ''{1}'')
zh_hant: 訊息 (要在 "{0}" 上提交 {1})

# ++CODE++f0f141c12a17f52bcd64321cf6969ffbc81f015b584641cd783d89904c1f72ea
source: Message ({0} to commit)
de: Nachricht ({0} für Commit)
it: Messaggio ({0} per eseguire il commit)
ja: メッセージ (コミットするための {0})
pt_br: Mensagem ({0} para confirmação)
zh_hant: 訊息 (要認可的 {0})

# ++CODE++d45c9f6ecdd755947ace0120f734f99da7328ecb87b04c3b10d780117a94c2ed
source: Migrate Changes
de: Änderungen migrieren
it: Eseguire la migrazione delle modifiche
ja: 変更の移行
pt_br: Migrar Alterações
zh_hant: 移轉變更

# ++CODE++e8ce5dcaf408935ff76747226d2e8bee4319a2f593c1d7a838115e56183d1f37
source: Modified
de: Geändert
it: Modificato
ja: 変更済み
pt_br: Modificado
zh_hant: 已修改

# ++CODE++6300ef800bb884295b0b4b35682b75cecd7cc550d202db56d04a0643b8fb873f
source: Never
de: Nie
it: Mai
ja: 行わない
pt_br: Nunca
zh_hant: 永不

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
de: Nein
ja: いいえ
pt_br: Não
zh_hant: 否

# ++CODE++440633c6285d225a6e3849eb5e17f33c608ad0285fdf7acc14f7e4d912516ed9
source: No rebase in progress.
de: Es wird kein Rebase ausgeführt.
it: Non è in corso alcuna riassegnazione.
ja: 進行中のリベースはありません。
pt_br: Não há troca de base em andamento.
zh_hant: 沒有進行中的重訂基底。

# ++CODE++565339bc4d33d72817b583024112eb7f5cdf3e5eef0252d6ec1b9c9a94e12bb3
source: OK
zh_hant: 確定

# ++CODE++e78008c3f3637c142067bbec565bb0d623b5a2113699795765c09e4f95cb7bd0
source: OK, Don\'t Ask Again
de: OK, nicht mehr fragen
it: OK, non visualizzare più questo messaggio
ja: OK、今後は確認しない
pt_br: OK, Não Perguntar Novamente
zh_hant: 確定，不要再詢問

# ++CODE++a863d11492e395445acc633ced9be38f332c9aa0d0607dc83b5ab3b60a6d9fbd
source: OK, Don\'t Show Again
de: OK, nicht mehr anzeigen
it: OK, non visualizzare più
ja: OK、今後は表示しない
pt_br: OK, Não Mostrar Novamente
zh_hant: 確定，不要再顯示

# ++CODE++ed077f3d8125d60dca1979c7133601bd187d47c73ed9975028f677e49e709942
source: Open
de: Öffnen
it: Apri
ja: 開く
pt_br: Abrir
zh_hant: 開啟

# ++CODE++d77d0470fcb6e709dbc646f6ae4b68a4db64162b769b2914a3a760a1bbadb4df
source: Open Comparison
de: Vergleich öffnen
it: Apri confronto
ja: 比較を開く
pt_br: Abrir Comparação
zh_hant: 開啟比較

# ++CODE++893fcb727fc6ee5a7516324e78ec23f7c12b62546a74b0b37f86d7e30d205547
source: Open Git Log
de: Git-Protokoll öffnen
it: Apri log GIT
ja: Git ログを開く
pt_br: Abrir Log do Git
zh_hant: 開啟 Git 記錄

# ++CODE++6fba1de2739c8e7ee835016e3340ef0b6c11d1b7cb2123af7ee23abf7f124682
source: Open Merge
de: Merge öffnen
it: Apri merge
ja: マージを開く
pt_br: Abrir Mesclagem
zh_hant: 開啟合併

# ++CODE++f10c3c817a26227242cc20133608ec65402399011cff683c49aed7ea3b4e5436
source: Open Repositories In Parent Folders
de: Repositorys in übergeordneten Ordnern öffnen
it: Apri repository nelle cartelle padre
ja: 親フォルダーでリポジトリを開く
pt_br: Abrir Repositórios em Pastas Pai
zh_hant: 開啟上層資料夾中的存放庫

# ++CODE++2466923190a5c2d42540382922f01b6091b99ac2253c9eac5a066ccc129fac1d
source: Open Repository
de: Repository öffnen
it: Apri repository
ja: リポジトリを開く
pt_br: Abrir o Repositório
zh_hant: 開啟存放庫

# ++CODE++e8e0ccba8b0da9ab15259028d04ab1bb9e9ae240bae643e8e07c87dae591120b
source: Open in New Window
de: In neuem Fenster öffnen
it: Apri in una nuova finestra
ja: 新しいウィンドウで開く
pt_br: Abrir em uma Nova Janela
zh_hant: 在新視窗中開啟

# ++CODE++4085b549321e7af912c77c7eaf2313790ad7d283eb11d32780764b816c2a3c34
source: Optionally provide a stash message
de: Geben Sie optional eine Stash-Nachricht ein.
it: Specificare un messaggio di accantonamento (facoltativo)
ja: 必要に応じてスタッシュ メッセージを提示する
pt_br: Opcionalmente, forneça uma mensagem stash
zh_hant: 可選擇提供擱置變更訊息

# ++CODE++e7611f0537df5fc5d0177da520628219fccf065a1d4176cfbde2f75d824821f4
source: Passphrase
ja: パスフレーズ
pt_br: Frase Secreta
zh_hant: 複雜密碼

# ++CODE++93abc930718bf1254198727dd8023b30499c5f833319550cdf7a20490a5ee744
source: Pick a branch to pull from
de: Branch für Pull auswählen
it: Selezionare un ramo da cui eseguire il pull
ja: プル元のブランチを選択
pt_br: Selecionar uma ramificação da qual efetuar pull
zh_hant: 揀選要提取的來源分支

# ++CODE++23a1e19a9fdf977e37f940b03ad56faab51a9a907bba6a975e35a707e5469c50
source: Pick a provider to publish the branch "{0}" to:
de: Wählen Sie einen Anbieter aus, um den Branch "{0}" hier zu veröffentlichen:
it: Selezionare un provider in cui pubblicare il ramo "{0}":
ja: ブランチ "{0}" を以下へ発行するプロバイダーを選択する:
pt_br: Selecionar um provedor ao qual publicar o branch ''{0}'' para:
zh_hant: 挑選要對其發佈分支 "{0}" 的提供者:

# ++CODE++3e7c9d7d3ffce6d2931f8f2ec3cb30afce7f4786401f1391b97866c4f8739ccf
source: Pick a remote to publish the branch "{0}" to:
de: Wählen Sie ein Remote-Objekt aus, in dem der Branch "{0}" veröffentlicht werden soll:
it: Selezionare un repository remoto in cui pubblicare il ramo "{0}":
ja: リモートを選んで、ブランチ "{0}" を次の場所に公開します:
pt_br: Selecionar um remoto ao qual publicar o branch ''{0}'' para:
zh_hant: 挑選要對其發佈分支 "{0}" 的遠端:

# ++CODE++9b097971a9f0ce4309cddca492d9689f9e39b5b37cb374442960925f227c0776
source: Pick a remote to pull the branch from
de: Remoteelement zum Pullen des Branch auswählen
it: Selezionare un repository remoto da cui effettuare il pull del ramo
ja: リモートを選んで、ブランチを次からプルします
pt_br: Selecionar um remoto do qual efetuar pull da ramificação
zh_hant: 挑選要將分支提取出的遠端

# ++CODE++e60dcf7dfc306478e6b869345c50ad6ac41a4b2697c8c449ab03e2b74ed81754
source: Pick a remote to remove
de: Remote zum Entfernen auswählen
it: Scegliere un repository remoto da rimuovere
ja: 削除するリモートを選択
pt_br: Selecionar um remoto para remover
zh_hant: 挑選要移除的遠端存放庫

# ++CODE++1db2709f2fc57a3e38685eeb075e00235bad5ee2538a98973dc2f5cb6b09c4ec
source: Pick a repository to mark as safe and open
de: Wählen Sie ein Repository aus, das als sicher markiert werden soll und öffnen Sie es
it: Selezionar un repository da contrassegnare come sicuro e aprir
ja: 安全とマークして開くリポジトリを選択してください
pt_br: Escolha um repositório para marcar como seguro e aberto
zh_hant: 挑選標記為安全的存放庫並開啟

# ++CODE++6e2c8ec7bb53a72cb08507098e1cd6685bb5b0defbf4bb4751a91f73fd4ab061
source: Pick a repository to open
de: Zu öffnendes Repository auswählen
it: Selezionare un repository da aprire.
ja: 開くリポジトリを選択します。
pt_br: Selecione um repositório para abrir
zh_hant: 挑選要開啟的存放庫

# ++CODE++43cfba061c66b48d18654d4630284c8f93f76fd551a761506e76d04100be78d2
source: Pick a repository to reopen
de: Zu öffnendes Repository auswählen
it: Seleziona un repository da riaprire
ja: 再度開くリポジトリを選択する
pt_br: Escolha um repositório para reabrir
zh_hant: 挑選要重新開啟的存放庫

# ++CODE++4409fc12fb9667fbb6713fe6c40de5a69128fafb717e7f925f9829d842769a66
source: Pick a stash to apply
de: Stash zum Anwenden auswählen
it: Scegli un accantonamento da applicare
ja: 適用するスタッシュを選択してください
pt_br: Selecionar um stash para aplicar
zh_hant: 取回挑選的擱置套用變更

# ++CODE++8c4d9b659312323368fa1e554a7aaf11f36cb27249a24c81435d66ffb3633e36
source: Pick a stash to drop
de: Zu löschenden Stash auswählen
it: Selezionare un accantonamento da rimuovere
ja: ドロップするスタッシュを選択する
pt_br: Selecionar um stash para soltar
zh_hant: 挑選要卸除的隱藏項目

# ++CODE++e7ae4efa4b2f3d2f0dfc06be57bd0d9b4a693241f232b00f301497beb274a7eb
source: Pick a stash to pop
de: Wählen Sie einen Stash aus, für den ein Pop ausgeführt werden soll.
it: Scegli un accantonamento da prelevare
ja: ポップするスタッシュを選択する
pt_br: Selecionar um stash para aplicar e remover
zh_hant: 取回挑選的擱置變更
