Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# ++CODE++a93447605ef4b2cc8eda934a1e9af7ad57f8d2d2e5dc1defbaa121ed13550e57
source: $(info) Remote "{0}" has no tags.
de: $(info) Remote "{0}" hat keine Tags.
it: $(info) "{0}" remoto non contiene tag.
ja: $(info) リモート「{0}」にタグがありません。
pt_br: $(info) O remoto "{0}" não possui marcas.
zh_hant: $(info) 遠端 "{0}" 沒有標籤。

# ++CODE++d33636398d4d33c00d489b6b7a46b224e0b779fcf33fd6c3e3d6e40c2933373a
source: $(info) This repository has no tags.
de: $(info) Dieses Repository hat keine Tags.
it: $(info) Non esistono tag per questo repository.
ja: $(info) このリポジトリにはタグがありません。
pt_br: $(info) Este repositório não tem marcas.
zh_hant: $(info) 此存放庫沒有標籤。

# ++CODE++96ab5dc0020f2126bcb175ec9f0fe83b01c1b357fd2a9f0a3afc3d1f2860ee85
source: "{0}" has fingerprint "{1}"
de: "{0}" hat Fingerabdruck "{1}"
it: "{0}" ha l'impronta digitale "{1}"
ja: "{0}" のフィンガープリントは "{1}" です
pt_br: "{0}" tem impressão digital "{1}"
zh_hant: 「{0}」具有指紋「{1}」。

# ++CODE++59dacc1ec703cf2cd4c3f087ed4ff2d7da089b9634de61200779a5007bac6af0
source: A branch named "{0}" already exists
de: Ein Branch mit dem Namen "{0}" ist bereits vorhanden.
it: Esiste già un ramo denominato "{0}"
ja: ブランチ名 "{0}" は既に存在します
pt_br: Já existe um branch com o nome ''{0}''
zh_hant: 分支名稱 "{0}" 已經存在

# ++CODE++621321bc491d0f5f5702b38ee93f4b2f0b07bb9f72e3c1ad3ce06ce6b0f06219
source: A git repository was found in the parent folders of the workspace or the open file(s). Would you like to open the repository?
de: Ein Git-Repository wurde in den übergeordneten Ordnern des Arbeitsbereichs oder in den geöffneten Dateien gefunden. Möchten Sie das Repository öffnen?
it: È stato trovato un repository Git nelle cartelle padre dell'area di lavoro o dei file aperti. Aprire il repository?
ja: ワークスペースまたは開いているファイルの親フォルダーに Git リポジトリが見つかりました。リポジトリを開きますか?
pt_br: Um repositório Git foi encontrado nas pastas pai do workspace ou nos arquivos abertos. Deseja abrir o repositório?
zh_hant: 在工作區或開啟檔案的上層資料夾中找到一個 Git 存放庫。您要開啟存放庫嗎?

# ++CODE++1da1a00fd75ac0a5f8e6d1c1649dec3b58f5c987faaffe73078f7296a636312f
source: Absolute paths not supported in "git.scanRepositories" setting.
de: Absolute Pfade werden in der Einstellung "git.scanRepositories" nicht unterstützt.
it: I percorsi assoluti non sono supportati nell'impostazione "git.scanRepositories".
ja: "git.scanRepositories" 設定は絶対パスをサポートしていません。
pt_br: Não há suporte para caminhos absolutos na configuração ''git. scanRepositories''.
zh_hant: "git.scanRepositories" 設定中不支援絕對路徑。

# ++CODE++6fa5252bce4290bcd9ff56fe10025f8bdfc5d4e24691f6fa68f27ed431c063a2
source: Add Remote
de: Remoterepository hinzufügen
it: Aggiungi repository remoto
ja: リモートを追加する
pt_br: Adicionar Remoto
zh_hant: 新增遠端存放庫

# ++CODE++060c966a30504cab8cdc4cd05de72451e3a644e0bfe14080fc49722e00e93f75
source: Add a new remote...
de: Neues Remoterepository hinzufügen...
it: Aggiungi un nuovo computer remoto...
ja: 新しいリモートを追加...
pt_br: Adicionar um novo remoto...
zh_hant: 新增遠端...

# ++CODE++d5eca92389f946b04241308e4a3b9b92fc39429ee9348a6c24448dc1a4b24c6f
source: Add remote from URL
de: Remoterepository aus URL hinzufügen
it: Aggiungi repository remoto da URL
ja: URL からリモートを追加する
pt_br: Adicionar remoto da URL
zh_hant: 從 URL 新增遠端存放庫

# ++CODE++d6641e7833cbdcd1456edcd6d584a99f9d005f5cd0b4c8bbcbf18099e680f089
source: Add remote from {0}
de: Remoterepository aus {0} hinzufügen
it: Aggiungi repository remoto da {0}
ja: {0} からリモートを追加する
pt_br: Adicionar remoto de {0}
zh_hant: 從 {0} 新增遠端存放庫

# ++CODE++de161ac4087726413ce474f53279a95dc36167a2274bb58721f8720b87bfd611
source: Add to Workspace
de: Zum Arbeitsbereich hinzufügen
it: Aggiungi all'Area di Lavoro
ja: ワークスペースに追加
pt_br: Adicionar ao Workspace
zh_hant: 新增到工作區

# ++CODE++b9f653e0e3af44de571212f85ec3f499df207e29bd1f28ab02cb527899690926
source: All Repositories
de: Alle Repositorys
it: Tutti gli repository
ja: すべてのリポジトリ
pt_br: Todos os Repositórios
zh_hant: 所有存放庫

# ++CODE++de9f057a471cdb8d3b082719bdc7ad2031788d042947349723fa83c9d13a517a
source: Always
de: Immer
it: Sempre
ja: 常に行う
pt_br: Sempre
zh_hant: 永遠

# ++CODE++2c707611079d56814a3db49f113e4b83c4825cc85ed4a25ec42c3d93196a4b0b
source: Always Pull
de: Immer pullen
it: Esegui sempre il pull
ja: 常にプル
pt_br: Sempre Efetuar Pull
zh_hant: 一律提取

# ++CODE++4d9f6cfd4b0c13b17c73c16f9ad939310ef950e9e6d5a20ecf0a24663669d8be
source: Are you sure you want to DELETE {0} files?\nThis is IRREVERSIBLE!\nThese files will be FOREVER LOST if you proceed.
de: Möchten Sie {0} Dateien LÖSCHEN?\nDieser Vorgang ist UNUMKEHRBAR!\nWenn Sie fortfahren, gehen diese Dateien DAUERHAFT VERLOREN.
it: ELIMINARE {0} file? \nQuesta operazione è IRREVERSIBILE.\nSe si procede, questi file andranno PERSI DEFINITIVAMENTE.
ja: {0} 個のファイルを削除しますか?\nこれは元に戻すことができません。\n続行すると、このファイルは完全に失われます。
pt_br: Tem certeza de que deseja EXCLUIR {0} arquivos?\nIsso é IRREVERSÍVEL!\nEste arquivo será PERDIDO PARA SEMPRE.
zh_hant: 確定要刪除 {0} 個檔案嗎?\n此動作無法復原!\n如果繼續，這些檔案會永遠遺失。

# ++CODE++405467178639c4f62d3a56a1ae70edb4b6a2526bcc4f3dbc8ee8b34e5f49e6c0
source: Are you sure you want to DELETE {0}?\nThis is IRREVERSIBLE!\nThis file will be FOREVER LOST if you proceed.
de: Möchten Sie {0} LÖSCHEN?\nDieser Vorgang ist UNUMKEHRBAR!\nWenn Sie fortfahren, geht die Datei DAUERHAFT VERLOREN.
it: ELIMINARE {0}? \nQuesta operazione è IRREVERSIBILE.\nSe si procede, questo file andrà PERSO DEFINITIVAMENTE.
ja: {0} を削除しますか?\nこれは元に戻すことはできません。\n続行すると、このファイルは完全に失われます。
pt_br: Tem certeza de que deseja EXCLUIR {0}?\nIsso é IRREVERSÍVEL!\nEste arquivo será PERDIDO PARA SEMPRE.
zh_hant: 確定要刪除 {0} 嗎?\n此動作無法回復!\n此檔案將會永久遺失。

# ++CODE++46d379e48de8077187857870eaed5866f00e7d88fee7d4f6ab609ca34912c244
source: Are you sure you want to continue connecting?
de: Möchten Sie die Verbindungsherstellung fortsetzen?
it: Continuare la connessione?
ja: 接続を続行しますか?
pt_br: Tem certeza de que deseja continuar a se conectar?
zh_hant: 確定要繼續連線嗎?

# ++CODE++ffb8582a7ae040adfcc7adbee5a8207a55754268d09fa3b06b21a86c0893b609
source: Are you sure you want to create an empty commit?
de: Möchten Sie wirklich einen leeren Commit erstellen?
it: Creare un commit vuoto?
ja: 空のコミットを生成しますか?
pt_br: Tem certeza de que deseja criar uma confirmação vazia?
zh_hant: 確實要建立空白認可嗎?

# ++CODE++ec1000557d338870dea0e872589afc8fd1758ab4bf53a9fa2721bc8ec9a3261e
source: Are you sure you want to discard ALL changes in {0} files?\nThis is IRREVERSIBLE!\nYour current working set will be FOREVER LOST if you proceed.
de: Möchten Sie ALLE Änderungen in {0} Dateien verwerfen?\nDieser Vorgang ist UNUMKEHRBAR!\nWenn Sie fortfahren, geht Ihr aktueller Arbeitssatz DAUERHAFT VERLOREN.
it: Rimuovere TUTTE le modifiche apportate in {0} file?\nQuesta operazione è IRREVERSIBILE.\nSe si procede, il working set corrente andrà PERSO DEFINITIVAMENTE.
ja: {0} 個のファイルのすべての変更を破棄してもよろしいですか?\nこれは元に戻すことができません。\n続行すると、現在のワーキング セットは完全に失われます。
pt_br: Tem certeza de que deseja descartar TODAS as alterações nos {0} arquivos?\nIsso é IRREVERSÍVEL!\nSeu conjunto de trabalho atual será PERDIDO PARA SEMPRE.
zh_hant: 確定要捨棄 {0} 個檔案中的所有變更嗎?\n此動作無法回復!\n若繼續，您目前的工作集將會永久遺失。

# ++CODE++2169b04f53a8d7b7c06071bc23579d940de5187c1f3e3df2dd4bbf9724f1e4e3
source: Are you sure you want to discard changes in {0} files?
de: Möchten Sie wirklich Änderungen in {0} Dateien verwerfen?
it: Rimuovere le modifiche in {0} file?
ja: {0} 個のファイルの変更内容を破棄しますか?
pt_br: Tem certeza de que deseja descartar as alterações nos {0} arquivos?
zh_hant: 確定要捨棄 {0} 檔案中的變更嗎?

# ++CODE++f8a5199a5d46ea80a9e9b2626e8181906ca21c5a37e2425379945161e76f6a6f
source: Are you sure you want to discard changes in {0}?
de: Möchten Sie die Änderungen in {0} wirklich verwerfen?
it: Rimuovere le modifiche in {0}?
ja: {0} の変更を破棄しますか?
pt_br: Tem certeza de que deseja descartar as alterações em {0}?
zh_hant: 確定要捨棄 {0} 中的變更嗎?

# ++CODE++6f875b4f8d4f7d28e6dc570891696be992d21c501c1d04ae0a91adb407418b9d
source: Are you sure you want to drop ALL stashes? There are {0} stashes that will be subject to pruning, and MAY BE IMPOSSIBLE TO RECOVER.
de: Sind Sie sich sicher, dass Sie ALLE Stashes löschen möchten? Es sind {0} Stashes vorhanden, die gelöscht werden müssen und MÖGLICHERWEISE NICHT WIEDERHERGESTELLT werden können.
it: Rimuovere TUTTI gli accantonamenti? Sono presenti {0} accantonamenti che verranno eliminati e POTREBBERO ESSERE IMPOSSIBILI DA RECUPERARE.
ja: すべてのスタッシュを削除しますか? 削除の対象となる可能性のある {0} 個のスタッシュがあり、それらは回復できない可能性があります。
pt_br: Tem certeza de que deseja remover TODOS os stashes? Existem {0} stashes que estarão sujeitos a remoção e PODEM SER IMPOSSÍVEIS DE RECUPERAR.
zh_hant: 確定要卸除所有隱藏項目嗎? 有 {0} 個隱藏項目將需要剪除，可能無法復原。

# ++CODE++24ab570db1c20d8c4ec76c5a64104f95d1ddff931a4194f0c0f975a22a5df50d
source: Are you sure you want to drop ALL stashes? There is 1 stash that will be subject to pruning, and MAY BE IMPOSSIBLE TO RECOVER.
de: Sind Sie sich sicher, dass Sie ALLE Stashes löschen möchten? Es ist 1 Stash vorhanden, der gelöscht werden muss und MÖGLICHERWEISE NICHT WIEDERHERGESTELLT werden kann.
it: Rimuovere TUTTI gli accantonamenti? È presente 1 accantonamento che verrà eliminato e POTREBBE ESSERE IMPOSSIBILE DA RECUPERARE.
ja: すべてのスタッシュを削除しますか? 削除の対象となる可能性のある 1 個のスタッシュがあり、それらは回復できない可能性があります。
pt_br: Tem certeza de que deseja remover TODOS os stashes? Há 1 estoque que estará sujeito a remoção e PODE SER IMPOSSÍVEL DE RECUPERAR.
zh_hant: 確定要卸除所有隱藏項目嗎? 有 1 個隱藏項目將需要剪除，可能無法復原。

# ++CODE++76f1fe23e2bbf8ac3061a3fdd5bd60802fcf476e1b2ee914f93825bd1b0faf70
source: Are you sure you want to drop the stash: {0}?
de: Möchten Sie den folgenden Stash löschen: {0}?
it: Rimuovere l'accantonamento {0}?
ja: スタッシュ {0} を削除しますか?
pt_br: Tem certeza de que deseja remover o stash: {0}?
zh_hant: 確定要卸除隱藏項目 {0} 嗎?

# ++CODE++32961fc63b06971d43dae40be139f80907bbbff6767b9b2f49269adc85416813
source: Are you sure you want to restore {0} files?
de: Möchten Sie {0} Dateien wirklich wiederherstellen?
it: Ripristinare {0} file?
ja: {0} 個のファイルを復元しますか?
pt_br: Tem certeza de que deseja restaurar {0} arquivos?
zh_hant: 確定要還原 {0} 檔案嗎?

# ++CODE++c88929a2d06f38f89607f487372203d45323cf7b8af3ccaedcb18de0e25f4e1a
source: Are you sure you want to restore {0}?
de: Möchten Sie {0} wirklich wiederherstellen?
it: Ripristinare {0}?
ja: {0} を復元しますか?
pt_br: Tem certeza de que deseja restaurar {0}?
zh_hant: 確定要還原 {0} 嗎?

# ++CODE++329f9a037f3c5a986261e6a6e542e87bfa0ee72b98c08c0345a67fbe360f935c
source: Are you sure you want to stage {0} files with merge conflicts?
de: Möchten Sie {0} Dateien mit Mergingkonflikten bereitstellen?
it: Preparare per il commit {0} file con conflitti di merge?
ja: マージの競合がある {0} 個のファイルをステージしてもよろしいですか?
pt_br: Tem certeza de que deseja preparar {0} arquivos com conflitos de mesclagem?
zh_hant: 確定要暫存 {0} 個有合併衝突的檔案嗎?

# ++CODE++d0d9c64e1041439f769f99f8c2e321f3c0448095a9d175f2dbb9a422e0de437f
source: Are you sure you want to stage {0} with merge conflicts?
de: Möchten Sie {0} mit Mergingkonflikten bereitstellen?
it: Preparare per il commit {0} con conflitti di merge?
ja: マージの競合がある {0} をステージしてもよろしいですか?
pt_br: Tem certeza de que deseja preparar {0} com conflitos de mesclagem?
zh_hant: 確定要暫存有合併衝突的 {0} 嗎?

# ++CODE++fca24e51f77ed30ee8b875dba3000717e817f65dacb9130a9b1f1dffe8fdc679
source: Ask Me Later
de: Erneut nachfragen
it: Chiedimelo in seguito
ja: 後で通知する
pt_br: Pergunte-me Mais Tarde
zh_hant: 稍後詢問我

# ++CODE++06f6bb7108ffdb5caf844b4538b5ec8f44cc1b3bc6b577624d32fc57eff9fe3f
source: Branch name
it: Nome ramo
ja: ブランチ名
pt_br: Nome da ramificação
zh_hant: 分支名稱

# ++CODE++69c5b417453bbe27e9b739db7bbb93c3ee3b7a3698a808d28fa6115e685c36f7
source: Branch name needs to match regex: {0}
de: Der Name des Branches muss mit RegEx übereinstimmen: {0}
it: Il nome del ramo deve corrispondere all'espressione regex: {0}
ja: ブランチ名は次の正規表現に一致する必要があります: {0}
pt_br: O nome da ramificação precisa corresponder ao regex: {0}
zh_hant: 分支名稱需要匹配 正規表達式: {0}

# ++CODE++fc84c23a4b9614dda0c2bff6659a5b1fdd3d211de84fe26b42e79efc1d95dcef
source: Can\'t push refs to remote. Try running "Pull" first to integrate your changes.
de: Verweise können nicht per Push an remote übertragen werden. Führen Sie zunächst „Pull“ aus, um Ihre Änderungen zu integrieren.
it: Impossibile fare push dei ref su remoto. Provare a eseguire un "Pull" prima, per integrare le modifiche.
ja: 参照仕様をリモートにプッシュできません。最初に "Pull" を実行して変更を統合してください。
pt_br: Não é possível efetuar push de refs para o remoto. Tente executar “Pull” primeiro para integrar as alterações.
zh_hant: 無法將參考推送到遠端。請先嘗試執行「提取」以整合您的變更。

# ++CODE++9409f5afddffd4a93106de025d9682aecf16664dea804f2e6401b8464a5584dc
source: Can\'t undo because HEAD doesn\'t point to any commit.
de: Die Aktion kann nicht rückgängig gemacht werden, da HEAD nicht auf einen Commit verweist.
it: Non è possibile annullare l\'operazione perché HEAD non fa riferimento ad alcun commit.
ja: HEAD が任意のコミットを明示しないため、元に戻すことはできません。
pt_br: Não é possível desfazer porque HEAD não aponta para nenhuma confirmação.
zh_hant: 因為 HEAD 未指向任何提交，所以無法復原。

# ++CODE++bbd4b6a86bc65b6ac8e79e97afc61499158edb40f7bb404c70637b46d80a7ad2
source: Changes
de: Änderungen
it: Modifiche
ja: 変更
pt_br: Alterações
zh_hant: 變更

# ++CODE++c393643a0d2b8afb59b5368249e1aa94ac44dbd6aab25347a4c8788acf7065a1
source: Checking Out Branch/Tag...
de: Verzweigung/Tag wird ausgecheckt...
it: Estrazione ramo/tag in corso...
ja: ブランチまたはタグをチェックアウトしています...
pt_br: Fazendo check-out do branch/tag...
zh_hant: 正在簽出分支/標籤...

# ++CODE++06c1c85316f574170dfd57c5f7fde4af263c41616826fe806c2e032cc4ffed0a
source: Checking Out Changes...
de: Änderungen werden ausgecheckt...
it: Estrazione delle modifiche in corso...
ja: 変更をチェックアウトしています...
pt_br: Verificando Alterações...
zh_hant: 正在簽出變更...

# ++CODE++870cef993507d1e51e03f108fccd4ba158542d9d3617e0d6065fa9ff2957fea8
source: Checkout Branch/Tag...
de: Verzweigung/Tag auschecken...
it: Eseguire il checkout del ramo/tag...
ja: ブランチまたはタグのチェックアウト...
pt_br: Fazer Check-Out do Branch/Tag...
zh_hant: 簽出分支/標籤...

# ++CODE++3de23bd5c86856018b0b9b70b96e257b66c8efce795c7864e6a68c779464b25e
source: Checkout detached...
de: Getrennte auschecken...
it: Checkout scollegato...
ja: チェックアウトがデタッチされました...
pt_br: Check-out desanexado...
zh_hant: 簽出已中斷連結...

# ++CODE++ef12959262a90a02838d73d524e3dae6a0271a013f2017051508ce526016175d
source: Choose Folder...
de: Ordner auswählen...
it: Scegli cartella...
ja: フォルダーを選択...
pt_br: Escolher Pasta...
zh_hant: 選擇資料夾...

# ++CODE++339efbb5f4e6a1cb79b21d625f068b11022acd5e37857d396d4d2a5fa5fce451
source: Choose a folder to clone {0} into
de: Wählen Sie einen Ordner aus, in den {0} geklont werden soll.
it: Scegliere una cartella in cui clonare {0}
ja: {0} を複製するフォルダーを選択してください
pt_br: Escolha uma pasta para clonar {0} em
zh_hant: 選擇要複製 {0} 的資料夾

# ++CODE++61cc7bd271a5a5b8784320285c1920a502420a5bef95f8a159323ddd4064a820
source: Choose a repository
de: Repository auswählen
it: Scegli un repository
ja: リポジトリの選択
pt_br: Escolher um repositório
zh_hant: 請選擇儲存庫

# ++CODE++f0b79e95174d85877c16dd82f0c4d4d6f36a31c31c4b47419039da94dbd22ddd
source: Choose which repository to clone
de: Wählen Sie aus, welches Repository geklont werden soll.
it: Scegliere il repository da clonare
ja: プルするリポジトリを選択する
pt_br: Escolha qual repositório clonar
zh_hant: 選擇要複製的存放庫

# ++CODE++d425c4cb46b4dbd6b73ee7bc369b63795cefbe0702c041f581fc0be71739c4b5
source: Clone from URL
de: Repository-URL
it: URL del repository
ja: リポジトリの URL
pt_br: Clonar da URL
zh_hant: 存放庫 URL

# ++CODE++58987b3663ca5a076846d352605196819f81c5e118d93937d9480b26520120d7
source: Clone from {0}
de: Aus „{0}“ klonen
it: Clona da {0}
ja: {0} から複製
pt_br: Clonar de {0}
zh_hant: 從 {0} 複製

# ++CODE++dc4a4db67704a975c2d0d65338d136d6f9ad7336dec08ffe2dac1e42b42f21d0
source: Cloning git repository "{0}"...
de: Git-Repository "{0}" wird geklont...
it: Clonazione del repository Git "{0}"...
ja: Git リポジトリ "{0}" を複製しています...
pt_br: Clonando o repositório git ''{0}''...
zh_hant: 正在複製 Git 儲存庫 "{0}"...

# ++CODE++82a9c46ffa4789945d9f2359d75891558ef6faa8dee09e4b25e4e0597704f5bd
source: Commit
it: Esegui commit
ja: コミット
pt_br: Confirmar
zh_hant: 認可

# ++CODE++d0018212c7ec56f7dec88df64cea48c03cd22fb7294f5a731061fb6fe037c171
source: Commit & Push Changes
de: Committen und Änderungen pushen
it: Commit e push delle modifiche
ja: 変更点をコミットしてプッシュ
pt_br: Confirmar e Enviar Alterações por Push
zh_hant: 提交與推送變更

# ++CODE++8ee870c3b9de2b0f27c0b858a94a0d8b6e605caf6c1a481c5ee1fe1cafd73cd5
source: Commit & Sync Changes
de: Committen und Änderungen synchronisieren
it: Commit e sincronizzazione delle modifiche
ja: 変更点をコミットして同期
pt_br: Confirmar e Sincronizar Alterações
zh_hant: 提交與同步變更

# ++CODE++6ead59e71e458fb4011c59193f4aca9b0c9aa84ae5be108386fbbf1527973788
source: Commit Anyway
de: Commit dennoch ausführen
it: Eseguire comunque il commit
ja: このままコミット
pt_br: Confirmar mesmo assim
zh_hant: 仍要提交

# ++CODE++749e00cf6618bc6ef3d0fbe34d822881466a634f5c7b85d166df2fb1460f0056
source: Commit Changes
de: Änderungen committen
it: Eseguire il commit delle modifiche
ja: 変更点のコミット
pt_br: Confirmar Alterações
zh_hant: 認可變更

# ++CODE++f1902e6bba725c6d3fcf51683aabc4686fb2a0f0dd682e1d6a9adf32fa0441d9
source: Commit Changes on "{0}"
de: Änderungen an "{0}" committen
it: Esegui il commit delle modifiche su "{0}"
ja: "{0}" で変更点をコミットする
pt_br: Confirmar Alterações em "{0}"...
zh_hant: 在「{0}」上提交變更

# ++CODE++2a8cf21232f60e18a2463520f642e8744cbb02e52bf28da24679207e4302b447
source: Commit Changes to New Branch
de: Commit der Änderungen für neue Verzweigung ausführen
it: Eseguire il commit delle modifiche apportate a un nuovo ramo
ja: 新しいブランチに変更をコミットする
pt_br: Confirmar Alterações na Nova Ramificação
zh_hant: 提交新分支的變更

# ++CODE++cb039e43bfd1824728db88aee47282a1362819ca8ccbfec5b311ee5af0e89760
source: Commit Hash
it: Hash del commit
ja: コミット ハッシュ
pt_br: Fazer Commit do Hash
zh_hant: 認可雜湊

# ++CODE++26306d203c4a6f1a77f32cd065d7d11593ba0c7a9b5c52c188b98f22b620941f
source: Commit message
de: Commit-Nachricht
it: Messaggio di commit
ja: コミット メッセージ
pt_br: Confirmar mensagem
zh_hant: 認可訊息

# ++CODE++853333402637451d6aa3b25ece807151fc432e65654ef1a92683c08d2f469a08
source: Commit operation was cancelled due to empty commit message.
de: Der Commitvorgang wurde aufgrund einer leeren Commitnachricht abgebrochen.
it: L'operazione di commit è stata annullata a causa di un messaggio di commit vuoto.
ja: コミット メッセージが空だったため、コミット操作がキャンセルされました。
pt_br: A operação de confirmação foi cancelada devido à mensagem de confirmação vazia.
zh_hant: 提交作業已取消，因為提交訊息為空白。

# ++CODE++c561966032532f5cb4e661520907ce9195227eab5a7a8502ed432c65d2cec33c
source: Commit to New Branch & Push Changes
de: Commit an neuer Verzweigung ausführen und Änderungen mit Push übertragen
it: Eseguire commit in un nuovo ramo e push delle modifiche
ja: 新しいブランチにコミットして変更をプッシュする
pt_br: Confirmar Nova Ramificação e Alterações por Push
zh_hant: 提交新的分支與推送變更

# ++CODE++3807b76456b337798395543fd7f71add47058cc837ec3ce97557869b96a5a178
source: Commit to New Branch & Synchronize Changes
de: Commit an neuer Verzweigung ausführen und Änderungen synchronisieren
it: Esegui il commit in un nuovo ramo e sincronizza le modifiche
ja: 新しいブランチへのコミットと変更の同期
pt_br: Confirmar no Novo Branch e Sincronizar Alterações
zh_hant: 提交至新的分支並同步處理變更

# ++CODE++c5803c644368982b5ba18930ba87da76d777035a01c0404d0a738689513da3c1
source: Commit to a New Branch
de: Commit für eine neue Verzweigung ausführen
it: Eseguire il commit in un nuovo ramo
ja: 新しいブランチにコミットする
pt_br: Fazer commit em um novo branch
zh_hant: 提交新的分支

# ++CODE++d713d959ee6b9ef81c29bf51aa9a1e02cd00557b1d256630a191495aef81788b
source: Commits without verification are not allowed, please enable them with the "git.allowNoVerifyCommit" setting.
de: Commits ohne Überprüfung sind nicht zulässig. Aktivieren Sie sie mit der Einstellung "git.allowNoVerifyCommit".
it: I commit senza verifica non sono consentiti. Abilitarli con l'impostazione "git.allowNoVerifyCommit".
ja: 確認なしのコミットは許可されていません。"git.allowNoVerifyCommit" 設定を使用して有効にしてください。
pt_br: Commits sem verificação não são permitidos, habilite-os com a configuração 'git.allowNoVerifyCommit'.
zh_hant: 不允許未經驗證的提交，請使用 "git.allowNoVerifyCommit" 設定加以啟用。

# ++CODE++222889674324947cdb3d7362d9c932658d6035ca96fa1b2d03e8243c2a494ebe
source: Committing & Pushing Changes...
de: Commit wird ausgeführt und Änderungen werden per Push übertragen...
it: Commit e push delle modifiche in corso...
ja: 変更点をコミットしてプッシュしています...
pt_br: Confirmando e enviando alterações por push...
zh_hant: 正在提交並推送變更...

# ++CODE++0670568e2bce6ac7ba3dd75805187f7e4b7bf4660f663ce69edc04bcddaa6b79
source: Committing & Synchronizing Changes...
de: Commit wird ausgeführt und Änderungen werden synchronisiert...
it: Esecuzione del commit e sincronizzazione delle modifiche in corso...
ja: コミットをして変更を同期しています...
pt_br: Confirmando e Sincronizando Alterações...
zh_hant: 正在提交並同步處理變更...

# ++CODE++094f485ef9934983ca0d9a7980a869fbf0b1cdc609a840d1eb2f0a13dacd8c11
source: Committing Changes to New Branch...
de: Committen von Änderungen an neuer Verzweigung wird ausgeführt...
it: Esecuzione del commit delle modifiche nel nuovo ramo in corso...
ja: 新しいブランチに変更をコミットしています...
pt_br: Confirmando Alterações no Novo Branch...
zh_hant: 正在提交對新分支的變更...

# ++CODE++e00dcd402be4da03cd33575153acf4ae2f39273fecefe7c78f13b743f4ca887a
source: Committing Changes...
de: Änderungen werden committet...
it: Commit delle modifiche in corso...
ja: 変更点をコミットしています...
pt_br: Confirmando Alterações...
zh_hant: 正在認可變更...

# ++CODE++7e9af1cefa5907c0ad11ae3d77a1116494026ffc9419dc3f9d51eee1e5c0f87c
source: Committing to New Branch & Pushing Changes...
de: Committen an neuer Verzweigung wird ausgeführt und Änderungen werden mit Push übertragen...
it: Eseguire commit in un nuovo ramo e pushing delle modifiche in corso...
ja: 新しいブランチにコミットして変更をプッシュしています...
pt_br: Confirmando Novas Ramificações e Enviando Alterações por Push...
zh_hant: 正在提交新的分支與推送變更...

# ++CODE++c1de8d4fc91a72a414f95fb6e7ddaa42e846c3862560e6ad81ec2508c9c95542
source: Committing to New Branch & Synchronizing Changes...
de: Commit an neuer Verzweigung wird ausgeführt und Änderungen werden synchronisiert...
it: Esecuzione il commit su un nuovo ramo e sincronizzazione delle modifiche...
ja: 新しいブランチへのコミットと変更を同期しています...
pt_br: Comprometendo-se com o Novo Branch e Sincronizando as Alterações...
zh_hant: 正在提交至新的分支並同步處理變更...

# ++CODE++26727a77b60784d2907788f4dcd2c528470f39420c7d89cf6b2fb7017bd0d973
source: Conflict: Added By Them
de: Konflikt: von Anderen hinzugefügt
it: Conflitto: aggiunto dall'utente
ja: 競合: 他者が追加
pt_br: Conflito: Adicionado por Eles
zh_hant: 衝突: 由他人新增

# ++CODE++e60a6686b1c40266a21a7fb54613a90683e298c8373488c8c9b09b9b696e7dc6
source: Conflict: Added By Us
de: Konflikt: von uns hinzugefügt
it: Conflitto: aggiunto da Microsoft
ja: 競合: こちらが追加
pt_br: Conflito: Adicionados por Nós
zh_hant: 衝突: 由我們新增

# ++CODE++cf655e271c68cfa38a63d55a83b3f244fdf668f6102a8b2f7dedb774e1a53fcd
source: Conflict: Both Added
de: Konflikt: beide hinzugefügt
it: Conflitto: aggiunto dall'utente e da Microsoft
ja: 競合: 両方追加
pt_br: Conflito: Adicionados por Ambos
zh_hant: 衝突: 兩者皆新增

# ++CODE++90a447188c3e8f03122432f6eadb32a86a3d3f2a7bfe47973c5268a43cfa482b
source: Conflict: Both Deleted
de: Konflikt: beide gelöscht
it: Conflitto: eliminato dall'utente e da Microsoft
ja: 競合: 両方削除
pt_br: Conflito: Excluído por Ambos
zh_hant: 衝突: 兩者皆刪除

# ++CODE++9b10e40394e51ee85ee978d10dcd4e39508bc7b7dbfaca0ff1c0fb1d34a4f48b
source: Conflict: Both Modified
de: Konflikt: beide geändert
it: Conflitto: modificato dall'utente e da Microsoft
ja: 競合: 両方変更
pt_br: Conflito: Modificado por Ambos
zh_hant: 衝突: 兩者皆修改

# ++CODE++a7f3173b4ff7b9d91eeae6f949c39727b52e7620a66d6f4335335fc762506332
source: Conflict: Deleted By Them
de: Konflikt: von Anderen gelöscht
it: Conflitto: eliminato dall'utente
ja: 競合: 他者が削除
pt_br: Conflito: Excluído por Eles
zh_hant: 衝突: 由他人刪除
