Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# config.openRepositoryInParentFolders
source: Control whether a repository in parent folders of workspaces or open files should be opened.
de: Steuern Sie, ob ein Repository in übergeordneten Ordnern von Arbeitsbereichen oder geöffneten Dateien geöffnet werden soll.
it: Controllare se un repository nelle cartelle padre delle aree di lavoro o dei file aperti deve essere aperto.
ja: ワークスペースの親フォルダー内または開いているファイルのどちらでのリポジトリを開く必要があるのかを制御します。
pt_br: Controle se um repositório em pastas pai de workspaces ou arquivos abertos deve ser aberto.
zh_hant: 控制是否應開啟工作區或開啟檔案上層資料夾中的存放庫。

# config.smartCommitChanges
source: Control which changes are automatically staged by Smart Commit.
de: Hiermit steuern Sie, welche Änderungen beim intelligenten Commit automatisch gestaget werden.
it: Controlla quali modifiche vengono automaticamente preparate per il commit da Commit intelligente.
ja: スマート コミットで変更を自動的にステージングするかどうかを制御します。
pt_br: Controlar quais alterações são automaticamente testadas por Confirmação Inteligente.
zh_hant: 控制智慧提交自動暫存的變更。

# config.statusLimit
source: Controls how to limit the number of changes that can be parsed from Git status command. Can be set to 0 for no limit.
de: Steuert, wie die Anzahl der Änderungen begrenzt wird, die über den Git-Statusbefehl analysiert werden können. Kann auf 0 (Null) festgelegt werden, um keinen Grenzwert zu setzen.
it: Controlla come limitare il numero di modifiche che è possibile analizzare dal comando di stato GIT. Può essere impostato su 0 per non porre alcun limite.
ja: Git 状態コマンドで解析できる変更回数の制限方法を制御します。0 に設定すると制限なしにすることができます。
pt_br: Controla como limitar o número de alterações que podem ser analisadas a partir do comando de status do Git. Pode ser definido como 0 para nenhum limite.
zh_hant: 控制如何限制可以從 Git 狀態命令剖析的變更數。可以設定為 0 表示無限制。

# config.untrackedChanges
source: Controls how untracked changes behave.
de: Legt fest, wie sich nicht nachverfolgte Änderungen verhalten.
it: Controlla il comportamento delle modifiche non tracciate.
ja: 追跡対象外の変更の動作を制御します。
pt_br: Controla como as alterações não controladas se comportam.
zh_hant: 控制未追蹤修訂的運作方式。

# config.countBadge
source: Controls the Git count badge.
de: Steuert den Git-Anzahlbadge.
it: Controlla la notifica del conteggio GIT.
ja: Git カウント バッジを制御します。
pt_br: Controla o selo da contagem de Git.
zh_hant: 控制 Git 計數徽章。

# config.inputValidationLength
source: Controls the commit message length threshold for showing a warning.
de: Steuert, ab welcher Länge für Commit-Nachrichten eine Warnung eingeblendet werden soll.
it: Controlla la soglia di lunghezza del messaggio di commit per mostrare un avviso.
ja: 警告を表示するコミット メッセージの長さのしきい値を制御します。
pt_br: Controla o limite de tamanho da mensagem de confirmação para mostrar um aviso.
zh_hant: 控制顯示警告的認可訊息長度閾值。

# config.inputValidationSubjectLength
source: Controls the commit message subject length threshold for showing a warning. Unset it to inherit the value of `config.inputValidationLength`.
de: Legt den Grenzwert der Länge des Betreffs der Commitmeldung beim Anzeigen einer Warnung fest. Heben Sie die Festlegung auf, um den Wert von „config.inputValidationLength“ zu erben.
it: Controlla la soglia relativa alla lunghezza dell'oggetto del messaggio di commit per la visualizzazione di un avviso. Disattivarlo per ereditare il valore di `config.inputValidationLength`.
ja: 警告を表示するためのコミット メッセージの件名長のしきい値を制御します。'config.inputValidationLength' の値を継承する場合には設定解除します。
pt_br: Controla o limite de tamanho do assunto da mensagem de confirmação para mostrar um aviso. Remova a definição dele para herdar o valor de `config.inputValidationLength`.
zh_hant: 控制用於顯示警告的認可訊息主旨長度閾值。將其取消設定可繼承 `config.inputValidationLength` 的值。

# config.repositoryScanMaxDepth
source: Controls the depth used when scanning workspace folders for Git repositories when `#git.autoRepositoryDetection#` is set to `true` or `subFolders`. Can be set to `-1` for no limit.
de: Steuert die Tiefe, die beim Überprüfen von Arbeitsbereichsordnern für Git-Repositorys verwendet wird, wenn „#git.autoRepositoryDetection#“ auf „TRUE“ oder „subFolders“ festgelegt ist. Kann auf „-1“ festgelegt werden, wenn kein Limit gelten soll.
it: Controlla la profondità usata per l'analisi delle cartelle dell'area di lavoro per i repository GIT quando '#git.autoRepositoryDetection#' è impostato su 'true' o 'subFolders'. Può essere impostato su '-1' per nessun limite.
ja: '#git.autoRepositoryDetection#' が 'true' もしくは 'subFolders' であるとき、Git リポジトリのワークスペース フォルダーをスキャンする際に使用される深さを制御します。制限なしとするためには、'-1' として設定可能です。
pt_br: Controla a profundidade usada ao verificar as pastas do workspace para repositórios Git quando `#git.autoRepositoryDetection#` está definido como `true` ou` subFolders`. Pode ser definido como `-1` para nenhum limite.
zh_hant: 控制當 '#git.autoRepositoryDetection#' 設定為 'true' 或 'subFolders' 時，掃描 Git 存放庫的工作區資料夾時所使用的深度。可以設為 '-1'，表示沒有限制。

# config.detectSubmodulesLimit
source: Controls the limit of git submodules detected.
de: Steuert die Begrenzung der Git-Submodule.
it: Controlla il limite dei sottomoduli git rilevati.
ja: 検出する git サブモジュール数の制限を制御します。
pt_br: Controla o limite de submódulos git detectados.
zh_hant: 控制 Git 子模組的偵測限制

# config.alwaysSignOff
source: Controls the signoff flag for all commits.
de: Legt das signoff-Flag für alle Commits fest.
it: Controlla il flag di signoff per tutti i commit.
ja: すべてのコミットのサインオフ フラグを制御します。
pt_br: Controla o sinalizador de aprovação para todas as confirmações.
zh_hant: 控制所有認可的簽核旗標。

# config.branchSortOrder
source: Controls the sort order for branches.
de: Steuert die Sortierreihenfolge für Branches.
it: Controlla l'ordinamento per i rami.
ja: ブランチの並べ替え順序を制御します。
pt_br: Controla a ordem de classificação de ramificações.
zh_hant: 控制分支的排序順序。

# config.similarityThreshold
source: Controls the threshold of the similarity index (i.e. amount of additions/deletions compared to the file's size) for changes in a pair of added/deleted files to be considered a rename. **Note:** Requires git version `2.18.0` or later.
de: Steuert den Schwellenwert des Ähnlichkeitsindexes (d. h. die Anzahl der Hinzufügungen/Löschungen im Vergleich zur Dateigröße) für Änderungen in einem Paar hinzugefügter/gelöschter Dateien, die als Umbenennung betrachtet werden sollen. **Hinweis:** Erfordert Git-Version 2.18.0 oder höher.
it: Controlla la soglia dell'indice di somiglianza, ovvero la quantità di aggiunte/eliminazioni rispetto alle dimensioni del file, per le modifiche in una coppia di file aggiunti/eliminati da considerare per l’assegnazione di un nuovo nome. **Nota:** richiede la versione Git `2.18.0` o successiva.
ja: 名前変更と見なされる追加/削除されたファイルのペアの変更に対する類似性インデックスのしきい値 (つまり、ファイルのサイズと比較した追加/削除の量) を制御します。**注意:** Git バージョン `2.18.0` 以降が必要です。
pt_br: Controla o limite do índice de similaridade (ou seja, quantidade de adições/exclusões em comparação com o tamanho do arquivo) para que as alterações em um par de arquivos adicionados/excluídos sejam consideradas uma renomeação. **Observação:** Requer git versão `2.18.0` ou posterior.
zh_hant: 控制相似性索引的閾值 (即相較於檔案大小新增/刪除的數量)，以將一對新增/刪除檔案中的變更視為重新命名。**注意:** 需要 Git 版本 `2.18.0` 或更新版本。

# config.discardAllScope
source: Controls what changes are discarded by the `Discard all changes` command. `all` discards all changes. `tracked` discards only tracked files. `prompt` shows a prompt dialog every time the action is run.
de: Legt fest, welche Änderungen vom Befehl „Alle Änderungen verwerfen“ verworfen werden. „all“ verwirft alle Änderungen. „tracked“ verwirft nur verfolgte Dateien. „prompt“ zeigt immer eine Eingabeaufforderung an, wenn die Aktion ausgeführt wird.
it: Controlla quali modifiche vengono rimosse tramite il comando `Rimuovi tutte le modifiche`. Con `all` vengono rimosse tutte le modifiche. Con `tracked` vengono rimossi solo i file di cui viene tenuta traccia. Con `prompt` viene visualizzata una finestra di dialogo ogni volta che si esegue l'azione.
ja: 'すべての変更を破棄' コマンドによってどの変更が破棄されるかを制御します。'all' はすべての変更を破棄します。 'tracked' は追跡されているファイルだけを破棄します。 'prompt' は、アクションが実行されるたびにプロンプ​​ト ダイアログを表示します。
pt_br: Controla as alterações que são descartadas pelo comando `Discard all changes`. `all` descarta todas as alterações. `tracked` descarta somente arquivos controlados. `prompt` mostra uma caixa de diálogo de aviso toda vez que a ação é executada.
zh_hant: 控制 `Discard all changes` 命令會捨棄的變更。`all` 會捨棄所有變更。`tracked` 只會捨棄追蹤的檔案。`prompt` 會在每次動作執行時顯示提示對話方塊。

# config.checkoutType
source: Controls what type of git refs are listed when running `Checkout to...`.
de: Legt fest, welche Git-Referenzen aufgelistet werden, wenn „Auschecken an...“ ausgeführt wird.
it: Controlla il tipo di riferimenti GIT elencati quando si esegue `Esegui checkout in...`.
ja: 'チェックアウト先...' を実行するとき、どの種類の Git 参照を一覧表示するか制御します。
pt_br: Controla o tipo de referências do Git que são listadas ao executar `Checkout to...`.
zh_hant: 控制執行 [簽出至...] 時，要列出哪種類型的 Git 參考。

# config.inputValidation
source: Controls when to show commit message input validation.
de: Steuert, wann die Commit-Meldung der Eingabevalidierung angezeigt wird.
it: Controlla quando visualizzare la convalida sull'input del messaggio di commit.
ja: コミット メッセージの入力検証をいつ表示するかを制御します。
pt_br: Controla quando mostrar a validação de entrada da mensagem de confirmação.
zh_hant: 控制何時顯示認可訊息輸入驗證。

# config.useIntegratedAskPass
source: Controls whether GIT_ASKPASS should be overwritten to use the integrated version.
de: Steuert, ob GIT_ASKPASS überschrieben werden soll, um die integrierte Version zu verwenden.
it: Controlla se GIT_ASKPASS deve essere sovrascritto per usare la versione integrata.
ja: 統合バージョンを使用するために GIT_ASKPASS を上書きするかどうかを制御します。
pt_br: Controla se o GIT_ASKPASS deve ser substituído para usar a versão integrada.
zh_hant: 控制是否應覆寫 GIT_ASKPASS 以使用整合式版本。

# config.decorations.enabled
source: Controls whether Git contributes colors and badges to the Explorer and the Open Editors view.
de: Legt fest, ob Git Farben und Badges für die Explorer-Ansicht und die Ansicht „Geöffnete Editoren“ bereitstellt.
it: Controlla se GIT aggiunge come contributo colori e notifiche nelle visualizzazioni Esplora risorse e Editor aperti.
ja: Git が配色とバッジをエクスプローラーと [開いているエディター] ビューに提供するかどうかを制御します。
pt_br: Controla se o Git contribui com cores e selos para o Explorador e para a exibição Editores Abertos.
zh_hant: 控制 Git 是否會為總管和 [已開啟的編輯器] 檢視貢獻色彩和徽章。

# config.promptToSaveFilesBeforeCommit
source: Controls whether Git should check for unsaved files before committing.
de: Legt fest, ob Git vor dem einchecken nach nicht gespeicherten Dateien suchen soll.
it: Controlla se GIT deve verificare la presenza di file non salvati prima di eseguire il commit.
ja: コミット前に Git が保存していないファイルを確認すべきかどうかを制御します。
pt_br: Controla se o Git deve verificar arquivos não salvos antes de confirmar.
zh_hant: 控制Git是否應該在提交之前檢查未儲存的檔案。

# config.promptToSaveFilesBeforeStash
source: Controls whether Git should check for unsaved files before stashing changes.
de: Legt fest, ob Git vor dem Stashen von Änderungen nach nicht gespeicherten Dateien suchen soll.
it: Controlla se GIT deve verificare la presenza di file non salvati prima di accantonare le modifiche.
ja: 変更をスタッシュする前に Git で保存していないファイルを確認すべきかどうかを制御します。
pt_br: Controla se o Git deve verificar se há arquivos não salvos antes de fazer stash das alterações.
zh_hant: 控制 Git 是否應該在隱藏變更之前檢查未儲存的檔案。

# config.pullBeforeCheckout
source: Controls whether a branch that does not have outgoing commits is fast-forwarded before it is checked out.
de: Steuert, ob ein Branch ohne ausgehende Commits vor dem Auschecken schnell weitergeleitet wird.
it: Controlla se un ramo che non dispone di commit in uscita viene inoltrato rapidamente prima di essere estratto.
ja: 出力方向のコミットがないブランチを、チェックアウト前に早送りするかどうかを制御します。
pt_br: Controla se uma ramificação que não possui commits de saída é avançada antes do check-out.
zh_hant: 控制沒有傳出認可的分支在簽出前是否向前快轉。

# config.useEditorAsCommitInput
source: Controls whether a full text editor will be used to author commit messages, whenever no message is provided in the commit input box.
de: Steuert, ob ein Volltext-Editor zum Erstellen von Commitnachrichten verwendet wird, wenn im Eingabefeld für den Commit keine Nachricht bereitgestellt wird.
it: Controlla se verrà usato un editor full-text per creare messaggi di commit ogni volta che non viene specificato alcun messaggio nella casella di input di commit.
ja: コミット入力ボックスにメッセージが指定されていない場合に、コミット メッセージの作成にフル テキスト エディターを使用するかどうかを制御します。
pt_br: Controla se um editor de texto completo será usado para criar mensagens de confirmação, sempre que nenhuma mensagem for fornecida na caixa de entrada de confirmação.
zh_hant: 控制在提交輸入方塊中未提供訊息時，是否使用全文字編輯器來撰寫提交訊息。

# config.supportCancellation
source: Controls whether a notification comes up when running the Sync action, which allows the user to cancel the operation.
de: Steuert, ob bei Ausführung der Synchronisierungsaktion eine Benachrichtigung angezeigt wird, sodass der Benutzer den Vorgang abbrechen kann.
it: Controlla se durante l'esecuzione dell'azione Sync viene inviata una notifica, che consente all'utente di annullare l'operazione.
ja: ユーザーが操作を中止できる同期アクションの実行時に通知が表示されるかどうかを制御します。
pt_br: Controla se uma notificação aparece durante a execução da ação de sincronização, o que permite ao usuário cancelar a operação.
zh_hant: 控制是否要在執行同步動作時顯示允許使用者取消作業的通知。

# config.branchProtectionPrompt
source: Controls whether a prompt is being shown before changes are committed to a protected branch.
de: Steuert, ob eine Eingabeaufforderung angezeigt wird, bevor ein Commit für Änderungen an einen geschützten Branch ausgeführt wird.
it: Controlla se viene visualizzato un prompt prima del commit delle modifiche in un ramo protetto.
ja: 保護されたブランチに変更をコミットする前にプロンプトを表示するかどうかを制御します。
pt_br: Controla se um prompt está sendo mostrado antes que as alterações sejam confirmadas em um branch protegido.
zh_hant: 控制是否要在變更提交至受保護的分支之前先顯示提示。

# config.branchRandomNameEnable
source: Controls whether a random name is generated when creating a new branch.
de: Steuert, ob beim Erstellen einer neuen Verzweigung ein zufälliger Name generiert wird.
it: Controlla se viene generato un nome casuale durante la creazione di un nuovo ramo.
ja: 新しいブランチの作成時にランダムな名前を生成するかどうかを制御します。
pt_br: Controla se um nome aleatório é gerado ao criar um novo branch.
zh_hant: 控制建立新分支時是否產生隨機名稱。

# config.showActionButton
source: Controls whether an action button is shown in the Source Control view.
de: Steuert, ob eine Aktionsschaltfläche in der Quellensteuerungsansicht angezeigt wird.
it: Consente di controllare se è visualizzato un pulsante di azione nella visualizzazione del codice sorgente.
ja: ソース管理ビューにアクション ボタンを表示するかどうかを制御します。
pt_br: Controla se um botão de ação é mostrado na visualização Source Control.
zh_hant: 控制是否可以在原始檔控制檢視中顯示動作按鈕。

# config.allowNoVerifyCommit
source: Controls whether commits without running pre-commit and commit-msg hooks are allowed.
de: Hiermit wird gesteuert, ob Commits ohne Ausführung von pre-commit- und commit-msg-Hooks zulässig sind.
it: Controlla se consentire i commit senza l'esecuzione di hook pre-commit e commit-msg.
ja: pre-commit と commit-msg フックを実行しないコミットを許可するかどうかを制御します。
pt_br: Controla se as confirmações sem executar ganchos pre-commit e commit-msg são permitidas.
zh_hant: 控制是否允許未執行預先認可與認可訊息勾點的認可。

# config.allowForcePush
source: Controls whether force push (with or without lease) is enabled.
de: Steuert, ob erzwungene Pushes (mit oder ohne Lease) aktiviert sind.
it: Controlla se il push forzato (con o senza lease) è abilitato.
ja: 強制的なプッシュ (--force-with-lease の有無にかかわらず) を有効にするかどうかを制御します。
pt_br: Controla se o envio forçado por push (com ou sem concessão) está habilitado.
zh_hant: 控制是否啟用強制推送 (不論是否有新的認可)。

# config.useForcePushWithLease
source: Controls whether force pushing uses the safer force-with-lease variant.
de: Steuert, ob erzwungene Pushes die sicherere Variante mit Leases verwenden.
it: Controlla se il push forzato usa la variante più sicura di forzatura con lease.
ja: force プッシュより安全な force-with-lease 方式を使用するかどうかを制御します。
pt_br: Controla se o envio por push forçado usa a variante force-with-lease mais segura.
zh_hant: 控制強制推送是否使用較安全的 force-with-lease 方法。

# config.showProgress
source: Controls whether git actions should show progress.
de: Steuert, ob für Git-Aktionen der Fortschritt zu sehen ist.
it: Determina se le azioni git devono mostrare lo stato di avanzamento.
ja: Git 操作の進行状況を表示するかどうかを制御します。
pt_br: Controla se as ações git devem mostrar o progresso.
zh_hant: 控制 git 動作是否應顯示進度。

# config.enableStatusBarSync
source: Controls whether the Git Sync command appears in the status bar.
de: Steuert, ob der Git Sync-Befehl in der Statusleiste angezeigt wird.
it: Controlla se il comando Git Sync è visualizzato nella barra di stato.
ja: ステータス バーに Git Sync コマンドを表示するかどうかを制御します。
pt_br: Controla se o comando de sincronização do Git aparece na barra de status.
zh_hant: 控制是否在狀態列顯示 Git 同步命令。

# config.closeDiffOnOperation
source: Controls whether the diff editor should be automatically closed when changes are stashed, committed, discarded, staged, or unstaged.
de: Steuert, ob der Diff-Editor automatisch geschlossen werden soll, wenn Änderungen gestasht, zugesagt, verworfen, bereitgestellt oder nicht bereitgestellt werden.
it: Controllare se l'editor diff deve essere chiuso automaticamente quando le modifiche vengono accantonate, salvate, rimosse, preparate per il commit o non preparate per il commit.
ja: 変更をスタッシュ、コミット、破棄、ステージング、またはステージング解除する場合に差分エディターを自動的に閉じるかどうかを制御します。
pt_br: Controla se o editor de comparação deve ser fechado automaticamente quando as alterações são ocultadas, confirmadas, descartadas, preparadas ou não.
zh_hant: 控制在隱藏、提交、捨棄、暫存或取消暫存變更時，是否應自動關閉 Diff 編輯器。

# config.openDiffOnClick
source: Controls whether the diff editor should be opened when clicking a change. Otherwise the regular editor will be opened.
de: Steuert, ob der Diff-Editor geöffnet werden soll, wenn Sie auf eine Änderung klicken. Ansonsten wird der normale Editor geöffnet.
it: Controlla se aprire l'editor diff quando si fa clic su una modifica; in caso contrario verrà aperto l'editor normale.
ja: 変更をクリックすると差分エディターを開くかどうかを制御します。そうでなければ通常のエディターを開きます。
pt_br: Controla se o editor de comparação deve ser aberto ao clicar em uma alteração. Caso contrário, o editor regular será aberto.
zh_hant: 控制按一下變更時，是否應該開啟 Diff 編輯器。否則將開啟一般編輯器。

# config.confirmNoVerifyCommit
source: Controls whether to ask for confirmation before committing without verification.
de: Steuert, ob vor dem Committen eine Bestätigung ohne Überprüfung angefragt werden soll.
it: Controlla se chiedere conferma prima di eseguire il commit senza verifica.
ja: 確認せずにコミットする前に確認メッセージを表示するかどうかを制御します。
pt_br: Controla se deve solicitar confirmação antes de confirmar sem verificação.
zh_hant: 控制在認可但未經驗證之前是否要求確認。

# config.confirmForcePush
source: Controls whether to ask for confirmation before force-pushing.
de: Steuert, ob der Benutzer vor einem erzwungenen Push zur Bestätigung aufgefordert wird.
it: Controlla se chiedere conferma prima di eseguire il push forzato.
ja: 強制的なプッシュの前に確認を求めるかどうかを制御します。
pt_br: Controla se é necessário solicitar confirmação antes de forçar o envio por push.
zh_hant: 控制強制更新前是否要求確認。

# config.detectSubmodules
source: Controls whether to automatically detect git submodules.
de: Steuert, ob Git-Submodule automatisch erkannt werden.
it: Controlla se rilevare automaticamente i moduli secondari GIT.
ja: git サブモジュールを自動的に検出するかどうかを制御します。
pt_br: Controla se os submódulos git devem ser detectados automaticamente.
zh_hant: 控制是否自動偵測 Git 子模組。

# config.terminalGitEditor
source: Controls whether to enable Azure Data Studio to be the Git editor for Git processes spawned in the integrated terminal. Note: Terminals need to be restarted to pick up a change in this setting.
de: Steuert, ob Azure Data Studio als Git-Editor für Git-Prozesse aktiviert werden soll, die im integrierten Terminal erzeugt werden. Hinweis: Terminals müssen neu gestartet werden, um eine Änderung in dieser Einstellung zu übernehmen.
it: Controlla se abilitare Azure Data Studio come gestore di autenticazione per i processi Git generati nel terminale integrato. Nota: per rendere effettiva una modifica di questa impostazione, è necessario riavviare i terminali.
ja: 統合ターミナルで生成される Git プロセスの Git エディターとして Azure Data Studio を有効にするかどうかを制御します。注意: この設定の変更を反映させるには、ターミナルを再起動する必要があります。
pt_br: Controla se o Azure Data Studio deve ser habilitado para ser o editor Git para processos Git gerados no terminal integrado. Observação: Os terminais precisam ser reiniciados para detectar uma alteração nesta configuração.
zh_hant: 控制是否要讓 Azure Data Studio 成為在整合式終端中繁衍之 Git 處理序的 Git 編輯器。請注意: 您必須重新啟動終端，才能在此設定中發現變更。

# config.terminalAuthentication
source: Controls whether to enable Azure Data Studio to be the authentication handler for Git processes spawned in the Integrated Terminal. Note: Terminals need to be restarted to pick up a change in this setting.
de: Steuert, ob Azure Data Studio als Authentifizierungshandler für Git-Prozesse aktiviert werden soll, die im integrierten Terminal erzeugt werden. Hinweis: Terminals müssen neu gestartet werden, um eine Änderung in dieser Einstellung zu übernehmen.
it: Controlla se abilitare Azure Data Studio come gestore di autenticazione per i processi Git generati nel terminale integrato. Nota: per rendere effettiva una modifica di questa impostazione, è necessario riavviare i terminali.
ja: 統合ターミナルで生成された Git プロセスの認証ハンドラーとして Azure Data Studio を有効にするかどうかを制御します。注意: この設定の変更を反映させるには、ターミナルを再起動する必要があります。
pt_br: Controla se o Azure Data Studio deve ser habilitado para ser o manipulador de autenticação para processos Git gerados no Terminal Integrado. Observação: Os terminais precisam ser reiniciados para detectar uma alteração nesta configuração.
zh_hant: 控制是否要讓 Azure Data Studio 成為在整合式終端中繁衍之 Git 處理序的驗證處理常式。請注意: 您必須重新啟動終端，才能在此設定中發現變更。

# config.openAfterClone
source: Controls whether to open a repository automatically after cloning.
de: Steuert, ob ein Repository nach dem Klonen automatisch geöffnet wird.
it: Controlla se aprire automaticamente un repository dopo la clonazione.
ja: 複製後にリポジトリを自動的に開くかどうかを制御します。
pt_br: Controla se um repositório deve ser aberto automaticamente após a clonagem.
zh_hant: 控制是否要在複製後自動開啟存放庫。

# config.optimisticUpdate
source: Controls whether to optimistically update the state of the Source Control view after running git commands.
de: Steuert, ob der Status der Quellcodeverwaltungsansicht nach dem Ausführen von Git-Befehlen optimistisch aktualisiert werden soll.
it: Controlla se aggiornare in modo ottimistico lo stato della visualizzazione Controllo del codice sorgente dopo l'esecuzione dei comandi GIT.
ja: git コマンドの実行後にソース管理ビューの状態を楽観的に更新するかどうかを制御します。
pt_br: Controla se o estado da exibição do Controle do Código-Fonte deve ser atualizado de forma otimizada após a execução dos comandos git.
zh_hant: 控制是否要在執行 Git 命令之後，樂觀地更新原始檔控制檢視的狀態。

# config.publishBeforeContinueOn
source: Controls whether to publish unpublished git state when using Continue Working On from a git repository.
de: Steuert, ob der unveröffentlichte Git-Status veröffentlicht werden soll, wenn "Weiterarbeiten an" aus einem Git-Repository verwendet wird.
it: Chiedi conferma per pubblicare lo stato GIT non pubblicato quando si usa Continua a lavorare da un repository GIT.
ja: Git リポジトリから Continue Working On を使用する場合に、未発行の Git 状態を発行するかどうかを制御します。
pt_br: Controla se o estado git não publicado deve ser publicado ao usar Continuar Trabalhando em um repositório git.
zh_hant: 使用 Git 存放庫的 [繼續工作] 時，控制是否發佈未發佈的 Git 狀態
