Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# ++CODE++4a9bc15b4ed0cf72587423bf0e2d14780f2050bfbb59d187cf98cc081e0d1d1b
source: There are no available repositories
de: Es sind keine verfügbaren Repositorys vorhanden.
it: Non ci sono repository disponibili
ja: 利用可能なリポジトリがありません
pt_br: Não há repositórios disponíveis
zh_hant: 沒有儲存庫可供使用

# ++CODE++ae1a589b1c95953ed140c40811e495dcbaea430a742c8f895231e3c270e852ef
source: There are no changes to commit.
de: Keine Änderungen zum Speichern vorhanden.
it: Non ci sono modifiche di cui eseguire il commit.
ja: コミットする必要のある変更はありません。
pt_br: Não há alterações para confirmar.
zh_hant: 沒有任何變更要認可。

# ++CODE++1817660c6b621c7c863521e96a45227469758a3f51d690448de5d1b50c46bc2d
source: There are no changes to stash.
de: Es sind keine Änderungen vorhanden, für die ein Stash ausgeführt werden kann.
it: Non ci sono modifiche da accantonare.
ja: スタッシュする変更がありません。
pt_br: Não há alterações para stash.
zh_hant: 沒有變更可供擱置

# ++CODE++0eb60d4befa938a3a146ef5031aaffff7f5c3b290ca2524472b36a3ef99259da
source: There are no staged changes to commit.\n\nWould you like to stage all your changes and commit them directly?
de: Es sind keine gestageten Änderungen vorhanden, für die ein Commit durchgeführt werden kann.\n\nMöchten Sie all Ihre Änderungen stagen und direkt committen?
it: Non ci sono modifiche preparate per il commit di cui eseguire il commit.\n\nPreparare per il commit tutte le modifiche ed eseguirne il commit direttamente?
ja: ステージされている変更がなく、コミットできません。\n\nすべての変更をステージして、直接コミットしますか?
pt_br: Não há nenhuma alteração preparada a ser confirmada.\n\nDeseja preparar automaticamente todas as alterações e confirmá-las diretamente?
zh_hant: 沒有任何要提交的暫存變更。\n\n要暫存所有變更並直接提交嗎?

# ++CODE++0a6f7df2d272dbe9feb4bf0dd43c6a93144be7e5192b330ca7a1b191666c5b93
source: There are no staged changes to stash.
de: Es sind keine gestagete Änderungen vorhanden, um einen Stash auszuführen.
it: Non sono presenti modifiche a fasi da accantonare.
ja: コミットする必要のあるステージされている変更はありません。
pt_br: Não há alterações preparadas para stash.
zh_hant: 沒有對隱藏的分段變更。

# ++CODE++46031808b597269632b77fb15757e8f4e0f56b9028ddf7b5889e68f5753668c9
source: There are no stashes in the repository.
de: Das Repository enthält keine Stashes.
it: Non ci sono accantonamenti nel repository.
ja: リポジトリ内にスタッシュはありません。
pt_br: Não há fases no repositório.
zh_hant: 儲存庫中沒有擱置的變更

# ++CODE++be81fa311df402c9d32e9f0d31240455ba7bd8c5a968fd9c4261854469666a80
source: There are {0} unsaved files.\n\nWould you like to save them before committing?
de: {0} Dateien wurden nicht gespeichert.\n\nMöchten Sie diese vor dem Ausführen des Commits speichern?
it: Sono presenti {0} file non salvati.\n\nSalvarli prima di eseguire il commit?
ja: {0} 個の保存されていないファイルがあります。\n\nコミット前に保存しますか?
pt_br: Existem {0} arquivos não salvos.\n\nGostaria de salvá-los antes de executar a confirmação?
zh_hant: 有 {0} 個未儲存檔案。\n\n您要在提交前儲存嗎?

# ++CODE++bd3d54b7b5279debc1b7120498741a9123d3247573fb0b03ee2b356e799ec807
source: There are {0} unsaved files.\n\nWould you like to save them before stashing?
de: {0} Dateien wurden nicht gespeichert.\n\nMöchten Sie diese vor dem Stashen speichern?
it: Sono presenti {0} file non salvati.\n\nSalvarli prima dell\'accantonamento?
ja: {0} 個の保存されていないファイルがあります。\n\nスタッシュする前に保存しますか?
pt_br: Há {0} arquivos não salvos.\n\nDeseja salvá-los antes de fazer stash?
zh_hant: 有 {0} 個未儲存的檔案。\n\n要先儲存檔案再隱藏嗎?

# ++CODE++17a302d9654f49beddb9c262df6083f2295f88a618de2130cd94a71c13c9a815
source: There are {0} untracked files which will be DELETED FROM DISK if discarded.
de: Es sind {0} nicht verfolgte Dateien vorhanden, die VOM DATENTRÄGER GELÖSCHT werden, wenn sie verworfen werden.
it: Se rimossi, {0} file di cui non viene tenuta traccia verranno ELIMINATI DAL DISCO.
ja: 破棄すると {0} 個の未追跡ファイルがディスクから削除されます。
pt_br: Há {0} arquivos não controlados que serão EXCLUÍDOS DO disco, se descartados.
zh_hant: 有 {0} 個未追蹤檔案若被捨棄，將會從磁碟中刪除。

# ++CODE++1547ede309e6d1f85da487e614b5c06ecb8be8280e4d7edc5431a29025a0cf49
source: There were merge conflicts while applying the stash.
de: Beim Anwenden des Stashes sind Merge-Konflikte aufgetreten.
it: Si sono verificati conflitti di merge durante l'applicazione dell'accantonamento.
ja: スタッシュを適用している間に、マージの競合がありました。
pt_br: Ocorreram conflitos de mesclagem ao aplicar o stash.
zh_hant: 套用隱藏時發生合併衝突。

# ++CODE++4e5370c14c2e52f7bc248222f1d743cfeecaef3f484f987facbf4604af7d7bdd
source: This action will pull and push commits from and to "{0}/{1}".
de: Durch diese Aktion werden Commits von und an "{0}/{1}" gepullt und gepusht.
it: Questa azione eseguirà il pull e il push dei commit da e verso "{0}/{1}".
ja: このアクションは、"{0}/{1}" との間でコミットをプルおよびプッシュします。
pt_br: Esta ação efetuará pull e push das confirmações de e para ''{0}/{1}''.
zh_hant: 此動作會從 "{0}/{1}" 提取和推送提交。

# ++CODE++a3bfed7d5da3d9d87e3ffe75f75ecb1c47b3d635177a918a421dbc3da4789012
source: This repository has no remotes configured to fetch from.
de: In diesem Repository wurden keine Remoteelemente konfiguriert, aus denen ein Abrufen erfolgt.
it: Questo repository non ha remote configurati da cui eseguire un fetch.
ja: リポジトリには、フェッチ元として構成されているリモートがありません。
pt_br: Este repositório não tem remotos configurados para buscar.
zh_hant: 您的儲存庫未設定要擷取的遠端來源。

# ++CODE++946fda221b3c1389605a25d3c1836cbe2931594e7f17b1d406c6794e16bf7060
source: This will DELETE {0} untracked files!\nThis is IRREVERSIBLE!\nThese files will be FOREVER LOST.
de: Hierdurch werden {0} nicht nachverfolgte Dateien GELÖSCHT!\nDieser Vorgang ist UNUMKEHRBAR.\nDie Dateien gehen DAUERHAFT VERLOREN.
it: {0} file non verificati verranno ELIMINATI.\nQuesta operazione è IRREVERSIBILE.\nQuesti file andranno PERSI DEFINITIVAMENTE.
ja: {0} 個の追跡されていないファイルが削除されます。\n元に戻すことはできません。\nこれらのファイルは完全に失われます。
pt_br: Isso excluirá {0} arquivos não rastreados!\nIsto é irreversível!\nEsses arquivos serão perdidos para sempre.
zh_hant: 這會刪除 {0} 已取消追蹤的檔案!\n此動作無法復原!\n將會永久遺失這些檔案。

# ++CODE++8a31a9a33b1daab0d79eae0dc86548abb75d8210f058d99a3ef4b6f3ece60162
source: This will create a Git repository in "{0}". Are you sure you want to continue?
de: Dadurch wird ein Git-Repository in "{0}" erstellt. Möchten Sie den Vorgang wirklich fortsetzen?
it: Questo creerà un repository Git in "{0}". Continuare?
ja: "{0}" に Git リポジトリを作成します。続行してもよろしいですか?
pt_br: Isso criará um repositório Git em ''{0}''. Tem certeza de que deseja continuar?
zh_hant: 這會建立一個 Git 儲存庫在 "{0}"。確定要繼續嗎?

# ++CODE++05f7892749ae2c9768ce4044a9df51b9f9bb38485c7c42049a15b1b99b9535d9
source: Too many changes were detected. Only the first {0} changes will be shown below.
de: Es wurden zu viele Änderungen erkannt. Im Folgenden werden nur die ersten {0} Änderungen angezeigt.
it: Sono state rilevate troppe modifiche. Di seguito verranno visualizzate solo le prime {0} modifiche.
ja: 検出された変更が多すぎます。最初の {0} の変更のみが下に表示されます。
pt_br: Muitas mudanças foram detectadas. Somente as primeiras {0} alterações serão mostradas abaixo.
zh_hant: 偵測到太多變更。下方僅顯示前 {0} 個變更。

# ++CODE++dce9960e3b2a3c0c30e66c7e1a3ec396a86650a7acb8fd3cedf74196356deb54
source: Type Changed
de: Typ geändert
it: Tipo modificato
ja: 変更された型
pt_br: Tipo alterado
zh_hant: 類型已變更

# ++CODE++4460d1b1316e9beeda90bd568c3e9d13b47a3710674433fd1022371f8e1d3108
source: Unable to pull from remote repository due to conflicting tag(s): {0}. Would you like to resolve the conflict by replacing the local tag(s)?
de: Aus dem Remote Repository kann aufgrund von in Konflikt stehenden Tags nicht zugegriffen werden: {0}. Möchten Sie den Konflikt lösen, indem Sie die lokalen Tags ersetzen?
it: Non è possibile eseguire il pull dal repository remoto a causa di tag in conflitto: {0}. Risolvere il conflitto sostituendo i tag locali?
ja: タグが競合しているため、リモート リポジトリからプルできません: {0}。ローカル タグを置き換えて競合を解決しますか?
pt_br: Não foi possível extrair do repositório remoto devido a marcas conflitantes: {0}. Gostaria de resolver o conflito substituindo a marca(s) local?
zh_hant: 無法從遠端存放庫提取，因為標籤衝突: {0}。您要取代本機標籤來解決衝突嗎?

# ++CODE++0d0b4290628654ca57e79767b0c2c66ab30fd9b41dfe4eb48495003a199bf27f
source: Uncommitted Changes
de: Ausgecheckte Änderungen
it: Modifiche non sottoposte a commit
ja: コミットされていない変更
pt_br: Alterações Não Confirmadas
zh_hant: 未認可的變更

# ++CODE++35a96c53b643b0cfb6501a078cb24a26c2158f732df4e497c68292ab9b2fb387
source: Undo merge commit
de: Mergecommit rückgängig machen
it: Annulla commit di merge
ja: マージ コミットの取り消し
pt_br: Desfazer confirmação de mesclagem
zh_hant: 復原合併認可

# ++CODE++c7ba5477e19cf0bb25460d840cc2e67341e81e1c2d274d00b3054c73898d4d27
source: Untracked
de: Nicht verfolgt
it: Non registrato
ja: 追跡対象外
pt_br: Não controlado
zh_hant: 已取消追蹤

# ++CODE++d9dbf89a0df1e2e894271aa0784f5a497aa621698eca5da8c125870ead7b718e
source: Untracked Changes
de: Nicht nachverfolgte Änderungen
it: Modifiche non tracciate
ja: 追跡対象外の変更
pt_br: Alterações Não Controladas
zh_hant: 未追蹤的變更

# ++CODE++eda6b0f61d9c085625dc90eb871b839a26cdbd818b39a6198eb4cc9a8fcc4ea5
source: Using git "{0}" from "{1}"
de: Git "{0}" von "{1}" verwenden
it: Uso di Git "{0}" da "{1}"
ja: "{1}" から Git "{0}" を使用しています
pt_br: Usando git ''{0}'' de ''{1}''
zh_hant: 正在使用來自 "{0}" 的 Git "{1}"

# ++CODE++e7fde14b366ecaa13e8419d872a4b9f4008fa1e14c03f17d947b76c8e2130d91
source: Validating found git in: "{0}"
de: Gefundenes Git wird überprüft in: "{0}"
it: Convalida del GitT trovato in: "{0}"
ja: Git の検証が検出されました: "{0}"
pt_br: Validando o git encontrado em: {0}
zh_hant: 正在驗證在下列位置找到的 Git: "{0}"

# ++CODE++7f1d79b89e7e2a73fb77da103a8f48ff6a1d82d197245b96a00bd0bb1b807301
source: Would you like to add "{0}" to .gitignore?
de: Möchten Sie "{0}" zu ".gitignore" hinzufügen?
it: Aggiungere "{0}" a .gitignore?
ja: .gitignore に "{0}" を追加しますか?
pt_br: Deseja adicionar ''{0}'' ao .gitignore?
zh_hant: 要將 "{0}" 新增至 .gitignore 嗎?

# ++CODE++a9b2a56ef24209b80c6e9e0508fae6e0cd8dde12582670f4867730d234fa660f
source: Would you like to open the cloned repository, or add it to the current workspace?
de: Möchten Sie das geklonte Repository öffnen oder es zum aktuellen Arbeitsbereich hinzufügen?
it: Vuoi aprire il repository clonato o aggiungerlo all'area di lavoro corrente?
ja: 複製したリポジトリを開きますか? または現在のワークスペースに追加しますか?
pt_br: Deseja abrir o repositório clonado ou adicioná-lo ao workspace atual?
zh_hant: 要開啟已複製的儲存庫, 或將其新增到目前工作區?

# ++CODE++8e3e2fa1eac65813d54533388a9394094f68b3af6c8408dde1e4a3d4e57d91d7
source: Would you like to open the cloned repository?
de: Möchten Sie das geklonte Repository öffnen?
it: Aprire il repository clonato?
ja: クローンしたリポジトリを開きますか?
pt_br: Deseja abrir o repositório clonado?
zh_hant: 要開啟複製的儲存庫嗎?

# ++CODE++2f583a9a7e36a2087285836c950f99f22099e18fd2565543ba73d4b175fdd72f
source: Would you like to open the initialized repository, or add it to the current workspace?
de: Möchten Sie das initialisierte Repository öffnen oder es zum aktuellen Arbeitsbereich hinzufügen?
it: Aprire il repository inizializzato o aggiungerlo all'area di lavoro corrente?
ja: 初期化済みのリポジトリを開きますか? または現在のワークスペースへ追加しますか?
pt_br: Deseja abrir o repositório inicializado ou adicioná-lo ao workspace atual?
zh_hant: 要開啟初始化的儲存庫，或將其新增到目前工作區?

# ++CODE++01cedefc7a6bda340489ba5bce02d9cf13cf3344b44ff23845566a379edf01a5
source: Would you like to open the initialized repository?
de: Möchten Sie das initialisierte Repository öffnen?
it: Aprire il repository inizializzato?
ja: 初期化済みのリポジトリを開きますか?
pt_br: Deseja abrir o repositório inicializado?
zh_hant: 要開啟初始化的儲存庫嗎?

# ++CODE++0d956bc1273b2c3663c075e95965229e067e6aa8baf635905a73feec866b0ce6
source: Would you like {0} to [periodically run "git fetch"]({1})?
de: Soll {0} [in regelmäßigen Abständen "git fetch" ausführen]({1})?
it: Si vuole che {0} [esegua periodicamente "git fetch"]({1})?
ja: {0}に定期的に[「git fetch」を実行する]({1}) にしますか?
pt_br: Deseja que {0} [execute periodicamente o "git fetch"]({1})?
zh_hant: 是否要 {0} [定期執行 [git 擷取]]({1})?

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
de: Ja
it: Sì
ja: はい
pt_br: Sim
zh_hant: 是

# ++CODE++568b3eef26e3360a32fba05157ba2b75657ca22b5929211279821ff88bd2fa3d
source: Yes, Don\'t Show Again
de: Ja, nicht mehr anzeigen
it: Sì, non visualizzare più questo messaggio
ja: はい、今後は表示しません
pt_br: Sim, Não Mostrar Novamente
zh_hant: 是的，不要再顯示

# ++CODE++08b041935798fbf6fd6ff51099ffedb140a475889986d14f5559ff8e7fc571dd
source: You
de: Sie
it: Utente
ja: 自分
pt_br: Você
zh_hant: 您

# ++CODE++30757342a07b54b8546d73b091103bc1ec0e1d5b015265bb6a21b5f4716b0d53
source: You are about to commit your changes without verification, this skips pre-commit hooks and can be undesirable.\n\nAre you sure to continue?
de: Sie sind im Begriff, Ihre Änderungen ohne Überprüfung zu committen. Hierdurch werden Pre-commit-Hooks übersprungen, was möglicherweise nicht erwünscht ist.\n\nMöchten Sie den Vorgang fortsetzen?
it: Si sta per eseguire il commit delle modifiche senza verifica. Con questa operazione gli hook pre-commit verranno ignorati e tale comportamento può non essere quello desiderato.\n\nContinuare?
ja: 確認せずに変更をコミットしようとしています。これは、コミット前のフックをスキップするため、望ましくない場合があります。\n\n続行しますか?
pt_br: Você está prestes a confirmar as alterações sem verificação, isso ignora hooks pre-commit e pode ser indesejável.\n\nTem certeza de que deseja continuar?
zh_hant: 您即將在不進行驗證的情況下提交變更，這麼做會跳過預先提交勾點，造成不適當的結果。\n\n確定要繼續嗎?

# ++CODE++0907e6f3642577f3302552d8e71bbc82073e9de0fe7c04c02c095e7ad6176750
source: You are about to force push your changes, this can be destructive and could inadvertently overwrite changes made by others.\n\nAre you sure to continue?
de: Sie sind dabei, einen erzwungenen Push für Ihre Änderungen durchzuführen. Dieser Vorgang kann negative Auswirkungen haben und die Änderungen anderer Benutzer überschreiben.\n\nMöchten Sie fortfahren?
it: Si sta per eseguire il push forzato delle modifiche. Questa operazione può essere distruttiva e comportare la sovrascrittura accidentale di modifiche apportate da altri utenti.\n\nContinuare?
ja: 変更の強制プッシュを行おうとしていますが、これは破壊的なことがあり、他人の変更を誤って上書きする可能性があります。\n\n続行しますか?
pt_br: Você está prestes a forçar o envio por push das suas alterações. Isso pode ser destrutivo e pode substituir acidentalmente as alterações feitas por outras pessoas.\n\nTem certeza de que deseja continuar?
zh_hant: 您即將強制推送自己的變更，這可能具有破壞性，而且可能會不小心覆寫他人所做的變更。\n\n確定要繼續嗎?

# ++CODE++fe2df0f8d1bf9e45d9afaf5ca1a24523803f19221bec807bfc00f13cc519aa77
source: You are trying to commit to a protected branch and you might not have permission to push your commits to the remote.\n\nHow would you like to proceed?
de: Sie versuchen, einen Commit für eine geschützte Verzweigung auszuführen, und sind möglicherweise nicht berechtigt, Ihre Commits per Push auf die Remote-Verzweigung zu übertragen.\n\nWie möchten Sie fortfahren?
it: Si sta tentando di eseguire il commit in un ramo protetto e potrebbe non essere disponibile l\'autorizzazione per eseguire il push dei commit nel ramo remoto.\n\nCome procedere?
ja: 保護されたブランチにコミットしようとしていますが、コミットをリモートにプッシュするアクセス許可がない可能性があります。\n\n続行しますか?
pt_br: Você está tentando fazer commit em um branch protegido e talvez não tenha permissão para efetuar push em seus commits por push para remoto.\n\nComo você deseja continuar?
zh_hant: 您正在嘗試提交受保護的分支，而且可能沒有將提交推到遠端的權限。\n\n要如何繼續?

# ++CODE++802759f1e5e53993fd0ea369ce7f0ae28138651ca90cffb363771432692e5630
source: Your local changes would be overwritten by checkout.
de: Ihre lokalen Änderungen werden durch Auschecken überschrieben.
it: Le modifiche locali verranno sovrascritte dal checkout.
ja: ローカルの変更は、チェックアウトによって上書きされます。
pt_br: Suas alterações locais seriam substituídas pelo check-out.
zh_hant: 您的本機變更會在簽出時被覆寫。

# ++CODE++4006ee78c8bf7a85704c33264a1bdfcce6e88144b698cccdfc9b73d259294da3
source: Your repository has no remotes configured to publish to.
de: In Ihrem Repository wurden keine Remoteelemente für die Veröffentlichung konfiguriert.
it: Il repository non contiene elementi remoti configurati come destinazione della pubblicazione.
ja: リポジトリには、発行先として構成されているリモートがありません。
pt_br: O repositório não tem remotos configurados para publicar.
zh_hant: 您的儲存庫未設定要發行的遠端目標。

# ++CODE++b85f634ce5d7b0c897cffccadc3bd1827a2b7d3022f77288e460892af9e561a2
source: Your repository has no remotes configured to pull from.
de: In Ihrem Repository wurden keine Remoteelemente für den Pull konfiguriert.
it: Il repository non contiene elementi remoti configurati come origini del pull.
ja: リポジトリには、プル元として構成されているリモートがありません。
pt_br: O repositório não tem remotos configurados para extrair.
zh_hant: 您的存放庫未設定要提取的來源遠端。

# ++CODE++b2cfea1b73b4855e2c9788d34218761d0345b040ca237bdc9d0d4fc2577e6be5
source: Your repository has no remotes configured to push to.
de: In Ihrem Repository wurden keine Remoteelemente für den Push konfiguriert.
it: Il repository non contiene elementi remoti configurati come destinazione del push.
ja: リポジトリには、プッシュ先として構成されているリモートがありません。
pt_br: O repositório não tem remotos configurados para enviar por push.
zh_hant: 您的存放庫未設定要推送的目標遠端。

# ++CODE++390f001b0ad6b35e9d11767949fbe88481014bff0abcdb95925ca74bcee7cd90
source: Your repository has no remotes.
de: In Ihrem Repository liegen keine Remoteelemente vor.
it: Il repository non contiene repository remoti.
ja: リポジトリにリモートが含まれていません。
pt_br: O repositório não tem remotos.
zh_hant: 您的存放庫沒有遠端存放庫。

# ++CODE++9390298f3fb0c5b160498935d79cb139aef28e1c47358b4bbba61862b9c26e59
source: no
de: Nein
pt_br: não
zh_hant: 否

# ++CODE++8a798890fe93817163b10b5f7bd2ca4d25d84c52739a645a889c173eee7d9d3d
source: yes
de: Ja
it: sì
ja: はい
pt_br: sim
zh_hant: 是

# ++CODE++87bd11c53118b1c7e013a7abab752a62a22b8ab546323fa0daa6ceae4474fadb
source: {0} (Deleted)
de: {0} (gelöscht)
it: {0} (eliminato)
ja: {0} (削除済み)
pt_br: {0} (Excluído)
zh_hant: {0} (已刪除)

# ++CODE++2902a2172b4cd18aff8b58fe9754a4d14b8f14caf5faee5f32b52092ecafbf05
source: {0} (Index)
it: {0} (Indice)
ja: {0} (インデックス)
pt_br: {0} (Índice)
zh_hant: {0} (索引)

# ++CODE++d6bd8cfa8b318f8c3845ea4c575f6dfc48f3db10ebec956199cb5afe75ced8f7
source: {0} (Intent to add)
de: {0} (Hinzuzufügende Absicht)
it: {0} (Finalità da aggiungere)
ja: {0} (追加する意図)
pt_br: {0} (Intenção de adicionar)
zh_hant: {0} (要新增的意圖)

# ++CODE++aac7b4cbb9b0b84aa84433090d5b052e903003ebbe61d74bff4b1609e302f98f
source: {0} (Ours)
de: {0} (unseres)
it: {0} (versione utente)
ja: {0} (自分たちの)
pt_br: {0} (Nosso)
zh_hant: {0} (我們的)

# ++CODE++84d560d3629f1574ce6136b005e80785cc48e18319cdaf6e8736dfdc9d5bf899
source: {0} (Theirs)
de: {0} (ihres)
it: {0} (versione server)
ja: {0} (他のユーザー)
pt_br: {0} (Deles)
zh_hant: {0} (他們的)

# ++CODE++06d2d2cf7b10db10195c834f0403e5802aa68f6551afec39fdc6fb549ca73302
source: {0} (Type changed)
de: {0} (Typ geändert)
it: {0} (tipo modificato)
ja: {0} (変更された型)
pt_br: {0} (Tipo alterado)
zh_hant: {0} (類型已變更)

# ++CODE++236384de21336e110098c378d5fbdee9628af5281f36a15d98daa43702757ff0
source: {0} (Untracked)
de: {0} (keine Nachverfolgung)
it: {0} (non tracciati)
ja: {0} (未追跡)
pt_br: {0} (Não rastreado)
zh_hant: {0} (已取消追蹤)

# ++CODE++da0616325ba5bc9c1849caff89e19cc03b34b23ed3bc73ddfc6ac06a2db891d7
source: {0} (Working Tree)
de: {0} (Arbeitsstruktur)
it: {0} (Albero di lavoro)
ja: {0} (作業ツリー)
pt_br: {0} (Árvore de Trabalho)
zh_hant: {0} (工作樹狀)

# ++CODE++82a451fe75f2a900d68020e00d21556defd511eccbd8b2e5743ac8ec3168c9fa
source: {0} Commit
ja: {0} コミット
pt_br: {0} Confirmação
zh_hant: {0} 認可

# ++CODE++ba938268068ea08ae956bde42d00e5794a9213cfe5766936cacb2f3758b72dc0
source: {0} Commit & Push
de: {0} Commit und Push
it: {0}commit e push
ja: {0} コミットしてプッシュ
pt_br: {0} Confirmar e Efetuar push
zh_hant: {0} 提交與推送

# ++CODE++9e5f10ce1f838d861901ebb2c83f8824296843cff8472960cfafc0098182383c
source: {0} Commit & Sync
de: Commit und Synchronisieren "{0}"
it: {0} commit e sincronizzazione
ja: {0} コミットして同期
pt_br: {0} Confirmar e Sincronizar
zh_hant: {0} 提交與同步處理

# ++CODE++34f8bd615c01255a5815e862d415a991324737482a7d66c874f16a10427897a0
source: {0} Commit (Amend)
de: {0} Committen (Korrigieren)
it: commit{0} (modifica)
ja: {0} コミット (修正)
pt_br: Confirmar {0} (Corrigir)
zh_hant: {0} 認可 (修改)

# ++CODE++5ea8624f43aa58ee102eae1842f3ba8a08c5bc1e1541440e5fcf3d9c91f78463
source: {0} Continue
de: {0} Weiterfahren
it: {0} Continua
ja: {0} 続行
pt_br: {0} Continuar
zh_hant: {0} 繼續

# ++CODE++22b70b7e3d265ec2795798f823257aae227228dc4191a3cc85fd00bd2f368f3a
source: {0} Fetch all remotes
de: {0} Abrufen aller Remotes
it: {0} Recupera tutti i repository remoti
ja: {0} すべてのリモートを取得
pt_br: {0} buscar todos os remotos
zh_hant: {0} 擷取所有遠端

# ++CODE++81ad1e4c7e769dcad02d582dd25ee2810c51cc4989b92b5d32a2f1e5467d9927
source: {0} Publish Branch
de: {0} Branch veröffentlichen
it: {0} Pubblica Branch
ja: {0} Branch の発行
pt_br: {0} Publicar Branch
zh_hant: {0} 發佈 Branch

# ++CODE++da089f5ddfe606c3dc6f961bcb1316e41e11cf382afe908f8371b88e97b89225
source: {0} Sync Changes{1}{2}
de: {0} Änderungen synchronisieren{1}{2}
it: {0} Sincronizza modifiche{1}{2}
ja: {0}変更の同期{1}{2}
pt_br: {0} Sincronizar Alterações{1}{2}
zh_hant: {0} 同步變更{1}{2}

# ++CODE++24cf0fac66cc6a565ec23f5b2b9d58f2c8606cb7313b2591836da1f8d0a53993
source: {0} characters left in current line
de: {0} Zeichen in der aktuellen Zeile verbleibend
it: ancora {0} caratteri disponibili nella riga corrente
ja: 現在の行で残り {0} 文字
pt_br: {0} caracteres restantes na linha atual
zh_hant: 在目前行數剩餘 {0} 個字元

# ++CODE++8de94f809d2ce26a9db6bd5c9e3fe247254b40c6888ad3044050a147374dbd91
source: {0} characters over {1} in current line
de: {0} Zeichen über {1} in der aktuellen Zeile
it: {0} caratteri rispetto ai {1} disponibili nella riga corrente
ja: 現在の行で {1} から {0} 文字オーバー
pt_br: {0} caracteres acima de {1} na linha atual
zh_hant: 在目前行數有 {0} 個字元已超過 {1} 個

# ++CODE++86b933c7292229ebcd6fc4977d94683a09568745f08b5eff0ddf6249ca56a11d
source: {0}\n\nThis is IRREVERSIBLE, your current working set will be FOREVER LOST.
de: {0}\n\nDies kann NICHT rückgängig gemacht werden, und Ihr aktueller Arbeitssatz geht DAUERHAFT verloren.
it: {0}\n\nQuesta operazione è IRREVERSIBILE. Il working set corrente andrà PERSO PER SEMPRE.
ja: {0}\n\nこの変更は元に戻すことはできません。現在のワーキング セットは永久に失われます。
pt_br: {0}\n\n é IRREVERSÍVEL, o conjunto de trabalho atual será PERDIDO PARA SEMPRE.
zh_hant: {0}\n\n這項動作無法復原，您會永久失去目前的工作集。
