Repository: microsoft/azuredatastudio
Catalog: resources/xlf/*/vscode.git.*.xlf
Languages: de, it, ja, pt_br, zh_hant

# command.stageAll
source: Stage All Changes
de: Alle Änderungen bereitstellen
it: Prepara tutte le modifiche per commit
ja: すべての変更をステージ
pt_br: Preparar Todas as Alterações
zh_hant: 暫存所有變更 (Stage All Changes)

# command.stageAllMerge
source: Stage All Merge Changes
de: Alle zusammengeführten Änderungen stagen
it: Prepara per il commit tutte le modifiche di merge
ja: すべてのマージ変更をステージする
pt_br: Preparar Todas as Alterações de Mesclagem
zh_hant: 暫存所有合併變更

# command.stageAllTracked
source: Stage All Tracked Changes
de: Alle nachverfolgten Änderungen bereitstellen
it: Prepara per il commit tutte le modifiche non tracciate
ja: すべての変更履歴をステージングする
pt_br: Preparar Todas as Alterações Controladas
zh_hant: 暫存所有追蹤修訂

# command.stageAllUntracked
source: Stage All Untracked Changes
de: Alle nicht nachverfolgten Änderungen bereitstellen
it: Prepara per commit tutte le modifiche non tracciate
ja: すべての追跡対象外の変更のステージング
pt_br: Preparar Todas as Alterações Não Controladas
zh_hant: 暫存所有未追蹤修訂

# command.stageChange
source: Stage Change
de: Änderung bereitstellen
it: Prepara modifica per commit
ja: 変更のステージング
pt_br: Preparar Alteração
zh_hant: 暫存變更

# command.stage
source: Stage Changes
de: Änderungen bereitstellen
it: Prepara modifiche per commit
ja: 変更をステージ
pt_br: Preparar Alterações
zh_hant: 暫存變更

# command.stageSelectedRanges
source: Stage Selected Ranges
de: Gewählte Bereiche staffeln
it: Prepara per il commit intervalli selezionati
ja: 選択した範囲をステージする
pt_br: Preparar Intervalos Selecionados
zh_hant: 暫存選取的範圍

# submenu.stash
source: Stash
de: Stash ausführen
it: Accantona
ja: スタッシュ
pt_br: Fazer Stash
zh_hant: 隱藏

# command.stash
source: Stash
de: Stash ausführen
it: Accantona
ja: スタッシュ
pt_br: Fazer Stash
zh_hant: 擱置變更 (Stash)

# command.stashIncludeUntracked
source: Stash (Include Untracked)
de: Stash (einschließlich nicht verfolgt)
it: Stash (includi non tracciate)
ja: スタッシュ (未追跡ファイルを含む)
pt_br: Stash (Incluir Não Controlado)
zh_hant: 擱置變更 (包含未被追蹤的檔案)

# command.stashStaged
source: Stash Staged
de: Stash (gestaget)
it: Accantonamento a fasi
ja: スタッシュ (ステージング済み)
pt_br: Stash Preparado
zh_hant: Stash 已暫存

# config.autoStash
source: Stash any changes before pulling and restore them after successful pull.
de: Führen Sie für Änderungen einen Stash aus, bevor Sie sie pullen, und stellen Sie sie nach einem erfolgreichen Pull wieder her.
it: Accantona eventuali modifiche prima del pull e le ripristina dopo un pull riuscito.
ja: プルする前にすべての変更をスタッシュし、プル成功後に復元します。
pt_br: Efetuar stash das alterações antes de acioná-las e restaurá-las após o êxito.
zh_hant: 先隱藏再提取任何變更，並在成功提取後，將其還原。

# config.suggestSmartCommit
source: Suggests to enable smart commit (commit all changes when there are no staged changes).
de: Schlägt das Aktivieren intelligenter Commits vor. Dabei werden alle Änderungen committet, wenn keine gestageten Änderungen vorliegen.
it: Suggerisce di abilitare il commit intelligente (eseguire il commit di tutte le modifiche quando non ci sono modifiche preparate per il commit).
ja: スマート コミットを有効にすることを推奨します (ステージング済み変更がない場合、すべての変更をコミットします)。
pt_br: Sugere habilitar a confirmação inteligente (confirmar todas as alterações quando não há alterações preparadas).
zh_hant: 建議啟用智慧認可 (在沒有暫存變更時認可所有變更)。

# command.sync
source: Sync
de: Synchronisierung
it: Sincronizza
ja: 同期
pt_br: Sincronizar
zh_hant: 同步處理

# command.syncRebase
source: Sync (Rebase)
it: Sincronizza (Rebase)
ja: 同期 (Rebase)
pt_br: Sincronizar (Trocar Base)
zh_hant: 同步 (重定基底)

# submenu.tags
source: Tags
it: Tag
ja: タグ
zh_hant: 標籤

# config.checkoutType.tags
source: Tags
it: Tag
ja: タグ
pt_br: Rótulos
zh_hant: 標籤

# config.branchWhitespaceChar
source: The character to replace whitespace in new branch names, and to separate segments of a randomly generated branch name.
de: Das Zeichen, das Leerzeichen in neuen Verzweigungsnamen ersetzen und Segmente eines zufällig generierten Verzweigungsnamens trennen soll.
it: Carattere per sostituire gli spazi vuoti nei nuovi nomi di ramo e per separare i segmenti di un nome di ramo generato in modo casuale.
ja: 新しいブランチ名の空白文字を置き換え、ランダムに生成されたブランチ名のセグメントを区切る文字。
pt_br: O caractere para substituir o espaço em branco em novos nomes de branch e para separar segmentos de um nome de branch gerado aleatoriamente.
zh_hant: 要取代新分支名稱中的空格，以及分隔隨機產生之分支名稱區段的字元。

# config.defaultCloneDirectory
source: The default location to clone a git repository.
de: Das Standardspeicherort für einen Klon eines Git-Repositorys.
it: Il percorso predefinito in cui clonare un repository GIT.
ja: Git リポジトリをクローンする既定の場所。
pt_br: A localização padrão para clonar um repositório git.
zh_hant: 用於複製 Git 存放庫的預設位置。

# view.workbench.scm.unsafeRepositories
source: The detected git repositories are potentially unsafe as the folders are owned by someone other than the current user. [Manage Unsafe Repositories](command:git.manageUnsafeRepositories) To learn more about unsafe repositories [read our docs](https://aka.ms/vscode-git-unsafe-repository).
de: Die erkannten Git-Repositorys sind potenziell unsicher, weil sich die Ordner im Besitz einer anderen Person als dem aktuellen Benutzer befinden. [Unsichere Repositorys verwalten](command:git.manageUnsafeRepositories) Weitere Informationen zu unsicheren Repositorys [Unsere Dokumente lesen](https://aka.ms/vscode-git-unsafe-repository).
it: I repository GIT rilevati sono potenzialmente pericolosi perché la cartella è di proprietà di un utente diverso dall'utente corrente. [Gestisci repository non sicuri](command:git.manageUnsafeRepositories) Per altre informazioni sui repository non sicuri [leggere la nostra documentazione](https://aka.ms/vscode-git-unsafe-repository).
ja: 検出された Git リポジトリは、現在のユーザー以外のユーザーがフォルダーを所有しているため、安全でない可能性があります。 [安全でないリポジトリの管理](command:git.manageUnsafeRepositories) 安全でないリポジトリの詳細については、[ドキュメントをお読みください](https://aka.ms/vscode-git-unsafe-repository)。
pt_br: Os repositórios git detectados são potencialmente não seguros, pois as pastas pertencem a alguém diferente do usuário atual. [Gerenciar Repositórios Não Seguros](command:git.manageUnsafeRepositories) Para saber mais sobre repositórios não seguros [leia nossos documentos](https://aka.ms/vscode-git-unsafe-repository).
zh_hant: 偵測到的 Git 存放庫可能不安全，因為資料夾是由目前使用者以外的人所擁有。 [管理不安全的存放庫](command:git.manageUnsafeRepositories) 若要深入了解不安全的存放庫，[請閱讀我們的文件](https://aka.ms/vscode-git-unsafe-repository)。

# view.workbench.scm.unsafeRepository
source: The detected git repository is potentially unsafe as the folder is owned by someone other than the current user. [Manage Unsafe Repositories](command:git.manageUnsafeRepositories) To learn more about unsafe repositories [read our docs](https://aka.ms/vscode-git-unsafe-repository).
de: Das erkannte Git-Repository ist potenziell unsicher, weil sich der Ordner im Besitz einer anderen Person als dem aktuellen Benutzer befindet. [Unsichere Repositorys verwalten](command:git.manageUnsafeRepositories) Weitere Informationen zu unsicheren Repositorys [Unsere Dokumente lesen](https://aka.ms/vscode-git-unsafe-repository).
it: Il repository GIT rilevato è potenzialmente pericoloso perché la cartella è di proprietà di un utente diverso dall'utente corrente. [Gestisci repository non sicuri](command:git.manageUnsafeRepositories) Per altre informazioni sui repository non sicuri [leggere la nostra documentazione](https://aka.ms/vscode-git-unsafe-repository).
ja: 検出された Git リポジトリは、現在のユーザー以外のユーザーがフォルダーを所有しているため、安全でない可能性があります。 [安全でないリポジトリの管理](command:git.manageUnsafeRepositories) 安全でないリポジトリの詳細については、[ドキュメントをお読みください](https://aka.ms/vscode-git-unsafe-repository)。
pt_br: O repositório git detectado é potencialmente não seguro, pois a pasta pertence a alguém diferente do usuário atual. [Gerenciar Repositórios Não Seguros](command:git.manageUnsafeRepositories) Para saber mais sobre repositórios não seguros [leia nossos documentos](https://aka.ms/vscode-git-unsafe-repository).
zh_hant: 偵測到的 Git 存放庫可能不安全，因為資料夾是由目前使用者以外的人所擁有。 [管理不安全的存放庫](command:git.manageUnsafeRepositories) 若要深入了解不安全的存放庫，[請閱讀我們的文件](https://aka.ms/vscode-git-unsafe-repository)。

# view.workbench.scm.folder
source: The folder currently open doesn't have a git repository. You can initialize a repository which will enable source control features powered by git. [Initialize Repository](command:git.init?%5Btrue%5D) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Der aktuell geöffnete Ordner enthält kein Git-Repository. Sie können ein Repository initialisieren, wodurch die Git-Features zur Quellcodeverwaltung aktiviert werden. [Repository initialisieren](command:git.init?%5Btrue%5D) Weitere Informationen zur Verwendung von Git und der Quellcodeverwaltung in Azure Data Studio finden Sie [in unserer Dokumentation](https://aka.ms/vscode-scm).
it: La cartella attualmente aperta non ha un repository GIT. È possibile inizializzare un repository che abiliterà le funzionalità di controllo del codice sorgente basate su GIT. [Initialize Repository](command:git.init?%5Btrue%5D) Per altre informazioni su come usare Git e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: 現在開いているフォルダーには Git リポジトリがありません。Git を利用したソース管理機能を有効にするリポジトリを初期化できます。 [リポジトリを初期化する](command:git.init?%5Btrue%5D) Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: A pasta aberta no momento não tem um repositório git. Você pode inicializar um repositório que habilitará os recursos de controle do código-fonte alimentados pelo git. [Inicializar Repositório](command:git.init?%5Btrue%5D) Para saber mais sobre como usar o git e o controle do código-fonte no Azure Data Studio [leia a nossa documentação](https://aka.ms/vscode-scm).
zh_hant: 目前開啟的資料夾沒有任何 git 存放庫。您可以將存放庫初始化，以啟用 git 支援的原始檔控制功能。 [將存放庫初始化](command:git.init?%5Btrue%5D) 若要深入了解如何在 Azure Data Studio 中使用 git 和原始檔控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# config.defaultBranchName
source: The name of the default branch (ex: main, trunk, development) when initializing a new git repository. When set to empty, the default branch name configured in git will be used. **Note:** Requires git version `2.28.0` or later.
de: Der Name des Standardbranchs (z. B. main, trunk, development), wenn ein neues Git-Repository initialisiert wird. Bei Festlegung auf "empty" wird der in Git konfigurierte Standardbranchname verwendet. **Hinweis:** Erfordert Git-Version 2.28.0 oder höher.
it: Nome del ramo predefinito (ad esempio principale, tronco, sviluppo) durante l'inizializzazione di un nuovo repository Git. Se impostato su vuoto, verrà usato il nome del ramo predefinito configurato in Git. **Nota:** richiede la versione Git `2.28.0` o successiva.
ja: 新しい Git リポジトリを初期化するときの既定のブランチ (メイン、トランク、開発など) の名前。空に設定すると、Git で構成された既定のブランチ名が使用されます。**注意:** Git バージョン `2.28.0` 以降が必要です。
pt_br: O nome do branch padrão (ex: principal, tronco, desenvolvimento) ao inicializar um novo repositório git. Quando definido como vazio, o nome da ramificação padrão configurado no git será usado. **Observação:** Requer git versão `2.28.0` ou posterior.
zh_hant: 初始化新的 Git 存放庫時預設分支的名稱 (例如: 主要、主幹、開發)。設為空白時，將會使用 Git 中設定的預設分支名稱。**注意:** 需要 Git 版本 `2.28.0` 或更新版本。

# view.workbench.scm.workspace
source: The workspace currently open doesn't have any folders containing git repositories. You can initialize a repository on a folder which will enable source control features powered by git. [Initialize Repository](command:git.init) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Der aktuell geöffnete Arbeitsbereich enthält keine Ordner mit Git-Repositorys. Sie können ein Repository für einen Ordner initialisieren, wodurch die Git-Features zur Quellcodeverwaltung aktiviert werden. [Repository initialisieren](command:git.init) Weitere Informationen zur Verwendung von Git und der Quellcodeverwaltung in Azure Data Studio finden Sie [in unserer Dokumentation](https://aka.ms/vscode-scm).
it: L'area di lavoro attualmente aperta non contiene cartelle contenenti repository GIT. È possibile inizializzare un repository in una cartella che abiliterà le funzionalità del controllo del codice sorgente basate su GIT. [Initialize Repository](command:git.init) Per altre informazioni su come usare GIT e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: 現在開いているワークスペースには、Git リポジトリを含むフォルダーはありません。フォルダーにあるリポジトリを初期化して、Git を利用したソース管理機能を有効にすることができます。 [リポジトリの初期化](command:git.init) Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: O espaço de trabalho aberto no momento não tem nenhuma pasta contendo repositórios git. Você pode inicializar um repositório em uma pasta que habilitará os recursos de controle do código-fonte fornecidos pelo git. [Inicializar Repositório](command:git.init) Para saber mais sobre como usar o git e o controle do código-fonte no Azure Data Studio [leia a nossa documentação](https://aka.ms/vscode-scm).
zh_hant: 目前開啟的工作區沒有任何包含 Git 存放庫的資料夾。您可以在資料夾上將存放庫初始化，以啟用 Git 支援的來源控制功能。 [將存放庫初始化](command:git.init) 若要深入了解如何在 Azure Data Studio 中使用 Git 和來源控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# view.workbench.scm.emptyWorkspace
source: The workspace currently open doesn't have any folders containing git repositories. [Add Folder to Workspace](command:workbench.action.addRootFolder) To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Der derzeit geöffnete Arbeitsbereich verfügt über keine Ordner, die Git-Repositorys enthalten. [Ordner zum Arbeitsbereich hinzufügen](command:workbench.action.addRootFolder) Weitere Informationen zur Verwendung von Git und der Quellcodeverwaltung in Azure Data Studio finden Sie [in unserer Dokumentation](https://aka.ms/vscode-scm).
it: L'area di lavoro attualmente aperta non contiene cartelle contenenti repository GIT. [Aggiungi cartella all'area di lavoro](command:workbench.action.addRootFolder) Per altre informazioni su come usare GIT e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: 現在開いているワークスペースには、Git リポジトリを含むフォルダーがありません。 [ワークスペースにフォルダーを追加します](command:workbench.action.addRootFolder) Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: O espaço de trabalho aberto no momento não tem nenhuma pasta contendo repositórios git. [Adicionar pasta ao espaço de trabalho](command:workbench.action.addRootFolder) Para saber mais sobre como usar o git e o controle do código-fonte no Azure Data Studio [leia a nossa documentação](https://aka.ms/vscode-scm).
zh_hant: 目前開啟的工作區沒有任何資料夾包含 git 存放庫。 [新增資料夾至工作區](command:workbench.action.addRootFolder) 如果要深入了解如何在 Azure Data Studio 中使用 git 和原始檔控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# view.workbench.learnMore
source: To learn more about how to use git and source control in Azure Data Studio [read our docs](https://aka.ms/vscode-scm).
de: Weitere Informationen zur Verwendung von Git und Quellcodeverwaltung in Azure Data Studio [finden Sie in unserer Dokumentation](https://aka.ms/vscode-scm).
it: Per altre informazioni su come usare GIT e il controllo del codice sorgente in Azure Data Studio [leggere la documentazione](https://aka.ms/vscode-scm).
ja: Azure Data Studio で Git とソース管理を使用する方法の詳細については、[ドキュメントをご覧ください](https://aka.ms/vscode-scm)。
pt_br: Para saber mais sobre como usar o git e o controle do código-fonte no Azure Data Studio [leia nossa documentação](https://aka.ms/vscode-scm).
zh_hant: 若要深入了解如何在 Azure Data Studio 中使用 git 和原始檔控制，[請參閱我們的文件](https://aka.ms/vscode-scm)。

# config.countBadge.off
source: Turn off counter.
de: Zähler deaktivieren.
it: Disattiva il contatore.
ja: カウンターをオフにします。
pt_br: Desligar o contador.
zh_hant: 關閉計數器。

# command.undoCommit
source: Undo Last Commit
de: Letzten Commit rückgängig machen
it: Annulla ultimo commit
ja: 前回のコミットを元に戻す
pt_br: Desfazer Última Confirmação
zh_hant: 復原上個提交

# command.unstageAll
source: Unstage All Changes
de: Bereitstellung aller Änderungen aufheben
it: Annulla preparazione di tutte le modifiche per commit
ja: すべての変更のステージング解除
pt_br: Despreparar Todas as Alterações
zh_hant: 取消所有暫存變更(Unstage All Changes)

# command.unstage
source: Unstage Changes
de: Bereitstellung der Änderungen aufheben
it: Annulla preparazione modifiche per commit
ja: 変更のステージング解除
pt_br: Despreparar Alterações
zh_hant: 取消暫存變更

# command.unstageSelectedRanges
source: Unstage Selected Ranges
de: Bereitstellung gewählter Bereiche aufheben
it: Annulla preparazione per il commit di intervalli selezionati
ja: 選択した範囲のステージを解除
pt_br: Despreparar Intervalos Selecionados
zh_hant: 取消暫存選取的範圍

# config.untrackedChanges.separate
source: Untracked changes appear separately in the Source Control view. They are also excluded from several actions.
de: Nicht nachverfolgte Änderungen werden separat in der Quellcodeverwaltung angezeigt. Sie sind zudem von mehreren Aktionen ausgeschlossen.
it: Le modifiche non tracciate vengono visualizzate separatamente nella visualizzazione Controllo del codice sorgente. Sono inoltre escluse da diverse azioni.
ja: 追跡されていない変更は、ソース管理ビューに個別に表示されます。それらは、複数のアクションからも除外されます。
pt_br: As alterações não controladas são exibidas separadamente no modo de exibição de Controle do Código-fonte. Elas também são excluídas de várias ações.
zh_hant: 未追蹤修訂個別出現在原始檔控制檢視中。這些修訂也會從數個動作中排除。

# config.untrackedChanges.hidden
source: Untracked changes are hidden and excluded from several actions.
de: Nicht nachverfolgte Änderungen werden ausgeblendet und von mehreren Aktionen ausgeschlossen.
it: Le modifiche non tracciate vengono nascoste ed escluse da diverse azioni.
ja: 追跡対象外の変更は非表示になり、複数のアクションから除外されます。
pt_br: As alterações não controladas são ocultas e excluídas de várias ações.
zh_hant: 未追蹤修訂會隱藏並從數個動作中排除。

# config.timeline.date.authored
source: Use the authored date
de: Erstellungsdatum verwenden
it: Usa la data di creazione
ja: 作成日を使用する
pt_br: Usar a data de criação
zh_hant: 使用撰寫日期

# config.timeline.date.committed
source: Use the committed date
de: Commitdatum verwenden
it: Usa la data di commit
ja: コミットされた日付を使用する
pt_br: Usar a data confirmada
zh_hant: 使用認可日期

# config.fetchOnPull
source: When enabled, fetch all branches when pulling. Otherwise, fetch just the current one.
de: Wenn aktiviert, beim Pullen alle Branches abrufen. Andernfalls nur den aktuellen abrufen.
it: Quando è abilitato, recupera tutti i rami durante il pulling; altrimenti recupera solo il ramo corrente.
ja: 有効にすると、プル時にすべてのブランチをフェッチします。それ以外の場合は、現在のブランチだけをフェッチします。
pt_br: Quando habilitado, busque todas as ramificações efetuando pull. Caso contrário, busque apenas a atual.
zh_hant: 啟用時，會在提取時擷取所有分支。否則僅擷取目前的分支。

# config.autofetch
source: When set to true, commits will automatically be fetched from the default remote of the current Git repository. Setting to `all` will fetch from all remotes.
de: Bei Festlegung auf TRUE werden Commits automatisch aus dem Standardremoteverzeichnis des aktuellen Git-Repositorys abgerufen. Bei Festlegung auf „Alle“ erfolgt der Abruf aus allen Remoteverzeichnissen.
it: Quando è impostata su true, i commit verranno recuperati automaticamente dal repository remoto del repository GIT corrente. Se è impostata su `all`, verranno recuperati da tutti i repository remoti.
ja: true に設定すると、現在の Git リポジトリの既定のリモートからコミットが自動的にフェッチされます。[すべて] に設定すると、すべてのリモートからフェッチされます。
pt_br: Quando esta opção estiver definida como true, os commits serão buscados automaticamente no repositório remoto padrão do repositório do Git atual. Quando ela estiver definida como `all` os commits serão buscados de todos os repositórios remotos.
zh_hant: 設定為 true 時，會自動從目前 Git 存放庫的預設遠端擷取認可。設定為 `all` 將從所有遠端進行擷取。

# config.autorefresh
source: Whether auto refreshing is enabled.
de: Gibt an, ob die automatische Aktualisierung aktiviert ist.
it: Indica se l'aggiornamento automatico è abilitato.
ja: 自動更新の有効/無効。
pt_br: Se a atualização automática está habilitada.
zh_hant: 是否啟用自動重新整理。

# config.enabled
source: Whether git is enabled.
de: Legt fest, ob Git aktiviert ist.
it: Indica se GIT è abilitato.
ja: Git が有効になっているかどうか。
pt_br: Se o Git está habilitado.
zh_hant: 是否啟用 Git。

# view.workbench.cloneRepository
source: You can clone a repository locally. [Clone Repository](command:git.clone 'Clone a repository once the git extension has activated')
de: Sie können ein Repository lokal klonen. [Repository klonen](command:git.clone 'Clone a repository once the git extension has activated')
it: È possibile clonare un repository in locale. [Clona repository](command:git.clone 'Clona un repository dopo l'attivazione dell'estensione GIT')
ja: リポジトリをローカルに複製できます。 [リポジトリの複製](command:git.clone 'Git 拡張機能がアクティブ化されたらリポジトリを複製する')
pt_br: Você pode clonar um repositório localmente. [Clonar Repositório](command:git.clone 'Clonar um repositório após a ativação da extensão git')
zh_hant: 您可以在本機複製存放庫。 [複製存放庫](command:git.clone '在 GIT 延伸模組啟用後複製存放庫')

# view.workbench.scm.missing.windows
source: [Download Git for Windows](https://git-scm.com/download/win) After installing, please [reload](command:workbench.action.reloadWindow) (or [troubleshoot](command:git.showOutput)). Additional source control providers can be installed [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
de: [Git für Windows herunterladen](https://git-scm.com/download/win) Nach der Installation bitte [neu laden](command:workbench.action.reloadWindow) (oder [Fehlerbehebung](command:git.showOutput)). Zusätzliche Quellcodeverwaltungsanbieter können [aus dem Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) installiert werden.
it: [Download Git for Windows](https://git-scm.com/download/win) Dopo l'installazione, [reload](command:workbench.action.reloadWindow) (o [troubleshoot](command:git.showOutput)). È possibile installare altri provider del controllo del codice sorgente [from the Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20provider%5C%22%22).
ja: [Windows 用 Git のダウンロード](https://git-scm.com/download/win) インストール後、[再読み込み](command:workbench.action.reloadWindow) (または [トラブルシューティング](command:git.showOutput)) してください。追加のソース管理プロバイダーを [Marketplace から](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) インストールできます。
pt_br: [Baixar o Git para Windows](https://git-scm.com/download/win) Depois de instalar, [recarregue](command:workbench.action.reloadWindow) (ou [solucione o problema](command:git.showOutput)). Provedores de controle do código-fonte adicionais podem ser instalados [a partir do Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22).
zh_hant: [下載適用於 Windows 的 Git](https://git-scm.com/download/win) 安裝之後，請[重新載入](command:workbench.action.reloadWindow) (或[疑難排解](command:git.showOutput))。可[從 Marketplace](command:workbench.extensions.search?%22%40category%3A%5C%22scm%20providers%5C%22%22) 安裝其他來源控制提供者。
