{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the Source EULA. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"azdata.extension.contributes.dashboard.tab.id": "Identificador único para esta ficha. Se pasará a la extensión para cualquier solicitud.",
	"azdata.extension.contributes.dashboard.tab.title": "Título de la pestaña para mostrar al usuario.",
	"azdata.extension.contributes.dashboard.tab.description": "Descripción de esta pestaña que será mostrada al usuario.",
	"azdata.extension.contributes.tab.when": "Condición que se debe cumplir para mostrar este elemento",
	"azdata.extension.contributes.tab.provider": "Define los tipos de conexión con que es compatible esta pestaña. Se establece de manera predeterminada en \"MSSQL\" si no se configura.",
	"azdata.extension.contributes.dashboard.tab.container": "El contenedor que será mostrado en esta pestaña.",
	"azdata.extension.contributes.dashboard.tab.alwaysShow": "Si esta ficha se debe mostrar siempre, o sólo cuando el usuario la agrega.",
	"azdata.extension.contributes.dashboard.tab.isHomeTab": "Si esta pestaña se debe usar o no como la pestaña Inicio para un tipo de conexión.",
	"azdata.extension.contributes.tabs": "Aporta una o varias pestañas que los usuarios pueden agregar a su panel.",
	"dashboardTab.contribution.noTitleError": "No se ha especificado ningún título para la extensión.",
	"dashboardTab.contribution.noDescriptionWarning": "No se ha especificado ninguna descripción para mostrar.",
	"dashboardTab.contribution.noContainerError": "Ningún contenedor especificado para la extensión.",
	"dashboardTab.contribution.moreThanOneDashboardContainersError": "Debe definirse exactamente 1 contenedor de paneles por espacio"
}